{"0": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1488333279, "Score": 1, "Body": "Depends on the university. Ours are finalized but will get sent out in 1-2 weeks. ", "Permalink": "https://www.reddit.com/by_id/t3_5ws1wl.json"}, "1": {"Subreddit": "PhD", "Author": "Major_Redux", "Date": 1488333882, "Score": 2, "Body": "The reason I chose such a specific field was to improve my chances of tenure, but when I look around I don't see any 30 something professors at university, so maybe it is a little bit of a pipe dream.\n\nI do enjoy research and academia, I just don't know if I want to spend the next 10 years in poverty to reach my goals.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "2": {"Subreddit": "PhD", "Author": "Major_Redux", "Date": 1488333929, "Score": 1, "Body": "That is what I was afraid of. PhD just seems like such a huge decision to make - something that will choose the track of the rest of your life.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "3": {"Subreddit": "PhD", "Author": "Major_Redux", "Date": 1488335256, "Score": 3, "Body": "I started out in video game design (communication design) and shifted to business entrepreneurship as I didn't enjoy the programming aspect. After my creative writing masters I joined the Navy as a Warfare Officer. During my service I had trouble remembering bearings to create fixes on the radar. A fix is three or four relative bearings from the ship to determine location. So, for example you would find bearings of 128, 157 and 194, and quickly input them them into the radar to create the location fix. On an average day (8 hour shift) a watch officer would do anywhere from 40 to 120 fixes on the coast and 120-240 fixes on a pilotage (coming into harbour). It was a huge part of the job and I wasn't good at it, so I started researching ways to improve memory. I found about about n-back (continuous performance task n steps back - like a delayed simon says) and started training for half an hour a day for a year. The results were miraculous and I found that my not only my memory, but my cognitive abilities had been greatly improved. \n\nAfter I left the Navy, I started researching psychometrics because I was looking for employment in the Intelligence sector, while doing entrepreneurial activities. At a networking event I met a organisational psychologist who was using cognitive neuroscience and psychometrics to improve the cognitive abilities of professionals in various areas. We got talking and he mentioned that the greatest weakness of n-back as a training tool was that people wouldn't keep working at it because it was boring. Using my game development background we collaborated on a project to make a fun version of n-back, without losing the effectiveness of the training system (watering it down). From there I started researching working memory, focusing specifically on n-back to create a game people would enjoy, but still get all the benefits of n-back from.\n\nI made a prototype, but it didn't achieve what we set out to do. I'm currently testing a new prototype, but finding a job or progressing my academic career has become a priority right now.\n\nCommunications design has a great deal to do with user interface design, intuitive controls and psychologically rewarding interaction. My main goal is to make n-back more efficient, while making it into a 'game' so it doesn't even feel like cognitive training.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "4": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1488336330, "Score": 1, "Body": "Not bad. Out of curiosity, do you have a plan to make your code easily inheritable by future lab members? Or are you not too worried about that?\n\nThat's something that I can't decide if I want to sink a lot of time into, or if I should leave it to be someone else's eventual problem.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "5": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488337177, "Score": -1, "Body": "No, not particularly. Obviously, I write neat, modular code. I may add a comment or two, but mostly for myself- not for anyone else. Everyone in my lab has a strong technical background so in the rare event that anyone needs to use someone else's code for something - we usually just re-write it from scratch anyway. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "6": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488338692, "Score": 1, "Body": "You're not normally a professor as a 30 something. Normally youre in a position on the way to that like a research fellow or associate professor. Otherwise you've topped out the career before 40 which is ridiculous. I do however have a supervisor who was a full professor at 38 so it does happen.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "7": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1488355408, "Score": 15, "Body": "This is the biggest ego-stroking post I have ever seen.\n\n\"highly productive,\" \"I write neat code,\" \"kick-ass resume,\" \"a person who is smart (that's evident in graduate work), but also a go getter\"\n\nThe best one, however, is \"being likable.\" Calling yourself likable speaks volumes.\n\nI can smell the BS from here. I am willing to wager that 90% of the shit you've said ain't even true.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "8": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1488355797, "Score": 9, "Body": "Yeah, my only question for OP is why we should care.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "9": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1488356006, "Score": 7, "Body": "That's exactly what I thought when I read the post title... ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "10": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488376397, "Score": 4, "Body": "At my university there is an information systems degree within business and there's one in maths or science or something. Seems confusing, yes, and I have no idea what the difference between the two is but there are definitely people continuing onto IS PhDs from business undergrads here. I am in Australia though so could be different.", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "11": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488385730, "Score": -2, "Body": "I promised myself I wouldn't feed the trolls... I'm not sure if you're a PhD student or not, but \"highly productive\" is a common term we use all the time. Its a barometer of how many times you've published. Similar is the term neat code\" - that means your code is LEGIBLE. It's a common term - basic coding 101 is that your code be \"neat\" and \"modular.\" Google it. Common terms, not ego-stroking. \n\n&amp;nbsp;\n\nI have no problem saying I have a kick-ass resume, I didn't work my ass off to to be shy about it.\n\n&amp;nbsp;\n\nBeing likable is important. Ask any consultant. The job isn't that difficult and anybody, ESPECIALLY any fellow PhD is smart enough to do it. But, the team wants to know if they can spend 15 hours a day with you (that's how bad the hours are). In fact, at my firm, we had a 45 minute \"fit\" interview. (A common consulting interview term, Google it.) Where it was just me and a partner chatting for 45 minutes. He asked me all types of odd personality questions like \"what's the worst thing co-workers say about you\" and \"whose your favorite comedian.\" All to determine \"fit\"- if he liked me.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "12": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488385789, "Score": -1, "Body": "Why should you care about any AMA post. It's so people can get any questions they're curious about about answered. Most jobs have alternative routes for hiring PhDs. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "13": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1488387028, "Score": 3, "Body": "Well for a start, AMAs are usually solicited or at the very least are by someone high profile or extraordinary. \n\n&gt; It's so people can get any questions they're curious about about[sic] answered.\n\nWe have /r/AskAcademia for that. Unless of course you're egotistical enough to be sitting there and thinking \"You know what, the 2.5k subs over at /r/PhD are probably *dying* to ask me questions about my life. I'll do an AMA\".\n\n&gt; Finishing up my Neuro PhD at an Ivy League school in the Northeast\n\nWhere?\n\n&gt; Ivy undergrad\n\nWhere?\n\n&gt; Highly productive in terms of publications and conferences\n\nHow many? What are they?\n\n&gt; Also founded a seed-funded startup\n\nWhat is it?\n\n&gt; completed an internship in a biotech group of a VC firm\n\nWhere?\n\n&gt; joining a major consulting firm (MBB)\n\nWhich one?\n\nYou've left an awful lot of information out for someone looking to stroke their ego. Either you're full of shit of desperately trying to get someone to ask these questions so you can talk about it.\n\nEdit: But wait, there's more!\n\n&gt; I may add a comment or two, but mostly for myself- not for anyone else. Everyone in my lab has a strong technical background so in the rare event that anyone needs to use someone else's code for something - we usually just re-write it from scratch anyway.\n\nYou do not program enough if you think that you don't need to write comments because everyone is \"technical\" and they'll just redo it. \n\n&gt; I write neat, modular code\n\n&gt; we usually just re-write it from scratch anyway\n\nWhy bother writing modular code if the codebase is never used again?\n\n&gt; being likable and chill was extremely important and not a trait many PhDs I met on the interview trail had.\n\nYou aren't likeable, and you just shit over the community you're trying to host an AMA to.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "14": {"Subreddit": "PhD", "Author": "demosthenes83", "Date": 1488387615, "Score": 4, "Body": "I know many people who have done the BS, MBA, PhD in IS track. In fact, I'm in the middle of that (working on my MBA) myself. In all the schools I know information systems, or management information systems is a specialization within their business/management program-why would a business undergrad/masters not work well with that?\n\nIs your program somehow not business/management related? I guess I've seen some sort of 'information' programs in library science departments or the like...\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "15": {"Subreddit": "PhD", "Author": "lightnovel_abuser", "Date": 1488388015, "Score": 2, "Body": "Sorry if this is brief, answering on mobile. \n\nWe're attached to the faculty of computing. Hence the doubts. \n\nThanks for your reply, I'll show him your reply, could be a boost for his confidence.", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "16": {"Subreddit": "PhD", "Author": "lightnovel_abuser", "Date": 1488388160, "Score": 2, "Body": "Yeap, there's a management information systems class when he did his Masters. That's  where his interest started. Unfortunately, in my uni, IS is under the computing faculty. \n\nSorry, answering on mobile. ", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "17": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488389313, "Score": -2, "Body": "&gt; post\n\nIf I told you any of that info you'd be able to figure out who I was pretty easily. It sounds like you aren't in a PhD program, because if you were, you'd know PhD program sizes are small (8-10). Biotech VCs are even smaller. And I'm friends with many of the PhDs that recruited at MBB this year- that's a pretty small group too. Also, I've seen very few AMA where people reveal their identities. \n\nAnd have you ever tried doing a biomedical science project using someone else's code? Clearly you don't code enough, because it's MUCH easier to write your own code from scratch than try to decipher someone else's code, even if it is modular. We work with biological data- asking ourselves math-based questions based on the type of data we have. Much of it is hypothesis-driven. And you don't want to use someone else's code for that. You want your own-hypothesis driven code, unique to your data and it's nuisances. We have tons and tons of datasets. Everyone doesn't work with the same data. \n\n&amp;nbsp;\n\nNot replying to the naysayers anymore but will reply to legit questions. If you don't have anything positive to say, go hate on and troll someone else's post. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "18": {"Subreddit": "PhD", "Author": "Shellout", "Date": 1488398479, "Score": 5, "Body": "Wow. That's crappy. I have no advice or knowledge to pass on, it's basically a bullying issue and it sounds like those people who should help aren't taking it seriously. Just think of the benefits in a year. Stay strong- all the best.", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "19": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1488405194, "Score": 3, "Body": "I am not a PhD student.\n\nAlso, there was no need to explain why it is important to hire someone likable.\n\nIt's pretty obvious why you do not see an issue with calling yourself likable and productive, calling your own code neat, your own resume kick-ass.\n\nI know that you have no problem saying that you have a kick-ass resume, that's precisely why you wrote this post, you just wanted to stroke your ego.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "20": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1488405374, "Score": 5, "Body": "\"It sounds like you aren't in a PhD program.\"/\"I'm not sure if you're a PhD student or not.\"\n\n\"Clearly you don't code enough.\"\n\nYou sir are hilarious.... As well as narcissistic and painfully lacking of any self awareness.\n\nEdit: Also, just to add... \"You'd be able to figure out who I was pretty easily.\" My man, nobody gives a fuck who you are, or what you've done. Just go back to whatever you were doing you egocentric crazy fuck.", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "21": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1488425454, "Score": 2, "Body": "Jesus. That's the most toxic sounding academic environment I've ever heard of. There is some mild behind-the-back complaining about other people in my department, but nothing like that. You mentioned counseling helped, maybe try that again until you finish your program? Getting through a Ph.D. is already so emotionally and mentally taxing without the extra pressure of hate from colleagues. I hope things improve for you soon. ", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "22": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1488425457, "Score": 3, "Body": "This is a serious case of workplace bullying and harassment, and you deserve better treatment than this. Who have you spoken to about what's going on? Can you go higher? \n\nAlso, does your university have a student counselling/support service? I'd reach out to them right away. \n\nThis is truly awful. I'm sorry that your PhD experience has been like this :( ", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "23": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1488431270, "Score": 1, "Body": "Thanks. I only started recognizing it as bullying in the past few months and for a while I was able to block it out and just talk myself out of feeling so low. It's just feeling constant eyes watching me for every mistake I make that just eventually makes me cave. I'll definitely go back to counselling to help me out of this struggle. It helps that I finally have my annual committee presentation and I realized I did a lot more work than everyone told me I did (which they think I did 0 and I had a mild panic attack). I think I just need constant reassurance even if it sounds weak on my part to keep their toxic words out of my head.", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "24": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1488431560, "Score": 2, "Body": "I have spoken to my professor about this but really there's not much she can do about it and I asked her not to do much other than to give me some sympathy when I ask for extensions.. I know a coworker who complained about her bullying problem with the same girl who has targeted me and sadly my professor's talk with her had only led to the girl telling everyone that my coworker is \"crazy\" and has \"mental issues\" and a \"snitch\" which I don't really want to happen to me..\n\nI have definitely started going back to counselling. I made my first appointment of 2017 for Monday next week! Thanks for the support! I hope I get out of this slump again!", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "25": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1488431804, "Score": 2, "Body": "Thanks for the support. I made my first appointment already and I'm hoping that this will get me out of the dark just like in the summer (I had a bad breakdown in summer from this as well). I know these people will probably not change in the duration of my phd but I hope some day they will grow up and quit being a bunch of Regina Georges before they do some serious mental damage on someone", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "26": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1488443057, "Score": 1, "Body": "I'm glad you made an appointment and are actively trying to fight through this. I already have such a hard time managing my life in my Ph.D. (being in my third year and teaching undergrad while working on qualifying exams) that I can't imagine having people around me that are supposed to be supportive being so incredibly hostile. Again, good luck and know things will be better once you're done!", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "27": {"Subreddit": "PhD", "Author": "Shellout", "Date": 1488444472, "Score": 1, "Body": "Well, regardless you're doing good. You gotta be pretty tough to have made it this far. Other people seem to have mentioned it in the comments below, but bbasically keep taking it higher if you think you're being ignored. ", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "28": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1488454960, "Score": 2, "Body": "I wrote 2 papers which have been converted into chapters. Each took about 2-3 weeks. The final chapter is bugging me since I had to write it from scratch. Taking 6-7 weeks. The introduction and conclusion need to be finished in the next 3 weeks for me. Should be doable. All-in-all, about 3 months of writing (but I'm good at writing).", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "29": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1488456830, "Score": 1, "Body": "it took you 2-3 to convert your pre-written papers to chapters? thats about what Im thinking. I want to leave myself 3 months but I dont think ill need that long if everythings 'already written' except intro and conclusion", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "30": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1488457615, "Score": 3, "Body": "Yup. That included catching up with research that has happened since I wrote them, extending them a bit with extra search results, rewording parts of it to fit in with the writing style of my thesis (third person passive as opposed to first person), and also adding a bunch of figures and explanations I'd omitted from my papers. I think I easily added a 50-75% more content than what was already written.", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "31": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1488461942, "Score": 1, "Body": "Obviously it's totally up to you to do what you are comfortable with, and it's easy for me to make judgements when I'm not there, but I think your professor is letting you down, and should be encouraging you to make a formal complaint. Behaviour like this shouldn't be accepted in the 2017 workplace. \n\nI disagree that you need to 'get out of a slump'. This is serious workplace harassment. Anybody would be struggling with what you have to put up with. \n\nI'm not naive though, I know sometimes it's systemic and can be impossible to change, and just easier to deal with and get out. I hope the counsellor is able to support you. ", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "32": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488469688, "Score": 1, "Body": "Normally you can choose your own topic somewhat but they need to have the expertise to advise you. Maybe they know the testing method or the sample or whatever (I'm in physics so it's a little different). You should not start a PhD where you are in any way apathetic about the topic.\n\nJust as an aside, I have heard that psych and particularly clinical psych phds are super hard to get into and the jobs afterwards are even harder to get. Just make sure that this is needed for what you want to do with your future and not just \"the next logical step\".", "Permalink": "https://www.reddit.com/by_id/t3_5x2upl.json"}, "33": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1488471707, "Score": 1, "Body": "Took me 1.5 months. Intro/lit review was 1 month. 1 paper was done so just needed to format. 2 weeks or so to write one paper on my own and one with my boss.", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "34": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1488481951, "Score": 1, "Body": "I agree. I did report what was easy and obvious, like the assault I experienced in bar/club thing with the guy grinding on me. I've been told that there's not much they can do about \"social dynamics\" and they can't make people be friends with me. Which is fair but I feel like this goes beyond the power of friendship (/s) and it's more of the ostracizing. Anybody new to the group is automatically pulled aside to be told god knows what and even undergrad's behaviour belittles me (ex. one of them was looking for syringes and I said it's in the drawer and they snapped at me that they weren't even talking to me). When I first joined the group I also had the same treatment about the girl who was targeted before. I was pulled aside to told to stay away and don't talk to that girl because she's crazy and a snitch and will probably drop out of grad studies.. So I can only be paranoid and imagine the same thing is happening to me.\n\nI just don't know if there's much I can do if even the head of department told me that yeah this situation sucks but this is something social and nothing can be done and that even the guy assaulting me at the bar/club is on thin ice cause the incident happened in a bar/club. It doesn't matter that I told him no I don't want to be involved with him or have sex with him the million times he asked. I've been told I should have been more clear but I don't know how \"no\" was not clear.\n\nI just hope that counselling will help me through again.", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "35": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1488489349, "Score": 1, "Body": "Before you decide you really need to think about whether you want to go into research or you want to going to practice. That will be a determining factor in whether you go for a PhD or PsyD. \n\nI'm a psych phd student right now, but before I was counseling psych PhD for some reason the 'pure' psychology kids were always really dismissive of us, in my masters, too. So in my humble opinion I would avoid a PhD in counseling psych and go for a psyD instead. Less for some reason you have your heart set on doing research into counseling psych. ", "Permalink": "https://www.reddit.com/by_id/t3_5x2upl.json"}, "36": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1488497383, "Score": 3, "Body": "I'm doing research, no classes. I personally prefer writing notes by hand, as it's easier to do little diagrams and to get the formatting exactly as I want. However, I actually do all my notes in text or Word files for future searchability and easy copy/pasting.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "37": {"Subreddit": "PhD", "Author": "lacefishnets", "Date": 1488507615, "Score": 1, "Body": "I don't have a strong opinion either way; I do see myself more in practice rather than research or academia, but there is not a single PsyD school in my state or any of the surrounding ones, so I feel like a PhD would be a better option if I want to stay anywhere remotely close to my family (the closest PhD program is still about two hours away).\n\nI ultimately just want to be a licensed psychologist, and expand my practice to be able to do assessments and psychological evals. ", "Permalink": "https://www.reddit.com/by_id/t3_5x2upl.json"}, "38": {"Subreddit": "PhD", "Author": "lacefishnets", "Date": 1488507763, "Score": 1, "Body": "Thank you; psych PhD programs do seem hard to get into, and even intimidating, but I'd like to try!  It's overwhelming to see stats like, \"We receive 350 applicants per year and accept six.\"  :-X  PsyD programs tend to accept slightly higher numbers, like 20-30 people.", "Permalink": "https://www.reddit.com/by_id/t3_5x2upl.json"}, "39": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488511041, "Score": 1, "Body": "If it makes you feel any better, people who are attempting to go into a professorship have a pretty bad hiring percentage too haha. I know the numbers for people who get tenure track positions are like 0.5%. We don't have tenure in my country or the countries I'm aiming for but professor track positions in those countries are not better.", "Permalink": "https://www.reddit.com/by_id/t3_5x2upl.json"}, "40": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1488527554, "Score": 1, "Body": "3 months sounds about right. In my department, it usually takes about a semester with pre-written papers as main body. Mine took about slightly more than 4 months and I took about two months for my intro and conclusion chapters. It really depends on your workflow and how your adviser work with written stuff. My adviser is horrible about editing and take far too long to do anything.", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "41": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1488529429, "Score": 2, "Body": "It depends where you're doing your PhD. In the U.K. they are more focused on the final write up than in the US. I had a couple of\npublished papers and plenty of text that I had written. It took me about 7 months of writing to do the final write up. ", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "42": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1488530908, "Score": 1, "Body": "Are you UK or US based? Im UK based. I also think its quite subject driven as well. \n\n(I should have clarified, the main reason behind my questions is im planning my last study and im being cautious with how ambitious it may be with my funding deadline approaching as I cant afford to write-up unfunded)", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "43": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1488539689, "Score": 2, "Body": "I (was) UK based. Did a PhD in STEM. ", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "44": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1488546902, "Score": 1, "Body": "Thank you for your answer. Yes, I totally enjoyed by research both for my bachelors and masters thesis. Of course there were parts that were bit more of a struggle than the others, but all in all, I enjoyed finding out new things, writing them down, being able to be proud of something I have found out, I also liked to present it on conferences and all.\n\nNot sure about the intensity, but I am not afraid about the guidance. I managed to ask a professor that is not a linguist to be my supervisor for my BA thesis about linguistics, so there was little guidance there as well, and I managed well. I am not getting too much help for my current thesis, either...\n\nWell, I guess, with a PHD I could teach at a university which is something I could imagine myself doing, or being a fellow at the Hungarian Academy of Sciences, and just dealing with linguistics every day of the week - yes, these sounds nice. \n\nIf I was only deciding based on whether something would be good for me in 10 years, I would be probably standing on the same spot for ever... I have no idea about the future...\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "45": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1488546913, "Score": 1, "Body": "Why?", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "46": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1488546916, "Score": 1, "Body": "Why?", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "47": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1488546951, "Score": 1, "Body": "Thank you, I will try to think about it this way. Anyway, I would be doing it in Humanities, so it is not like science with unanswered questions...\n", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "48": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1488547025, "Score": 1, "Body": "Hmm.", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "49": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488588855, "Score": 1, "Body": "Littlemousy- sorry this post got trolled by some random non-PhD hanging out here. We have a good dialogue about PhD recruiting going on on the consulting subreddit if you want to check it out. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "50": {"Subreddit": "PhD", "Author": "cafe_chaos", "Date": 1488663917, "Score": 2, "Body": "It took me almost 5 months. i had to finish 2 manuscripts in between. Writing was never an easy phase but i already knew it would be difficult. So I was kind of practicing meditation, keeping a daily journal etc..this phase helped me to understand myself better. bt still some days were very tough..i set a daily goal of writing 2 pages.  ", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "51": {"Subreddit": "PhD", "Author": "cafe_chaos", "Date": 1488664530, "Score": 3, "Body": "At some point in my phd as well, I was completely drained out and couldnt cope with the stress and failures.. what helped me recoup was having a month long vacation. In your case, it may not change the attitude of others to you but it might help you to better cope with them..you will me mentally tougher after a good break. ", "Permalink": "https://www.reddit.com/by_id/t3_5wwwkr.json"}, "52": {"Subreddit": "PhD", "Author": "cafe_chaos", "Date": 1488665703, "Score": 5, "Body": "I still remember the advise from E Hemingway, it goes something like this: when you are writing, the start is always crucial..when you are in a flow, words naturally come to you..so what you have to do is when you are about to wind up for the day, do not pour yourself out to the last drop.. keep it for tomorrow, so tat you can get going straightaway the next morning", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "53": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1488670393, "Score": 3, "Body": "Unfortunately not, I just had to buy a license, you could also try python matlibplot, but origin is king", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}, "54": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1488675304, "Score": 3, "Body": "Not as far as I know... can you describe it? Maybe some people here can help. Experimental design textbooks might be of use to you too.", "Permalink": "https://www.reddit.com/by_id/t3_5xh22v.json"}, "55": {"Subreddit": "PhD", "Author": "babysleepbaby", "Date": 1488676217, "Score": 2, "Body": "Hi mate, I think it's actually a cross-sectional study. I was getting hung up on the fact that a cross-sectional study takes place at a specific point in time, which I stupidly thought had to be the same time (as in clock-time) for all participants, rather than the time treatment-wise. Thank you for offering to help!", "Permalink": "https://www.reddit.com/by_id/t3_5xh22v.json"}, "56": {"Subreddit": "PhD", "Author": "babysleepbaby", "Date": 1488676537, "Score": 2, "Body": "I'm very early on in the PhD process but this is what I've learned so far.\n\n- It is SUPER IMPORTANT that you get along well with/work well with supervisors. I am continuing along at the same university so I knew my supervisors well before starting. One is going really well but the other has been less than helpful at different points. Very busy supervisor so I'm clearly not one of the priorities which is cool, I get it, but I'm glad I have one who is helpful.\n\n- Do something you're passionate about. Even if robotics gets you going, does materials? Are you excited when you talk about it? I have no prior experience in my research area but damn, if someone asks me what my PhD is about I can actually talk about it for hours if I don't restrain myself. I'm totally invested personally in the research, I believe in its merit, and it helps ease the pain of some tight deadlines.", "Permalink": "https://www.reddit.com/by_id/t3_5xjdfh.json"}, "57": {"Subreddit": "PhD", "Author": "babysleepbaby", "Date": 1488676701, "Score": 1, "Body": "That's great advice, I'm keeping hold of that one. Thank you for passing it along!", "Permalink": "https://www.reddit.com/by_id/t3_5x2ami.json"}, "58": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1488678506, "Score": 1, "Body": "No worries! Glad you got it sorted!", "Permalink": "https://www.reddit.com/by_id/t3_5xh22v.json"}, "59": {"Subreddit": "PhD", "Author": "Heartburn_tonight", "Date": 1488678634, "Score": 5, "Body": "Get a good sized grant from an outside organization. Money talks.", "Permalink": "https://www.reddit.com/by_id/t3_5xkghq.json"}, "60": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1488680877, "Score": 2, "Body": "Absolutely possible, I've seen people go from CS --&gt; genetics, electrical engineering --&gt; plant biology. But there's not enough detail in your post to help more. What field are you switching to? What's your background? Where are you applying?", "Permalink": "https://www.reddit.com/by_id/t3_5xkghq.json"}, "61": {"Subreddit": "PhD", "Author": "ch1253", "Date": 1488684313, "Score": 2, "Body": "Sorry to mislead you. I have edited my post with some more detail.", "Permalink": "https://www.reddit.com/by_id/t3_5xkghq.json"}, "62": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1488685413, "Score": 3, "Body": "Just explain to the professors why you're interested in the topics and how your prior knowledge can help you and how you've been trained to analyze and think like a scientist.", "Permalink": "https://www.reddit.com/by_id/t3_5xkghq.json"}, "63": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1488692306, "Score": 3, "Body": "Random non-PhD?... Are you sure?", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "64": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1488722642, "Score": 1, "Body": "I just found these too that you could try: SciDAVis, QtiPlot\nLabPlot, Fityk, MagicPlot, peak-o-mat, HippoDraw, Veusz, ParaView, gnuplot", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}, "65": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1488750969, "Score": 2, "Body": "Country? Discipline? \n\nFyi: PhD \"candidate\" is a student who has finished coursework, passed qualifying / comprehensive exams, and had written a dissertation proposal (and defended it, in some cases). They then become \"ABD\" (all but dissertation) and have advanced to candidacy. Hence \"PhD Candidate\". In your case, you'd be an incoming PhD \"student\". ", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "66": {"Subreddit": "PhD", "Author": "BirdFacee", "Date": 1488752687, "Score": 2, "Body": "Thanks. I have fixed it. America and mechanical engineering. ", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "67": {"Subreddit": "PhD", "Author": "Yu_Xuelin", "Date": 1488754266, "Score": 1, "Body": "Tableau? What do you mean none of the listed are as good as origin? Matplotlib can do whatever you want; it's your coding skills that matter... It's weird and has a learning curve, but learning python has a lot of power.", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}, "68": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1488757503, "Score": 1, "Body": "Sorry, can't help (dif country and field). Best of luck. ", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "69": {"Subreddit": "PhD", "Author": "BirdFacee", "Date": 1488758421, "Score": 2, "Body": "Aww no worries. Thanks anyway 😊", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "70": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1488759631, "Score": 1, "Body": "Try asking in /r/gradschool maybe? This place is a little dead. ", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "71": {"Subreddit": "PhD", "Author": "BirdFacee", "Date": 1488759745, "Score": 1, "Body": "I will! Thanks for the recommendation! ", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "72": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1488772779, "Score": 8, "Body": "Even if it is legit they need to change their business model. It reeks of scam no matter how you look at it. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "73": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488792278, "Score": 3, "Body": "Psychology programs are all going to have a low acceptance rate if you want funding. The numbers I have seen are all less than 10% acceptance. I'm not sure if there's a way around the application fees if you're not from the US. I know that people from the US can get some of that money back with financial aid but I'm not sure if it'd be available to you. As for having your fees paid by being a TA or RA, that's basically any institution that has one available at the time. The list would literally be pretty much the list of universities that offer the program you want. Since you want to do a PhD, you need to look into who's research you're actually interested in and then contact them. There's no reason to go to a high ranking university if you'll hate the research.", "Permalink": "https://www.reddit.com/by_id/t3_5xrvlm.json"}, "74": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1488803208, "Score": 1, "Body": "They'll tell you what their basic offer is when you get accepted and then there's always the option to apply for even more funding via scholarships, etc... \n", "Permalink": "https://www.reddit.com/by_id/t3_5xrvlm.json"}, "75": {"Subreddit": "PhD", "Author": "aritra91", "Date": 1488808747, "Score": 3, "Body": "Yes. IMO after a buffer of 1.5-2 weeks you should inquire about the position you had applied for, if they didn't get back to you. ( Based on advice given by the professionals from my university). Good luck !!", "Permalink": "https://www.reddit.com/by_id/t3_5xq9j8.json"}, "76": {"Subreddit": "PhD", "Author": "helloiambrain", "Date": 1488811881, "Score": 1, "Body": "As I said, I need a spesific universities because I will apply for couple universities to increase my chance. In addition, It is not easy to apply randomly because currency differences. For instance, what if their basic offer is too low for me?", "Permalink": "https://www.reddit.com/by_id/t3_5xrvlm.json"}, "77": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1488817399, "Score": 3, "Body": "Python with matplotlib module might be worth a go. ", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}, "78": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1488823341, "Score": 4, "Body": "PhD is not another diploma you get to earn more money in a job. Its about doing something innovative that will contribute to society and you yourself will develop that branch by devoting your life because no one else can. Do not do a PhD because you don't want to get a job.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "79": {"Subreddit": "PhD", "Author": "sciencetm", "Date": 1488825156, "Score": 3, "Body": "Not sure. Didn’t join, but one of my lab mates is a chemist and joined and then she got a job. She told me to read the guy’s book black circle focus or something, didn’t read it but remember it was published by wiley. Don’t think wiley would mess around with something that wasn’t legit.", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "80": {"Subreddit": "PhD", "Author": "demosthenes83", "Date": 1488825766, "Score": 6, "Body": "Mba&gt;PhD track is pretty standard for business/management professors. I'm looking at doing the same. Talk to some of the professors in your program about your options.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "81": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488827112, "Score": 2, "Body": "Thanks, wasn't sure if it was common. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "82": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488827367, "Score": 3, "Body": "Its not really about avoiding a professional career, I have a job. Its about feeling like I'm wasting my time at my job, because I believe my purpose is to learn/teach at a university. I wasn't sure if I go continue down that path with an MBA, or if I needed to switch to something research based (which I wanted to avoid, being that I only need 6 hours to graduate)\n\n*Edit: Your response seems very science-focused*\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "83": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1488832504, "Score": 4, "Body": "If you're thinking of a PhD in Finance, then you should know that you need basically the equivalent of an undergraduate math degree. If you don't have that, you're going to need to get it and be able to demonstrate proficiency with math to the admissions committees before they'll let you in.\n  \nAlso know that Finance is the hardest PhD discipline to gain admission into, you'll need near perfect test scores, and glowing letters of recommendation, as well as excellent performance in math courses to have a shot.  \n  \nThere's a community of people also trying to get into Business PhDs check out http://www.urch.com/forums/phd-business/ \n\nEdit: I just noticed your MBA is in \"HR\". Just so you know the requirements to get into management PhD are *completely* different from Finance. For Management you'll actually be expected to have research experience. The fact that you said you are interested in PhD but didn't list a specific sub-area means you're really at the beginning of your search, and you'll need to do a lot of work to figure out if this is the right fit for you, and if you have the qualifications to get accepted to a program. Good luck.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "84": {"Subreddit": "PhD", "Author": "GG_MJC", "Date": 1488832509, "Score": 5, "Body": "I would make sure you know what kind of effort and sacrifices you'll make to do a PhD.  Might be a lifestyle shock.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "85": {"Subreddit": "PhD", "Author": "egelados", "Date": 1488834262, "Score": 6, "Body": "The association is legit.  I bought my membership last October and I don't regret the investment at all. \n\nWhen you join you will invited in a private facebook group. This is the main medium of communication. The group is really active and the admins will answer any questions you have about your applications/CV/networking ASAP. You will also get access to the private CSA material that include more than 50+ webinars (a new webinar is added every week or so) and precise steps on how to build your LinkedIn profile, networking strategy and resume. \n\nMost people are from health sciences, but I am an engineer and I've found a lot of relevant information in the material. The support from the other associates is also great! Meet-ups are organised regularly all over the world. I am not currently searching for a job actively, but I am sure that it won't take me too long to find a good and relevant position in 6 or so months, when I graduate. Recruiters have already started contacting me about relevant \npositions.\n\nI hope this helped! :)", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "86": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488834344, "Score": 3, "Body": "Definitely not wanting to go into a finance discipline for my PhD. My undergraduate major reflects the career path I thought I wanted to jump into when I was 18, and while I enjoy the content I would not want to dedicate any more time to the subject. \n\nThe concepts I'm interested in are Management, International Business, Human resource management, Marketing, and subjects of this sort. International Business is a frontrunner for me, as I have a solid connection with a professor who focuses on this subject. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "87": {"Subreddit": "PhD", "Author": "jinqianhan", "Date": 1488835459, "Score": 6, "Body": "I've been part of the Cheeky Scientist Association (CSA) for about 1.5 years - joined during the final year of my PhD and am currently a postdoc in a global 500 pharmaceutical company (so I can arguably say I've transitioned). The members are from fields all across the scientific, engineering, business spectrum (although most people are in the life sciences). If you are considering joining, all I can say is, what you get out of the CSA is what you put in. It is not a magical organization where you join and get automatically hired into industry. Much of the information you get from it can be found publicly. Some of the things like networking scripts and member interview question databases are unique within the association. Most importantly, joining the CSA gives you access to a large network of professionals that's a bit more close knit than your average alumni network (again, how much you get out of either is how much reach-out efforts you put in).\n\nWhat CSA did most for me is to get me to take action, and actively develop my network, which was ultimately how I got my current job. The interviewing question database was pretty much on point to my actual interview, which helped a lot as well. What Isaiah (the founder of CSA) is trying to do is to invest time to develop a large community of PhDs who have transitioned into industry. As more CSA members transition and move up the career ladder, the CSA becomes better positioned to give even more value to new members. There are several dozens of examples in the past year where CSA members have helped each other get jobs.\n\nMy financial rationale for joining is investing $500-1000 on a program that can help you find a job even 1 month earlier than you would have is a negligible investment for a large payoff. I anticipate that as CSA grows and gains more credibility, the price to join could increase.\n\nIn the end, joining is up to you. If you are committed to taking action (meaning more than just reading articles online), going to networking events, strategizing your job search, then there's no need to join, you'll be fine with just the information you can find on blogs and linkedin. If you need a bit of help and would like a small boost in your initial network, joining is a good idea.", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "88": {"Subreddit": "PhD", "Author": "nmsiqueira", "Date": 1488837906, "Score": 2, "Body": "I joined Cheeky Scientist Association in August 2016. I was looking for a program to help me build in my CV and to develop interview skills as I wanted to become more competitive for industry jobs. What I found was a completely wonderful and supportive group of scientists from all around the world. My experience within this group has helped me to gain confidence in all the technical and the transferable skills I have developed during my academic experience as Master and Ph.D. researcher. I’m grateful to CSA because this group changed the way I used to place myself in the professional world. This group genuinely creates an atmosphere where each member wants to lift others. I feel more confident and competitive since then.", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "89": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1488839173, "Score": 2, "Body": "I have no advice or experience in business academia, but I went into a PhD program with an MPH, which is essentially the healthcare equivalent of a MBA.  Have you taught at the university level?  You might want to try your hand at teaching to make sure you are passionate about it.  ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "90": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488839256, "Score": 0, "Body": "Universities in the US don't let you teach without a PhD (or being in the process of getting one)\n\nYou can teach at a community college level with a masters, but that isn't going to be my first plan. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "91": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488839648, "Score": 2, "Body": "They might not let you lecture but you can definitely teach. There's a lot of threads on here complaining about teaching undergrads. For most US PhDs you will be required to either TA or RA for small stipend and to have fees waived.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "92": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488840027, "Score": 1, "Body": "My plan is certainly to get a TA position while I do my PhD. Its not an option at my current university without changing degree programs (and I'm 6 hours from graduating with my current program). ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "93": {"Subreddit": "PhD", "Author": "Rugmani16", "Date": 1488840393, "Score": 6, "Body": " Cheeky Scientist Association or CSA as we call it is a wonderful group where you get answers for all your queries regarding scientific careers. This group is not just about career in pharma/biotech industry or scientific writing. It is definitely not about academic career bashing. I have been a member for 6 months now. Before joining CSA I had given 2 on-site interviews with no clue as to what went wrong at the final stage which led to no job offer. 6 months with CSA and I can already feel that my mindset has completely changed from a post doctoral trainee to a professional seeking a job in real world. I just recently had an opportunity for another on-site interview and the difference was that this time I was the one asking a  lot of science and business related questions. This is not just because of the content or modules provided by the association. It is more due to learning about and learning from experiences of other PhDs and Post Docs who went through the same situation. CSA is not just about helping secure a job. Its a group that helps you change your perspective towards science. Its a group that makes PhDs and Post-docs realize that you are not just researchers and that science is not only about securing a grant or an assistant professor position. It’s a training that would have been extremely helpful for me had I got it in my university when I was a graduate student. In addition, have you all not heard about your professors talking about the importance of networking and collaborating?  This is a group that helps you do that in the most easiest way . With reference to to those people who say CSA has not been helpful in securing a job  - I would like to remind that CSA never said it will get you a job…it only said that it will tell you all the strategies that you need to find the job. Now after learning those strategies how you use it and whether you use it that is up to you but the group does give a lot of opportunities to use those strategies but you have to do the hard work of approaching people, building rapport and getting referrals. This is fair enough because we never get anything we dreamt of (and definitely not a dream job) without putting our part of effort in it. So CSA is group that someone should join if you want to change your perspective towards science, feel motivated and achieve the goals (any career goals- academic/pharma/any other) that you aimed for and build and expand your network.\n", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "94": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1488841539, "Score": 3, "Body": "They definitely do allow you to teach- look at some of the smaller private universities.  I'm not sure if it's different in business, but there are lots of MPH grads teaching in MPH programs. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "95": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1488843183, "Score": 2, "Body": "How were you turning out a published paper every few months? Is this STEM?", "Permalink": "https://www.reddit.com/by_id/t3_5vyigu.json"}, "96": {"Subreddit": "PhD", "Author": "Anon_Scientist", "Date": 1488845271, "Score": 5, "Body": "I joined the association a few months ago and it doesn't appear nearly as scammy from the inside. I debated for months about joining because they seems like such a massive scam from the outside (I've given them feedback as such). The info is mostly useful- a bunch of worksheets and booklets with info ranging from how to network to how to prepare for an interview and negotiate salary. There are also a ton of webinars (I so wish they would consolidate the webinar info so you don't need to watch a million hours of conversation). \n\nThe single most useful part of CSA is the networking. You join a private facebook group and lots of people post information about their experiences interviewing, ask for advice about their job search, and post relevant job openings. You can connect with associates that were recently hired to do informational interviews. It's a nice little community. I feel a bit conflicted about this, because I just paid $300+ to grow my professional network, but I suppose it was worth it. I've made 2 informational interviews and connected with 2 recruiters that I wouldn't have found without CSA. \n\nOverall, their business model is bizzare (it's like they're *trying* to be seen as a scam), but I would still recommend it. \n\nP.S. The founder of CSA posted this reddit thread to the FB group in an effort to build credibility for the group. They might be open to changing their business model if enough people comment on the outward scamminess factor. And hopefully you'll get lots of responses on your thread. :)", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "97": {"Subreddit": "PhD", "Author": "drarch", "Date": 1488846446, "Score": 2, "Body": "I took a couple years off to work between my Masters and my (current) PhD. In that in between time I was able to teach as an adjunct, which helped me determine whether or not I liked teaching, and also helped me focus on an area of research to pursue as a doctoral student. It's a huge commitment to do a PhD, and it's worth investing the time in meeting with potential advisors and seeing if your unique interests can develop into a field of research, as that's what's expected. This approach (adjunct) also gives you an easy out if teaching isn't what you enjoy, or the environment isn't what you expected. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "98": {"Subreddit": "PhD", "Author": "awindinthedoor", "Date": 1488849395, "Score": 2, "Body": "I'm in the program, and I haven't transitioned to industry (yet).\n\nWas it worth it for me? Yes\n\nYou get to talk to like minded people, learn from their mistakes, and build a network of highly educated people who are / were in the same boat as you. You can effectively crowdsource your learning (plus the CSA webinars are pretty good and informative), and more importantly you realize that you're not in this alone.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "99": {"Subreddit": "PhD", "Author": "Sharpy777", "Date": 1488853990, "Score": 1, "Body": "I joined the Cheeky Scientist Association a couple of months ago. While their sales and marketing certainly reeks of scam as pointed out by one of the comments, the Association is real. I am still in the process of finalising my PhD but I find the materials and the help that comes from CSA very helpful in preparing for my transition to industry. They offer a variety of webinars; personalised feedback on your LinkedIN profile, resume and cover letter; and other helpful things as pointed out in some of the other comments.", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "100": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1488854791, "Score": 1, "Body": "Management and Marketing are solid choices. They both are mainstays in the academic business scene and will have departments in every business school. \n  \nHRM, tends to fall under management at most schools. International Business is popular at some schools, but not all, so going into this area might limit your job prospects. But still, with academia, you should focus on what you're passionate about. So if it's international business that keeps you up at night with excitement, then you shouldn't let it's limited status dissuade you too much.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "101": {"Subreddit": "PhD", "Author": "nickross008", "Date": 1488856111, "Score": 5, "Body": "Hi, my name is Nick.\n\nI am a Cheeky Scientist member. \n\nI remember when I was not a member yet and I stumbled upon cheeky scientist I just wanted non-biased information about the cheeky scientist organization to help decide to join and pay the membership fee or not. When I stumbled on cheeky scientist I was at a point in my job hunt where I have already paid for two other services that promised to help me find a job. Both were not very helpful, and most stuff they did I could have done or done better. I was very skeptical at this point in my life about services and organizations that advertise helping you find a job/dream job. I didn't trust any success stories from the cheeky scientist web page because I did not trust job hunting helping organizations at this point in my life and money was very tight. When I saw very little information about cheeky science other than just on cheeky science web page I was even more skeptical. I have to second the “scammy” vibes other people are writing. As an outsider, I got that feeling as well and it made me not purchase the membership right away. Finally, I did find some advice, I believe it was from this Reddit thread, that helped me finally go through and purchase the membership. \n\nIn short, Cheeky Scientist is worth the investment. I am now in industry and I still go back to some of the webinars and people I know through the organization to help other fellow cheeky scientists and also advance myself in my career path. It is nice that it is a lifetime membership.\n\nI believe Cheeky Scientist would have been a better investment if I purchased it earlier in my Ph.D. and slowly built up my network versus obviously being in crises mode. I also see the network I built within Cheeky Scientist will be invaluable down the road. Who knows what all of us will be doing in 5, 10, 20 years 😃. \n\nI have a Ph.D. in Analytical Chemistry and Post doc experience. In my Ph.D. and Post-doc, I worked on collaborative research projects with semiconductor industry companies such as Intel, L3, Freescale, and Texas Instruments. Even with this experience working on projects with industry collaborators I did not find a job right away when I graduated, and even months into a post-doc. Here is a link to my Linkedin if want to learn more about my Ph.D. experience and research. - https://www.linkedin.com/in/nick-ross-89623566/\n\nCheeky scientist is another tool in your tool box to help get your foot in the door. Some of us just need that little extra knowledge and connections (network) get that fail to turn into a pass. In industry, there is no A, B, C, F system, it is pass or fail. You either got the interview or you didn’t. You either got the position or you didn’t. There are some key phrases, key suggestions, key people to talk to and network with that helped me. Most of this helpful information came from webinars cheeky scientist has on their web page. I would listen to them while I was job hunting and working on responsibilities as a post-doc. \n\nNow cheeky scientist alone will not get you a job, and a lot of the information they give is just common sense to me. Someone who is applying for a job in another country that where they were born in or is not strong in their social skills cheeky scientist will be very helpful. I have to admit, being a people person and staying in the United States all my life I still found some “golden” information while sifting through the “dirt”. I still learned several good sayings, tactics, and communication skills that made getting an interview and doing better in an interview. For example, what do you say when an interviewer asks you, “how are you today?” and when they ask you,” what is the base salary you are looking for?” In short, you have to work on yourself and be willing to fail… a lot. Then learn from your failure and continue.\n\nIf you have seen a group of crabs in a bucket, you will notice that they are all trying to get out and will pull other crabs down to get closer to the edge of the bucket. What if all the crabs help each other? That is how if view cheeky scientist. I would see a job position or knew of a job opening due to a friend and would post it on cheeky scientist if I knew I would not be a good fit, and then offer to give my friends email/LinkedIn info for them to make a connection if someone in cheeky scientist was interested. Having inside knowledge and knowing the hiring manager is key. I knew someone would do the same for me. We are all educated professionals. If we all work together we can help each other reach our goals. I truly believe the best way to get what you want is to help enough other people get what they want.\n\nIt took me 2 months, but I found a position. I networked from 10am-4pm Monday-Friday and applied to jobs the rest of the day. usually working 8–12 hours Mon-Friday and 4–8 hours Saturday and Sunday. I would cold call, email, and reach out to friends and people I have never talked to in my life. Some, how I still made advances in my post-doc work. Yay, delegating work to younger graduate students: P\n\nI recommend getting into industry ASAP! I took a contract position that had a minimum 2 weeks to a maximum 6-month contract as analytical chemist analyzing products in development at and suitability tests for up to 3 years in shelf life. This position paid less per hour than my post doc, but it was full time so I did get paid more per week. More importantly, I got industry experience and continued to look for a position I really want. I am proud to announce that I will start as a Senior Packaging R&amp;D Engineer at Intel in February 2017. I joined Cheeky scientist in August 2016, got a contract job in October 2016, and got the job offer for Senior Packaging R&amp;D Engineer December 2016. I got my dream job at my dream company.\n\nMy manager in my contract position showed me how he/she looks at resumes for Ph.D. positions for his/her’s research team. In industry, when they are hiring for a position that would need a Ph.D. for, they look for industry experience (in a related field to what they are hiring for), experience with instruments and software that they currently use in the group that they are hiring for, and a Ph.D. in a related field. Now if you have all 3 your will be in the yes category. If your still in academia you most likely don’t have industry experience so you must have the last two conditions just to be put in the maybe category. Now I know why it was so hard to transition. Most companies do not want to gamble with someone who hasn't proved themselves in the industry setting. You have to really stand out for them to want to hire you.\n\nI recommend that in the last 2 or 3 years in your Ph.D. you meet with the career services department of your University. At my University, there was not much in terms of help at the Ph.D. level. The people at the Career services only dealt with BA, BS level students. But I made an appointment every 3 weeks, asking for suggestions, tell them what I have done and what I plan to do next. If you have a full 2r or 3 years, then you can make an appointment every month or two. Go to every career fair! Every … single… one…. Seriously! I made great connections for a career fair that was only for business majors for example! I stood out from the crowd! Booths of companies that would normally be hour long lines in engineering/scientist focus career fairs had no lines at the business career fair. At career fairs, I got a lot of offers for an internship in 9 months (the following summer), that would have been perfect if I will still working on my Ph.D. Seriously guys and gals, I have seen so many graduate students get an internship and they get a job offer the same year they finish their internship. I had two coworkers get an internship, get an offer (no interview, their internship was their interview) within the same year. Both coworkers go an offer before they graduated. One was pushed through the program, the other just left and finished writing his dissertation then came back to defend then went back to work 😝. Would you want a job before you graduate? Get an internship.\n\nIn the last 2 or 3 of years your Ph.D. I would focus on finding a job not finishing your Ph.D. Finding a job is so much harder. Once you have a job lined up usually your adviser and committee members will help push you through. If you’re having difficulty, consider investing in cheeky scientist. Allow yourself some time so that you are not in crises mode.\n\nHoped this information helped.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "102": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1488858204, "Score": 1, "Body": "Thanks for the advice!", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "103": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1488861647, "Score": 2, "Body": "I've never heard of this organisation, but I find it extremely strange that there are so many positive and lengthy reviews from accounts that have existed less than a day...", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "104": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1488863274, "Score": 1, "Body": "Why do you want to be a professor? What about a university setting appeals to you? What type of university are you considering working at?\n\nWhen I started grad school, I wanted to be in academia. Now I'm near the end of my PhD and I don't want to be a professor. It's all committee meetings, managing grad students, and writing grant proposals. I should probably say I'm not in finance so it might be different in your area.\n\nIf I were you I'd keep the job and forego the five years of hardship. I might be less cynical in 5 years though, you caught me at a bad time.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "105": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1488870814, "Score": 1, "Body": "I've heard MATLAB is easy to find for free online 😉\n\nR or Python would be the tools to try in my personal opinion ☺ Python 3 over Python 2 if you want to be specific, just because it's probably going to be around for longer afaik", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}, "106": {"Subreddit": "PhD", "Author": "Myinate", "Date": 1488883933, "Score": 1, "Body": "Thanks a bunch for the advice, I'll send them a mail to inquire. ", "Permalink": "https://www.reddit.com/by_id/t3_5xq9j8.json"}, "107": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1488905256, "Score": 1, "Body": "First I've heard about it.", "Permalink": "https://www.reddit.com/by_id/t3_5y12s7.json"}, "108": {"Subreddit": "PhD", "Author": "JimmyRat", "Date": 1488907997, "Score": 1, "Body": "Why don't you wash some dishes and make me a sandwich. ", "Permalink": "https://www.reddit.com/by_id/t3_5y12s7.json"}, "109": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1488909426, "Score": 1, "Body": "I will give you my example in a different branch. I am currently a PhD candidate in Remote Sensing (precision forestry) at 46 years old. I have a B. Comm in Accounting from the early 90s. I was an accountant for 6 months ;) then spent the next 20 years in IT consulting.\n\nI had to do a graduate diploma (one year) in GIS, then I did M. Sc Geography and now my PhD. I did not think I would be doing a PhD when I started my graduate diploma (they would have require it anyways for my Masters) but everything kind of fell into place.\n\nWhat I am trying to say, badly, is that the worse that can happen is that the department will accept him on condition of fulfilling pre-requisites that are important in their eyes. Enthusisasm and dedication is what they are looking for in a PhD student, in my opinion.", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "110": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1488909655, "Score": 3, "Body": "Indeed, classic astroturfing", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "111": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1488911183, "Score": 2, "Body": "Having the REU experience will be helpful for grad school apps no matter which one of the two you choose. I think the robotics program may be helpful for you to see what you're really interested in and what you want to do in grad school/career. It would be better to do it for the summer and realize you don't like it than realize that in grad school (and also the opposite, better to realize that now than when you're already doing other research in grad school). That would be my opinion, other people may feel its better to get more experience in one area. In the end though its up to you, and I don't think either experience will hurt you.\n\nAlso, if you don't get many responses here you can also try posting in /r/gradschool, it seems to be busier than this sub.", "Permalink": "https://www.reddit.com/by_id/t3_5xjdfh.json"}, "112": {"Subreddit": "PhD", "Author": "aLightBraise", "Date": 1488911538, "Score": 3, "Body": "CSA is legit, and I am a member. Got my PhD in geoscience in 2013, and didn't want a postdoc or to stay in academia.  Took a teaching job for a year, but was looking for something else and wasn't sure how to get there.  Found Cheeky Scientist and decided to gamble on their paid services.  \n\nFirst, I will say that CSA does have a bias towards the biochem/molecular/chem fields since that is more or less the 'easiest' leap to the biotech industry.  I am not in those fields, nor did I want to go to the biotech industry.  I still found the paid services valuable, and used their strategies to get first a fellowship, and now have used them again to get my current position (comms/strategy at a national lab). \n\nBefore CSA, I found networking to be a painful exercise to be avoided.  Now, it's still painful because I'm an introvert but I've used the CSA strategies to make it easier and more fruitful.  I know how to talk about my academic experience in a way that is more meaningful to people outside of academia. \n\nThese two things alone made the cost worthwhile.  I also found the cost to be completely reasonable, particularly compared to the thousands of dollars that some 'skills for academics' workshops I've seen advertised.\n\nYou're welcome to PM me with specific questions if you want more info. \n\nTLDR; I have a PhD, took a chance on CSA, found it completely worth it. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "113": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1488920228, "Score": 1, "Body": "Experiences definitely vary on field. I know a lot of very happy comp sci profs, and a lot more unhappy bio or STEM folks (my background).  We need so much more effort, money and time to make a project happen compared to others who can more easily do experiments in silico.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "114": {"Subreddit": "PhD", "Author": "JoNapill", "Date": 1488931771, "Score": 1, "Body": "I barely used reddit and happened to see some of the post here. Guys, please be respectful to to others. You may not like the post, then you can leave. \nSanfrancisco1233's experience is very common among IVY undergraduate-IVY PhDs. For example, as an undergraduate in UCSF/UCLA/UCSD, I am pretty sure you have the chance to know Weissman, Wendell and the whole department.etc, other HHMI/NAS. The eastern coast-Broad Instit...\nThe PhDs nowadays in life science have kick-ass CV indeed. Benchwork + Programming (Learn from 0) + Engineering insights. I can tell you a lot!\nI can tell you one of my labmate was publicly commented by geoffrey hinton \"The best machine learning application\". I have seen dozens of trainee from George church. Fantastic! programming like a CSer, Building machine like a engineer and talk about biology like doctor. \nHowever, writing neat code is rare though.  For example, I know how to code and make it work....python, R, Bash, Java...but never clean lol.\nIf you are from some hot fields....like me such as sequencing/data analysis, it is pretty easy to get some VC. I just got 1 million for the project we set up.  \nHowever, Sanfrancisoc1233's CV/performance is still better than what I describe. (More solid/sound than what I describe. There is a huge gap between neat coding and coding.  My investor told me he never expect my project will succeed someday...Maybe sanfrancisco1233's startup will land somewhere)\nAnyway, if we don't know who they are, better not to judge them just based our own experience.  ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "115": {"Subreddit": "PhD", "Author": "desyree", "Date": 1488943905, "Score": 2, "Body": "I joined CSA in August 2015 and was employed in the biotech industry by May 2016. BEST decision of my career! It is not only good to improve your self-esteem (since you start seeing that you are not the only PhD that cannot find a job), but it changed the way I see my career. I am now much more strategic than I was before I joined. Academia does not teach you how to find a job outside of University and that is what they do. True, you can get most of their advice from perusing websites, but it is going to take you a LONG time to find all the advice they give you and to be able to put them in practice. Besides, there will be no one with enough knowledge (or time) to give you tips on how to make your resume/cover letter/interview skills better. There is so much important information and it is all in an organized structure, which makes it much easier to digest everything you need to. When I joined, I was going to several seminars in my university about how to find a job outside of academia. Trust me, these are nothing compared to the support we get from the association. The association is much more practical and that is what makes a difference. I recommend the association to all my friends that are struggling to find a job. So far, none of them have said it was a bad idea. And one last point: network! Most of these people will be in biotech soon and you are linked to all of them.\n\nSo, my experience has been great. I have a job that I love and a career to prepare for, with concrete goals and strategic thinking. And even with a job, the association still helps me (business acumen, networking, articles that people post on the facebook group…).", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "116": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1488944653, "Score": 2, "Body": "Well, your anecdotal evidence matches my personal experience. I'm in STEM.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "117": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1488944864, "Score": 2, "Body": "Since PhD career outcomes is a passion project of mine, curious what your thoughts are for your next step, given you don't seem inclined towards the traditional path.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "118": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1488944958, "Score": 1, "Body": "Dream job is a national lab. Seems like the best of academia and industry. What did you end up doing?", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "119": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1488945448, "Score": 1, "Body": "It's a bit ironic that at the end of a PhD, many people wish they had the opposite problem you do!\n\nCan you spare any time or effort to find a local school to do some teaching or to work with someone on a research project related to something you have experience, say a business or finance topic, in that could intersect with education?  Or volunteer to do some education related work with a nonprofit or community organization. \n\nLike any time you're competing with others, the more you can demonstrate tangible competency, the better you'll look. When it comes to competing for a PhD student position, you basically can get by on any kind of background if you also have some evidence of research experience. I switched fields between undergrad and my PhD because I had my name on a publication and did an honors thesis, which I'm pretty sure is the reason I got accepted. (I did switch from one STEM field to another, but they're still not necessarily related.)  \n\nBottom line is you can take solid research experience anywhere if you know how to sell it. \n\nA side note, most big companies do research all the time, so maybe you could also see what kind of analytical projects your colleagues are up to. In fact, your cushy financial employer may well employ PhDs...though they're likely on the computational or analytics side of things. \n\nRegardless, everyone can make the best of their situations, as we usually all have multiple opportunities to shift directions in our professional lives if we make moves in the desired direction. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "120": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1488950265, "Score": 3, "Body": "I'm in chemistry but this is the best resource I've found for it: http://www.tulane.edu/~lamp/whiteside.pdf ", "Permalink": "https://www.reddit.com/by_id/t3_5y5eim.json"}, "121": {"Subreddit": "PhD", "Author": "lightnovel_abuser", "Date": 1488956238, "Score": 1, "Body": "Thanks for your reply!\n\nI'll be sure to relay it to him. As of yesterday when I talked to him, He's still preparing his research proposal and according to him, he'll send it in and hope it gets accepted. I did tell him that he could send it in to a few other Unis but the one i'm in is the closest to office. \n\nThanks again.", "Permalink": "https://www.reddit.com/by_id/t3_5wvoi0.json"}, "122": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1488962734, "Score": 2, "Body": "I'm also an engineer and found the book \"Writing with Style\" by Trimble to be the most useful resource I've read so far.  It's focused on the methods you should use while writing and while analyzing/editing your own writing.  \n\nSomething else you can do is to make time to read papers *only* for the writing style and methods, rather than for the technical content.  It might be easier to do this on papers a bit outside of your exact specialization so you don't get too distracted with thinking about the work itself.  When you read them, note down things that make them easy or hard to follow, when and how the authors summarize the general content of the paper, how they use repetition or references to make it easier to read, etc.  You can always ask some colleagues for suggestions of well (or badly) written papers to give you something to start with.", "Permalink": "https://www.reddit.com/by_id/t3_5y5eim.json"}, "123": {"Subreddit": "PhD", "Author": "israelKiwi", "Date": 1488974162, "Score": 2, "Body": "Usually conference papers don't deal a whole lot with literature and the problem Yuu are trying to solve, I would start from there. Be thorough on what the problem is and why it exists: why hasn't it been tackled and what is the flow of solutions of the state of the art? Then why are you trying to solve it? What are the pre/post condition you want to achieve and what are the measurable benefits?\n\nWhat applications can you present that significantly move the soap forward? Pure applications, not results.\n\nData, data, data: select a large experiment and make a lot of them for each of the properties you want to showcase: make sure your foundation is strong and include as much detail as possible to describe the experiment, put great care in the results and their interpretation: how each experiment allows you to build more knowledge. Don't fear to be too formal in these sections, you'll need them later.\n\nUse the previous conclusions to draw your results, show how they improve the soa, strengthening your point for the experiments. Tackle the problems you could not solve before your journal and show measurable, detailed, simple but very substantial experiments on them.\n\nAs usual, end up with future,  work.", "Permalink": "https://www.reddit.com/by_id/t3_5y71a2.json"}, "124": {"Subreddit": "PhD", "Author": "ch1253", "Date": 1488980344, "Score": 1, "Body": "Thank you very much for your suggestion.", "Permalink": "https://www.reddit.com/by_id/t3_5xkghq.json"}, "125": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1488988014, "Score": 2, "Body": "For CS people: Writing for Computer Science, Zobel.", "Permalink": "https://www.reddit.com/by_id/t3_5y5eim.json"}, "126": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1489001875, "Score": 2, "Body": "I'm at a startup, which has been a pretty neat ride so far.  Also working on a program to help others transition on the side, so been keeping busy!  \n\nNational labs are definitely a good option.  Depending on your skillsets and interests, some industries or CROs can also be a nice blend of the two worlds as well. Really breaks down into what you do well (or want to do well in the future), what you naturally tend to enjoy doing, and finding a place that values those aspects.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "127": {"Subreddit": "PhD", "Author": "PierceBrosman", "Date": 1489005624, "Score": 2, "Body": "Check the author guidelines for the Journal that you're aiming for. They will sometimes include information about what is required/acceptable in terms of overlap with prior work. \n\nFor example, from the IEEE Signal Processing Society:\n&gt;**Extensions of the Author’s Prior Work.** It is acceptable for conference papers to be used as the basis for a more fully developed journal submission. Still, authors are required to cite their related prior work; the papers cannot be identical; and the journal publication must include substantively novel aspects such as new experimental results and analysis or added theoretical work. The journal publication should clearly specify how the journal paper offers novel contributions when citing the prior work. Limited overlap with prior journal publications with a common author is allowed only if it is necessary for the readability of the paper, and the prior work must be cited as the primary source.", "Permalink": "https://www.reddit.com/by_id/t3_5y71a2.json"}, "128": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1489007928, "Score": 4, "Body": "What field are you in? I've seen big differences between what a conference publication actually means between fields. In some fields conferences limited to 2-3 page contributions which are not peer reviewed, while in other fields, e.g. computer science, some conferences can be quite competitive with sometimes even 10% acceptance rate. In the latter case the difference in expectations between a conference and a journal paper (of course depending on which journal and which conference) might not be so large. ", "Permalink": "https://www.reddit.com/by_id/t3_5y71a2.json"}, "129": {"Subreddit": "PhD", "Author": "julloa01", "Date": 1489022884, "Score": 2, "Body": "I'm joined CSA a few months ago, and the platform has been an enormous help. I've joined a few other platforms that are helpful as well, but one of the things that separates CSA from others are the resources provided almost daily which are extremely beneficial. I have learned an incredible amount from the live conferences with professionals and experts, articles, webinars (e.g. how to create and industry ready resume and LinkedIn profile or interviewing skills from phone interview to salary negotiation), and the network that you gain by joining. Several months ago I paid someone at Clinical Strategist (I believe) more than CSA cost...biggest waste of money and time. She 'helped' me with my resume, but it was nothing like what it needed to be. If I had a question about how to write a cover letter let's say-after I paid her, I basically never heard from her again. After emailing her with few simple questions 3-4 times for each question, I just stopped trying. It wasn't like I was emailing her all of the time...I'm pretty independent and can research answers on my own, but I thought I would get 'insiders' perspective...what are recruiters or people hiring looking for? With CSA, I can post a question and receive advice right away..and there's a network of people (fellow CSA) that want to help. I have since re-written (from what I have learned from CSA) my resume, almost finished with Linkedin, took CSA advice on how to network and just today met with a MSL director that sat with me over coffee for an hour to give me info about the MSL role and her experiences. CSA rightfully asks that you have your resume and LinkedIn in order prior to networking, but I have completed my summary and just need to tweak the rest..Anyway, I was blown away with how helpful that the MSL director was and am grateful for the opportunity. I largely attribute my getting this meeting to what CSA taught me about networking. The program is ongoing-there is a constant flow of valuable info. You can't go wrong joining and have all to gain. Best of luck.\n", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "130": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1489023149, "Score": 1, "Body": "My field is Operations and Supply Chain Management.\n\nConference papers are peer reviewed, about 10-14 pages, and typically around 5,000 words. The conference papers are in the top two conferences in my field.", "Permalink": "https://www.reddit.com/by_id/t3_5y71a2.json"}, "131": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1489023259, "Score": 1, "Body": "Thank you, this is very helpful.", "Permalink": "https://www.reddit.com/by_id/t3_5y71a2.json"}, "132": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1489037793, "Score": 10, "Body": "Not a good idea to rely on drugs, unless you have a diagnosed condition that has been attended to by a practicing physician.  \n  \nPhD is a marathon not a sprint.  \n  \nMaybe try the pomodoro technique?", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "133": {"Subreddit": "PhD", "Author": "welp____see_ya_later", "Date": 1489045009, "Score": 8, "Body": "+1 for Pomodoro technique. Also, set a relatively small number of time-based, not achievement-based, goals per day. Aim for about 4 hours of solid theoretical work per day. \n\n+1 for no pills. I did use various amphetamines (Adderall®, Ritalin®) for a year or so, even though I don't have ADD, but really found they were not helpful in the long run, which is what  Ph.D. is.\n\nSource: myself; just graduated :)... 5½ years, so it could have been worse. \n", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "134": {"Subreddit": "PhD", "Author": "manicmuncher", "Date": 1489045836, "Score": 2, "Body": "There are several add ons for your browser to stop you visiting certain sites. There is a nice app called writeometer that you can do intervals with it will just show a timer on screen for a certain period of time", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "135": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1489050319, "Score": 6, "Body": "No one else knows anything and we are all just winging it whatever we do. You've spent a lot of time on this and you've managed to progress to a stage where you are at least going to defend it so you must have been able to do something with the information you've been working on. Good luck!! ", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "136": {"Subreddit": "PhD", "Author": "Gg17iln", "Date": 1489056197, "Score": 1, "Body": "Thank you, I will stay strong and believe myself.", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "137": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1489056281, "Score": 1, "Body": "[Imposter syndrome](https://en.wikipedia.org/wiki/Impostor_syndrome), everyone is in the same situation as you.", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "138": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1489057914, "Score": 1, "Body": "To be completely harsh (because what you describe is something I've struggled with too) - you can't just take a pill or rely on a technique, you need to just f*ucking sit down and study. I had the same issues and I'm my own worst enemy cause I swear I made progress in candy crush than my PhD in my first year. \n\nI had to be harsh and just ban myself from using my phone/internet while I was researching. My reliance on technology was particularly detrimental when I was doing reading for my literature review, I'd lose my place reading cause I was checking my phone or had opened the internet to check something and ended up on reddit and I would have to go over the same thing again and again. \n\nI started going to the library with a notepad and a pen - no phone, no laptop. All I had left was to sit and read. It was torture, but it was what worked for me. Once I got used to doing it (and realised how much I can get done if I applied myself) it was easier to focus and I don't find it an issue now. \n\nAlso - took modafinil for a while and it's effects on attention/focus are seriously overrated - at least for me. All it did was give me a feeling of being constantly \"on edge\" and made my heartbeat go crazy.", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "139": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1489058126, "Score": 1, "Body": "Yep, sounds like you've got a bad case of imposter syndrome. \n\nAlso remember that, right now, you are the leading world expert in whatever your topic is. Nobody knows your topic better than you do. \n\nAlso remember some basics- it's okay to take breaks to breathe, and think. If you get asked a question and you panic, take a big, long drink of something. Take ten seconds and say, 'Hmm, that's an interesting question'. \n\nAll the best! ", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "140": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1489058957, "Score": 1, "Body": "Personally, I would recommend a combination of two things.\n\n1) Increase your attention span. For example, taking a walk and leaving your phone behind, taking up an activity that requires concentration and nothing else (for me; mountain biking). Mindfulness also seems to help, but it's not for everyone. More subtle things help as well. For example, making a habit of reading what you see online, rather than scrolling through it.\n\n2) Don't rely on motivation or willpower. You can create habits, which decreases the willpower you need to do something. Alternatively, you can flat-out get rid of distractions (e.g. use a blocker on the computer, remove your social media accounts, etc). \n\nOverall, the combination of these two points will increase your concentration of whatever you're doing, and reduce the likelihood of encountering distracting technology.\n\nThe honest conclusion to this is that there is no magic answer. I've read countless 'self-help' books, and none of them helped. The trick is to just get out there and make manageable changes to your lifestyle over time.\n\nDrugs don't treat the cause, only the symptoms.\n\nSorry for the lack of clarity in my post!", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "141": {"Subreddit": "PhD", "Author": "Baconate69", "Date": 1489066652, "Score": 10, "Body": "How to interact with other people. This is invaluable in any career, especially industry. If you want to progress up the chain then you have to be able to manage others, convince people of your ideas and generally be able to give people a positive social impression of yourself. Unfortunately this isn't something you learn in school, and sitting in a lab by yourself running experiments or writing probably actually causes digression in this area.", "Permalink": "https://www.reddit.com/by_id/t3_5yemyr.json"}, "142": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1489073329, "Score": 1, "Body": "As someone in my third year of the PhD and on Reddit right now (lol) - limit technology. Instead of using a laptop for notes, use notebooks. Instead of having your phone nearby, set it on silent and a good distance away so you'd have to get up to look at it. Write essays and papers out by hand first, then type them.\n\nAlso, use computer stations at the library or grad spaces so that you're not tempted to sit there and google stuff all day, since they're public. Leave your laptop and such for downtime at home.", "Permalink": "https://www.reddit.com/by_id/t3_5yd5dj.json"}, "143": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1489074989, "Score": 7, "Body": "In the sciences, it's documentation. Industry really really cares about properly recording what you do as it might be vital for patent cases, FDA approval, etc. \nAlso, method optimization. There is a lot less, \"let's just run with this hokey assay I threw together over the weekend\" and a lot more, \"I piloted an assay and now I'm going to get a statistician help me identify the critical parameters (temperature, time, pH, starting material concentration, etc) that I should test to ensure that this will work robustly with reasonable concentrations of all the reagents, etc.\"\nAlso record everything properly.\nDocumentation.\nedit: for spelling", "Permalink": "https://www.reddit.com/by_id/t3_5yemyr.json"}, "144": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1489079903, "Score": 5, "Body": "Within the first 6 months, you learn the paradigm within which your field operates. That means you're taught by experts in your field, how to begin thinking and approaching problems in your field like an expert.  \n  \nA lot of PhDs are funded. The main costs are opportunity costs. \n  \nIf you have the passion, there's no harm in applying.", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "145": {"Subreddit": "PhD", "Author": "ReddRepublic", "Date": 1489085805, "Score": 2, "Body": "After three years of PhD studies in energy ecominics, I have a much better overview knowledge of all the actors in my field, what they do, how they do it, why certain mechanisms work and others don't. My knowledge of potential employers has also exploded - right after college, I had no idea of all the options out there. Finally, I know so many different methods (read: maths), some of which I had vague ideas about in college, that I can apply to problems and that increase chances I will get an interesting job after finishing next year.", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "146": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1489098333, "Score": 5, "Body": "A few things; I learned that high school drama doesn't stop, even amongst high level intellectuals. More importantly, though, I've learned that the \"experts\" are just people who are really really interested in one specific area. Before, I felt like I put them on a pedestal for their intellectual capacities, and to a certain extent, I do. My advisor is somewhat of a celebrity in my field, and I have a lot of respect for his work. But they aren't necessarily mad scientist geniuses is my point. If you are really interested in something and are willing to put in the work, you, too can become an expert. \n\nAlong that line, as another commenter said, most of us are funded. It's not much, but it pays my bills and my tuition is covered. Not every program offers that, but it is worth looking into. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "147": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1489098708, "Score": 2, "Body": "Hey there. Based on this I would go with school B. Having money to travel and do research is something you shouldn't take for granted. Also, this kind of makes the remoteness a bit less relevant, right? small class sizes are clutch. Some of my best learning moments in my program are in class discussions. \n\nFor \"service\" what kind of responsibilities are at each school? For example, teaching a class is WAY different than working in a lab in terms of time. And as a PhD student your time is more valuable than money. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5yhn0z.json"}, "148": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1489103801, "Score": 2, "Body": "Also, the remoteness of school B might mean a lower cost of living, which could undercut the financial gain to going to A. \nGo B.", "Permalink": "https://www.reddit.com/by_id/t3_5yhn0z.json"}, "149": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1489105766, "Score": 2, "Body": "Great read, OP. I'll have to look at my job options post-phd too - it seems the industry side might have options I don't even know yet! ", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "150": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1489112149, "Score": 12, "Body": "Come back and share after at least a year in your job before making any lofty statement like you did. \n\nI have gone to the real world and found that there are pros and cons of both sides. You can't compare the expectations between a postdoctoral and an industry position. \n\nYou are earning more because they are expecting more. You're not cultivating your own expertise daily as in the postdoc. You're somebody's else resource now. You work for them and everything you do revolves round the company's objective. \n\nA way to look as the Ivory Tower is that it is your tower. You're at a higher vantage point, away from the low lying short term profit driven thinking. ", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "151": {"Subreddit": "PhD", "Author": "FreeFromIvoryTower", "Date": 1489112914, "Score": 3, "Body": "Nothing I said was lofty. Everything was true. I never made any indication that I was my own independent resource in industry. Not that doing a postdoc makes you an independent resource. I have seen many postdocs treated like graduate students and micromanaged. It's far from uncommon. \n\nAlso, planning to earn enough money to live more than comfortably at both a young age and through retirement is not \"short term\". It was my thinking long term that actually led to this decision. The easiest short term thing for me to do was to accept one of the postdoc positions I was offered.", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "152": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1489113601, "Score": 8, "Body": "&gt;You are earning more because they are expecting more.\n\nTwo first year assistant professors in my program have offices right next to mine, and they are consistently pulling 12 hour days at a minimum (sometimes 18+ when deadlines loom) applying for grants and writing papers. I highly doubt the OP will be *expected* to work anywhere near that hard.\n\nEven if you ignore postdocs, there are huge hurdles facing young faculty members in getting the funding needed for tenure. With scientific funding going nowhere but down with the current administration, I plan to look in industry as well. ", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "153": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1489116407, "Score": 2, "Body": "Congratulations! It's great to hear something positive about the job market because all I hear is how there are no PhD jobs. \n\nI'm in the same field and I don't know exactly which one but I know I want to take on a nontraditional career. I guess the biggest obstacle  in this is lack of information regarding what these alternative options are and what those jobs involve. I already know what professor life is like and I don't want that. Industry is absolutely a contender so I was wondering if you'd share how you got into industry? Most of the postings I see require a few years of experience or even a post doc. Also, what are your responsibilities or day to day work like? Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "154": {"Subreddit": "PhD", "Author": "FreeFromIvoryTower", "Date": 1489121147, "Score": 2, "Body": "Basically, about half way through my PhD I started to question both the career trajectory and quality of life in academia and was becoming unsettled. I tried not to dwell on it and figured that I would just put my head down, grind out the PhD, jump into a postdoc and then worry. I interviewed for multiple postdoc positions and ultimately turned down a couple. It was during this interview process it became painstakingly evident that many postdocs from all over, in general, seemed unhappy, overworked, underpaid and stuck. I really questioned if this was what I wanted for the next 7 years and quite frankly, I would really just be doing an extended PhD again - this time without the complications of committee meetings or TAing. I was basically going to be doing the same stuff I already had an expertise in, which of course is why I was a good candidate for these labs. \n\nI stepped away from that and decided I couldn't really answer the question of why I was considering putting myself through all of this. I originally went to school because I loved science, not because I wanted to be a professor, necessarily. So I figured, why not try and better my quality of life, gain valuable real working experience and still get to talk about science all day. I got into contact with a scientist I worked with during my PhD in a central hub for the biotech industry and that initiated the interview process. It was solely that connection. Prior to that, I sent out about a dozen industry job applications without any bites. It's the big double edged sword  - we want a doctorate AND extensive industry experience- for most positions. More importantly than what I studied, was who I knew in the end. \n\nI would prefer not to go into too many details about the day to day for confidentiality. It is a non-research position that requires a PhD, lots of travel and post sale support to researchers.  ", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "155": {"Subreddit": "PhD", "Author": "chuck-fanstorm", "Date": 1489177242, "Score": 1, "Body": "The service is a TA requirement: 3 years at the state school, and two at the private one. I think graduate class sizes would be comparable, but the course sizes for TAs are much larger at the public school. \n\nI'm local to school A so moving would be a pain, but the cost of living is definitely lower in B. ", "Permalink": "https://www.reddit.com/by_id/t3_5yhn0z.json"}, "156": {"Subreddit": "WitchPhD", "Author": "Whatifisaid-", "Date": 1489178341, "Score": 2, "Body": "You're back! I was starting to worry you'd stopped posting. Very cool photo. :)", "Permalink": "https://www.reddit.com/by_id/t3_5ymz2k.json"}, "157": {"Subreddit": "WitchPhD", "Author": "imembarrassedwithme", "Date": 1489184234, "Score": 1, "Body": "It has been far too long! I'm addicted and I need more :)", "Permalink": "https://www.reddit.com/by_id/t3_5ymz2k.json"}, "158": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1489186285, "Score": 2, "Body": "And how every now and then I look and go, \"Oh crap, so many!\" Only to realise its my dirty screen. Ha!", "Permalink": "https://www.reddit.com/by_id/t3_5ypcn9.json"}, "159": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1489193129, "Score": 2, "Body": "Thanks I appreciate the reply. I'll keep this in mind, it does seem that networking is key in any career!", "Permalink": "https://www.reddit.com/by_id/t3_5yifph.json"}, "160": {"Subreddit": "WitchPhD", "Author": "Sudokonym", "Date": 1489199426, "Score": 3, "Body": "Alas, poor WitchPhd.  I knew her well, Horatio.  A woman of infinite breasts. . . ", "Permalink": "https://www.reddit.com/by_id/t3_5ymz2k.json"}, "161": {"Subreddit": "WitchPhD", "Author": "CommentSomething", "Date": 1489202592, "Score": 1, "Body": "Alassinsane ", "Permalink": "https://www.reddit.com/by_id/t3_5ymz2k.json"}, "162": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1489221589, "Score": 1, "Body": "Thanks! ;)", "Permalink": "https://www.reddit.com/by_id/t3_5ypcn9.json"}, "163": {"Subreddit": "PhD", "Author": "TissueBoxesOfFun", "Date": 1489264217, "Score": 1, "Body": "How did it go? As bad as you thought?", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "164": {"Subreddit": "PhD", "Author": "sarakyeo", "Date": 1489288202, "Score": 1, "Body": "this is great, thanks for sharing! ", "Permalink": "https://www.reddit.com/by_id/t3_5yu7rz.json"}, "165": {"Subreddit": "WitchPhD", "Author": "SlutPmYourNudesToMe", "Date": 1489322210, "Score": 1, "Body": "I'd go to this show...", "Permalink": "https://www.reddit.com/by_id/t3_5ymz2k.json"}, "166": {"Subreddit": "PhD", "Author": "Gg17iln", "Date": 1489338048, "Score": 1, "Body": "Thanks so much for your advice, I guess I do suffer from imposter syndrome. I took your advice and for questions that I didn't know the answer tried to say something, or at least shift it to the direction to a discussion.", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "167": {"Subreddit": "PhD", "Author": "Gg17iln", "Date": 1489338318, "Score": 3, "Body": "Hi, thanks for asking. Not as bad as I thought, but still a lot of questions where I said something and the jury didn't say that much for response, and I couldn't tell if they were satisfied with that answer or they were unsatisfied and thought \"silly student, obviously she doesn't understand\" and decided to move on to the next question. But in the end they gave me the degree so all's well I guess.", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "168": {"Subreddit": "PhD", "Author": "TissueBoxesOfFun", "Date": 1489340861, "Score": 1, "Body": "Awesome, congratulations! What was your dissertation on?", "Permalink": "https://www.reddit.com/by_id/t3_5ydw2q.json"}, "169": {"Subreddit": "Playful_PhD", "Author": "Flat_Sixx", "Date": 1489355849, "Score": 1, "Body": "Gratz !!   😘🍻\n\n🍺", "Permalink": "https://www.reddit.com/by_id/t3_5yxsjy.json"}, "170": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1489358432, "Score": 1, "Body": "Thanks! Honestly, so so so so so excited!!!\n", "Permalink": "https://www.reddit.com/by_id/t3_5yxsjy.json"}, "171": {"Subreddit": "Playful_PhD", "Author": "Flat_Sixx", "Date": 1489379337, "Score": 1, "Body": "***smiles***  ... i can tell.   (((Hugs)))   In the voice on Kayne West ....\n\n** im-a-let choo finish ... but Playful is da most over qualified bar maid of alll timmme **\n\nXx", "Permalink": "https://www.reddit.com/by_id/t3_5yxsjy.json"}, "172": {"Subreddit": "PhD", "Author": "Zoombiniton", "Date": 1489421000, "Score": 5, "Body": "I don't see why it would be an issue tbh - you were offered an opportunity and you took it. Just because you'll be running a start-up doesn't mean that you're not officially employed. I doubt that it would put you any further behind, your only cost is your time.", "Permalink": "https://www.reddit.com/by_id/t3_5z4w8d.json"}, "173": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1489422063, "Score": 1, "Body": "Thanks JoNapill. I too have met some trainees from the Church Lab (some in their own entrepreneurial pursuits, some at VC firms right now) and those guys are absolute badasses. Let's take our convo back to the consulting subreddit. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "174": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1489437035, "Score": 10, "Body": "Whatever you do I'd say finish the phd first. Don't stall on that. ", "Permalink": "https://www.reddit.com/by_id/t3_5z4w8d.json"}, "175": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1489439657, "Score": 1, "Body": "This^ op", "Permalink": "https://www.reddit.com/by_id/t3_5z4w8d.json"}, "176": {"Subreddit": "PhD", "Author": "stathicus", "Date": 1489467412, "Score": 2, "Body": "My whole perspective on academia and science has changed since I started grad school. For the record, I did not go to grad school with the intent on becoming a professor, but I was open to the idea at first. Now, I want to get as far away from academia as possible. It is a corrupt and broken system. The main issues are: 1. Too much emphasis on publication count/impact factor, little to no emphasis on being good advisor/mentor/teacher or doing work for the public good. 2. Lack of oversight and entirely too much trust that members will adhere to ethics and integrity. 3. Exploits cheap, highly skilled labor (i.e adjuncts, post-docs, etc.) 4. Too self-centered in the sense that academia seems only good at preparing people for jobs in academia, which there are very few of. \n\nScience suffers as a result of this. PIs choose to investigate less interesting questions because they know they can publish the results quickly and easily. Because there are so many perverse incentives and pretty much no one checking your work, irreproducible findings are a big issue. Some studies on the matter claim that 75+% of papers published in certain fields are irreproducible. Academia isn't the sole cause of these issues, funding is also. Projects that have a clear return in a reasonable amount of time tend to get funding which means projects that might be worthwhile researching but may take many years or don't have a clear return don't get funded. Also, no one gets funding to reproduce other people's work. \n\nI've experienced all of this and more first hand in grad school, including watching another student in my department get outed for publishing fabricated data. ", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "177": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1489537468, "Score": 1, "Body": "What kind of school do you attend? ", "Permalink": "https://www.reddit.com/by_id/t3_5zfdf9.json"}, "178": {"Subreddit": "PhD", "Author": "NucksRuleAll", "Date": 1489582000, "Score": 2, "Body": "Once you are in grad school, what you learn is much more dependent on you than on your school or professors. Whether you are ready for a phd or not is almost entirely up to how much effort you have put in to learn the necessary material. It can be frustrating having easy classes or unhelpful professors, I'm sorry to hear that. But the expectation is that you are learning independently by now. That being said, everyone has gaps in their knowledge, I wouldn't let that worry you.", "Permalink": "https://www.reddit.com/by_id/t3_5zfdf9.json"}, "179": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489616518, "Score": 7, "Body": "Just curious, what is your intended career path/ degree usage?  It seems like with your Master's in Education, a PhD in a science would be much stronger than in Science Education.\n\nI'm not familiar with Science Education, but in general, a PhD is a research-publishing degree, so to see what research is active where, you look up the journals and conference proceedings for your subject, read recent papers, and when you see papers you like, you look up where the authors are located.  To find out about funding, you try to strike up a conversation with these authors about this great paper, figure out if the project is ongoing, express interest in it, and see what they recommend.", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "180": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1489619038, "Score": 1, "Body": "Those calves!!!", "Permalink": "https://www.reddit.com/by_id/t3_5zlf0q.json"}, "181": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1489626448, "Score": 3, "Body": "yeah, to piggyback on this, STEM is extremely well funded, compared to other PhD disciplines (with the exception of business, which has excellent funding).  \n  \nSo if funding is a major concern, a science PhD (that is, you work with people in a science department) will alleviate that concern", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "182": {"Subreddit": "PhD", "Author": "Bramenstein", "Date": 1489626453, "Score": 1, "Body": "I wanted to get a career as.a professor teaching future science teachers how to teach and earn their certifications ", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "183": {"Subreddit": "PhD", "Author": "Danteal56", "Date": 1489633523, "Score": 2, "Body": "Here at North Dakota State University there is a decent science education lab, were u would get a science education phd. Pm if u need/want more details! If accepted you would get a completeli liveable salary as a ta. ", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "184": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1489655408, "Score": 1, "Body": "Ha- you sound like my climbing instructor!", "Permalink": "https://www.reddit.com/by_id/t3_5zlf0q.json"}, "185": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489661082, "Score": 3, "Body": "And you checked the CVs of recent hires in Science Education labs at universities, and this is the degree that newest professors have?  \n\nI'm just asking because sometimes it's not obvious which degree will actually result in a professorship in a discipline.  Psychology, linguistics, physics, and chemistry all grant PhD's of their own, but probability of getting hired in these departments is [anecdotally] higher for computer science PhD's who can apply their knowledge to psychology, etc, research.  I would hate for you to get enticed into a degree program that won't get you where you want to go.  \n\nAdditionally, many science PhD's have the option of second careers as relatively well-paid Data Scientists if a professorship doesn't materialize.", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "186": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489661673, "Score": 1, "Body": "I've taken a number of couple-year breaks in my career to pursue other projects like this, and returning to my science career has never been a problem for me at all, but with one caveat.  I love my science career very much; I just love my other projects too.  I feel like potential supervisors can see that love I have, and they know that I didn't take breaks because I'm looking for an excuse to leave; they know they can rely on me to be committed to and enthusiastic about my job.\n\nAlso, to stay competitive, I never stop publishing, even when I'm working at something else at the time.", "Permalink": "https://www.reddit.com/by_id/t3_5z4w8d.json"}, "187": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489663796, "Score": 1, "Body": "Academia is an economic marketplace like any other.  \"Ideas\" are produced as cheaply/quickly as possible, and sold in exchange for publications, grants, and collaborations.  Very little research contains any content that the general public, if they understood the background, would consider useful, let alone impressive or smart.  The academic marketplace doesn't pay well for impressive water-tight ideas; it pays for volume (often low quality) that is currently in demand. (\"And here with us today is Dr. XYZ who is an expert on topic T with 22 publications on aspects of T in the last 4 years, including 7 papers in famous journal J and 3 papers in famous journal K.\"  Some of those publications were written by Dr. XYZ's grad students; others have no new content or data; many have unreplicatable results.)\n\nHumanity is capable of great things, and great ideas, theories, and inventions are part of this.  But please don't confuse this with academia.  I don't think they have any more connection than great ideas and humanitarian work in industry or government or elsewhere.\n\nPS- For many fields, there's no need to be affiliated or physically present at a university to keep up.  Just read the research papers from that field online.  Many are free.  ", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "188": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489664686, "Score": 1, "Body": "Well, without specifying my field, I'd say it depends on your field and which tools you need for research.  If you need access to a particle accelerator, then you should be collaborating with colleagues who have access to such tools.\n\nSometimes folks get an idea that you need academic affiliation to publish, but of course this isn't true.  You just may have to pay travel costs yourself.", "Permalink": "https://www.reddit.com/by_id/t3_5z4w8d.json"}, "189": {"Subreddit": "PhD", "Author": "Bramenstein", "Date": 1489687805, "Score": 1, "Body": "Any information would be greatly appreciated. Thank you so much for taking the time to help. ", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "190": {"Subreddit": "PhD", "Author": "Bramenstein", "Date": 1489687926, "Score": 1, "Body": "I'll certainly have to look into that. I know how much work and money earning a degree is and I would hate for it to be a wasted effort. ", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "191": {"Subreddit": "PhD", "Author": "N140067", "Date": 1489689248, "Score": 3, "Body": "I'm not really good with words, so, stay strong and stay positive! You will figure it out one way or another. ", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "192": {"Subreddit": "PhD", "Author": "Danteal56", "Date": 1489693583, "Score": 1, "Body": "There are two schools (all in the same unversity) that offer something that you might be interested, one is this: [School of education](https://www.ndsu.edu/education/education_doctoral_programs/)\n\nand the other one is this: [STEM PhD EDucation]( https://www.ndsu.edu/csme/stem_education_graduate_programs/graduate_programs/)\n\ngive a read to the websites and see if you might be interested!\n\ngood luck!", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "193": {"Subreddit": "PhD", "Author": "procarastinizer", "Date": 1489712052, "Score": 3, "Body": "You a scientist, you will find a way out. Once things become well, you will think of this ordeal as a pivotal part of your education, not just because of your PhD. Stay strong brother !", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "194": {"Subreddit": "PhD", "Author": "Bramenstein", "Date": 1489714544, "Score": 1, "Body": "Thank you. I'll look at this ASAP! ", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "195": {"Subreddit": "PhD", "Author": "mbathrowed", "Date": 1489724517, "Score": 1, "Body": "Where are you getting your MBA from? I'm also considering a PhD post-MBA.", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "196": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1489728238, "Score": 6, "Body": "Submit it, then unpack all the hurt after. Finish the race and then nurse the wounds. ", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "197": {"Subreddit": "PhD", "Author": "gabegm", "Date": 1489738604, "Score": 2, "Body": "I know this won't be an easy thing to do but focus on submitting in this last week and look to making things right after. I wish you the very best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "198": {"Subreddit": "WitchPhD", "Author": "Randy_youngman", "Date": 1489752596, "Score": 1, "Body": "Your boobs are immense. ", "Permalink": "https://www.reddit.com/by_id/t3_5nmd95.json"}, "199": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1489761638, "Score": 1, "Body": "Seriously!", "Permalink": "https://www.reddit.com/by_id/t3_5zlf0q.json"}, "200": {"Subreddit": "PhD", "Author": "Enzohere", "Date": 1489762069, "Score": 1, "Body": "University of Houston. Its a good school, but I really wouldn't recommend it for online classes. ", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "201": {"Subreddit": "WitchPhD", "Author": "thedude0121", "Date": 1489764939, "Score": 1, "Body": "Wow so hottttttt ", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "202": {"Subreddit": "WitchPhD", "Author": "Whatifisaid-", "Date": 1489765407, "Score": 1, "Body": "Really nice shot! :)", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "203": {"Subreddit": "PhD", "Author": "mbathrowed", "Date": 1489767119, "Score": 1, "Body": "I see. Hold it dine from a fellow Houstonian!", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "204": {"Subreddit": "WitchPhD", "Author": "gerchoc44", "Date": 1489767558, "Score": 1, "Body": "I like!", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "205": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1489773633, "Score": 2, "Body": "At my university, you would be doing research into science education and something science based while teaching the science thing to undergrads with a very small seminar run for profs and lecturers over the summer. Unless you plan on going out on your own as a consultant, I don't see a university hiring you for what you want, full time. In case my explanation is convoluted, here's an example of a prof at my university. He's a synthetic chemist and teaches that in first and second year and runs a group in this. He also has a few students working on chemistry education and does his own research there. He runs two seminars a year on chemistry education which are mandatory for sessionals and optional for everyone else.", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "206": {"Subreddit": "WitchPhD", "Author": "skip_hunter", "Date": 1489792847, "Score": 1, "Body": "So classic. ", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "207": {"Subreddit": "WitchPhD", "Author": "Jcfallen09", "Date": 1489795268, "Score": 1, "Body": "Absolute perfection 😍 loving the upgrade in production!", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "208": {"Subreddit": "WitchPhD", "Author": "imembarrassedwithme", "Date": 1489805772, "Score": 2, "Body": "You never disappoint :)", "Permalink": "https://www.reddit.com/by_id/t3_5zy1r0.json"}, "209": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1489806192, "Score": 6, "Body": "In grad school I went to a panel that the university sponsored on biotech startups following you're PhD. They toured it as, \"these successful people had a great idea and a go-getter attitude and now they're millionaires!\" The first half of the panel was very interesting and motivating. Yes, they struggled through their phds. They saw something that was marketable, spin it off into a startup, ran it for 3-4 years until it was bought up by Fisher or Qiagen or whoever. They used that giant chunk of cash to start another small company, rinse and repeat.  \nThen at the start of the second half of the day, someone had to ask, \"but how did you get started that very first time, when you were just finishing up your PhD? Where did you get the equipment and reagents? How did you pay your accountants and lawyers?\"  \nEach of the panelists (there were 5 of them) said some version of the same thing. Ask your family for a few hundred thousand dollars to get going. And this would have been 20-30 years ago. All of them came from money in the first place.  Every. Fucking. One. \nI would love to hear of some young upstart who managed to bootstrap themselves into becoming the CEO of a biotech startup at some point in recent history, but I've never hear of anyone doing so without a massive influx of cash at the start from a blood relation.\nSorry to be a downer. If someone has an anecdote to counter this, I'm all ears.", "Permalink": "https://www.reddit.com/by_id/t3_5zzxgy.json"}, "210": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1489808940, "Score": 5, "Body": "Some thoughts:\n\n- As another commenter said, if you are already rich to start with, that's basically easy mode. \n- You can get initial capital from startup accelerators, venture capitalists, angel investors... But make sure you know some basics about starting and scaling a business. \n- You could provide services to an existing business (e.g., B2B consulting) and get some insight to how they run while also building up your own cash reserves \n\n\nPlease do remember that starting a business does not equal big bucks. Most people fail because they either have no idea what they are doing, or just get unlucky, or have very strong competitors. \n\nSource: started several businesses, have been VC funded, also have lots of friends who are in startups or are founders. ", "Permalink": "https://www.reddit.com/by_id/t3_5zzxgy.json"}, "211": {"Subreddit": "PhD", "Author": "Bramenstein", "Date": 1489809392, "Score": 1, "Body": "Well, I don't know if it's different for other states, but in NY there are professors that exclusively teach classes on science education. They are full-time teachers and anyone that becomes a certified teacher at the K-12 level has to take these types of education courses", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "212": {"Subreddit": "PhD", "Author": "Tuglyfe", "Date": 1489857533, "Score": 2, "Body": "I'm a third year PhD student hoping to graduate by the end of this year. I started my own B2C company (a web platform) in my first year of my PhD and ran the company for 2 years with less than $1000 to start. \n\nYou aren't going to benefit from your PhD when you're running a startup-- other than the fact that people/investors think you might be a bit smarter than the average bloke that pursues entrepreneurship. Anyways, I ran the company for two years and after expanding it across Canada, decided to shut it down because revenues were behind my milestones. \n\nWas it a failure? I definitely don't think so.\n\nYes, we did end up going down, but in the process I've learned how to start a company, manage people and figure out how to get things accomplished with little to no money (this was the hardest part... But most enjoyable for me). I'm now refocusing on my PhD to get it done by the end of the year (Academia is sooooooo slow), but once I'm done, I plan to go full force into another startup. \n\nAnother positive is that I now use my startup experience to consult with other companies in their marketing/data analytics/business model problems. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5zzxgy.json"}, "213": {"Subreddit": "PhD", "Author": "Tuglyfe", "Date": 1489857707, "Score": 1, "Body": "Don't give up! Start planning your life week to week, look at it from a smaller time scale. You'll only hurt yourself more if you think of the \"what if\" situations. You're at rock bottom now.. So the only way is up! Good luck to you!", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "214": {"Subreddit": "PhD", "Author": "Tuglyfe", "Date": 1489857923, "Score": 1, "Body": "p-hacking :(", "Permalink": "https://www.reddit.com/by_id/t3_5yg5gw.json"}, "215": {"Subreddit": "PhD", "Author": "ReddRepublic", "Date": 1489861155, "Score": 3, "Body": "I use Mendeley but not the Word plugin (TeX FTW). I am assuming you make your manual edits inside the Mendeley interface, right? If you edit them in Word, it seems only logical that Mendeley would overwrite them with what it has in its database.", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "216": {"Subreddit": "PhD", "Author": "jammycarrot", "Date": 1489861947, "Score": 2, "Body": "I've attempted editting the database too, but it still does it. There appears to be no rhyme or reason as to whether I get (Smith et al. 2012), (G.Smith et al. 2013) or Graeme W. Smith et al. 2014), depending on the paper, when all are written as G.Smith in my database...", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "217": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1489865471, "Score": 1, "Body": "Submit it, tell that to your professors in the note section.\n\nIt does not have to be perfect man. And maybe later you can REVIEW your work.\n\nAnd good luck. You are lucky your leaving PhD, some new victims are just about to get in! ;D", "Permalink": "https://www.reddit.com/by_id/t3_5zrscn.json"}, "218": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1489873159, "Score": 3, "Body": "I have the exact same problem, so following in the hopes that someone else has solved it! ", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "219": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1489875103, "Score": 1, "Body": "I use the CSL editor; in there you can set up a different style or edit a style.", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "220": {"Subreddit": "PhD", "Author": "peeteep", "Date": 1489888218, "Score": 2, "Body": "What I have resolved to doing is just add all the references during writing, then update everything manually to be correct (inside Mendeley) just prior to submission. Things seem to keep duplicating and changing randomly otherwise..", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "221": {"Subreddit": "PhD", "Author": "jammycarrot", "Date": 1489917963, "Score": 1, "Body": "I've tried that, using it to attempt to get the short name (so no initials) and remove the et al. limit down from 6 to 3. But whilst it downloads to the desktop and then word, it automatically resyncs to the old one again. ", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "222": {"Subreddit": "PhD", "Author": "jammycarrot", "Date": 1489918031, "Score": 1, "Body": "I fear this may be what I have to do. I've found that creating the bibliography seems to reset some of them, so make sure you've got that done first before editing! ", "Permalink": "https://www.reddit.com/by_id/t3_605ewm.json"}, "223": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489966355, "Score": 7, "Body": "It totally depends on your business plan for your career, but publishing is a critical component of my industrial career.  The whole point of the PhD is people hire me to be the expert on a topic.  How do I prove I'm expert and up-to-date?  I have recent good publications.\n\nBe careful of basing your career decisions on job adverts.  IMHE, jobs that make it to the advert stage are some of the least appealing jobs out there; that's why they needed to advertise them.  I've ended up with much better projects when I'm at a conference and chatting to people and they know me and my strengths and we come up with a project idea.  Or when I have an idea and I approach the people I need to make it happen.", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "224": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1489968682, "Score": 4, "Body": "PhD's get stale.  Who wants to hire someone that was an expert 15 years ago and hasn't done much with the topic since?  I think of it as, the PhD was the original certification, and papers are the renewals.\n\nThere's a huge range of conferences, and yes, many are low-quality.  I'm very careful which conferences I bother with, but it generally aligns with the same pattern as an aspiring professor: top conferences in my field, plus specialist workshops in my specific research subarea, plus specialist workshops/conferences in specialties I have reason to want to meet more people.  \n\nVery few of my conferences are within a 3 hr drive; most are on different continents.  Some I pay for myself.  For me, I consider it a critical part of my career; I wouldn't be a researcher if I didn't regularly interact with my research communities.", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "225": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1489970774, "Score": 0, "Body": "For the sake of bringing new knowledge to the world maybe? ", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "226": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1489973373, "Score": 17, "Body": "When funding became the priority, rather than the science.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "227": {"Subreddit": "PhD", "Author": "ZeMeest", "Date": 1489973833, "Score": 9, "Body": "Seeing P.I.s hoard funding into their 70s, making it impossible for new blood to come in. ", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "228": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1489974156, "Score": 3, "Body": "Not all PhDs are created equal, the ones with more publications tend to be thought of as more serious.", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "229": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1489982312, "Score": 2, "Body": "I don't know about the publications for industry jobs but I would suggest that the conferences would be a good idea for networking. If you're going into industry this is very important. To make your supervisor happy you could publish conference papers to satisfy both criteria with a little less writing. ", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "230": {"Subreddit": "PhD", "Author": "Beryllia", "Date": 1489995782, "Score": 13, "Body": "Seeing someone incompetent get hired and have their contract continually renewed as a result of nepotism.  ", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "231": {"Subreddit": "PhD", "Author": "Beryllia", "Date": 1489996385, "Score": 4, "Body": "I think attending and presenting at conferences is something you should be doing.  Not only for networking but for the public speaking experience (which will always be beneficial no matter what field you're in).\n\nI'm intending on leaving my field after I graduate this year so right now I'm disinterested in publishing.  I think it's good to have at least 1 on your CV.  I've heard that some people outside of academia find it impressive if you've been published.  However, I've also been told that industry (I'm in science) doesn't care about publications.  I guess it depends on who you're speaking to and under what context.", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "232": {"Subreddit": "PhD", "Author": "FutureDrHou", "Date": 1490002403, "Score": 5, "Body": "I came here to say this.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "233": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490020221, "Score": 7, "Body": "Get everything in writing first. The main way I do this is to send a summary of meetings to my supervisors after we finish the meeting. It's basically \"these are the things I am going to do and the priority I'm going to give them. If you have any issues with this then let me know\". Then if I don't hear from them I assume that we agree on what was said in the meeting. Then if you get told something different the next week you can say \"sorry but I thought you wanted me to do it like this because last week you said x. Is that not what you meant? I'm not certain I understand what you want.\" if they blow up about that then there's an issue.", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "234": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1490023332, "Score": 1, "Body": "I did consider this but thought it might look a bit petty? So far I've been thinking \"well this is frustrating but no point being pedantic, I have to do it this way now so let's just get on with it\". But maybe it's a good idea. It's actually happening with every meeting now, it's ridiculous (or maybe it's just what happens and I'm being too sensitive).", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "235": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490023884, "Score": 2, "Body": "I don't think it's petty unless you are setting out to be petty and then it'll come across that way. If you're approaching it from a mindset of \"I am really not understanding the directive each meeting and this is wasting a lot of time for both of us\" then it should be fine.", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "236": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1490028403, "Score": 2, "Body": "Everyone has struggle stories on the way to Ph.D.  Your supervisor holds the keys.  Without more specific detail, this kind of seems like the process.  It's frustrating to everyone that goes through it.  I knew this going in so I picked my chair as best I could, but even then there was struggle like you describe.  So I then just worked through all the commentary.  I even had to switch my topic early on.  Fine, I did, previous work gone... just went in with as little defensiveness as I could (and that can be frustrating, see: me starting over).  But I also finished.  Keep your relationship as good as you can, and just try and respond back to each request as best as possible.  That's how you get through it.", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "237": {"Subreddit": "PhD", "Author": "Beryllia", "Date": 1490037797, "Score": 1, "Body": "I think what you're experiencing is normal and just dependent on who your advisor is and how they choose to advise their students.\n\nIf I need my advisor to edit something, I know I'm going to be going back and forth with her.  She says to make certain changes, I do them, then she doesn't like them so I change it again, and then she changes it back to what it originally was.  Very frustrating but you're just stuck going along with it.\n\nTry not to have it demoralize you or make you feel useless.  It's not you but your advisor, and you can't change them.  Be confident in your abilities and know that you do good work.  The opinion of one person does not speak for the actual quality of your work.", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "238": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1490045348, "Score": 1, "Body": "Calm down and email your supervisor. ", "Permalink": "https://www.reddit.com/by_id/t3_60j300.json"}, "239": {"Subreddit": "PhD", "Author": "PM_me_your_goals_", "Date": 1490054593, "Score": 2, "Body": "It should be fine, just send him a brief email. It's been a couple of months so it's not as if you're repeatedly pestering him about it.", "Permalink": "https://www.reddit.com/by_id/t3_60hug9.json"}, "240": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1490057003, "Score": 3, "Body": "What do your subjects normally earn per hour? If it's $40 or more, then $10 for a 15 minute survey isn't overkill. I would use their typical salary to calibrate the compensation.", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "241": {"Subreddit": "PhD", "Author": "culturecouture", "Date": 1490067978, "Score": 7, "Body": "I think a $5 gift card is fine, especially if they know you are a student.  I am way more open to giving my time cheaply to students, but not to companies that are making a profit from it. ", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "242": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1490082939, "Score": 2, "Body": "Simply nothing. They should enjoy spending 15 minutes of their time to help science. Voluntarism is great.", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "243": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1490117340, "Score": 2, "Body": "Perhaps a \"be entered for a drawing to win a $x gift card\", that way you don't have to give it to all of them", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "244": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490129514, "Score": 1, "Body": "Not a single answer! Thanks a lot, peeps.", "Permalink": "https://www.reddit.com/by_id/t3_6060yb.json"}, "245": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1490137455, "Score": 1, "Body": "Would you come to my lab and mix chemicals for me for 15 minutes? I doubt it", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "246": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1490137532, "Score": 2, "Body": "I really dislike this, \"spend your time helping me and I MIGHT give you something for it\". Whenever I see these I just pass them by. A free coffee somewhere and hell yeah i'll do it", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "247": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1490138080, "Score": 1, "Body": "When you don't have a lot of funding and are a broke grad student, sometimes you have to make do", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "248": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1490138476, "Score": 1, "Body": "I don't have a lot of funding and am a broke grad student, so I'm not going to work for free", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "249": {"Subreddit": "PhD", "Author": "TheKeenMind", "Date": 1490145323, "Score": 1, "Body": "Thanks for this by the way. Your perspective helped swing my decision, and I've accepted a position at a bio-inspired robotics REU.", "Permalink": "https://www.reddit.com/by_id/t3_5xjdfh.json"}, "250": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1490178144, "Score": 1, "Body": "Hi there! Currently deciding on a school for Science Education PhD, Wisconsin, Maryland or Penn State.\n\nYes, there's funding out there, each school is going to have courses for undergraduates seeking teacher certification, however, a lot of these TA positions go to people with classroom teaching experience, which you might have just didn't mention.  \n\nAs for choosing a school, go through the literature and find people who are doing what you want to study, and choose a school based on that.  Is it equity, argumentation, pre service teaching, elementary, college? Each professor is going to have a focus, and you want to make sure you fit.", "Permalink": "https://www.reddit.com/by_id/t3_5zm49v.json"}, "251": {"Subreddit": "PhD", "Author": "jhpy1024", "Date": 1490180698, "Score": 4, "Body": "Because you should have started studying shit earlier... do you expect some miracle answer?", "Permalink": "https://www.reddit.com/by_id/t3_6060yb.json"}, "252": {"Subreddit": "PhD", "Author": "ursath", "Date": 1490185983, "Score": 8, "Body": "Funding &gt; No funding. \n\nIt is very unlikely that you can delay your decision to accept. The funding body needs to know as soon as possible so that in the case of your rejection, they can offer the funding to the next person on the waiting list.   \n\nWho knows what good will come from going to your second-choice uni. Yes, the research environment matters but what matters more than anything is that you have enough money to support yourself. If you struggle from day one, you may wish that you had taken the fully funded option after all.\n\nIn my experience, those that are hell-bent on their one university of choice would defer entry and earn money for a year and re-apply for the next academic year. I personally was in exactly the same position as you and went for the fully-funded position. I have never regretted it.", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "253": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1490190917, "Score": 2, "Body": "Thank you, that makes me feel better and less useless :)", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "254": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1490191093, "Score": 1, "Body": "Thank you, exactly what I needed to hear.", "Permalink": "https://www.reddit.com/by_id/t3_60glik.json"}, "255": {"Subreddit": "PhD", "Author": "natura_simplex_", "Date": 1490196666, "Score": 5, "Body": "It isn't a thing to accept both offers. You'd burn the bridges with faculty at the school you reject if you first accept their offer. \n\nWorrying about funding can negatively impact your research. Depending why school 2 is the second choice, taking guaranteed funding is the best choice.", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "256": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490207859, "Score": 1, "Body": "You should never trust a person that does not know the difference between studying &amp; reviewing.\nAnyways, studying is for what you have not learned.\nreviewing is for what you already learned.\nNow you know that, good luck with life as it seems you dunno what people are faced with https://www.youtube.com/playlist?list=PL8OqEjU_6N9WlldgYR1j9jQM7ZeGqC411", "Permalink": "https://www.reddit.com/by_id/t3_6060yb.json"}, "257": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490208045, "Score": 1, "Body": "http://faculty.cse.tamu.edu/walker/Quals/GRE_CompSci_PracticeBook.pdf", "Permalink": "https://www.reddit.com/by_id/t3_6060yb.json"}, "258": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490208083, "Score": 1, "Body": "See the stats, brainiac!", "Permalink": "https://www.reddit.com/by_id/t3_6060yb.json"}, "259": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1490211401, "Score": 6, "Body": "Don't accept two offers, that's just asking for trouble.\n  \n  Also agree that funding &gt; no funding.  \nMaybe talk to school 1 and explain you have a funded offer and they're your first choice so if they can give funding then you'll go there.\n", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "260": {"Subreddit": "PhD", "Author": "thermos26", "Date": 1490219866, "Score": 5, "Body": "I was in the exact same position as you (although I had switched my first and second picks a few time) and picked the fully funded one. I definitely think I made the correct choice.", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "261": {"Subreddit": "PhD", "Author": "ZeMeest", "Date": 1490220647, "Score": 4, "Body": "Screw university #1 if they don't fund their students for their years of free labor.  Seriously, don't go into too much debt for grad school.  Maybe do your post doc at university #1 later, surely they will pay you for that.", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "262": {"Subreddit": "PhD", "Author": "iwantaTruCutreel", "Date": 1490226635, "Score": 1, "Body": "Lol, I think he means the other way around (i.e. OP must make due with what is available.) I too, dislike the drawing because I think it comes across as a disingenuous bait. While it sucks not being able to compensate participants in some way, but I'd rather just make a case for the needs of the research than do a drawing. Of course, I know that's not always going to work.\n", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "263": {"Subreddit": "PhD", "Author": "johchem-phd", "Date": 1490230780, "Score": 1, "Body": "Classic trolling by you two. Am I the only one that noticed the person asking the question asked for feedback from members only. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "264": {"Subreddit": "PhD", "Author": "johchem-phd", "Date": 1490234640, "Score": 1, "Body": "Wow, an actual human being who used his real name and is indeed on linked in. Thank you Nick. I'll be checking out your profile and reaching out. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "265": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1490234781, "Score": 4, "Body": "I'd contact school #1 and tell them that you have two offers in hand, one funded, and that you're trying to make a good academic and financial decision. If they won't fund you, I wouldn't even bother with them. ", "Permalink": "https://www.reddit.com/by_id/t3_60ttix.json"}, "266": {"Subreddit": "PhD", "Author": "Subcutaneous_Beauty", "Date": 1490262218, "Score": 11, "Body": "I had to force myself to be around people and that made me feel more social, which made me less sad. I also took up knitting, which made a huge difference in how I felt because I was being creative. Find something that  allows you to NOT apply your school knowledge to give your mind a way to reset and rest.", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "267": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490276194, "Score": 5, "Body": "In addition to this, speak to a counsellor or doctor. Normally you can solve burnout yourself but if you're at a point where youre wanting to sleep all the time and you're not eating then you need some professional help to get healthy again.", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "268": {"Subreddit": "PhD", "Author": "doctorofnilosophy", "Date": 1490276457, "Score": 5, "Body": "I second the social effort...force yourself to do non-PhD things with either non-PhD people, or with PhD people who are able to disconnect from anything program-related to enjoy the company and activity (dinner, movie, hike, game night, etc.) at hand. If the social event evolves into a bitch-fest about academic life, that's fine--so long as it's letting you connect with people on that more emotional/not career-specific level, if that make sense? This might also be a good time to consider finding yourself a therapist to talk to and help you figure out what you want next--from your program, life, etc. Finding a clinician who had a PhD (as opposed to a MSW or a PsyD) was a great way for me to discuss a lot of the challenges and isolation you're describing (which is associated with many/most peoples' doctoral pursuits) with someone who had been through the process but wasn't necessarily invested in academia or my own academic progress (like my advisor). For me (and a handful of others in my program who also decided to seek out a therapist during grad school), a weekly therapy appointment became like a check-in meeting with a meta-advisor who could weigh in on the pieces of my life that I wouldn't feel comfortable talking about with my advisor (like burnout, imposter syndrome symptoms, family isolation stemming from my studies) but also could appreciate the context of those experiences. 10/10 would recommend.", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "269": {"Subreddit": "PhD", "Author": "doctorofnilosophy", "Date": 1490277508, "Score": 3, "Body": "Reinforcing /u/antihero790 here... Recognize that depression rates are elevated among PhD students (and the feelings you're describing are a dead ringer for it). What you are feeling now is not your \"forever,\" nor is it a sign of your decline, or anything like that. While you may get some good tips on this thread about maintaining your mental health, you need to readjust your perspective before you can get to maintenance; a professional will help you get back on track much more expediently/adeptly than any of us on Reddit can! ", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "270": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1490282722, "Score": 13, "Body": "Student: I emailed it to you, you didn't get it? \n\nMe: Nope, but just show it to me in your sent mail folder and it'll be fine. \n\n*Crickets*", "Permalink": "https://www.reddit.com/by_id/t3_6126j8.json"}, "271": {"Subreddit": "PhD", "Author": "Elemnts21", "Date": 1490292569, "Score": 1, "Body": "Thanks for the details Rugmani but if Cheeky says it will give you the strategies to get a job isn't that the same as saying it will give you a job?", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "272": {"Subreddit": "PhD", "Author": "gand-me-ungli", "Date": 1490293686, "Score": 2, "Body": "They could have worked on Google Docs and downloaded it as a doc/pdf the day of...", "Permalink": "https://www.reddit.com/by_id/t3_6126j8.json"}, "273": {"Subreddit": "PhD", "Author": "DeathStarCMDR", "Date": 1490293735, "Score": 5, "Body": "In this case the doc was actually started on one day and edited the next.  Good point though!", "Permalink": "https://www.reddit.com/by_id/t3_6126j8.json"}, "274": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1490297579, "Score": 9, "Body": "Don't go there looking to party. \n\nDo get swag. \n\nDo listen attentively. \n\nDo find quality coffee nearby, because convention center/hotel stuff usually sucks. \n\nDo network and have some sort of way to remember who you network with. A Connection is no good if you can't remember their name or phone number. ", "Permalink": "https://www.reddit.com/by_id/t3_6140yg.json"}, "275": {"Subreddit": "PhD", "Author": "Subcutaneous_Beauty", "Date": 1490305239, "Score": 1, "Body": " Very good advice. ", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "276": {"Subreddit": "PhD", "Author": "Biomedgator", "Date": 1490308103, "Score": 1, "Body": "The two statements are not the same. You can be given the strategies to successfully land a job but if you don't implement them you will not be successful. No one is going to hand you a job, you have to do the work. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "277": {"Subreddit": "PhD", "Author": "kaswing", "Date": 1490310193, "Score": 5, "Body": "I wish I had made up business cards. As cheesy and old school as they are, it's among the best ways to give you a chance of ever talking to them again! \n\nI enjoy listening to and participating in the conversation on Twitter /Slack whatever they use. Preferably if your connection to people in that venue will remain (I.e. You will still be following them once the conference is over.) \n\nThe most salient potential disappointment for me is making a meaningful social or professional connection and not having a way to maintain or strengthen it until next year, and then only maybe. \n\nHave fun!", "Permalink": "https://www.reddit.com/by_id/t3_6140yg.json"}, "278": {"Subreddit": "PhD", "Author": "aca-d-pain", "Date": 1490322406, "Score": 1, "Body": "Thanks for the detailed response Nick and for using your actual name with a link to find you. ", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "279": {"Subreddit": "PhD", "Author": "aryanoface", "Date": 1490324831, "Score": 6, "Body": "When you network, look at their lanyard / name tag and write down their name and place of work in a note in your phone. When you get home try and fin them on LinkedIn and add them so you have a way of remembering / figuring out who \"that PI from Purdue\" was 4 months later.", "Permalink": "https://www.reddit.com/by_id/t3_6140yg.json"}, "280": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1490361558, "Score": 1, "Body": "Depends on them. The most meaningful gift is the most thought out and personalized", "Permalink": "https://www.reddit.com/by_id/t3_615cim.json"}, "281": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490366525, "Score": 1, "Body": "Haha\n\nGod! Sometimes you wonder why Linux(Unix) peeps made the touch utility, but anyways! ;D\n\nhttps://en.wikipedia.org/wiki/Touch_(Unix)\n\nOne should always love their professors/students.", "Permalink": "https://www.reddit.com/by_id/t3_6126j8.json"}, "282": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490366822, "Score": 1, "Body": "Once you are accepted into a program, take a snapshot of that and send it as an attachment with \"I made it, thanks a lot, Prof.\"\n\nIf you want to offer more that is a good thing, but that will do.\n\nNote: I ain't a Prof, but just saying! ;D", "Permalink": "https://www.reddit.com/by_id/t3_615cim.json"}, "283": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490367009, "Score": 3, "Body": "What if you were just that guy that's gonna make the academic world a better place?\n\nLeave a positive trace there and you are making it better.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "284": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490367178, "Score": 2, "Body": "What? That's the norm in most 3rd world unis/schools. But sometimes it is not nepotism but those who agree with a certain doctrine or hold certain ideas.\nBut still never lose hope in making Earth a better place.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "285": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490367430, "Score": 1, "Body": "Just publish what feels/is right for you. Pick an idea of interest, expand on it until it reaches the research level.\n\nHere is an example:\n\nhttps://www.youtube.com/watch?v=njVv7J2azY8\n\nSame goes to essays &amp; articles, pick a topic of interest and go from there.\n", "Permalink": "https://www.reddit.com/by_id/t3_60d3ge.json"}, "286": {"Subreddit": "PhD", "Author": "victoryvines", "Date": 1490374010, "Score": 1, "Body": "A nice card or a photo is good, but nothing of real $$ value. I tried to get a souvenir for a LoR writer for an REU I did, but she would not accept it. She did, however, accept a photo of me holding a \"Thank you\" sign while doing field work during the REU.", "Permalink": "https://www.reddit.com/by_id/t3_615cim.json"}, "287": {"Subreddit": "PhD", "Author": "Ezra_Pound_in_Italy", "Date": 1490453252, "Score": 2, "Body": "Probably the fifth time my supervisor said to me words to the effect of \"This is just a formality, everybody hates it and knows how useless it is\" and then had me focus on nothing but that for the next fortnight.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "288": {"Subreddit": "PhD", "Author": "Patricia_Silva", "Date": 1490455142, "Score": 1, "Body": "Hi, my name is Patrícia Silva and I’ll finish my PhD in approximately one year. I’m an associate of the Cheeky Scientist Association a little more than 2 months and joined because I knew I wanted to make a career transition to industry. I had been folowing the CSA founder’s blog for a while and decided to join to have access to the networking possibility that you find in the group. The support I found there is amazing and continuous.\n\nYou pay one fee and you have a life time access to all the organized material, these are the ones that I found more valuable: 1) detailed descriptions of career options and a mean to help you take a decision of which may be the good one for you; 2) how to effectively grow your network, how to use it to your advantage and how to do it with the right mindset. Whenever someone needs help with following up with an interview/cover letter/resume/networking/interview questions, there are always other associates who will step forward for support in addition to the materials available.\n\nJust being a part of the CSA won’t secure you a job by itself, you must work on it and put in an effort to reach your goal, as everything in life! Since I joined the association, I’ve managed to design a strategy for my transition to industry and I’m taking the right steps to get where I want - networking and taking courses to improve my cv, these things take their time so it’s never too early to start!\n\nHope this helped and if you wish to know more about my opinion and experience within the CSA don’t hesitate to reach out to me on LinkedIn https://www.linkedin.com/in/patriciamariasilva/\n", "Permalink": "https://www.reddit.com/by_id/t3_5xqeuy.json"}, "289": {"Subreddit": "Playful_PhD", "Author": "LawyerDaggett", "Date": 1490465872, "Score": 1, "Body": "Would love to peel those off and go exploring", "Permalink": "https://www.reddit.com/by_id/t3_617o8z.json"}, "290": {"Subreddit": "PhD", "Author": "iwantaTruCutreel", "Date": 1490477923, "Score": 1, "Body": "Public school or private? Folks in academia are notorious for being terrible at following up on anything. I've noticed private schools are not AS bad.", "Permalink": "https://www.reddit.com/by_id/t3_61ezdh.json"}, "291": {"Subreddit": "PhD", "Author": "DeathStarCMDR", "Date": 1490478060, "Score": 3, "Body": "Private university, grad school.  They set up anew faculty oversight process.  ", "Permalink": "https://www.reddit.com/by_id/t3_61ezdh.json"}, "292": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1490479992, "Score": 1, "Body": "Also interested in this.", "Permalink": "https://www.reddit.com/by_id/t3_60uloo.json"}, "293": {"Subreddit": "PhD", "Author": "ForgottenPotato", "Date": 1490525353, "Score": 6, "Body": "in my book, you should cite x person for their method. if the later person made any changes to the method and you're​ incorporating it into your own work, then cite that person for that.", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "294": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490529773, "Score": 2, "Body": "One of my friends is in human capital consulting. She doesn't have that degree background but it'd probably work.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "295": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1490545340, "Score": 4, "Body": "I cite myself for everything. My h-index thanks me. ", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "296": {"Subreddit": "PhD", "Author": "mythaone", "Date": 1490545934, "Score": 2, "Body": "Hahhah I found that this phenomena is very frequent xD", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "297": {"Subreddit": "PhD", "Author": "kszy29", "Date": 1490551156, "Score": 1, "Body": "Thanks! Just did a bit of research, it sounds what I'd enjoy doing.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "298": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490551596, "Score": 2, "Body": "Just so you know, it doesn't require a PhD so only do that if there's something you're really interested in that you want to research for the sake of research. My friend did a double degree undergrad in psych and commerce (HR and IR majors) and then started working at a consulting company. After a few years of experience you get to being a senior consultant and then you can strike out on your own or get hired by a large company to deal with their human capital organisation. She worked for two of the \"big 4\" and interned at 3 of them during undergrad.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "299": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1490553244, "Score": 4, "Body": "Depends on his focus, I supposed. I just graduate from my PhD program in chemistry. Always wanted a nice leather attache bag to appear more professional but I think I might be too old fashion.", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "300": {"Subreddit": "PhD", "Author": "kszy29", "Date": 1490558948, "Score": 1, "Body": "That's good advice, maybe I'll look at career change possibilities (it would already encompass some of what I do now) and see if I can shift direction and wait and see if the academic desire still sticks around.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "301": {"Subreddit": "PhD", "Author": "Krutoon", "Date": 1490560673, "Score": 3, "Body": "Got my academic husband one of these for Christmas. I think many of us secretly want one. I second this :)", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "302": {"Subreddit": "PhD", "Author": "Connacht_89", "Date": 1490564533, "Score": 2, "Body": "When it starts to ruin personal life and health.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "303": {"Subreddit": "PhD", "Author": "JimmyRat", "Date": 1490573279, "Score": 3, "Body": "Get him a quality stethoscope ($100ish) and have it framed. Because he's a doctor. ", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "304": {"Subreddit": "PhD", "Author": "Connacht_89", "Date": 1490574808, "Score": 2, "Body": "Cite both.", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "305": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1490578071, "Score": 3, "Body": "That sounds really tough, I'd advise you to reach out to people for some support - friends, family, or professional help. I've had similar thoughts myself but the thing is quitting and just doing something else is far less drastic than suicide, very possible, and no one would think less of you for choosing that path. When I start to feel trapped I remember I could leave at any time and things would be ok. Also if you can have other things going on it helps you remember that there is more important things in life than grad school. ", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "306": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1490578130, "Score": 10, "Body": "Get some counselling now. Almost everyone needs therapy for anxiety and/or depression during grad school. It's hard and isolating. You need to get this now. Also, try to find a hobby that is not strenuous so you can decompress at the end of the day. I knit and crochet but it can be whatever. Exercise is important too. Even if you just force yourself to walk for half an hour a day in the evenings.", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "307": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1490585858, "Score": 2, "Body": "I mean ultimately you're not obliged to finish a PhD if you find it's really not your thing, and there must be a reason you wanted to do it in the first place? No one is better equipped to decide what you should do than you, perhaps you'll find your passion during that first year, or maybe you'll decide it's not for you and go back to being a clinician.", "Permalink": "https://www.reddit.com/by_id/t3_61pu5n.json"}, "308": {"Subreddit": "PhD", "Author": "Krutoon", "Date": 1490588232, "Score": 3, "Body": "People leave programs all the time, and honestly I don't think it's shameful. Leave if you're unhappy, and as someone has already said, seek out some counseling. My anxiety went through the roof when I got to my program, and therapy and medication have me back to being leveled out. Nothing is worth your mental sanity and happiness. Take a break, find a new path, go talk to someone. With some distance, you'll see that this too shall pass.", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "309": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1490618620, "Score": 1, "Body": "Get some help.  Step one, no matter what call a licensed therapist.  It's important that you were able to talk about suicidal thoughts openly.   \n\nWe all live in fish bowls, sometimes that's hard to see.  Right now you are overwhelmed, but help and relief are really right around the corner.  If this isn't going to work for you, that's just the start of something else.  No doubt this can be overwhelming to the point it can break you. If you are at that point, take a deep breath, get some help, and decide what's best for you.   I wish you the best of luck and if you want someone random just to talk to I can PM my phone number to you.  I've dealt with extremely high stress and it's not easy, and if there's anything I can do to help please let me know.  ", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "310": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1490623957, "Score": 5, "Body": "I saw this on a previous thread (and while I don't have my PhD yet, I would love one of these)- a framed copy of the  first page of their first paper/or the doi URL (could be photo sized). I'd love that + a really nice bottle of whisky. ", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "311": {"Subreddit": "PhD", "Author": "lazarescu", "Date": 1490629646, "Score": 3, "Body": "I have, but not to the extent of your example as my work is qualitative and doesn't require (or offer the ability to construct) that sort of data visualusation.\n\nWhat I mean by this is that I've put \"graphic design\" at the forefront of my priorities in constructing a presentation - I went with what I saw to be current trends in web and print typography/design. \n\nIt looked great, and got a good reaction from the audience in terms of its visual appeal, but damn it took a long time to put together for 20 minutes at the lectern. And in the end you are judged on the quality of your academic material, rather than what your presentation looked like.\n\nI still am concerned about how my presentations look, just not as much. Now I tend to design one slide as a template and repeat it, perhaps swapping the colours (background, text, etc) if it looks good. Sometimes I'll use stock images if they fit in well.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_61sjrf.json"}, "312": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1490632143, "Score": 3, "Body": "I love this idea. The first page of his thesis or the first paper he had published ", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "313": {"Subreddit": "PhD", "Author": "ResearchedIt", "Date": 1490636527, "Score": 3, "Body": "Actually, unlike other academic fields, the job prospects in academia for OB PhDs are really good. If you want an academic job after graduation you can generally get one. Because of this, PhD admissions committees make an effort to filter out people who don't want careers in academia. This means you'd have to mislead people to get into a good program, which is ethically questionable.\n\nI'd also argue that a PhD wouldn't benefit you much. You might get some benefit from the first two years in which you take a lot of classes. But after that you are spending the next 3-4 years learning how to conduct and publish original academic research. That will be wasted your time and the school's resources if you want to go into industry. I spent many years in industry (mostly consulting at a big firm) before getting my PhD in OB and I would tell you not to get a PhD if you don't want to go to academia.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "314": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1490636738, "Score": 4, "Body": "Cite the original. If the citation says that X person did Y method first, find Y's paper, read around the quote and make sure it is legit. ", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "315": {"Subreddit": "PhD", "Author": "kszy29", "Date": 1490637496, "Score": 1, "Body": "Thanks, that's also good advice. If I applied, I would hope to work in academia after, I just figured it might be necessary to be open minded about career prospects like other social sciences. I was also curious about what avenues the field has an impact on industry practices and if there were niche opportunities here to work in both theory and practice. Glad I posted here - much more info than I could find in the program websites.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "316": {"Subreddit": "PhD", "Author": "ResearchedIt", "Date": 1490638012, "Score": 3, "Body": "Your question about how the field impacts industry practice is a good one. I think that is something that we in academia do some hand wringing over. Right now I'd say our impact comes mostly through teaching mbas and undergrads, publications like Harvard business review, and a handful of popularizers like Adam Grant. But I think we need to work more closely with industry. I actually came into academia because I was interested in seeing management be more evidence based. If you are interested in bringing academia and industry closer together I'd say that is a noble cause worth pursuing a PhD for, just don't write that on your applications, lol.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "317": {"Subreddit": "WitchPhD", "Author": "Jcfallen09", "Date": 1490641919, "Score": 3, "Body": "Absolutely classic and stunning! Always makes my day when you post, love the new style.", "Permalink": "https://www.reddit.com/by_id/t3_61t46i.json"}, "318": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1490651434, "Score": 2, "Body": "A job :)\n\nSeriously though, get him a trip to Vegas or something.", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "319": {"Subreddit": "WitchPhD", "Author": "thedude0121", "Date": 1490652906, "Score": 1, "Body": "So amazing so sexy so classy ", "Permalink": "https://www.reddit.com/by_id/t3_61t46i.json"}, "320": {"Subreddit": "Playful_PhD", "Author": "Flat_Sixx", "Date": 1490653097, "Score": 1, "Body": "VERY cute   😉\n\nCheers!   🍺", "Permalink": "https://www.reddit.com/by_id/t3_61v811.json"}, "321": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1490665490, "Score": 1, "Body": "I have, on the history of counseling psychology. It got an A, so I had no complaints. Just took a long time to make. ", "Permalink": "https://www.reddit.com/by_id/t3_61sjrf.json"}, "322": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1490681125, "Score": 1, "Body": "Thanks! And- hello to you!", "Permalink": "https://www.reddit.com/by_id/t3_61v811.json"}, "323": {"Subreddit": "PhD", "Author": "alezok", "Date": 1490685386, "Score": 2, "Body": "I received a beamer for my PhD, now I can't live without it!", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "324": {"Subreddit": "PhD", "Author": "MergeAndAcquire", "Date": 1490691349, "Score": 2, "Body": "If anything, I think he'd rather have me take some of the workload off him, not get him more of it :D", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "325": {"Subreddit": "PhD", "Author": "Nedyar", "Date": 1490692791, "Score": 1, "Body": "The goal of the study is the following. It is known from Kahneman &amp; Tversky's studies that humans violate the laws of classical probability theory and logic in scenarios with high levels of uncertainty. This generates decision paradoxes that cannot be taken into account in the current classical models. Recently, there has been a line of research that explores the usage of quantum probability theory in order to accommodate these paradoxes. This is the area that I am working on. By replacing classical probability in PGMs by quantum probability rules, one can obtain quantum interference effects that can disturb the final probability outcomes and simulate these decision paradoxes. The aim of this study is to precisely collect data to validate our models.", "Permalink": "https://www.reddit.com/by_id/t3_61skrd.json"}, "326": {"Subreddit": "PhD", "Author": "ElephantsAreHeavy", "Date": 1490702883, "Score": 3, "Body": "The whole publishing business.\n-You write for free for the journal that owns copyrights on your work\n-You correct for free, the work from others in these journals\n-You pay to get your research published\n-You pay extra to get colour figures in a online-only journal\n-You pay extra for open-acces, because your university/funding agency requires it\n-You pay to be able to read your own work (through university library)", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "327": {"Subreddit": "PhD", "Author": "kszy29", "Date": 1490728571, "Score": 1, "Body": "Perhaps it's better as a side project (like a leadership training MOOC for managers!) or a short research paper lol. Waiting patiently for evidenced-based everything to be the standard.\n\nNot just industry, but especially other types of large, publicly-funded orgs, too. I've spent the past 7 years in government/international organizations, and the dearth of any up-to-date knowledge, programs, systems, or training by HR on leadership, culture, talent management etc. is just plain sad. Most of what's in place are arcane rules and old-fashioned, untransparent processes that are increasingly criticized as inhumane, with some 90s style HR trends thrown in for credibility. \n\nI spent 4 months at a large company in between and was shocked at their higher quality, fair and comprehensive HR practices and communications. Until I decide, I'll keep reading HBR and doing research.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "328": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1490754012, "Score": 4, "Body": "What's wrong with writing in solitude with whiskey and self-loathing? ", "Permalink": "https://www.reddit.com/by_id/t3_61yu3n.json"}, "329": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1490795669, "Score": 2, "Body": "Check out /r/UKfrugal, and supplement your income with TA work. It's possible to manage if you're good with budgeting. A one bedroom flat with your SO outside a city centre should be possible. Prices are cheaper in the North.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "330": {"Subreddit": "PhD", "Author": "LCW16", "Date": 1490798171, "Score": 2, "Body": "Just about do-able in Edinburgh, but taking on short term extra jobs or teaching can really help ease the pressure! \n", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "331": {"Subreddit": "PhD", "Author": "WingedSorcerer", "Date": 1490798253, "Score": 2, "Body": "Most undergraduates live off way less than that, I'm currently on around 8k and I'm managing to save a little every month. This is in Glasgow and I'm renting a room in the city centre in a flat with two others (found on spareroom).\n\nI'm doing my masters right now (PhD in September!) while also working part time. Honestly it's easily doable, I'm just relatively careful with what I buy.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "332": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1490799020, "Score": 3, "Body": "A one bed flat with your SO *in* a city centre is doable even in the southeast.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "333": {"Subreddit": "PhD", "Author": "Krutoon", "Date": 1490809736, "Score": 1, "Body": "I'd love more details on your experience with Edinburgh, cost-wise. They're one of my top picks for the PhD! I start applying in the fall.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "334": {"Subreddit": "PhD", "Author": "LCW16", "Date": 1490820069, "Score": 1, "Body": "Nothing. Nothing at all. ", "Permalink": "https://www.reddit.com/by_id/t3_61yu3n.json"}, "335": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1490823880, "Score": 1, "Body": "It's tax-free, right?  I live with my SO and I'm spending less than 14k per year in a decent flat near the city centre in one of the cities you mentioned.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "336": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1490824490, "Score": 3, "Body": "&gt; EPSRC\n\nEPSRC is a UK organization and only for engineering and physical sciences; academics in other fields in the UK get funding from other UK research councils (there is a full list of them [here](http://www.rcuk.ac.uk/about/Aboutrcs/)) and from other UK or international organizations, including the EU.\n\nSpecific to the EU/Brexit question: last Autumn the Treasury issued a statement guaranteeing that EU funding which was approved before the actual exit will be underwritten by the UK gov't.  [Source](https://www.gov.uk/government/news/chancellor-philip-hammond-guarantees-eu-funding-beyond-date-uk-leaves-the-eu).  So for the moment, we're still applying for EU funding, and (at least where I work) we will continue to do so as long as we're eligible.\n\nWe don't know yet whether UK access to EU funding will be cut in the longer term, since there are other countries that participate in the EU funding programs while not being in the EU themselves.  You can see a list and description of this system [here](https://royalsociety.org/topics-policy/projects/uk-research-and-european-union/role-of-EU-in-funding-UK-research/which-countries-can-access-eu-research-funding/).  ", "Permalink": "https://www.reddit.com/by_id/t3_627fp7.json"}, "337": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1490825866, "Score": 1, "Body": "thanks for your response. Follow up questions: does this mean international students will have more funding opportunities once EU students won't be included in the eligibility anymore?\n\nAnd - this is asking for personal opinion - would this change the structure of graduate programs in the UK?", "Permalink": "https://www.reddit.com/by_id/t3_627fp7.json"}, "338": {"Subreddit": "PhD", "Author": "mentaculus", "Date": 1490827446, "Score": 21, "Body": "I can't speak for other fields, but in STEM no reputable PhD programs would charge you to attend.  For masters' it is sometimes different, but in general, when you get accepted to a decent program it comes with some kind of funding package.\n\nI would never consider doing a PhD without funding and a stipend.  A doctorate is a massive, life-consuming undertaking.  It's like if you joined the Peace Corps for a few years and had to pay for all of your travel, food and rent etc. plus an extra fee for 'tuition'.  It's only reasonable that a good program will understand this and offer you some kind of package to enable you to devote your life to your work.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "339": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1490827849, "Score": 4, "Body": "I had no publications before my phd..i had done alot of work that was pending publication or was going to be submitted. Is this a concern/gap in your cv for applying? Remember phds are a learning game, you're not supposed to know and have done everything when you apply.  Dont worry too much about publications and focus on your skills and interests! \nEdit: during my.phd ive published around 9 papers", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "340": {"Subreddit": "PhD", "Author": "InsertName78XDD", "Date": 1490828007, "Score": 2, "Body": "I had one first author publication and was writing my second one. I'd say about half of the people in my program had one (listed as an author) and a few had first authors. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "341": {"Subreddit": "PhD", "Author": "InsertName78XDD", "Date": 1490828066, "Score": 6, "Body": "I am funded. I would not attend if I had to pay for it.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "342": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1490829510, "Score": 1, "Body": "Wow congratulations, that's amazing! Did you have to face many rejections from publishers? \n\nLong story short, I suffered from mental illness during my masters without seeking help and battled through only just making it. So I feel like if I am to have any chance in applying for a phd I should probably show up with a publication to demonstrate my enthusiasm/capability. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "343": {"Subreddit": "PhD", "Author": "greenery14", "Date": 1490830041, "Score": 2, "Body": "I had no publications when I applied. I'm in my second year and I still have no journal publications, though I am working on it.", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "344": {"Subreddit": "PhD", "Author": "greenery14", "Date": 1490830115, "Score": 3, "Body": "I am self-funded; doing a law PhD. The only reason I am paying for it is because it's my dream university. I wouldn't pay for it if it were almost any other university in the world. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "345": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1490836275, "Score": 3, "Body": "I had 2 published first author papers as an undergrad applying for a PhD program. I'm in my first year now and with a little bit of luck should have a third submitted before the beginning of my second year. That said, I just got lucky with good timing and projects. I don't think having / not having papers is a reflection on anyone because that's not how science works. Sometimes it takes years to get results and sometimes it takes years to realize that you're not going to get results. The PhD is a time to learn, you're not expected to know everything already and be a publishing machine. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "346": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1490836346, "Score": 4, "Body": "The general rule of thumb is that you should never pay for a PhD... unless for whatever specific field you're looking at, that is the norm. In general, if you're paying for it, you're doing it wrong and the university wasn't interested in you in the first place. ", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "347": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1490837491, "Score": 3, "Body": "Same for business fields.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "348": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1490847811, "Score": 3, "Body": "Funded. Not a chance without it.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "349": {"Subreddit": "PhD", "Author": "LCW16", "Date": 1490855465, "Score": 2, "Body": "I've been absolutely fine living on my stipend in Edinburgh (though have recently taken on a part time job and this has helped to cover extra costs like car expenses, vet bills, etc.) You might be able to find more information on funding etc on this Edinburgh based PhD blog - http://www.blogs.hss.ed.ac.uk/pubs-and-publications/ ", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "350": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1490857882, "Score": 2, "Body": "This is not just field specific, it's country specific too.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "351": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1490861364, "Score": 2, "Body": "tbh I think its generally the norm that you would't have a publication when applying. (most of most fellow phds didnt- are only just now getting their first publications) I got lucky as I took a few years out inbeween my Mres and Phd and worked for a few years and that work later manifested into several papers during my phd + my own phd work. Yes, iv been rejected.. many many times! and you will too! So don't be disheartened by that- just take the reviewers comments, edit and resubmit elsewhere. \n\nI honestly wouldn't dwell on a publication, even is you--- had time out? Its academia and people are from all sorts of different backgrounds and walks of life. I had some hardships during my undergrad that I was able to explain when applying for my Masters, so this may come up in an interview or something (?) Additionally, if you're really keen to show you've disseminated your research you could always submit it to a conference and present it there! that way you have a conference presentation on your cv.   ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "352": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1490861880, "Score": 2, "Body": "Is it common to do extra jobs during your PhD? In my country you have to be in there 8 hours a day, so I don't see how is that possible.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "353": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1490861930, "Score": 1, "Body": "I guess this stands for most of the northern cities, but it's harder on the south.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "354": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1490861943, "Score": 2, "Body": "Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "355": {"Subreddit": "PhD", "Author": "IncompetentWaffle", "Date": 1490862827, "Score": 3, "Body": "First author as an undergrad... Will you elaborate?", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "356": {"Subreddit": "PhD", "Author": "moranr7", "Date": 1490867283, "Score": 3, "Body": "I made a grant application to my government to pay for my tuition, stipend and costs for my PhD.  I picked my project, supervisor and location.  Thankfully, got it and coming to an end now.  I would never in my life ever consider doing it self-funded.  No one such be expect to do so. ", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "357": {"Subreddit": "PhD", "Author": "greenery14", "Date": 1490870429, "Score": 1, "Body": "Apart from counselling, take a day off. Do something fun. Put your PhD to one side and do something just for yourself. This pressure is obviously unhealthy and you need to distance yourself from it to avoid being swallowed up by it. \n\nExercise also helps too. And of course, reach out to family and friends. ", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "358": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1490878996, "Score": 1, "Body": "I worked in the same lab for 3 years as an undergrad and averaged about 50 hours a week in there. I went to a state school where they only had a masters program, no PhD, so I was able to have my own projects and I put an enormous amount of work in. As I said though, I came in at a good time and there had been a lot of groundwork laid for the first paper. We had a fairly good idea as to how things would go and luckily, they more or less went how we predicted. The second paper was a bit easier because I knew what needed to be done to publish. I planned out a couple months of experiments at a time and just put the hours in to get them done. The net result was pretty great but I came in at a good time where there were lots of preliminary results to work with and joined a small lab where I didn't have to compete much with graduate students for projects and had an incredibly supportive PI. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "359": {"Subreddit": "PhD", "Author": "here_for_cooking", "Date": 1490880344, "Score": 1, "Body": "You will be fine. As long as you are outside of London and don't take any expensive trips, you going to get by in the places you mentioned.\n\nKeep in mind that visiting conferences may involve a lot of payments up front. You can easily spend 500-1000 GBP on that and not get reimbursed for months! So keep to a strict budget and research lot of sources of funding, preferably months before any conferences.\n\nBut as long as you are not renting anything London and live relatively frugally, you do not need to worry.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "360": {"Subreddit": "PhD", "Author": "here_for_cooking", "Date": 1490880763, "Score": 2, "Body": "I would be cautious with the TA work, to be honest. My supervisors told me that the sweet spot is to have taught 1 or 2 courses by the end of your PhD. Zero teaching is a slight lack of experience in academia but anything above 3 is not getting you further.\n\nAnd any second you do not spend on finishing/improving your thesis is a second wasted (according to the higher-ups in my department). I usually feel like one or two hours of teaching throw me off my work routine for the rest of the day but others may be better at coping with this. It also gets better with experience.\n\nOf course, if you love teaching or you value the extra cash high enough, do it. But you should be aware that time is the only resource that you can deliberately invest during your PhD. Some use their time to slack off, some get buffed in the gym (no joke), while some invest all of their time into research and wonder what their life has become after a few years. Choose wisely...", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "361": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1490881813, "Score": 1, "Body": "Thanks for your replies everyone!", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "362": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1490882470, "Score": 1, "Body": "Fair advice.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "363": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1490884421, "Score": 1, "Body": "Does this apply if I don't prefer to live with others? Obviously I'M not talking about a huge apartmant, rather a single room, small flat. Or what do you mean by frugally? Like eating meat once or twice in a week? Sorry for stupid questions, I really don't have any idea what does this mean for you. ", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "364": {"Subreddit": "PhD", "Author": "here_for_cooking", "Date": 1490885278, "Score": 1, "Body": "Living in a flat share is the option for most PhD students. That way, you can e.g. eat out cheaply a few times per week. Sticking to the example, if you want a single room flat all for yourself, you will probably not be able to eat out cheaply more than once a week.\n\nAll of this depends hugely on the place where you are. In some places accommodation is super cheap but you will need a car for transport (very expensive in the UK). In other places, like London, accommodation is hugely expensive but you spend almost the same amount of money on groceries as in other places. And eating out in London can be comparably cheap if you go to the right places.\n\nAll in all, look at how the average Undergrads are living at uni (minus the binge drinking) and then that will roughly be your standard of living. With 14k pounds and no supplementary income, not much more.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "365": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1490889310, "Score": 1, "Body": "In the UK there are some people who self fund a STEM PhD. Fees for this are not stupidly high (~£1k for UK students at least, when I was applying some 4-5 years ago). Generally people who do this are people who meet the requirements for doing a PhD at the institute, but the institute doesn't have money to fund them (as there were a number of other applicants who got the funding in stead or something).\n\nI know maybe 2-3 people who went down this path (or got only partial funding that covers tuition and very little else); and I'd say if you have an option to get a fully funded place go for that, as with no funding you do lose out on most of the conference travel and stuff, meaning that even if you produce a really good PhD you miss out on a lot of networking opportunities and will have more trouble getting a job afterwards. ", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "366": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490895457, "Score": 1, "Body": "Call them.", "Permalink": "https://www.reddit.com/by_id/t3_61ezdh.json"}, "367": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1490896380, "Score": 1, "Body": "How about reading this book if you haven't already done so?\n\nhttps://www.amazon.com/Effective-Study-Skills-Geraldine-Price/dp/1405840730/\n\nhttps://www.amazon.com/gp/offer-listing/1405840730/\n\nHere is an excerpt:\nhttp://i.imgur.com/ha7JxfM.png", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "368": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1490901501, "Score": 1, "Body": "I don't know.  Depending on the negotiations, maybe EU students will end up in the eligibility for funding.  I don't have a personal opinion on the graduate programs, since I'm not closely involved in any other than informally co-supervising specific projects.", "Permalink": "https://www.reddit.com/by_id/t3_627fp7.json"}, "369": {"Subreddit": "PhD", "Author": "Camel_Crush", "Date": 1490910621, "Score": 1, "Body": "Besides what has already been said, think about your future and stay positive.  I know that can be hard, but you've made it this far to your PhD program, and some day you'll have the chance to obtain a level of education that not many people have.  You have a lot to look forward to!", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "370": {"Subreddit": "PhD", "Author": "Camel_Crush", "Date": 1490911094, "Score": 1, "Body": "There's a good amount of professors in the College of Engineering at my (public) university that only have a Master's degree, however they also are certified PE's and have 20+ years of working experience.  Nonetheless, I see what you're saying", "Permalink": "https://www.reddit.com/by_id/t3_5xumqg.json"}, "371": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1490915796, "Score": 1, "Body": "I'm glad you posted here, not it'll be even easier for Profs and admissions departments to filter out bs applications!", "Permalink": "https://www.reddit.com/by_id/t3_62hfib.json"}, "372": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1490921644, "Score": 3, "Body": "I had none when I applied for the PhD. It wasn't required of candidates, and they were looking at other stuff like extra curricular activities, past experiences in the lab, other interesting values that add value to the organisation, etc. I guess they believe that having the right character is as crucial in succeeding in the PhD.", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "373": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1490931396, "Score": 1, "Body": "Note that if you're in a scenario where the \"funded\" route is way, way, way less money than even working part-time and paying tuition, it's often not an option (At least in the states).\n\nI'm not sure on your scenario, but it's unfortunate that you don't really -have- the option to pursue without \"funding\", but if you were worried about \"How would I pay for it\", it's basically a requirement (at least for every school I talked to in business).", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "374": {"Subreddit": "PhD", "Author": "Z10201Z", "Date": 1490952035, "Score": -4, "Body": "My supervisor never wrote a recommendation letter in his 30+ years of tenure.\n\nSupervisors are usually quite useless. The good professores are very rare and don't need to work directly with the students (they can work with younger colleagues). \n\nYou are a slave until you graduate, suck it up and move on. your supervisor does not give a sh*t about you and your life.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "375": {"Subreddit": "PhD", "Author": "YuePing", "Date": 1490981577, "Score": 1, "Body": "TDLR: veusz is first choice for paper/docs, and python for massive plottings.\n\nI asked this question several times. And after trying many of them (r, python, matlab, gnuplot, and excel) I finally picked my favourite: veusz!!! \n\nIt is very lightweight, intuitive, every component of your chart is an object, so you can easily do some sort of stuff like copy and and paste, and if you are one of those that prefer scripting it also allows you to get/edit the script of your chart. What I like most is that it is super easy to load data, and format them the proper way you want.\n\nMy second favourite is python with matplot and scipy. But I use it only when I have to generate large amounts of charts when I am debugging my results. For paper/thesis where the \"beauty\" of your plotting is greatly appreciated, I always use veusz.", "Permalink": "https://www.reddit.com/by_id/t3_5xjf3t.json"}}