{"0": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": "1435758415", "Score": 2, "Body": "To be honest, no. My grant is comfortable though, 1900€/month. I rent alone, rent is 700€ + 100€ for utilities. Of course as I understand it life is cheaper in mainland Europe (Belgium in my case) than the UK. It's very strange that they refuse even though your wife/SO is employed...", "Permalink": "https://www.reddit.com/by_id/t3_3bqe7i.json"}, "1": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": "1435763785", "Score": 1, "Body": "I must admit that I could imagine having similar problems where I live. I rented my place when I was on a full-time contract, so my landlady doesn't even know I'm back to uni, but she nearly didn't let my flatmate move in because he only had a 3 moths contract.\n\nMy grant is 1200€/month and contracts are yearly, therefore I'm pretty safe and can also convey that to whomever it may concern. With £9000/year (I suppose?) I can imagine land owners being sceptic, but with you wife having \"a real job\" (I like how you put that) there shouldn't be any issue. Could be a typical young couple discrimination issue of them assuming your wife will be pregnant in a month leaving you to pay the bills. If you say \"Yes, I work 60 hours a week and have a monthly income\" you're not even lying.", "Permalink": "https://www.reddit.com/by_id/t3_3bqe7i.json"}, "2": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": "1435763895", "Score": 1, "Body": "Well bugger off of this subreddit, I'd say. Just kidding, congrats!", "Permalink": "https://www.reddit.com/by_id/t3_38yi4x.json"}, "3": {"Subreddit": "PhD", "Author": "daithibowzy", "Date": "1435774014", "Score": 1, "Body": "Just finished this. A fantastic and handy read. I'm just back from a music festival, so this helped with the recovery. :)", "Permalink": "https://www.reddit.com/by_id/t3_33p6b1.json"}, "4": {"Subreddit": "PhD", "Author": "daithibowzy", "Date": "1435782884", "Score": 2, "Body": "Tell them you work for the university as a PhD researcher. That's what I do for any occupational questions. You could even say doctoral researcher, which sounds even fancier.\n", "Permalink": "https://www.reddit.com/by_id/t3_3bqe7i.json"}, "5": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": "1435823560", "Score": 1, "Body": "What's your field of study? You don't want vague or general answers so that might be a good idea to be more precise :)\n\nI'm doing a dissertation in computational linguistics so my \"theory as thread\" thingy was two-fold. First of all, there was the real linguistics part in which I described the main theories, then adapted the theories into the existing computational paradigms. That is to say, for example, that in natural language processing, there are two main paradigms and that in one of them, linguistics are in no use at all -- the machine doesn't know grammar, doesn't car whether we're dealing with nouns, verbs, etc. This was my main \"point\" so I tried to weave that into my research question. When I described my research question(s), and the methods that I'll have to use, the theoretical background was that I'd have to be dealing with those facts. Of course, I also described the main hot debates between the different methods, which was better for what kind of scenario, etc.", "Permalink": "https://www.reddit.com/by_id/t3_3bu5sz.json"}, "6": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": "1435840956", "Score": 1, "Body": "Education administration. \n\nBut your answer is helpful. Thank you for taking the time. I think I was thinking of theory and theoretical perspective as just sections. You know, write them, use them as setup, then done. \n\nI'm open to more examples and description. Anyone else? ", "Permalink": "https://www.reddit.com/by_id/t3_3bu5sz.json"}, "7": {"Subreddit": "PhD", "Author": "thesurgeon0726", "Date": "1436029013", "Score": 1, "Body": "As a Colombian in a Ph.D. program, I understand the difficulty you're facing right now. \n\nI have a lot of friends who have gone on to get PhD's in engineering here, and the whole \"you need to be accepted first by a professor\" is actually mostly bs. Professors can only provide minimal input in the admissions process as these are usually handled by committees of professors and the like, you need to find the program that best suits your interest and then apply to it. Most doctoral programs are funded and pay their students quite well for working in the labs. \n\nMy advice to you is find a program in the U.S., as it seems Europe has not yielded such good results lately for you, make sure it's funded, get in contact with the professors (if you want), and then apply. Because you have a masters you will most likely not need a GRE exam but they may require a TOEFL (the English proficiency exam). I only know so much, my program is in biomedical sciences so nowhere near what you do, but I have a lot of friends in system and mechanical engineering and things have gone pretty well for them. PM me if you think I can provide more help. ", "Permalink": "https://www.reddit.com/by_id/t3_3c01yg.json"}, "8": {"Subreddit": "PhD", "Author": "felipmo14", "Date": "1436192869", "Score": 1, "Body": "Thanks for the advice, I'll PM you.", "Permalink": "https://www.reddit.com/by_id/t3_3c01yg.json"}, "9": {"Subreddit": "PhD", "Author": "Simsimius", "Date": "1436198990", "Score": 1, "Body": "Get good references from lecturers, tutors and project supervisors. Get as involved as you can in research - the more experience you have the better. PhD scholarships look at how likely you are to  complete the research from start to finish, and how well you are likely to do it. A masters degree (either an entire research one, or one with a significant research project at the end) can be really helpful.", "Permalink": "https://www.reddit.com/by_id/t3_3c7am3.json"}, "10": {"Subreddit": "PhD", "Author": "Aurelius921", "Date": "1436218621", "Score": 1, "Body": "Hands down BEST way is to write a top notch research proposal and find a lecturer excited to supervise it and apply for funding with you. \n\nEven if you get rejected 10 times you still have your proposal, rather than applying to advertised projects that for one get hundreds of applicants and secondly if you don't get the place all the time wasted reading in that subject area and preparing an application is wasted. \n\nSource: I am a PhD student in the UK on a Scholarship.", "Permalink": "https://www.reddit.com/by_id/t3_3c7am3.json"}, "11": {"Subreddit": "PhD", "Author": "reddit_newbie_3991", "Date": "1436222118", "Score": 1, "Body": "You can use this website to ask for more info: http://academia.stackexchange.com/", "Permalink": "https://www.reddit.com/by_id/t3_3c7am3.json"}, "12": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": "1436501867", "Score": 0, "Body": "Most RAs are undergrads, so I doubt that they can \"help prepare [you] for quals\".", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "13": {"Subreddit": "PhD", "Author": "Shitsaurus", "Date": "1437551596", "Score": 1, "Body": "I typically just go to the [Web of Science](https://isiknowledge.com/), you should have access through your university account. For the second question, you have to ask people. Start with your supervisor(s) and they should tell you how to find that out.", "Permalink": "https://www.reddit.com/by_id/t3_3e5fy6.json"}, "14": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1437838468", "Score": 1, "Body": "it's a world where you can fill out a form and collect Sallie Mae Student Loans. ", "Permalink": "https://www.reddit.com/by_id/t3_3e4qcd.json"}, "15": {"Subreddit": "PhD", "Author": "interliel", "Date": "1438261750", "Score": 2, "Body": "I use the [ACM digital library](http://dl.acm.org/) and [IEEE](http://www.computer.org/web/publications/)", "Permalink": "https://www.reddit.com/by_id/t3_3e5fy6.json"}, "16": {"Subreddit": "PhD", "Author": "sadmoody", "Date": "1438264047", "Score": 2, "Body": "Write a survey paper. This'll act as a good base for your literature review for your thesis. The survey paper will contrast and compare different approaches etc. By doing so - you'll be able to note gaps in knowledge. The thing with scientific research is that everyone's usually off doing their own thing and time passes - so you'll get papers that tackle the same issue but make different assumptions. You can point at these assumptions and say that they're you have to take them into account, and offer solutions for that. OR you can mix two different approaches together for improved performance. Who knows?\n\nI started looking at Adaptive Traffic Control Systems, moved on to Vehicular Communication in Adaptive Traffic Control Systems, I realised that the communication had to be safety critical in order to allow for an adaptive traffic control system to run over vehicular communication. It's impossible to get absolute perfection, so how best do I go about achieving safety critical in a mesh network? Fairness and Timeliness. Ok, let me tackle Fairness first, oh there are all these fairness measures and I keep getting different fairness results depending on the randomness of the environment. I wonder if there's a way to obtain the worst-case fairness from just looking at the protocol? Oh cool, I came up with a formula. Hey, this formula is applicable to lots of OTHER fields - not just what I'm looking at. So that's what my phd is about now. Haven't even gone near timeliness, or safety-critical, or adaptive traffic control systems.\n\nNot sure if that's everyone's experience, but I guess if you keep digging at a problem - eventually you reach a wall you have to work your way through. When you get through that wall - that's your contribution (i.e. your phd).", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "17": {"Subreddit": "PhD", "Author": "Rhyze", "Date": "1438266706", "Score": 1, "Body": "Seems like a fair point, thanks. However, my research field seems vast, as it tries to optimize a slew of algorithms and/or designs meta-level approaches. I find it hard to narrow down a specific point that  hasn't been approached yet, while being manageable to do something with it. Maybe I'm trying to find excuses though.. I probably should talk to my promotor I guess.", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "18": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1438285863", "Score": -1, "Body": "I would legitimately like to know in terms of Computer Science, why, on a regular basis, instantaneously after uploading content to the internet in terms of text why, nearly every time, I feel the need to update and edit my work, immediately upon uploading.\n\nI comprehensively do no feel that Computer Science in terms of Science that has much to do with Programming ::\n\n\n**As a University of Cincinnati Graduate in English Literature Class or 2010 I can only offer this.**\n\n]        \n\nhttp://www.sciencebuddies.org/science-fair-projects/project_scientific_method.shtml == Science Buddies Reference Point\n\n**The scientific method is a way to ask and answer scientific questions by making observations and doing experiments.**\n\nThe steps of the scientific method are to:\n\n*Ask a Question    \n*Do Background Research    \n*Construct a Hypothesis    \n*Test Your Hypothesis by Doing an Experiment    \n*Analyze Your Data and Draw a Conclusion    \n*Communicate Your Results    \n\nIt is important for your experiment to be a fair test. A \"fair test\" occurs when you change only one factor (variable) and keep all other conditions the same.\n\nWhile scientists study how nature works, engineers create new things, such as products, websites, environments, and experiences.\n\nIf your project involves creating or inventing something new, your project might better fit the steps of The Engineering Design Process.\n\nIf you are not sure if your project is a scientific or engineering project, you should read Comparing the Engineering Design Process and the Scientific Method. \n\n]        \n\n\n:: Is being actively explored.\n\nI do not feel like programming and computer science have much to do with each other.\n\nI would appreciate it if in terms of receiving a Doc·tor of Phi·los·o·phy you would develop an answer to this question,\n\nWhy does a consumer of electronics connected to the internet feel the need to update and upload content uploaded to the internet immediately after uploading it regularly?\n\n\n**Side Note**: Another question you could answer at the PHD level is, what does the H stand for in PHD because I can't find it online?\n", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "19": {"Subreddit": "PhD", "Author": "Rhyze", "Date": "1438297676", "Score": 1, "Body": "While interesting to read, I don't get what you are talking about :p", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "20": {"Subreddit": "PhD", "Author": "rigneja", "Date": "1438299400", "Score": 1, "Body": "depends if you are in academia or business - in business I have seen no difference - its almost anecdotal ", "Permalink": "https://www.reddit.com/by_id/t3_3e4qcd.json"}, "21": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1438300123", "Score": 0, "Body": "Maybe that's why it's a field I am in and not you? :|\n\nor / and\n\nMaybe I get something different than you get?", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}}