{"0": {"Subreddit": "PhD", "Author": "zantech", "Date": 1496276009, "Score": 1, "Body": "I've been trying this - the chapter outlines have been helpful.  Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "1": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1496276696, "Score": 3, "Body": "My primary role at a college is to help undergraduates become competitive enough to get into a PhD program, I NEVER recommend going into debt for a PhD. If you are truly passionate about whatever you are studying, perhaps going full-time, while being funded by an assistantship, fellowship, or scholarship would be a better option. It would allow you the time to fully commit to your program and studies, and also give you a financial peace of mind.\n\nGraduate Assistantships usually come with a tuition waiver, health insurance, and a living stipend. Whether you are teaching or doing research, that would give you more experience to help build up your CV.\n\nIf there is no funding available at the moment, perhaps defer for a year, seek out funding, then get your PhD.\n\nI wouldn't worry about the age thing. The majority of people that were in my PhD cohort were between 30-45 years old. \n\nIf you want a PhD, go for it, but seriously think about the logistics of getting it so you set yourself up for success once you are done. An additional $72,000 in debt is not setting yourself up for success...financially or mentally.", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "2": {"Subreddit": "PhD", "Author": "AtonalTimpanist", "Date": 1496277502, "Score": 1, "Body": "THANK YOU for your advice. I didn't even consider deferring. And honestly, I don't know anything about the logistics of it. Would lack of funding be a legitimate reason for deferring in the eyes of my graduate school? Or is that typically reserved for non-financial motives?\n\nAnd I would think going through the deferral process is better if I do it now vs later in the summer, right?", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "3": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1496277831, "Score": 1, "Body": "People defer for all types of reasons, so I wouldn't get too anxious about the program judging you. You have to check if they will allow you to defer, but if they do, then they usually do not grill you about the reason for it. I have known people to defer to live in the location for a year for in-state tuition, people have deferred to do another internship for experience, or people have deferred to save up money to ease the financial burden. You have to do whatever is best for you in the long run.", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "4": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1496278432, "Score": 6, "Body": "I had to keep changing my writing time and location to finish my dissertation. For a couple of months I got up at 5am and was super productive for several hours, then didn't think about it for the rest of the day. For a while I formed a writing group with some other people finishing up their dissertations. The last few months before I defended, I didn't do much work during the week, but would work 8 hours a day on Saturday and Sunday, this made it seem like a 7 day work week, but I had the evenings to myself.\n\nWhat also helped me was having several types of things I could be working on that were all dedicated to finishing my dissertation. Sometime we judge our productivity by how many pages we write, but there is other work that needs to be done that could be done when your brain cant write anymore. These things include formatting, revising, data collection, reading, creating your bibliography, etc.\n\nWhen I would feel like I couldn't do one task anymore, I would just switch up the task. I know it seems impossible sometimes, but if you got this far, you got this!\n\nGood luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "5": {"Subreddit": "PhD", "Author": "zantech", "Date": 1496278796, "Score": 1, "Body": "Good idea Re: alternative tasks.  I do have a few appendices to put together....  ", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "6": {"Subreddit": "PhD", "Author": "aurora1988", "Date": 1496282859, "Score": 3, "Body": "I am in third year of PhD program and I am writing a journal paper! Writing is so though specially for me as an international student!\n\nI just try to be more organized! any paper that I read I try to write a short paragraph about it under the related sub-section (or even copy and paste the main points) and when I am done with a sub-section, I go back and paraphrase or organize my notes.\n\nI am also get distracted and I am not productive at all! I need someone to push me and give me a weekly deadline!", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "7": {"Subreddit": "PhD", "Author": "gallypette", "Date": 1496303897, "Score": 2, "Body": "Don't be afraid of silences, you can take your time. Don't be afraid of asking examiners to rephrase their questions. \nBe relaxed, you are the one who knows the shortcomings of your work. Examiners barely scratched the surface while reading it.", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "8": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1496312904, "Score": 5, "Body": "Try this. Read through the connecting phrases and you might find an idea on how to develop your arguments. \n\nhttp://www.kfs.edu.eg/com/pdf/2082015294739.pdf", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "9": {"Subreddit": "PhD", "Author": "Iluspfloufz", "Date": 1496325254, "Score": 1, "Body": "100% in the same boat as you. You're not alone. We got this!", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "10": {"Subreddit": "PhD", "Author": "zantech", "Date": 1496332916, "Score": 1, "Body": "This is gold - thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "11": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1496354218, "Score": 1, "Body": "What doors will it open that wouldn't otherwise...I would think this through carefully. Only computer science, or quantitative subjects translate to any form of tangible payback in my opinion. PhDs do enable you to join academic jobs for what that is worth...I don't rest know of any other role that specifically wants a PhD that actually pays well...", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "12": {"Subreddit": "PhD", "Author": "flaminis", "Date": 1496360271, "Score": 1, "Body": "good god, what did I just write.... I feel like my thesis is going to be a disaster. :x", "Permalink": "https://www.reddit.com/by_id/t3_6eqqd8.json"}, "13": {"Subreddit": "PhD", "Author": "xbiitx", "Date": 1496386286, "Score": 1, "Body": "Dude congrats for your Phd offer, My advice is to go for the Phd coz on completion of your Phd I am sure you will be welcomed by big tech giants and make way more capital. ", "Permalink": "https://www.reddit.com/by_id/t3_6eqqd8.json"}, "14": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1496387209, "Score": 2, "Body": "Hah well that's some very solid self-awareness there.  :P", "Permalink": "https://www.reddit.com/by_id/t3_6eqqd8.json"}, "15": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1496387548, "Score": 2, "Body": "Probably better to spend 3 years earning money on a higher degree than 1 year paying a shit-tonne of money on a lower one.  PhDs generally don't make STEM student unhireable.  It's far easier to get a UK visa when you're highly-qualified (on paper) than when you're a generic BEng grad.\n\nJust be aware of what you're getting into: a PhD is not about \"studying\".  It's basically a job, and you should treat it like one.  You'll be getting far less direction than in undergrad, and will be expected to develop your own project plan, project management skills, and writing/communication ability alongside your technical skills.  Fortunately, finding ways to improve and demonstrate those skills will make you more hireable in the future.", "Permalink": "https://www.reddit.com/by_id/t3_6eqqd8.json"}, "16": {"Subreddit": "PhD", "Author": "throwaway4323245", "Date": 1496401210, "Score": 9, "Body": "I know it feels rough but put it this way: if you were in the audience, watching someone else \"messing up\" their presentation, how do you think you'd feel? Probably empathy for the guy and then you'd probably forget about it by the next session. We always judge our presentation much worse than anyone elses and most of the time it's not any where near as bad we think it is. Sorry that your presentation didn't go as planned but now you know what needs to be done to present well so use this energy and put it into your next presentation. ", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "17": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1496413991, "Score": 3, "Body": "Sounds like your own fault for lack of preparation. Sorry, but you're seeking empathy for a situation that could have been easily prevented, couched in excuses. \n\nDo your work and prepare next time. ", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "18": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1496414897, "Score": 2, "Body": "Absolutely this.  No excuses. ", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "19": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1496414992, "Score": 3, "Body": "I wouldn't feel empathy for someone who is obviously unprepared and is clearly wasting my time.  It's just unprofessional and disrespectful.", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "20": {"Subreddit": "PhD", "Author": "Criibon", "Date": 1496415884, "Score": 2, "Body": "Thank you! It feels better now a couple of hours later. I probably panicked a little bit there. I think the main problem was that I tried to fit too much into the presentation, and the next time I will keep it short and sweet. Had one later today that went much better! ", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "21": {"Subreddit": "PhD", "Author": "Criibon", "Date": 1496416500, "Score": 2, "Body": "To some extent yes. The issue with the slides was not my fault but that of the chair. The mumbling on me, obviously. The results isn't really anybodys fault, just the datas. One could argue that it is my fault that I was not able to find an interesting angle. \n\nI am not trying to make excuses although I see your point, but my guess is that that all of us have sometimes messed up (due to our own making or others) and was asking for how you deal with that, emotionally. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "22": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1496418477, "Score": 1, "Body": "Look, I wasn't there so I don't really know. I'd say English isn't the first language for much, if not most of the academia, so it isn't something you'd get penalized for typically. However, I expect you to practice enough to make sure that it looks like you have some idea you know what you're talking about, and having the wrong slides.. I mean what the hell?\n\nI'm not being hard on you for the sake of being harsh, I just know my own expectations for myself. If you know that this is an issue, rehearse until it's minimized. Check your slides. Be a fucking professional. ", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "23": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1496420610, "Score": 3, "Body": "To follow on your deleted reply to me: there is a difference between being nice and being pragmatically realistic about expectations and becoming better at things. But in the spirit of being helpful, let me summarize with three small constructive things. First, again, rehearsing works. I will not present anything that I have not rehearsed at least 3-5 times, and in some cases 10x that. That will also be your chance to iron out the kinks in the slides, fix the grammar, and to prevent needless mistakes. Second, along with rehearsal, and especially if you have issues with wording/vocabulary, you may want to script the entire presentation to a word, and as you practice it, you are more likely to follow along and say the right thing at the right time even if you aren't following the script with 100% precision. Three, being busy isn't an excuse. We all have teaching, research, projects, etc. Prioritize and allocate time accordingly. There are times to blow preparation off for one thing where you can afford to do so, but it doesn't sound like this was the situation.", "Permalink": "https://www.reddit.com/by_id/t3_6etetd.json"}, "24": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1496435210, "Score": 5, "Body": "PGCE for teaching. A PhD is for research.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "25": {"Subreddit": "PhD", "Author": "offbeat_", "Date": 1496436678, "Score": 1, "Body": "it is in a sociology field.", "Permalink": "https://www.reddit.com/by_id/t3_6byavr.json"}, "26": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496436787, "Score": 5, "Body": "Are there other advisers who might be able to take you on? Could you apply for external funding that would relieve the financial strain on your adviser? \n\nDo you think your adviser's assessment is fair, or does he perhaps have unreasonable expectations? If his expectations are fair, is it possible you could take your MPhil and get a job at a community college (that's what we call them in the US, don't know if there's something similar in the UK.)?\n", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "27": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1496437796, "Score": 1, "Body": "Yes. See if another advisor will take you if you think you can succeed. ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "28": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496443669, "Score": 1, "Body": "I do have ascholarship - what exactly do you mean by the financial strain on my adviser? I'm sorry, I really am not very familiar with the system. \n\nWhat is a community college? ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "29": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496443899, "Score": 2, "Body": "&gt; PGCE \n\nThank you, I will look into this! it seems my  university has this course. Sorry, the system is a bit differeint in my country of origin, so I got a bit lost, - thank you for your help!", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "30": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1496444444, "Score": 3, "Body": "It might not be your supervisors call. Assuming that your ubi operates similar to mine  (also UK), it csn be a recommendation of your 'transfer' viva to not continue to full PhD. Maybe his suggestion is his gut feeling as to the outcome of that meeting?\n\nHave a frank discussion with him. What progress would he expect from someone at your point in the program. Discuss options for potentially completing part time, if other factors are hindering full time study. See whether the amou t of work needed to 'catch up' is feasible in X time period.\n\nIt depends how your department/uni views time to completion. My uni had a big drive to get people through the process within 3 years. However there are always square pegs, of which, I was one. As long as you have a realistic chance of completing, I am sure there are ways and means of doing so :)\n\nDrop me a PM if you want a sounding board?", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "31": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496444704, "Score": 3, "Body": "I know some advisers will \"drop\" certain students if they are low on funding and can no longer afford to finance the student (in the US this is how many students are funded). Granted, it's typically poor form unless there are some extenuating circumstances. So if your adviser is funding you, that may be motivating his decision to some degree.\n\nI googled the equivalent for community college in the UK and it says something like Seconding Foundation Courses? It's typically a school that offers vocational courses or courses for college credit but does not offer full university degrees. I *think* they might only  require a master's degree to teach there, but I could be wrong.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "32": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1496481448, "Score": 1, "Body": "What, so professors pay students, basically? ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "33": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1496485342, "Score": 2, "Body": "My advice was to never go into debt, I never said don't ever pay for a PhD. Obviously everyone's situation is different, and there are plenty of cases where it would be ok to pay to go part-time. ", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "34": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1496490766, "Score": 4, "Body": "A PGCE lets you teach up to A Levels, if I'm not mistaken - not at universities. Do you want to teach only up to school-age children? ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "35": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496503428, "Score": 2, "Body": "In a lot of cases.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "36": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1496508661, "Score": 1, "Body": "That sounds weird, how do they get the money for that? ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "37": {"Subreddit": "PhD", "Author": "TheKeenMind", "Date": 1496531971, "Score": 2, "Body": "A PhD will be valued at any time and in any Western country except for the US in the next 4-8 years. You can wait it out, or leave or change fields. but there will be funding problems in the short term if you stay in the country ", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "38": {"Subreddit": "PhD", "Author": "socim8", "Date": 1496534836, "Score": 1, "Body": "A colleague of mine goes by her middle name, so legally her name is: Francine Margaret Lipton but since she goes by Margaret she publishes under Margaret F. Lipton. So that's an option as well and may be clearer to understand if you go by Margie. I go by my shortened first name, publish under full name middle initial last name but usually but my shortened name on name tags and such. Then another person who never goes by her full first name uses it at conferences, etc as part of her \"brand\". Basically do whatever and be consistent. ", "Permalink": "https://www.reddit.com/by_id/t3_6eg3pv.json"}, "39": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496541674, "Score": 3, "Body": "Well, I am in STEM, so typically the money comes from projects for which the professors have received grants or partnered with industry, or they/the department will have TA positions.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "40": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1496562017, "Score": 2, "Body": "Go to Germany - no fees to study and with their rejection of nuclear and technological national focus you will have an awesome environment for studying. Also Berlin is fucking incredible.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "41": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1496563124, "Score": 1, "Body": "What is TA?\nAnd if the professors refuse to take any students, they can just keep that money?\n\nSorry for the silly questions...", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "42": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1496564079, "Score": 1, "Body": "I would never do a PhD in Germany. I know people 8 years on still trying to work on their project alongside the massive amount of grunt work they're given. UK, France, Nordics, Netherlands etc. Fees don't mean anything anyway, Phds are always funded (or a terrible idea)", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "43": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1496564447, "Score": 2, "Body": "Guess I have heard different things, but if you don't fancy it then it's not for you. Maybe there's more funding around in the US, though, as about half of my friends doing PhDs don't have funding (including me).", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "44": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1496564505, "Score": 6, "Body": "First, I just wanted to mention that a Ph.D. will require that you to go into something much more narrow than 'renewable energy', so if you haven't narrowed down your interests considerably past this broad concept, a Ph.D. may not be in your best interests regardless of the political/academic climate.\n\nFrom there, it really depends on what your long-term career goals are. For non-academic prospects, many of the innovations in renewable energy/high efficiency technologies are being made by the U.S. private sector and are gaining a lot of economic momentum - this will be affected less by the current political agenda than public scientific funding. So I think many private-sector jobs in this category will continue to be generated, and the prospects are probably still better in the U.S. than any other country in the world. However, you need to make a smart decision on this and decide for yourself which renewable energy technologies will become more viable and expand over the next 50 years. For instance, it really seems like corn ethanol can never meet a large fraction of our demands, and that it has its own severe negative consequences on the environment. A lot of Ph.D. students did research on this in the late 90s/early 2000s, and I can imagine a lot of them (or all of them) had to transition into something else. Another example is hydrogen fuel cells (which are still being promoted by some car manufacturers, like Toyota) which are inherently disadvantaged to battery powered cars like the ones Tesla is making (it's hard to see how these disadvantages could ever be overcome once you consider all factors). If you specialized in some dying or gimmicky technology, you'd have much fewer job prospects post-Ph.D no matter where you are.\n\nThe academic job market started becoming much more competitive in the U.S. from ~1995-2010, and nowadays we are at the point where literally hundreds of Ph.D. holders are applying for new tenure track faculty openings (professor positions). So if you absolutely want to be a professor, you need to be extremely competitive, which can involve surrendering yourself almost entirely to your research topic - this is a sacrifice that many don't want, or aren't able, to make. However, contrary to what others on here seem to be implying, this problem with getting a faculty job is not necessarily specific to the U.S.. It is simply that too many people are getting doctorates nowadays and there just aren't enough academic positions to hire all of these people. University labs are modeled/funded in a way to support one PI and then an army of Ph.D. students, which is simply not sustainable and needs to change. Besides this, I have personally found that 'research-focused professors' in other first world countries still get paid less and receive much less funding than academic researchers here in the U.S, with few exceptions, particularly for science and engineering. I see a lot of research grants in other countries ranging from thousands to tens of thousands of dollars, and here in the U.S., major grants usually provide 100s of thousands to millions of dollars of funding. While this large gap is starting to shrink, it likely won't shrink considerably or disappear in the next decade or two.\n\nI think perhaps the worst prospects moving forward in the U.S. are in non-university governmental agency positions. People are still going to college, and at the very least we still need lecturers, but the general populace has been convinced that most governmental regulatory/scientific agencies (like the USDA, EPA, DoE) are bloated, inefficient wastes of resources. And while one side of the political spectrum is advocating for their elimination or reduction, the other side has not been equally vocal about expanding these agencies or creating new ones - so best case scenario is that they stay the same and don't contract in funding. Even during the Obama-era, which supplied many new multi-million dollar climate change or renewable energy research grants to  U.S. DoE national laboratories, it was very hard to get a staff scientist Ph.D.-level job at these institutions. I can't imaging how difficult it will be in the next few years, or even in a Democrat controlled country without Obama-level funding.\n\nFinally, even if you think the U.S. is going in the wrong direction/backtracking on renewable energy, top-tier U.S. institutions are still generally held in much higher regard than programs in other countries, so you can always get your degree at a top institution in the U.S. and then make plans to work in another country afterwards.\n", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "45": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1496564831, "Score": 2, "Body": "Well what exactly are your concerns? That there won't be enough funding? Because that will be the issue if you rely on DoE grants for renewables, etc. Just because Trump doesn't support renewables though doesn't mean that expansion will slow. Onshore wind is so cheap now anyway that it hardly matters. Have you chosen a research area? Because I think this is entirely field specific. And what do you want to do with a PhD? Honestly the skills I've learned in my Phd (also in renewables) are extremely applicable in other fields. I could now work across meteorology, computer science, aeronautics, electrical engineering, energy economics. Just pick something you are excited about. The actual content of your project will become less important with time. A prof I work with did his PhD on mechanical hard drives and now designs turbine rotors. Another did his on CHP boiler design and now works on aerosol dispersion modelling for nuclear accidents", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "46": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1496567885, "Score": 2, "Body": "I'm in Denmark now actually. Yes the situation is quite good here. We all have funding (or doing industrial Phd which funding is split by a company and govt) and are limited to 3 years on our project. But I used to study in Germany and hear really bad things from my friends there. If you can get a Marie Curie stipend then it's OK though because you aren't employed by the university. Maybe your situation is also the same since you're not funded? Are you doing teaching or research outside your Phd?", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "47": {"Subreddit": "PhD", "Author": "Timmeh7", "Date": 1496578071, "Score": 2, "Body": "That's not accurate.  While you do need a PGCE (or, more specifically, Qualified Teacher Status (QTS)) to teach in compulsory education, you don't need any special teaching qualification to teach at university level.  Actually, many universities make new lecturers without a PGCE do at least a few modules.  Sometimes there's a specific post-compulsory version of a PGCE, called a PCET, but this is usually seen as a lesser qualification (and I say this as someone who has a PCET).\n\nIn theory, a master's-level qualification like an MPhil is also perfectly fine to teach undergraduates, and indeed, a few of my colleagues, hired in a different era, don't have a doctorate.  That said, universities simply won't hire lecturers without a PhD any more; I've not seen someone without one hired in well over a decade at my institution.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "48": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1496588996, "Score": 1, "Body": "I think it's more which country you're in - here in the UK they've been cutting funding for the research councils which fund PhD projects for years, sadly. Now, unless you're doing STEM research, it's much harder to get funding. Sigh!", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "49": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1496595321, "Score": 1, "Body": "Yes that's true here as well. I can only speak from my experiences in engineering. Funding agencies in Denmark like to support projects which will benefit Danish companies, and we also do commercial work in our department which brings in money for the university. There is also a higher opportunity cost for PhD students if they reduced STEM funding, since industry pays pretty well. I think that's true everywhere.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "50": {"Subreddit": "PhD", "Author": "mmoores", "Date": 1496602195, "Score": 3, "Body": "TA is an abbreviation for teaching assistant: in the UK, for example, many scholarships are contingent upon a certain amount of teaching (mostly tutorials, laboratory demonstration, and marking)", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "51": {"Subreddit": "PhD", "Author": "mmoores", "Date": 1496603919, "Score": 4, "Body": "Further to the last point, a PhD in a good research group in the USA followed by a postdoc in Europe would be a good way to maximise your options further down the line. An advisor who attends European conferences and/or co-authors papers with European researchers would be ideal.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "52": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496608674, "Score": 1, "Body": "No, I wanted to teach at the university, and I suspect i really do need a PhD for that. ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "53": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496608878, "Score": 1, "Body": "My adviser is definitely not funding me (to be honest this is the first time I heard about such a possibility), and I wanted to teach at the university. \n\nI think I should think about a further PhD, but I have no idea if getting an MPhil would be helpful when I later apply for a PhD, or if it is going to be a signifier of a previous failure.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "54": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496609023, "Score": 1, "Body": "Yes, I do think hiss assessment is fair - I was virtually missing over 6 months of studies, and i do suspect I will not be able to catch up, I just try to understand if finilising the MPhil will be a better option than dropping off completely.. Or if there are other ways to teach at the university without a complete PhD. Seems i need it..", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "55": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496609224, "Score": 1, "Body": "This is what someone in academia in teh US told me - that 10 years ago is was normal to hire a lecturer without a PhD for the universitites, but not anymore.  And I am trying to uniderstand what would be my best course of action from where I am right now. ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "56": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1496611488, "Score": 3, "Body": "Good point - the connections you make during the Ph.D. and the postdoc are very important.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "57": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496612790, "Score": 1, "Body": "Hmmm that's a good question - I don't think they would do that, because truthfully, professors are trying to publish so quickly that they need the PhD students to do some of the work; they may have multiple projects going on at any given time. But I suppose it could happen...", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "58": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1496612929, "Score": 2, "Body": "I don't think anyone has to know that you originally went in for your PhD and stopped at a masters unless you or your professor tells him/her. I think the bigger concern is making sure you have someone to write your recommendation letters/speak to your research abilities when you apply again. ", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "59": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496615594, "Score": 1, "Body": "Yes, I thought that I will definitely need to improve  the impression on my supervisor in the coming year. But do you think that it is not implied that an MPhil means a failed PhD?", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "60": {"Subreddit": "PhD", "Author": "LimeShower", "Date": 1496669234, "Score": 2, "Body": "Same as Timmeh7 my University now wont hire without PostDoc nevermind PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "61": {"Subreddit": "PhD", "Author": "Crash_Coredump", "Date": 1496677266, "Score": 1, "Body": "Incidentally, over at /r/consulting and also /r/consluting we also picked up at a similar post from this person that might as well have said \"Some people say I have a big ego, but really my ego is tiny compared with my enormous talent and genius\"", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "62": {"Subreddit": "PhD", "Author": "Crash_Coredump", "Date": 1496677349, "Score": 1, "Body": "non-PhD randos really need to be banned from the entire internet", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "63": {"Subreddit": "PhD", "Author": "motherofboys247", "Date": 1496678601, "Score": 1, "Body": "I appreciate your reply. Sorry it's taken me so long to get back to you. I'm definitely going to reconsider after the first semester. I'm starting with two theory courses, so if any semester is going to break me, it'll be this one... we'll see. My kids are grown, which helps, but they do still live at home as they both are going to college now too. I've already been to therapy a few times, mostly for anxiety, so maybe I'll just start out seeing her as I try to do this, instead of waiting until I'm desperate for the help. Thanks for the reply!", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "64": {"Subreddit": "PhD", "Author": "motherofboys247", "Date": 1496678675, "Score": 1, "Body": "Wow. Thanks for the encouragement-- at least my kids are in college now themselves, though they do still  live at home. ", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "65": {"Subreddit": "PhD", "Author": "motherofboys247", "Date": 1496678755, "Score": 1, "Body": "How long have you been at it? What's it like? Do you have family you have to balance? Is the quality of your work what you want it to be-- both in teaching and in your coursework? Any advice to someone just starting? (Sorry it took me so long to reply-- I use another name on here and forgot to check this one!)", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "66": {"Subreddit": "PhD", "Author": "c875654", "Date": 1496696322, "Score": 5, "Body": "What field are you in? It seems incredibly rare for anyone to be working on a single project that will really affect all of humanity.", "Permalink": "https://www.reddit.com/by_id/t3_6fgpng.json"}, "67": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1496697085, "Score": 3, "Body": "I keep my eye on the future. No single problem is going to meet your larger goal anyway, so I prefer to look at my current problem as a stepping stone towards my larger goal, which may take decades to get to. So in your case, the \"meager problems\" may just be your mentor's way to ease you in to a bigger problem, which will be the first of many big problems in your career. \nBottom line: Patience, it's the primary ingredient of a PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_6fgpng.json"}, "68": {"Subreddit": "PhD", "Author": "drarch", "Date": 1496701484, "Score": 8, "Body": "Not a direct answer to your question, but I found the concept of [Ikigai](https://en.m.wikipedia.org/wiki/Ikigai) to be helpful.", "Permalink": "https://www.reddit.com/by_id/t3_6fgpng.json"}, "69": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1496722965, "Score": 7, "Body": "When I first started my PhD, our Dean gave this advice: \"You won't change the world with your PhD. It's the first step to changing the world, though\".\n\nKind of de-motivational for the actual PhD, but it's helped me with the long term perspective. Plus, there's not a single job where you're going to be helping people every single moment of every single day. So a PhD is no worse than what you'd be doing otherwise, right?", "Permalink": "https://www.reddit.com/by_id/t3_6fgpng.json"}, "70": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1496744287, "Score": 3, "Body": "My situation was a bit different to yours (I went straight from honours to PhD and proposed my own topic), but here's what I'd suggest:\n\n1. Get in touch with the University advertising the position and ask what the requirements are for applying. If they've got the project well planned, you might not need to write a proposal. But if they're looking for a PhD student to do it completely, then you may need to write a proposal to show your understanding.\n2. Just like a job application, tailor it to the institute you're applying for. It doesn't need to be super specifically aimed at them, but I would look into their related areas of research and make a point of how the research you're proposing would help them.\n3. At my University it's pretty split. Some people get positions because they need a PhD student for something, some people get positions because they want to do a PhD and so someone finds them a topic, and then there's those like me who propose their own research.\n4. If you've done your Masters in Physics I'm sure you'll have enough knowledge about the field. The first part of researching is reading, reading, reading, and that's when you get specific knowledge. You need to show an understanding of the general area that your proposal is based on, but it doesn't need to have every single detail of what you're going to do, how you're going to do it, and how it's going to change the world. I'm doing a biomedical engineering PhD with sensor design and machine learning. I didn't have any knowledge of the details straight out of my computer systems degree. I had the basic skills and I'm building on them as I go.\n\nGood luck, I hope you find the position that you're looking for!", "Permalink": "https://www.reddit.com/by_id/t3_6fk0ll.json"}, "71": {"Subreddit": "PhD", "Author": "feces4all", "Date": 1496789546, "Score": 1, "Body": "Did you switch professors?", "Permalink": "https://www.reddit.com/by_id/t3_6d5m3o.json"}, "72": {"Subreddit": "PhD", "Author": "linharcan", "Date": 1496794562, "Score": 1, "Body": "Finding a group of likeminded classmates who are willing to look at my work and send their work for me to look at in return has been one of the most helpful things so far.", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "73": {"Subreddit": "PhD", "Author": "ohwasai", "Date": 1496801695, "Score": 1, "Body": "Hey man, chill. A PhD can always find a job. Maybe you set the bar too high?", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "74": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1496803533, "Score": 1, "Body": "Nah. I got along really well with all the other people in the lab (there were about 20 of us) and I powered through. Although, in the 5 years I was there, three other grad students crashed out of the lab. One in their first month, one at the end of their first year, and one right before their prelims. ", "Permalink": "https://www.reddit.com/by_id/t3_6d5m3o.json"}, "75": {"Subreddit": "PhD", "Author": "depressedthesis", "Date": 1496804633, "Score": 2, "Body": "Clearly not.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "76": {"Subreddit": "PhD", "Author": "kneading_hiccups", "Date": 1496820858, "Score": 1, "Body": "Hang in there! ", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "77": {"Subreddit": "PhD", "Author": "haffi112", "Date": 1496826995, "Score": 3, "Body": "*I cannot tell from your answer what is exactly the thing you need to improve on. So if any of the things below sound obvious or stupid then please excuse my ignorance.*\n\nHave you done any mock interview with your friends or colleagues where they can criticise you? And by that I mean that they shouldn't sugar coat it just to make you feel confident, I mean brutal criticism which helps you find out exactly what it is that you need to improve.\n\nI know it sounds harsh or depressing, but it's possible that the feedback from the interviewers is just something made up simply because they didn't feel like they wanted to work with you, i.e. you were not a cultural match. What's going through the interviewer's mind is something like: \"Is this a person I would have a beer with? Do I enjoy talking to that person? Do I feel like I could trust this person to solve my problems?\" Also, if you mention that your supervisor was/is insane (which I hope you don't) then this clearly signals that you would talk badly about your next boss as well... you need to portray yourself as a likeable person.\n\nIf you come off as being stressed or burned out in the interview this sends off a clear red-flag. That's why I recommend practising on friends, use online code judges, code on a white board at home. Also, to get rid of the burn out you might want to get some time to relax and clear your mind. Thinking of a suicide is a clear sign you need to seek help and work on the burn out or any other issue which is not apparent in your post.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "78": {"Subreddit": "PhD", "Author": "imp3ga", "Date": 1496833375, "Score": 2, "Body": "thank you so much!!", "Permalink": "https://www.reddit.com/by_id/t3_6fk0ll.json"}, "79": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1496834754, "Score": 2, "Body": "Dude. This is a phase. Seriously just keep applying, don't be afraid to keep at it even after finishing. \n\nIf you don't have the Hollywood dream of getting employment right after PhD, who cares? *You'll get it.* Don't let your inner doubts screw you up so close to getting your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "80": {"Subreddit": "PhD", "Author": "liketheguyontv", "Date": 1496838592, "Score": 3, "Body": "After reading your first sentence, I thought to myself, I am not going to be able to compete. A math PhD with specialty in graph algorithms? You will get a job.\n\nI'm in a CS PhD program myself but nowhere near the level of theory that you're in. I wish I was defending my thesis soon but seems that I'm burning out before I can get the damn thing written.\n\nOn the job search troubles, take the advice of the above comments and do mock interviews. Also, you've identified some of your weak areas that you think lost you the job. Focus on improving that. Go through job postings that you like and highlight what you don't know and set a goal to learn it. Data science is not going anywhere.\n\nKeep in mind that not everyone gets to the 4th round of interviews, with Apple. You are doing better than most. Hang in there.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "81": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1496843695, "Score": 2, "Body": "Dude. Breathe. Slow down. Meditate. You're sabotaging yourself by letting the anxiety, doubt, fear if failure take over. ", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "82": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1496852563, "Score": 5, "Body": "Good luck mate ! Remember you are expert on this topic !", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "83": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1496865690, "Score": 4, "Body": "You bastard. Congratulations.", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "84": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1496865881, "Score": 1, "Body": "Do the math. If there are 1000 jobs in your expertise field, go for all of them, repeat. Eventually you will be there. Just a phase. Really.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "85": {"Subreddit": "PhD", "Author": "PhDofferThrowaway", "Date": 1496872235, "Score": 1, "Body": "Facebook has lots of PhD vacancies open. Looked into those?", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "86": {"Subreddit": "PhD", "Author": "eesweed", "Date": 1496888026, "Score": 4, "Body": "I agree with u/fiorescuro's answers to your points. Just wanted to emphasise contacting and gaining some sort of rapport with the supervisor before applying. The application process is very time consuming (as I'm sure you're aware). I found it helpful to send an introductory e-mail to each potential supervisor I was interested in working with. In those I made clear: 1. my background both professionally and educationally. 2. Some tailored points about the position / why I was a good fit 3. why I was enthusiastic about the field. I'd then finish it by asking if he/she thought I would be suitable and would welcome an application. \n\nIf that e-mail doesn't get a positive response then you are not likely to get a positive response on the application anyway (except you've discovered that without spending days on a research proposal / personal statement etc.). If you do get a positive response then you can go ahead with the application and you've already started a dialogue with the supervisor in case you have any questions about the process.", "Permalink": "https://www.reddit.com/by_id/t3_6fk0ll.json"}, "87": {"Subreddit": "PhD", "Author": "arghnoname", "Date": 1496906014, "Score": 1, "Body": "I'm getting to the light at the end of the tunnel part of a CS PhD myself.\n\nA while ago I heard someone say that the hardest decisions are the ones that matter the least, at least with respect to one's ability to predict the consequences. This is because if one option was clearly better than the other it wouldn't be a very difficult decision. Moral of the story: if you're sweating it there's no use sweating it unless you have a crystal ball handy.\n\nThat said, I made the other choice and I still go back and forth on whether or not it was the right choice. I almost think not doing a PhD is never the wrong choice. This doesn't mean it's a mistake to do one, but I don't know if it makes a lot of sense \"on paper.\" You should do a PhD because not doing it isn't an option. The career prospects, the opportunity cost, and the crazy hours that most people have to (or are internally compelled to) put forth to become successful in academia are not for the faint of heart. A job at google sounds like a vacation to me.\n\nDon't look back. There will be BS in your professional life, but if you can live a life without being a researcher, skipping the PhD is probably a good bet.", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "88": {"Subreddit": "PhD", "Author": "AlexDiru", "Date": 1496913402, "Score": 1, "Body": "Like noname above, I'm also nearly finishing a PhD in CS (UK)\n\nIt's a lot of work for not a lot of money. All my friends from Uni are getting paid more than twice what I'm getting and enjoying what they do. A PhD is very isolating, considering only you and your supervisor really know what you are doing, so it pretty much falls down to you to fix any problems.\n\nI had the option to continue in academia post-PhD. I turned that down without much thought. I'm going to industry and leaving academia and I can't wait. There is also the fact that you can fail it after these 3 years and all that work and no pay will amount to nearly nothing. It's very stressful.\n\nThe boost to career prospects is definitely not worth sacrificing 3 years of your working life (no pension contribution too). Regarding your case, there will always be more chances to do a PhD, but it might be the best choice to work in industry for a bit, build up some savings and then see if you still want to do it.", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "89": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1496917744, "Score": 2, "Body": "Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "90": {"Subreddit": "PhD", "Author": "mugbrushteeth", "Date": 1496920933, "Score": 1, "Body": "I'm a CS Ph.D student in Asia and about to start my second year in my journey. \n(Short background story of CS PhD in Asia: the majority of CS PhD students spend more than 10 hours in front of computer. Endless reading papers to keep up with the new methods, writing/revising papers. Some do exercise to keep staying sane)\n\nI think I understand that your love/hate relationship with the PhD offer. These days CS is getting really booming and getting the offer in CS related field is quite flattering. But at the same time you might feel afraid how difficult/isolating/desperate the next 4-year (or even longer) would be. People also would feel a bit afraid of going to industry and looking for a job, not the (relatively comfortable) academia anymore.\n\nI want to tell you that you made a right call. If you consider between the offer and other choices, I would say declining the offer is a right thing to do.\n\nLong story to short, my opinion about CS PhD (I don't know other fields) is that unless you *want* to *know* about your specific field in CS, you had better not pursue PhD.\n\nAlthough you started the CS PhD because you want to know and explore the field, the CS PhD can be very hard/isolating/(insert any adjectives with negative connotations)\n\nIf you think you are meant to do PhD in CS in the future, you can always come back to school. I strongly believe that industry experiences in CS field can lead you to get PhD offers with way better conditions in terms of school names, scholarships, and supervisors than the current one.", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "91": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1496949154, "Score": 4, "Body": "If it's still bothering you in a year, you can always reapply. One year is not going to make or break you. If you're a strong candidate, you'll get in again. ", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "92": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1496949202, "Score": 1, "Body": "Good luck and congratulations!", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "93": {"Subreddit": "PhD", "Author": "kippers", "Date": 1496956524, "Score": 1, "Body": "my fiance goes by his middle name and just uses the first initial of his first name - for example - A. Bryan Cordley, PhD. his citations are Cordley, AB. (not his real name, etc.) I go by a shortened version of my name but always publish under my full name, first and middle included.", "Permalink": "https://www.reddit.com/by_id/t3_6eg3pv.json"}, "94": {"Subreddit": "PhD", "Author": "kippers", "Date": 1496957022, "Score": 1, "Body": "i don't totally agree. i graduated from a huge R1 institution in the midwest, had similar qualifying stats and ended up at a private top 10 institution for my master's, and it made a huge difference for me, especially after moving back home. i stick out, the name recognition is extremely helpful, i have better networking opportunities and it helped me get experience i otherwise wouldn't have had if i stayed at my undergrad institution. my field requires me to work before applying to phd programs and i feel MUCH more confident applying to programs knowing where my degree is from and where it stands than if i were applying with a degree from my undergrad institution. \n\nthat being said, if you're happy and feel like your program has good connections you're interested in, who cares.", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "95": {"Subreddit": "PhD", "Author": "blufox", "Date": 1496959592, "Score": 1, "Body": "My advisor has always told us that it is better to appreciate even the smallest help anyone does. That is, if there is even a slight doubt in your mind as to some one's contribution, err on the side of including them in your co-author list. \n\nFurther, in my experience, co-authorship is a small price to pay for the advantage gained by having a larger network. If she can provide you with introduction/reference to her professional network, especially when you attend conferences etc. then it may be worth it.", "Permalink": "https://www.reddit.com/by_id/t3_6bhvnx.json"}, "96": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1497030513, "Score": 3, "Body": "well???? =)", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "97": {"Subreddit": "PhD", "Author": "Alpacatastic", "Date": 1497033499, "Score": 4, "Body": "Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "98": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497034565, "Score": 1, "Body": "Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "99": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497034571, "Score": 1, "Body": "Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "100": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497034577, "Score": 1, "Body": "Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "101": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497034586, "Score": 1, "Body": "Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_6ftpre.json"}, "102": {"Subreddit": "PhD", "Author": "Nishanthk", "Date": 1497035607, "Score": 1, "Body": "It will undoubtedly get harder. If it doesn't, either you are incredibly smart, or your advisor isn't challenging you the way he should. The only thing I've found to get easier is your ability to adapt and cope with the difficulty. If you aren't working hard, making mistakes, and continuously learning new things then you're doing something wrong. In my experience at least, comps/exams were the easiest part of my PhD. Designing solid experiments, and writing good scientific papers is by far the hardest thing I've done as part of my PhD. \n\nBut I don't think that means its getting worse... It definitely is way better. As someone who felt confident in my grasp of English and writing in general, the nuance behind writing a scientific paper surprised me. I learned an incredible amount, and enjoy it thoroughly. So if the difficulty is discouraging you, try to adjust your frame of mind to put in place why you are being asked to do things or are doing things. ", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "103": {"Subreddit": "PhD", "Author": "Nishanthk", "Date": 1497036230, "Score": 1, "Body": "Depends on the program, but it doesn't seem like you are behind in any manner. At least in our program, doing your proposal before having a paper published is generally frowned upon, because without the understanding of what it takes to write a paper, there's no chance in understanding what it takes to write a grant. \n\nAs far as your advisor's apathy towards your success, typically there are a few routes to go if you want to escalate it further. One would be to take the issues to your committee if they are research related. Otherwise, you could work with the dean's office to help mediate the issues.\n\nThe other thing that I've found helped me with my advisor, who refuses to discuss graduation until we start writing our third paper, is to discuss steps as related to the project. By this I mean, concrete steps to push the project that he is interested forward. As I've completed those, each time I've gotten to a point where we've sat down and organized a paper to write and done it. We've also worked out timelines to get things done so that if things don't happen we have record of why we set goals and what went wrong.\nFinding ways to give your advisor feedback that he may not seek out on his own can help him help you is what I've learned.", "Permalink": "https://www.reddit.com/by_id/t3_6fqq4u.json"}, "104": {"Subreddit": "PhD", "Author": "blufox", "Date": 1497036343, "Score": 21, "Body": "Done! passed :)", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "105": {"Subreddit": "PhD", "Author": "blufox", "Date": 1497036359, "Score": 9, "Body": "Thank you, passed! :)", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "106": {"Subreddit": "PhD", "Author": "Carb0hydrate", "Date": 1497036404, "Score": 8, "Body": "Congratulations, doctor! :D", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "107": {"Subreddit": "PhD", "Author": "blufox", "Date": 1497039030, "Score": 7, "Body": ":D", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "108": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1497041024, "Score": 1, "Body": "Congratulations! What subject, if you don't mind sharing, Dr. blufox?", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "109": {"Subreddit": "PhD", "Author": "blufox", "Date": 1497043855, "Score": 2, "Body": "Thank you. It is in Software Analysis and Verification; specifically \"[Mutation Analysis](https://en.wikipedia.org/wiki/Mutation_testing)\".", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "110": {"Subreddit": "PhD", "Author": "WikiTextBot", "Date": 1497043858, "Score": 3, "Body": "##Mutation testing\nMutation testing (or Mutation analysis or Program mutation) is used to design new software tests and evaluate the quality of existing software tests. Mutation testing involves modifying a program in small ways. Each mutated version is called a mutant and tests detect and reject mutants by causing the behavior of the original version to differ from the mutant. This is called killing the mutant.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/PhD/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index)   ^]\n^Downvote ^to ^remove", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "111": {"Subreddit": "PhD", "Author": "PhDofferThrowaway", "Date": 1497044331, "Score": 1, "Body": "Thanks man appreciate it! :)", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "112": {"Subreddit": "PhD", "Author": "PhDofferThrowaway", "Date": 1497044347, "Score": 1, "Body": "Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "113": {"Subreddit": "PhD", "Author": "PhDofferThrowaway", "Date": 1497044358, "Score": 1, "Body": "Thanks! :)", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "114": {"Subreddit": "PhD", "Author": "PhDofferThrowaway", "Date": 1497044368, "Score": 1, "Body": "Good point, thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "115": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1497044579, "Score": 1, "Body": "Planning/lists and stricter habits. Make sure you're getting enough sleep and exercise and eating regularly (and healthily). Spend time on your hobbies. If you know you'll only work between 8 and 5 that day then it's a lot easier to get through. If you have a list of things to do in that time period then it's easier to stay on track and makes you feel like you've achieved something.", "Permalink": "https://www.reddit.com/by_id/t3_6gba5r.json"}, "116": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1497045205, "Score": 3, "Body": "Sounds interesting, congratulations on your doctorate and thank you for your research.", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "117": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1497099018, "Score": 6, "Body": "Dude you passed. Make the edits and move on to bigger and better things in life.  Congrats!", "Permalink": "https://www.reddit.com/by_id/t3_6gag5x.json"}, "118": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1497106403, "Score": 2, "Body": "&gt; Do you have any recommendations for of writers/blogs/news sites that you think make academic issues accessible?\n\nThe entire NASA.gov website.  Every article they post or news briefing they have is specifically written for non-scientists to understand.  I'm biased as an astronomer, but half of NASA's work is about making science (of space related things) more accessible.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6gasyl.json"}, "119": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497129315, "Score": 2, "Body": "I know. Thanks. Does not feel like I did. I need to work but I'm so worn out getting to this point.", "Permalink": "https://www.reddit.com/by_id/t3_6gag5x.json"}, "120": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497130564, "Score": 2, "Body": "\"If I have seen further it is by standing on the shoulders of Giants\" - Newton", "Permalink": "https://www.reddit.com/by_id/t3_6gc92x.json"}, "121": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497131756, "Score": 2, "Body": "I make a (realistic) list of stuff to do the following week every Monday, so that I can break up my work into small parts and not feel overwhelmed by the much larger body of work I'll need to do. I reward myself if I finish the list early by taking a day off or maybe watching a movie. \n\nI've felt burned out intermittently, and the list helps me recover. In addition, I try to do a variety of things after \"work\" everyday: go to the gym, read a (non-academic) book, cook something new, or even try some lectures from a fun course on EdX or Coursera (because why not?). This is where I think procrastination (in moderate amounts) isn't a bad thing.  ", "Permalink": "https://www.reddit.com/by_id/t3_6gba5r.json"}, "122": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1497137390, "Score": 1, "Body": "Depending on your field there may be a compiled academic genealogy tracing advisers and their students. \n\n[Academic Tree](https://academictree.org/) is a good start but not the most complete genealogy for most fields.\n", "Permalink": "https://www.reddit.com/by_id/t3_6gc92x.json"}, "123": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1497146777, "Score": 2, "Body": "I would recommend including references if youre going to cite scholars/authors just so that your reviewer can know who you are talking about or referring to. It also shows you have academic integrity. Youre not losing by including references, think of it like that.", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "124": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1497149283, "Score": 1, "Body": "Thank you! I guess I'd never heard of a reference list for an SoP but you're right about the academic integrity if I do mention scholars/works.", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "125": {"Subreddit": "PhD", "Author": "SocInTheMaking", "Date": 1497150154, "Score": 3, "Body": "I agree. However, I asked the same question as I was applying for Sociology PhDs for Fall 17. I was actually told not to cite because they wanted to know me, not read more of my research capabilities - assuming you are also required to submit some type of writing sample. Although I was told that, I think that citing cannot hurt. Especially if the people you are citing are the faculty that you are hoping to work with! Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "126": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1497156523, "Score": 1, "Body": "I mean you don't want to write a research paper for it, but I included some quotes from works that have inspired me or I'd like to build on.  ", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "127": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1497196720, "Score": 2, "Body": "It also depends on who you are citing.  \n  \nLook up the articles in google scholar, if all the references you are using have 1000+ cites, then you can assume that the adcoms should have some knowledge about them.  \n  \nBut if you're citing obscure stuff, then 1) maybe you might want to reconsider citing them and 2) the adcoms likely haven't read it.\n  \nWhen I applied to programs 6 years ago, I made one reference to a very famous article in my field of interest (10,000+ cites). I did not include a reference list for that, and just assumed that the adcoms would know what I was talking about.", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "128": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497208557, "Score": 1, "Body": "I apologize for being inactive these past few days after posing my question. A lot has been going on and I finally get some time to respond to your comments. I greatly appreciate everyone who's provided their opinions. \nAs someone pointed out below, my major concern is about funding if I want to do a PhD next year. I am working in the solar field as a design engineer right now and I want to do research in the same field but at the same time I do not want to limit myself to just solar. I know that I'm interested in doing an interdisciplinary research involving solar.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "129": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497208637, "Score": 1, "Body": "Thanks but I'd rather work in a field that has a future :)", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "130": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1497208852, "Score": 1, "Body": "Coal will make America great again. Are you a terrorist or what? ", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "131": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497209011, "Score": 1, "Body": "Thank you @grrlinterrupted and @chef_baboon for your insights. I know a couple of people who've had similar bad experiences while doing their PhDs in Germany as chef_baboon has pointed out. They had to drop out in the end and get out with a Master's degree. \n\nHowever, I've also heard that Sweden, Norway and Iceland have good research going on in the renewable energy field. I'm looking into those options as well but US is my first preference as of now.", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "132": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1497210122, "Score": 1, "Body": "Writing a to do list and meditation helps me a lot when I'm tired and stressed about work. I used to not understand how meditation could work, but now I meditate with buddhify (the app) and do one or two calming and/or affirming meditations and it's made a big difference.", "Permalink": "https://www.reddit.com/by_id/t3_6gba5r.json"}, "133": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497212034, "Score": 1, "Body": "Nope I'm just a realist who's willing to look further into the future than the next 50-100 years maybe. If you look at the studies out there, solar and wind sectors have more jobs for the common man than the coal sector right now. There is lesser and lesser human element in the coal field as more and more machines and automation take over. ", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "134": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1497213420, "Score": 1, "Body": "Jesus dude. Jk", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "135": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1497213687, "Score": 2, "Body": "Very best of luck with it, wherever you decide to go :)", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "136": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1497216762, "Score": 1, "Body": "congratulations! =)", "Permalink": "https://www.reddit.com/by_id/t3_6g8rhc.json"}, "137": {"Subreddit": "PhD", "Author": "wizus", "Date": 1497219187, "Score": 2, "Body": "I would recommend choosing the group with which you feel more comfortable achieving the goals that you have (e.g., strong publications if you plan to stay in academia, connection to industry otherwise). \n\nIf that's your main focus, the next things to consider are, in order of priorities: \n\n- Quality of life as a PhD. As you said, the Canadian offer seems to be better in this respect. Also, the calmer the environment, the better it is for your PhD. You'll have enough distractions anyways. \n\n- Speaking about distractions, don't forget to consider the \"whole package\", not just the research-related aspects of the offers. Some doctoral programs require you to teach, some will allow you to supervise Bachelors or even Masters students. As important as teaching is for academia as a whole, it's a lot of additional work which is not directly helpful for your research. On the other hand, delegating bits of your own work to students is a great research tool—if you're a good manager.  \n\n- Distance to friends and family doesn't matter that much. As a PhD, I live only 3 hours flight from my home, but I still end up visiting only couple of times per year. \n\n- Bilingual environments like Canada are great for enriching yourself in the diverse cultural environment. ", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "138": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497220191, "Score": 2, "Body": "Ah, the oldest dilemma in academia: the group or the university? I don't think there is a \"correct\" answer, so here is my opinion (I'm a 3rd yr PhD student):\n\nFirst and foremost for a PhD is the research group and adviser, which ultimately plays the most significant role for your research, right from finding a good topic, putting together a good committee, to \"little\" things like going to the top conferences. That said, it seems this point is moot for you, because both the research groups are similar. \n\nSo moving on to the university, it is my opinion that you should go to the better university, and by better, I mean richer. Why? Because there's a lot of support structures that your university can provide you with. The most basic of them is having a great library that subscribes to all the journals that you would need. In addition, better universities have better labs and equipment, as well as money to fund new purchases (if you need them, of course). My university has an excellent teaching center that helped prepare me to TA/teach (and also plenty of opportunities to TA/teach), as well as a writing support system to improve academic writing. All this costs money, of course, and only a \"fancier\" university can afford it. Finally, if a university is better known, chances are, professors there will have more collaborations, and that should be music to a PhD student's ears (this also depends on the professor though). So consider these support structures while choosing where to go. In addition, you may also want to look into differences between university policies on a PhD - the difference between American and European PhDs is well-known (in terms of required coursework, breadth of research, etc.), but I'm not familiar with the Canadian system. \n\nOn the point of a stipend, this is strictly my personal opinion, but I believe every PhD student should be financially struggling to an extent - if you're financially very comfortable, you tend to treat the PhD like a \"real job\" and become complacent, eventually delaying your defense. A PhD is not a \"real job\" - it is a step towards one, and should be treated as such. A little financial fire on your behind keeps you going. That said, if you're paid so little that you can barely afford food, then that's an obvious no-no. Again, this is my personal opinion. \n\nFinally, on Montreal being more relaxed. This is really subjective and depends on what sort of person you are. I mostly immerse myself in my work and go several days without talking to people at all (helps to live in the middle of nowhere), but not everybody likes that. So for me, Montreal or London would be the same (!) because I wouldn't care about the city very much, except maybe the weather. But a lot of my friends keep wanting to do fun stuff every weekend and have to drive to bigger cities, which can suck. Either way, you'll eventually have to balance your work with the \"real world\" and come to some sort of equilibrium. ", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "139": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497232879, "Score": 1, "Body": "Thank you and good luck to you as well :)", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "140": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497234691, "Score": 1, "Body": "It does not feel good.", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "141": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497234830, "Score": 1, "Body": "Thank you for your insights @RevisedMonk and @mmoores. \n@RevisedMonk For starters, I'm working in the solar field currently and was hoping to get my PhD in the same but I don't want to limit myself to just one field. I like doing interdisciplinary research as I did in my Master's. I am looking into the top U.S schools and the research they are doing in the solar field right now also hoping to see if there is any scope for interdisciplinary research at these schools. The other field of research that greatly captivates me is Bio-mimicry. So far, I haven't come across any top schools doing any research in this field or maybe I'm looking in the wrong places but that is one another field I do not mind spending a good amount of time researching in.\nAs for post PhD plans, I want to work as a researcher in the industry  and try to gain a wide variety of work experience before I can even think of getting into academia later (depending on the circumstances at that point). ", "Permalink": "https://www.reddit.com/by_id/t3_6f3ba0.json"}, "142": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497234858, "Score": 1, "Body": "All of them.", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "143": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497235078, "Score": 1, "Body": "I got a conditional pass. I just need to make the changes and re-submit the manuscript to my chair only.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "144": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1497236839, "Score": 9, "Body": "I've been through a similar thing, sort of. Honestly, I quit the masters when I was told I couldn't use my \ndata. I'm ashamed of that but I have bounced back since, I'm now half way through my PhD. \n\nYou have to understand that supervisors often have their own agendas at heart, unfortunately. You sound like a driven person, keep believing in yourself and give it your best shot. \n\nYou've come a long way to listen to someone tell you that you can't do something now. Head down and prove them wrong, no doubt you've done it before. \n\nGood luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "145": {"Subreddit": "PhD", "Author": "curious_george08", "Date": 1497237037, "Score": 1, "Body": "I can only hope that what I'm about to say will prove to be at least a little help if not a lot because I went through the same thing. When I was getting ready to graduate with a Master's degree in Mechanical, I was juggling between trying to defend my thesis and finding a job in my field during the final semester. It only got tougher for me as I'm an international student but I kept applying to as many jobs as I could in the limited time I had and eventually landed a good position (less pay but still) in my field.\n\nI basically signed up for LinkedIn premium, overhauled my entire profile and my resume, joined job seeker forums and asked industry professionals to review my profile (they provided some great feedback which helped me land the job). I also read a lot of articles on LinkedIn on how to improve my resume format (an HR apparently spends 6 seconds on each resume), used google suggestions to find various companies in my field, reached out to HRs on LinkedIn and via emails and after applying to 100's of jobs, I finally landed an offer, three months after I graduated. \n\nKeep at it and don't lose hope. Everything will work out just fine. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "146": {"Subreddit": "PhD", "Author": "r_Glautreu", "Date": 1497237114, "Score": 2, "Body": "Thank you, that means a lot! 😊", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "147": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497237471, "Score": 2, "Body": "Bad situation, it happened to a friend of mine. In their case, they moved to a different research group and took the qual again - and passed. It added at least 1 year to their PhD, but that's a cost they were willing to pay. Whereas, another friend of mine was dismissed from the group a year *after* they *passed* the qual - that was a pretty ugly affair and eventually they got a masters degree and left for industry - PhD dream over. \n\nI can't imagine how hard this will be, and I think I'd do what you're doing. I commend you for your willingness to fight the good fight. However, be aware of the risks of failing again, especially in terms of time lost. If you think a PhD is worth the extra wait, then go for it!", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "148": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1497238274, "Score": 1, "Body": "If you want it, make it happen. Cut a deal with your PI(s) or try to get into another lab. See if an administrator in your department or the grad school will help if need be.", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "149": {"Subreddit": "PhD", "Author": "r_Glautreu", "Date": 1497239159, "Score": 2, "Body": "Thank you for the encouragement, it means a lot! I don't think time lost will necessarily be an issue. Quals only take about a month and my research is going ok. I was even planning on presenting my dissertation proposal 1 semester earlier than normal so I could hit the ground running. That's why I find this whole situation perplexing. As far as I can tell, my PIs are onboard with my research.", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "150": {"Subreddit": "PhD", "Author": "nyquist_karma", "Date": 1497256320, "Score": 1, "Body": "Of course it sums up where I feel more comfortable but the thing is that I only had Skype meetings with them, so I don't know how they work exactly. Also, no teaching is involved in both of them. I am very confused.", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "151": {"Subreddit": "PhD", "Author": "ursath", "Date": 1497257667, "Score": 5, "Body": "It's not really a dilemma unless you are looking at Undergraduate courses. People turn down Oxford PhD offers because the other, unknown university, has the right environment for the topic. ", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "152": {"Subreddit": "PhD", "Author": "wizus", "Date": 1497259149, "Score": 2, "Body": "It's bad they haven't invited you to meet the group. \n\nI would contact the current PhD students from both groups and talk informally about life as a group member. ", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "153": {"Subreddit": "PhD", "Author": "nyquist_karma", "Date": 1497261132, "Score": 1, "Body": "I could have gone in person for the interview, instead of skype, but it was not possible due to my current job obligations", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "154": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1497263042, "Score": 3, "Body": "Right, but the comment was about feeling comfortable *achieving your goals*, not making friends.  You don't need to go in person to see which group's individual PhD students publish more frequently or in better journals/conferences, where their alumni end up (academia, government, or industry, what kinds of institutions/companies) and whether the group collaborates with industrial partners.  You can ask the advisors remotely how they supervise their students - hopefully you already did this in your skype chat!  Do they have weekly one-on-one meetings, casual infrequent meetings, regular group meetings, etc?  Which suits your style of work and needs better?\n\nAnother point is one you mentioned about living comfortably on the stipend.  The London stipend will not only mean a much smaller range of options for living (especially if you want to live alone) but also that you're likely to spend much more time commuting.\n\nThe other point is that the UK one is probably 3 years while the UQAM is probably... 5-6?  If you'd like to go into academia in North America after you graduate you'll probably have a hard time competing with the UK degree unless you go and do a few years postdoc afterwards to compensate for the shorter degree time.", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "155": {"Subreddit": "PhD", "Author": "mugbrushteeth", "Date": 1497267099, "Score": 1, "Body": "It totally depends on your personality and your priority in your career. Up to them, you can find the suitable place for you.\n\nThink about these aspects and other related points.\n- are you introvert or extrovert (what is your personality or life style)\n: for example, if you are more like extrovert, vibrant environment will be more suitable for you. The next years during PhD will be important for you in career wise but at the same time it's your precious 4+year life time. You should consider the quality of life you will have besides the research environment.\n- what's your next plan after PhD / what's your goal during the PhD\n: e.g. If the answer is publishing papers as many as you can, the group is more important than the school name. Check how active each research group in publishing papers.\n\nAdditionally, (although the other comments also mentioned that, I repeat this because it's very important.) I highly recommend you to have a chat with the advisor and current PhD students in the group.\n\nPs. after considering for days if you can't still make a decision, follow your gut feelings.", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "156": {"Subreddit": "PhD", "Author": "nyquist_karma", "Date": 1497277129, "Score": 2, "Body": "I should mention that I am currently in a well paying job which is insanely boring and completely different from what I studied.", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "157": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1497303346, "Score": 1, "Body": "Generally this is all just bound up in plagiarism laws and you don't need to license anything. If people wish to build on your data then that is their right as long as they cite you if they used your data or insights. It is illegal for someone to publish your whole or partial thesis anywhere that you didn't approve.", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "158": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1497313041, "Score": 2, "Body": "If it's code, any free license that GitHub uses.\n\nEdit: in fact, if it *is* code, put it on github. ", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "159": {"Subreddit": "PhD", "Author": "blufox", "Date": 1497315643, "Score": 2, "Body": "No, it is not code. Essentially, I have to upload the pdf of my thesis to the scholars archive of the university. Here, they give me two choices: Do not put a license at all (in which case it becomes inaccessible I think), put a creative commons license. in the CC choice, I have again three boxes, make it CC0, restrict commercial use [Y|N], restrict derivatives [Sharealike|Yes|No].", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "160": {"Subreddit": "PhD", "Author": "daisyfaith", "Date": 1497346719, "Score": 1, "Body": "thanks!! i'm genuinely going to test those out, this may be the proper center-floor solution. i haven't used Mendel before, usually EndNote, but i am satisfied to analyze new referencing software if it makes using Latex less painful!  [buy dissertation online](https://www.writersupport.co.uk/writing/dissertation)\n", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "161": {"Subreddit": "PhD", "Author": "BekBoynton", "Date": 1497356380, "Score": 2, "Body": "Check out this website for some awesome phd/planning resources: http://www.ithinkwell.com.au \n\nThey are based in Australia and specialise in helping PhD students and academics be more productive. If you're in Australia and get a chance to check them out I highly recommend it! ", "Permalink": "https://www.reddit.com/by_id/t3_6gba5r.json"}, "162": {"Subreddit": "PhD", "Author": "SecretlyAMosinNagant", "Date": 1497375340, "Score": 2, "Body": "Everything but CC0 requires that you be attributed, but that won't stop a thief from just ignoring the law. The same goes for all opensource software or anything that the public can see, we can license things all we want, but that won't stop dis-honest people. You should just license your work how you see fit.", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "163": {"Subreddit": "PhD", "Author": "wurdle", "Date": 1497383032, "Score": 2, "Body": "It depends on the rules/expectations of your particular school. Where I did my PhD, it was the job of the chair to compile the list of everyone's requested changes and meet one on one with the student to go over them, and then sign off on them after the changes were made.", "Permalink": "https://www.reddit.com/by_id/t3_6gpjxw.json"}, "164": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497384581, "Score": 1, "Body": "I spoke to administration about paperwork. They say it is up to my chair alone to decide when I have done what I need to. My question is if I should even invite more comments from the rest of the committee. If I don't, my scope is limited to comments what I have in my notes. If I do, I might be opening myself to more changes. Even though I'd like to get the whole committee's full input as of now, I think it is not necessary.", "Permalink": "https://www.reddit.com/by_id/t3_6gpjxw.json"}, "165": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1497390300, "Score": 7, "Body": "I think a general increase in gratitude would do the world a wonder of good. Being thankful is often more beneficial to the person thanking than the person being thanked. ", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "166": {"Subreddit": "PhD", "Author": "wurdle", "Date": 1497392201, "Score": 1, "Body": "The reason why my old institution had the chair be the one to write the notes about revisions is because post defense students are too distracted. The chair must put the list of revisions on the paperwork where the committee signs to say whether you passed or not, so all of this gets discussed while you're still out in the hallway and they are voting on the results.\n\nIt is unfortunate that you have ended up in this situation, but I thinking pinging your chair is probably the path of least resistance. Send them your list of revisions that you are working on. They will either say ok, or tell you to forward the list to the entire committee.", "Permalink": "https://www.reddit.com/by_id/t3_6gpjxw.json"}, "167": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1497401869, "Score": 6, "Body": "Jesus. Why not be thankful to anyone that helps.", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "168": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1497410346, "Score": 1, "Body": "Thanks. That's what I've done.", "Permalink": "https://www.reddit.com/by_id/t3_6gpjxw.json"}, "169": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1497428695, "Score": 4, "Body": "It's where you sit in the value chain...i.e. research scientists have every low extrinsic value. If all of us quit working for a week, nothing would happen. If the transport workers your town quit working for a week, chaos would ensue. \n\nRecognition requires power, and research is inherently powerless until it can unionise effectively and lobby for more recognition.", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "170": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1497429210, "Score": 1, "Body": "I am awaiting my viva in the UK as well, but the examiners have recently covered other students. I have been told that examiners are not out to fail you, but to ensure that you are generally aware of your own work and can defend or explain your concepts reasonably well. \n\nA PhD is a national qualification in the UK i.e. all tiers of universities are held to the same standard, in theory, so it's not necessarily a high bar to pass, it may be difficult to do very well of course, but most candidates have corrections.", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "171": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1497440358, "Score": 2, "Body": "Legitimate question haha. I think if we tangibly assisted someone with our work, sure.", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "172": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1497446967, "Score": 2, "Body": "Either see if you can do a PhD \"by publication\" rather than \"by thesis\" in which you write an introduction and a conclusion that you staple to your publications (that have already passed peer review), or buy a bike :).", "Permalink": "https://www.reddit.com/by_id/t3_6h591e.json"}, "173": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497460980, "Score": 2, "Body": "Group. Group. Group. Group. Better universities maybe have better equipment and more money, and therefore tend to have better groups but when it comes down to it the most important thing to have is a great supervisor. A good supervisor will publish often and in good journals, and therefor you will. If you get a bunch of papers in some top journals that is infinitely better than going to oxford or cambridge and having one mediocre paper", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "174": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497462775, "Score": 1, "Body": "Except any university worth anything will make you do a PGCHE in your first year of becoming a lecturer, if you don't already have one and will expect you to have had undergraduate teaching experience already", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "175": {"Subreddit": "PhD", "Author": "Timmeh7", "Date": 1497463667, "Score": 1, "Body": "That's... more or less exactly what I said?\n\n&gt; Actually, many universities make new lecturers without a PGCE do at least a few modules. Sometimes there's a specific post-compulsory version of a PGCE, called a PCET", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "176": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497468489, "Score": 1, "Body": "PGCE is for schools and PGCHE is post graduate certificate of higher education, and PCET is again for school, it's a PGCert.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "177": {"Subreddit": "PhD", "Author": "petecervelo", "Date": 1497476636, "Score": 2, "Body": "Because your research does not matter to anyone but you", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "178": {"Subreddit": "PhD", "Author": "nyquist_karma", "Date": 1497476733, "Score": 1, "Body": "They publish at the exact same journals and conferences ", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "179": {"Subreddit": "PhD", "Author": "petecervelo", "Date": 1497476883, "Score": 2, "Body": "Writing a thesis is hard. Even for those special people who can just put down perfect academic prose in a single draft. It always takes longer than you think ", "Permalink": "https://www.reddit.com/by_id/t3_6h591e.json"}, "180": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497478233, "Score": 1, "Body": "Exactly what I did for my masters thesis, and intend to do for my PhD too (the thesis part, not the bike part). If not through the peer review process, at least write each chapter like a paper, which IMO is easier than writing the whole thesis as one big document. ", "Permalink": "https://www.reddit.com/by_id/t3_6h591e.json"}, "181": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1497493782, "Score": 1, "Body": "Thanks! I don't have many publications just 2 at the moment with one pending and another chapter is just other miscellaneous projects I've done that I don't think is very strong and needs a lot more data for.\nI think I might opt for a longer stay just so that I won't have the worry of having to find another place to live while I'm studying and preparing for my defense!", "Permalink": "https://www.reddit.com/by_id/t3_6h591e.json"}, "182": {"Subreddit": "PhD", "Author": "WriteOne73", "Date": 1497504417, "Score": 1, "Body": "Your question is not dumb. ", "Permalink": "https://www.reddit.com/by_id/t3_6gj0nv.json"}, "183": {"Subreddit": "PhD", "Author": "aTadConfusedAlien", "Date": 1497537141, "Score": 2, "Body": "Montreal has quite a large amount of the big shots in deep learning, no? If you're into research rather than the PhD as a career building stone, choose group over the university.", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "184": {"Subreddit": "PhD", "Author": "aTadConfusedAlien", "Date": 1497538285, "Score": 1, "Body": "It's pretty easy to get an offer for a PhD in CS, so if you're really bothered by it, you can always re-apply. Regarding your perception about your own smarts: Sometimes it's good to trust outside judgment, it's easy to fall to the imposter syndrome. Learning how to deal with stress is a separate issue, but there are aways to deal with that too.\nAnother key factor to keep in mind is that you probably lose 2/3 of your current industry income by downgrading to a PhD salary or stipend.", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "185": {"Subreddit": "PhD", "Author": "Nishanthk", "Date": 1497548202, "Score": 3, "Body": "My suggestion is to do your work as if you were to graduate with a masters, so you can get that paper and all of the intangible pieces finished on your way to graduate. However, plan on retaking the quals. This way you cover yourself if you fail your quals graduating with a Masters will be a short order and you can move on, if you pass, you have a paper under your belt to start and you can keep up the momentum. ", "Permalink": "https://www.reddit.com/by_id/t3_6gpl77.json"}, "186": {"Subreddit": "PhD", "Author": "giraffic_park_8", "Date": 1497548379, "Score": 1, "Body": "It depends what you want. If you'd like to be a dev, then yes, a PhD won't necessarily help with that. If you would like to do research, then  the PhD is almost your only option (short of doing something amazing independently and getting attention that way). It also depends heavily on what group you get into.\n\nFor me, I lucked my way into an amazing group working on AI/CV, and it's put me on a far better trajectory career-wise.", "Permalink": "https://www.reddit.com/by_id/t3_6fwiqc.json"}, "187": {"Subreddit": "PhD", "Author": "Ginger-Force", "Date": 1497549303, "Score": 1, "Body": "You were gone for 6 months and you didn't suspend? I know in the UK you can suspend your PhD for 6 months I think. Like you mentioned in another reply, unfortunately I think an MPhil does imply a failed Phd.", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "188": {"Subreddit": "PhD", "Author": "aTadConfusedAlien", "Date": 1497555070, "Score": 1, "Body": "Take a look at some of the books along the lines of \"cracking the code interview\", go to hackerrank, solve some programs, put them on your github, include it in your CV. I'll help get your speed up and also provide some evidence that you can write code.", "Permalink": "https://www.reddit.com/by_id/t3_6fq8qm.json"}, "189": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497555942, "Score": 2, "Body": "Is this for argument sake or the reality? Because really no two groups are going to have the same track record. Which group publishes more often? Which of the groups has more citations on their papers? If that is the case then, go with the project you prefer. You're going to be doing it for the next few years", "Permalink": "https://www.reddit.com/by_id/t3_6go075.json"}, "190": {"Subreddit": "PhD", "Author": "currac", "Date": 1497559397, "Score": 2, "Body": "You can teach in any collage/ IT in Ireland with a masters degree phd is only for university. come to think of it I know a few people lecturing with just a Bsc......", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "191": {"Subreddit": "PhD", "Author": "currac", "Date": 1497568403, "Score": 1, "Body": "Ya I'm having a similar experience found the best thing to do is no joke ring them and say \"I'll be in to you tomorrow/following morning for (trivial problem / sign order form/ chat ) oh and I also want to.go through chapter x  i just sent you (again) having issues cheers\" the minute she give any form of acknowledgement I hang up\"  9/10 it's corrected. But yes I agree with your comments this \"doesn't work here\" and no suggestions 🤣  but then again I wouldn't consider myself to be a great writter..... so ya in short harass its the only solution! YOU ARE NOT ALONE.......lol", "Permalink": "https://www.reddit.com/by_id/t3_6hhp99.json"}, "192": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1497577018, "Score": 1, "Body": "When I was applying it was really obvious who really actually wanted me and where my numbers looked good but I was a drop in the bucket. Go where you are wanted. ", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "193": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1497577706, "Score": 3, "Body": "Well, at the one that I want I am not just a drop in the bucket. The research institute has few PhD students and are outnumbered by the number of actual researchers so it's not a research group where they just need labour. I just want to make sure I am still in the \"race\". ", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "194": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497582738, "Score": 3, "Body": "Is there a deadline by when they're supposed to get back to you, or by when you need to tell your university about your decision? Because it totally makes sense to tell them by email that you have deadlines, it is after all a reasonable scenario that everyone faces. It's best to be honest and upfront about this sort of stuff now - if you end up joining their group, you'll need to do it often. ", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "195": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1497583283, "Score": 1, "Body": "They did not mention a timeline. At the beginning I emailed the project manager (she is from another country as from where the supervisor is) and she mentioned they plan to finish recruiting by the end of June.\n\nThe PhD is supposed to start Sep-Oct.\n\nFor the current university, my current supervisor emailed me and said that they will offer me the scholarship, and I am saying \"unofficial\" because the university has not emailed me yet the contract or an official confirmation.\n\nIf I email the prospective PhD should I mention I already have an offer but they are my first choice, and I would like a timeline to make sure that the current supervisor would find a replacement?\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "196": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1497584162, "Score": 3, "Body": "I'd basically just sit back and relax for now - you did what you had to, and the ball is in their court. You're also in a fairly good situation because you do have a guaranteed backup, which few people can claim. \n\nIf I were you, once the \"unofficial\" deadline (end June) passes, and if you don't hear back, you can send an email and let them know your situation - that you have another offer, would like to take this one if offered, and would like an answer soon because you/your professor need to plan ahead - it's a very reasonable request. \n\nThe delay could be for any number of reasons - professors can be super-busy for months and ignore emails. They usually come around to stuff like this once it becomes urgent i.e., near a deadline. There's no need to assume that they've let you go - in fact, if they did, they'd probably tell you soon to close your file. The fact that they haven't gotten back to you probably just means they're undecided, which is fine. \n\nOne thing you need a lot of for a PhD is patience, even at the risk of failure. Count this as practice. ", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "197": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1497584551, "Score": 1, "Body": "Thanks!\n\nIn his email he said something like \"ask your referees to send me the letters and after that we will schedule a meeting\", in my mind implying as soon as he gets them we will have a meeting but I guess that might not be the case :) \n\nI really do not want to drop out of the current offer I have too late and cause my current supervisor problems with getting another student, he has been really great.", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "198": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1497590240, "Score": 3, "Body": "I don't know if you will need a full undergrad in physics but you will need a lot of basic undergrad courses which I doubt you've taken. You'll definitely need the basic physics ones and then probably more maths depending on what was in your finance degree.\n\nResearch and publications will definitely be more important than raising a GPA but that's only if you're over the cut off. If you're not over the minimum then you'll need to raise your GPA too. \n\nNever ever take an unfunded PhD. It's not just about the stipend. You'll need consumables and equipment and to attend conferences, and grants and scholarships have this covered. It is also very much worth the practice to be applying to this kind of stuff and working out what it takes to win them.", "Permalink": "https://www.reddit.com/by_id/t3_6hkj4t.json"}, "199": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1497593464, "Score": 3, "Body": "I'm not sure you'd be able to do a masters without taking quite a few undergrad courses so hopefully that would raise it a bit. You would be able to do a masters and then do a PhD somewhere else but it wouldnt be transferring. It would be applying again. You will also normally be required to take the coursework section of the PhD even if you had a masters. They will just find different courses for you to take if you've done some of the normal ones for people in that program.", "Permalink": "https://www.reddit.com/by_id/t3_6hkj4t.json"}, "200": {"Subreddit": "PhD", "Author": "bunnysuitman", "Date": 1497599056, "Score": 1, "Body": "Change advisors (if at all possible). I resisted it for a long time...tried to make it work...then switched. Nothing is ever perfect but my new advisor is like rainbows raised to the power of puppies better...and a lot of it was what I saw as professionalism. What I have realized later was that it was actually about respect. Old advisor did not respect grad students as people...and the result was an extreme double standard of expectations for behavior and actions.", "Permalink": "https://www.reddit.com/by_id/t3_6hhp99.json"}, "201": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1497604800, "Score": 2, "Body": "Computer Science is a very broad field. Which research areas in computer science are you interested in? ", "Permalink": "https://www.reddit.com/by_id/t3_6hl027.json"}, "202": {"Subreddit": "PhD", "Author": "Godye_", "Date": 1497610929, "Score": 1, "Body": "Was thinking something on Business admin-applied computer science or Business Admin-management systems; \n\n\nOr what do u mean by research areas?", "Permalink": "https://www.reddit.com/by_id/t3_6hl027.json"}, "203": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1497611666, "Score": 1, "Body": "The other drops on their buckets might not be students. ", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "204": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1497624014, "Score": 1, "Body": "In that situation, I would try to come up with an appropriate question that would warrant a quick phone call with the foreseen supervisor. Not only would that provide you with the confirmation you seek, but it would also give you the opportunity to give you a little edge over the other candidates, since you would be able to personally demonstrate your enthusiasm. No guarantees, but it might just move you up in the application pile.", "Permalink": "https://www.reddit.com/by_id/t3_6hj5po.json"}, "205": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1497642372, "Score": 1, "Body": "That sounds like a good idea! Worries will never help, and given that you will have three published contributions soon, it shouldn't all take too long anyway. Because those reports have already passed peer review, there is not too much that your referees will be able to take away from that.", "Permalink": "https://www.reddit.com/by_id/t3_6h591e.json"}, "206": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1497667464, "Score": 4, "Body": "Universities have \"research ethics boards\" that dictate what type of research can be conducted by its employees. ", "Permalink": "https://www.reddit.com/by_id/t3_6hr16z.json"}, "207": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1497714927, "Score": 5, "Body": "I have no idea the answer to your question. But, keep in mind those two places have a huge disparity in cost of living. ", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "208": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1497715115, "Score": 5, "Body": "Which has a better funding package? ", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "209": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1497715485, "Score": 3, "Body": "What's ECE?", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "210": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1497721494, "Score": 6, "Body": "I chose my program based solely on location with no regrets.\n\nIt was between nice weather in California or shit weather in rural Pennsylvania.  Which one would make you more miserable?\n\nJust saying, even if it's not at the top of your list, location is something to take into consideration. ", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "211": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1497722545, "Score": 1, "Body": "I also though penn state would have been an amazing choice for me if it'd had been located literally anywhere else. ", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "212": {"Subreddit": "PhD", "Author": "TrappedGrad", "Date": 1497722869, "Score": 1, "Body": "I wish I'd done this.", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "213": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1497728670, "Score": 2, "Body": "Electrical and Computer Engineering", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "214": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1497728696, "Score": 5, "Body": "What are you studying within ECE? That's a pretty broad field.", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "215": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497730386, "Score": 3, "Body": "\"Thankyou social scientist for exploring the political turmoil in 1920's poland that lead to socioeconomic tensions in working class children\" Said no one ever. Because people don't care about most people's research. Let be honest some research is purely self indulgent and most has no real world impact. However a doctor who replaces your heart when it fails deserves thanks", "Permalink": "https://www.reddit.com/by_id/t3_6h17kw.json"}, "216": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1497739801, "Score": 1, "Body": "GNU GPL or BSD depending on your preference, I'll probably put my code up as BSD when I'm done", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "217": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1497767270, "Score": 1, "Body": "These are all good questions but you should ask your potential supervisor about all of them, none of us can know what your specific program will be like.", "Permalink": "https://www.reddit.com/by_id/t3_6hnnoc.json"}, "218": {"Subreddit": "PhD", "Author": "Grosgos", "Date": 1497778575, "Score": 1, "Body": "Well, I have not even applied for a place as of yet..... So I don't have one. \nOr of you mean the lady who would take me on to work for her, she is the one who asks me how many hours I want to do, and how much I want to be paid. So I can not really ask her. XD", "Permalink": "https://www.reddit.com/by_id/t3_6hnnoc.json"}, "219": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1497794836, "Score": 1, "Body": "PhD programmes are very specialized, there are still many areas on the borderline of business administration and computer science, including business process management, requirement engineering, and data analytics. I would advise you to take a closer look into research papers in several of such areas, and then decide in which of those you want to work (or even better: decide which open problem in that area you want to work). Another good thing to do is to get an overview of which research groups are the world leading ones in the research area of your interest. In the business process management (bpm) area for example, world leading groups are at Queensland University of Technology in Brisbane Australia (the group of prof. Marcello la Rosa and prof. Arthur ter Hostede), Eindhoven University of Technology in Eindhoven Netherlands (the group of prof. Wil van der Aalst), University of Tartu in Tartu Estonia (prof. Marlon Dumas), and at the Hasso Plattner Institute in Potsdam Germany (prof. Mathias Weske).", "Permalink": "https://www.reddit.com/by_id/t3_6hl027.json"}, "220": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1497819226, "Score": 1, "Body": "yup, you can, but that means cancelled visa and a new application process..", "Permalink": "https://www.reddit.com/by_id/t3_6ewjl5.json"}, "221": {"Subreddit": "PhD", "Author": "sadifj", "Date": 1497834705, "Score": 1, "Body": "But there are no legal restrictions on publishing something like this?  What if you are researching something ethical and happen to stumble upon something that would significantly contribute to some military weapons system.  For example, maybe you come across something that would make it significantly easier to produce to nuclear weapons.\n\nWhat would one generally do in this situation? (Not that I am actually in this situation)", "Permalink": "https://www.reddit.com/by_id/t3_6hr16z.json"}, "222": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1497880459, "Score": 2, "Body": "Me too! Please help! ", "Permalink": "https://www.reddit.com/by_id/t3_6i6h5k.json"}, "223": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1497883099, "Score": 1, "Body": "Does any department of your university run SPSS workshops? ", "Permalink": "https://www.reddit.com/by_id/t3_6i6h5k.json"}, "224": {"Subreddit": "PhD", "Author": "navayan", "Date": 1497883175, "Score": 1, "Body": "Will check.", "Permalink": "https://www.reddit.com/by_id/t3_6i6h5k.json"}, "225": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1497886805, "Score": 1, "Body": "What are your goals when you are done?\n  \nAcademia is the reason most people do a PhD... if you have no interest in that, what will you use your PhD for? Put another way: why do you need a PhD?\n  \nAre there specific industry jobs that you think your PhD will aid you? In academia, you are either research or teaching track. If you really like research, you need to give it your full attention if you want to have a shot at a research position. Doing a PhD part-time ensures you will only ever be able to achieve teaching objectives.\n  \nAt the end of the day, before you start a PhD, you need to figure out how you will use it.", "Permalink": "https://www.reddit.com/by_id/t3_6i6abc.json"}, "226": {"Subreddit": "PhD", "Author": "sarah_morsink", "Date": 1497892146, "Score": 2, "Body": "Basic factor analyses (FA)can be done with spss, however for more detailed analyses I would recommend 'R'. As 'SEM' is a collection of analyses, including FA, the same argument applies. ", "Permalink": "https://www.reddit.com/by_id/t3_6i6h5k.json"}, "227": {"Subreddit": "PhD", "Author": "TheBlondeWithTheTats", "Date": 1497925593, "Score": 5, "Body": "You sound like a great PhD candidate! When applying for programs, look for programs that have a focus on your specialties. GPA are obviously important, but often times admission committees are looking for someone with the best fit. Look at the faculty profiles on the school website. Look for faculty that share similar interests and bring that up in your personal statement on how this program is a good fit for you. \n\nI applied to 5 PhD programs and was only accepted into 1 (I'm currently enrolled in it and I am on my second year). It's funny because the school I was accepted too is way more competitive and prestigious than the schools that rejected me. The reasoning for that is because this program's focus is more in line with my research goals. \n\nGood luck! :)", "Permalink": "https://www.reddit.com/by_id/t3_6i5bza.json"}, "228": {"Subreddit": "PhD", "Author": "TheBlondeWithTheTats", "Date": 1497926202, "Score": 3, "Body": "Purdue has an amazing program for engineering. It's very nationally known. The price of living is also extremely cheap in that area (I'm originally from Indiana). Purdue is definitely a better school, but UC San Diego is a probably a better location. California is a lot \"funner\" than Indiana because of the beach life, but the price of living is incredibly high in California. So depending on your financial situation, that might be hard. \n\nIndiana is beautiful in the fall, spring, and summer (especially fall), but the winters are rough during December-February. San Diego is pretty hot all year around (like extremely hot, I was there for 2 weeks in July and I was was over 100 degrees almost then entire time). \n\nCongrats though! :)", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "229": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1497955446, "Score": 3, "Body": "Hi,\n\nI'm not sure- but why don't you look through your Mendeley/Zotero etc and come up with a list of journals that you might like to pitch to and check their impact factors etc. It helps to have a list ready too for your other papers or in case you have a rejection.\n\nRe: the size of your qualitative study- is this (primarily) why you'd prefer a journal that isn't high impact? I don't think 'size' matters quite as much in a qualitative study if you're able to show how rich the data is and how it allows you to add to the discussion/theory. I think if you're open to learning and have solid feedback, you may even want to start with a journal that's not necessary low impact? \n\nWhile it isn't specific to adults with disabilities, you may want to look at the following qualitative/public health journals:\n*Qualitative Health Research Journal (IF 1.403),\n*Qualitative Research Journal (IF 1.671), \n*Social Science and Medicine (IF 2.733)\n*Global Public Health (IF 1.205)\n*PLOS One (IF 3.234)\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_6ibgaj.json"}, "230": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1497970699, "Score": 1, "Body": "Check out Laerd Statistics for factor analysis.", "Permalink": "https://www.reddit.com/by_id/t3_6i6h5k.json"}, "231": {"Subreddit": "PhD", "Author": "aending", "Date": 1498015867, "Score": 2, "Body": "Keep pushing through. You got this. Halfway through thesis is so close to done, and when it's done you can put the whole fucking department on a spam filter and move on with your life. ", "Permalink": "https://www.reddit.com/by_id/t3_6iia98.json"}, "232": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1498019259, "Score": 1, "Body": "Thanks man. Good plan :)", "Permalink": "https://www.reddit.com/by_id/t3_6iia98.json"}, "233": {"Subreddit": "PhD", "Author": "procras-tastic", "Date": 1498051272, "Score": 1, "Body": "Holy fuck, I'm an academic (supervise a couple of grad students too) and this is NOT OK. ", "Permalink": "https://www.reddit.com/by_id/t3_6iia98.json"}, "234": {"Subreddit": "PhD", "Author": "MrJoshiko", "Date": 1498084305, "Score": 4, "Body": "I used powerpoint in my masters (please don't tell anyone)", "Permalink": "https://www.reddit.com/by_id/t3_6iop47.json"}, "235": {"Subreddit": "PhD", "Author": "mowkiemowkie", "Date": 1498084946, "Score": 3, "Body": "The pictures you showed can totally be done in PowerPoint. You then have to save your presentation as a pdf or as a png picture and you can chose which slide to save. In some tab (I think the second one) on the left you have a button named Layout, you can there set the size of your PowerPoint slides and make it the size you want for your picture (eg if you want a square picture). \n\nIf you want to use a proper vector drawing software, you can use InkScape (open-source equivalent to Illustrator), but you may need more time learning how to use it than simply making your drawings through PowerPoint. \n\nIf you are writing your thesis with LaTeX, you can use LaTeX Draw, which will allow you to draw simple vector images (lines, arrows, circles, rectangles, etc. You'll need to be creative to do complicated stuff. I drew an industrial printing press once and it took me forever, you can do it but it's long) and write notes with the LaTeX font and simple LaTeX commands (you can't add packages but the math mode is working). It integrates splendidly smoothly into a LaTeX document. ", "Permalink": "https://www.reddit.com/by_id/t3_6iop47.json"}, "236": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1498094760, "Score": 3, "Body": "Things *will* be okay. It's hard, I know. When things start feeling like it's piling up - take a breather. Everyone needs a break, even PhD students! You made it this far, so you're clearly capable of finishing successfully. ", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "237": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1498106001, "Score": 9, "Body": "Remember that you could actually give up and everything would still be ok, you could walk away now and find a job and start a new life. Then ask yourself if you really want that. I often feel like I should walk away, but when I start to think about what that might look like I decide I'd rather stay. ", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "238": {"Subreddit": "PhD", "Author": "drarch", "Date": 1498109652, "Score": 2, "Body": "Adobe illustrator is the pro choice for vector artwork, which is great for these kinds of diagrams. There are a ton of free tutorials out there that will make learning it easy (all you really need is the pen tool and maybe livepaint). It can be expensive if purchased on your own, but check your university first. I can get it for $10/yr on our online software store for students because my university's IT department buys it in bulk to install throughout campus. ", "Permalink": "https://www.reddit.com/by_id/t3_6iop47.json"}, "239": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1498120031, "Score": 6, "Body": "Last time I was in a really good place with my PhD, I spent some time writing down all of the reasons that I started one. Whenever I'm feeling crappy about it and am wishing that I'd done literally anything else, I read over what happy-PhD-me wrote and it helps. I also write down my achievements for the same purpose.\n\nIt also doesn't hurt to talk to someone about how you're feeling, whether it's a friend, a family member, a counselor, your advisors, whatever. They might not understand exactly what you're going through unless they're also doing/have done a PhD, but they will more than likely be able to remind you how much you've achieved and how well you're still doing :)\n\nFocus on what you have done and why you're doing it, celebrate even the smallest of victories, and good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "240": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1498136892, "Score": 3, "Body": "This may not be super helpful or applicable to you but I posted this picture at my lab desk next to my computer monitor. It's actually helped me keep everything do day to day in perspective. It reminds me of how lucky I am to be in the position I'm in. \n\nhttps://m.imgur.com/WPE72nz\n", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "241": {"Subreddit": "PhD", "Author": "charika-bo", "Date": 1498150922, "Score": 2, "Body": "I would suggest consider ...\n1) the topic you are interested first then search for supervisor(s) and university. You can email them (potential supervisors) saying who you are and that you are interested in doing PhD in this particular topic + can you propose them to be your supervisor if you apply for PhD there? And see how they response. \n2) Also, browse university/department (where you would like to do PhD)'s research page or research interests. Normally they will state the research areas that the school is working on + occasionally state projects that they are looking for PhD students.   \n\nAll the best and good luck ", "Permalink": "https://www.reddit.com/by_id/t3_6it040.json"}, "242": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1498163242, "Score": 4, "Body": "Although it sounds like you would indeed be able to successfully defend on all five papers, selecting just the three would not only save you some time in preparation and may make your feel more confident, it will also allow you to tell a more coherent story and go a bit more into the details of your speciality.", "Permalink": "https://www.reddit.com/by_id/t3_6iw5qw.json"}, "243": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498164782, "Score": 1, "Body": "Thanks for your reply, that's almost exactly what I was thinking. ", "Permalink": "https://www.reddit.com/by_id/t3_6iw5qw.json"}, "244": {"Subreddit": "PhD", "Author": "PuddinTater69", "Date": 1498177883, "Score": 3, "Body": "This was really helpful to me. Applying to grad school within a year and a half and have been worrying about coming to the realization that all that I've been dreaming of won't be for me and not being able to escape. Both the knowledge and threat of being able to walk out at any moment is very comforting to me. Thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "245": {"Subreddit": "PhD", "Author": "Hypocaffeinic", "Date": 1498180742, "Score": 1, "Body": "Ugh. I feel your troubles; I have similar issues with my own advisors. Not such length delays, but absent-minded, and when I do receive feedback on papers and thesis chapters they too focus on the minutiae of grammar and syntax and not at all upon the content and direction.\n\nHow far through are you? If the behaviour and style seems entrenched, and you are not - as in you are not so far gone through the doctorate that you cannot feasibly change supervision - then find an alternative. \n\nI am at the pointy end now and so just grinding on through, but given that I feel I have self-directed my own research entirely and received direction only in superficial editorial review of papers and gross directional advice (\"write your Confirmation document now; now focus on your introduction chapter\") I wish with every fibre of my being and every character of my thesis that I had bitten the bullet and sought new supervision when issues first arose.\n\nIt won't get better and in this situation the student is massively disempowered in the relationship and as you're experiencing you cannot change their approach and style much if at all. Evacuate and relocate, stat!", "Permalink": "https://www.reddit.com/by_id/t3_6hhp99.json"}, "246": {"Subreddit": "PhD", "Author": "Hypocaffeinic", "Date": 1498180850, "Score": 2, "Body": "Is it just a feeling of anticlimax? I imagine I'll feel a little numb too, but there's beer for that..! \n\nYou should be nearly done on your edits now, if not resubmitted already, so congratubloodylations and go celebrate, Doctor! :D", "Permalink": "https://www.reddit.com/by_id/t3_6gag5x.json"}, "247": {"Subreddit": "PhD", "Author": "Hypocaffeinic", "Date": 1498180978, "Score": 2, "Body": "Agreed. Wholly understand the temptation but best to keep the focus clean, clear, and coherent; if you have enough, why muddy the waters by adding extra that doesn't, well, add anything extra to your core message? You already have recognition for doing that extra work in that they are submitted / accepted. Well done! :D", "Permalink": "https://www.reddit.com/by_id/t3_6iw5qw.json"}, "248": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1498194030, "Score": 2, "Body": "Right now, I would just work on getting into the most prestigious schools that you can get into.  After this, you can spend time researching professors, examining their research, and determining which might be the best fit for you.  It's a lot simpler to consider a few schools instead of considering all of them.", "Permalink": "https://www.reddit.com/by_id/t3_6it040.json"}, "249": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1498194590, "Score": 5, "Body": "Be kind to yourself.  Treat yourself to a fancy meal.  Take a weekend off \"because you're sick\".  Go on a vacation.  Make friends with people who aren't affiliated with the university at all.  Go excercise.  Get a massage.  Stand at high vantage point by yourself and look at the world.  \n\nSeriously, stop working so hard, stop caring about what your advisors think about you, what your peers think about you, whether you're being a \"good\" student, whether you are being an active member of the department, and whether your research matters.  If anything you do isn't moving you towards finishing the PhD then it better be 1) making you money or 2) making you happy.  If not, then you are wasting your time.  Stop wasting your time.  Your time is yours, not anyone else's.  On this note, you should also stop mentoring this other student.  It's not good for you.\n", "Permalink": "https://www.reddit.com/by_id/t3_6iq8zi.json"}, "250": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1498195114, "Score": 1, "Body": "Use pomodoros to stay on task.  Basically, take time to PLAN what you are going to do for the next 15 minutes, hour, 8 hours.  I don't think it's really necessary to plan out further than for today's time.  Work on only one paper/topic/task at a time.  Work only 8-10 hours a day.  Sleep a lot, excercise, eat three healthy meals a day, and don't drink during the week.  Take evenings, Saturdays and Sundays off.  Without supervision, people can tend to waste a lot of time.  40 hours of solid work per week means you are probably being more productive than many of your peers.", "Permalink": "https://www.reddit.com/by_id/t3_6gba5r.json"}, "251": {"Subreddit": "PhD", "Author": "Cherubin0", "Date": 1498207078, "Score": 1, "Body": "I would just use CC-BY, because dishonest people will steal it and just obscure that they took it from you. But non commercial and derivatives restriction will just punish the honest people. Also note that non commercial has all kind of problems, for example every webpage that has an advertisement (like reddit) on it would not be allowed to post it (this is a gray area that causes lot of confusion).", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "252": {"Subreddit": "PhD", "Author": "blufox", "Date": 1498214207, "Score": 1, "Body": "Hmm, I understand your reasoning. Unfortunately, I had only a few days to make that choice, and chose CC BY-NC-SA.", "Permalink": "https://www.reddit.com/by_id/t3_6gur2b.json"}, "253": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1498233783, "Score": 5, "Body": "The thesis technically doesn't need to be as high quality as published papers, though it really does help. Have you made any publications?\n\nI would approach your supervisor, thank her for the feedback, and ask for her to go through some of the text showing you where and how you can improve. \n\nUltimately, it needs to be well written. But long winded explanations aren't going to fail you. If the research is really is good and valid, and the writing accurately depicts the research then the worst you can get is pass with corrections (minor or major).", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "254": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498235663, "Score": 2, "Body": "1 so far but what I wrote got rewritten by my supervisor. Thank you for the advice and being honest. I am trying hard to make the writing as good as it can be, I'm just worried that it's going to be a major factor in my overall \"grade\" so to speak. \n\nCould clarifying in my defence help? I'm much better at presenting so I was hoping that I could make up for it somewhat. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "255": {"Subreddit": "PhD", "Author": "beauterson", "Date": 1498236614, "Score": 1, "Body": "In the same boat (though I'm 18 months in). 'fluffy' is used a lot. I know when my supervisors corrects things they track changes (in Microsoft Word)  I've been spending a lot of time going through these changes and establishing what I need to do to write more concisely and technically. Could be worth speaking to your supervisor about. Get her to correct a portion of your thesis and build on that. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "256": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1498244502, "Score": 7, "Body": "Ask your GP about beta blockers for anxiety.\n\nOther than that practice as much as possible. Hydrate, sugar, exercise, general good prep beforehand all help. Really drill your presentation so it's automatic. Deep breathing exercises trick your nervous system into calming down. Distraction techniques might work. Really though I think it's mostly practice so you realise there's nothing to be anxious about.", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "257": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498245475, "Score": 1, "Body": "I've done the same thing. My second supervisor gives constructive criticism and points out where things look grammatically incorrect. Whereas my actual supervisor just likes to tear it to shreds without giving any useful feedback. I ask questions, and instead of answering them she bounces back with something sarcastic.\n\nThe good thing is that I'm nearly done so I don't have to put up with it for much longer. The only reason why I didn't change supervisor is because the other staff members there don't do anything related to my topic. So I've kind of just stuck it out because I had to.", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "258": {"Subreddit": "PhD", "Author": "bigsquirrel55", "Date": 1498245501, "Score": 1, "Body": "To shreds you say?", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "259": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498245748, "Score": 1, "Body": "\"A snake, am I?\" ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "260": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1498247467, "Score": 6, "Body": "In my experience, the very presentation itself mostly determines how it can be delivered and will be experienced by both presenter and audience. There is probably a lot more to it, but a few simple aspects of the PowerPoint presentation that accompanies my talks may help you out a bit. I restrict and determine the amount of slides beforehand to, say, 6 slides for 10 minutes, excluding title slide and acknowledgements/questions slide. Secondly, I do not necessarily present everything I feel there is to say about a topic or study, but select the most appealing story line through intro/materials &amp;methods/results/discussion/conclusions. I keep my slides simple (left a few bullit points forming a concise and clear succession that I can verbally elaborate on, and right a figure) and discuss them in as little words necessary to convey the message clearly. Although this does mean I spend quite a bit of time evaluating the text and accompanying figures beforehand, since I have about 50% less slides than I would have had in the past, it really doesn't take that much extra time. Despite actively focusing on speaking slowly during the presentation, I still try to \"surprise\" the audience by finishing after 8 minutes instead of 10, or 26 instead of 30. Most people get a bit annoyed with long talks, especially at conferences, but nobody minds a refreshingly short talk. Surely, I may expect a bit more questions than I would have received when having gone over time, but there is one more thing up my sleeve. After the last slide, I place a \"summary slide\", only containing the four most important figures/graphs of the presentation, that I only click forward to if a relevant question is asked.  If those figures are selected with care, chances are there is no need for manually clicking back through the presentation during questions, which can be a bit frustrating. Furthermore, those figures should provide enough material to discuss a specific aspect for a bit longer if you need to fill some time. A shorter presentation focused mostly on clarity can be prepared beforehand in all comfort, and may provide sufficient support to deliver a relatively relaxed presentation that is enjoyable for all involved.", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "261": {"Subreddit": "PhD", "Author": "ViridianVertigo", "Date": 1498252611, "Score": 3, "Body": "Early on when I presented I would get the same sorta \"black out/blur\" you are talking about. For the most part it's stopped as I've gotten better, and more confident, at presenting.\n\nFor nerves I do a couple things in prep.  Once I have finished my presentation slides I find an empty room thats a similar size (or better snag the presentation room while it's empty). I set up my slides and I give the presentation from start to finish to the empty room. When I do this I don't stop if I make a mistake, because it's important to go through all of it together. It is cringe inducing but saying it outloud, but it gives me a chance to practice tone and projection which I tend to be inconsistent on. I'll practice maybe three separate times like this in the lead up to the presentation. This lets me organise what I want to say and lets me sort out timing for how much needs to be presented in the time limit. Even better this allows me to adapt on what I'm saying as I'm speaking\n\nNext thing is at the very start of the presentation. I let myself be nervous and think this is my normal right now. This sounds small but it's huge for me, because it basically allows me to focus on the presentation because the nerves are normal so there is no reason to not concentrate on my content.\n\nOut of curiosity do you get the same level of nerves when talking about your research over coffee/tea/beverage of choice with a friend or colleague?", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "262": {"Subreddit": "PhD", "Author": "extra_cellular", "Date": 1498256616, "Score": 1, "Body": "Thank you so much for your reply! \nNope, I don't feel nervous when I talk about my research with a friend or colleague. I also have a great relationship with my supervisor, so don't even feel nervous about presenting new ideas to them and so on... it's just when there's people I don't know or larger groups, I hope it gets better with practice and experience! ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "263": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1498257263, "Score": 3, "Body": "Yeah, in your defence you can clarify those things. They may ask the clarifications be added in corrections, but that's to be expected with any viva.\n\nAlso, the beauty of the PhD is that there is no grade. Pass or fail. And from the sounds of things, you're unlikely to fail! Writing style isn't a reason to fail someone, it's just going to mean you'll have a few weeks more of corrections which really isn't the end of the world. All the best, friend! ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "264": {"Subreddit": "PhD", "Author": "ViridianVertigo", "Date": 1498258538, "Score": 2, "Body": "Glad to help! It should get better with practice and experience. The more you do it, the more you develop your personal presentation style, which feels more natural and boosts confidence. \n\nYou can also ask your supervisor to sit in on a practice run to get feedback on how you're doing too.\n\n ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "265": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498262019, "Score": 2, "Body": "That's good then. And, I'm fine with making corrections so that doesn't bother me. Cheers for your help! ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "266": {"Subreddit": "PhD", "Author": "otherminds", "Date": 1498268134, "Score": 3, "Body": "Take. It. Slow. \n\nRemember to breath and just have a conversation with your audience. ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "267": {"Subreddit": "PhD", "Author": "mtb_addict", "Date": 1498277199, "Score": 3, "Body": "Hi there, I like to read On Writing Well yearly to calibrate my writing (lhttps://www.amazon.ca/Writing-Well-Classic-Guide-Nonfiction/dp/0060891548). It's a writing book that doesn't feel like a writing book. \n\nThat and of course elements of style... But that one feels like a writing book", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "268": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498287965, "Score": 2, "Body": "Judging from your comment history, you are a native English speaker. A lot of researchers - including myself - are not, yet they are still publishing in English. That's mostly accepted given that the papers are readable. I doubt that your writing style is worse than that of most non-native scientific English writers.", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "269": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498288615, "Score": 2, "Body": "If you need to draw 3D structures you could use SketchUp which is really easy to learn.", "Permalink": "https://www.reddit.com/by_id/t3_6iop47.json"}, "270": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1498298723, "Score": 1, "Body": "&gt; My second supervisor gives constructive criticism and points out where things look grammatically incorrect. Whereas my actual supervisor just likes to tear it to shreds without giving any useful feedback.\n\nHave you considered asking a friend or colleague who is good at this type of writing to do a first edit of one of your chapters just for brevity and style?  Maybe they could help you identify patterns or habits which you could tackle more specifically.", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "271": {"Subreddit": "PhD", "Author": "bigsquirrel55", "Date": 1498298730, "Score": 1, "Body": "To shreds you say?", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "272": {"Subreddit": "PhD", "Author": "Kagemand", "Date": 1498309869, "Score": 4, "Body": "Yep, give beta blockers a try. It won't kill your anxiety in the days up to your presentation, but it will make you calmer during the presentation and help you get a better experience. This is essential as a good experience will help lessening your anxiety for future presentations. ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "273": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1498320559, "Score": 2, "Body": "If you want to give us a writing sample (just like a paragraph), I'm sure we can all look it over for you and give peer-to-peer feedback! I know at least I'd be willing to. \n\n\nI also suggest grammarly to everyone. It can check for brevity and word choice. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "274": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498320866, "Score": 1, "Body": "Thanks for the link, I'll check it out! ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "275": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498320953, "Score": 1, "Body": "That could be very useful, thank you. Shall I message you a paragraph? Or, what's the best approach for this? \n\nI've heard of grammarly, but I haven't really looked into it. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "276": {"Subreddit": "PhD", "Author": "ihateusernames28", "Date": 1498320971, "Score": 1, "Body": "I suffer from the exact same thing.\n\nI found for me what works best is practicing until the cows come home... I know you dont want to sound over rehearsed but it honestly makes me more confident, knowing I know exactly what I should and shouldnt say for every slide and it helps lower my anxiety before I present. Yes its time consuming, but its helped me at conferences.\n\nIf your throat gets dry, have water on hand. \n\nIf youre nervous about questions, present to friends and your supervisor and ask them to literally bombard you with questions.\n\ndont drink coffee. it makes the anxiety worse - before my defense it was giving me panic attacks so I quit cold turkey. \n\nSleep well the night before\n\nIve found meditation has helped me tremendously with my anxiety. \n\nalso, Im unsure of where youre from, but theres a herbal treatment you could try... I thought it was a placebo effect but it really helps me... you can buy it at health food stores I believe.. its called passion flower and its useful for insomnia and nervousness (both of which I suffer from). \n\nTry presenting infront of people and in situations that make you uncomfortable before hand too..\n\nIve  also considered joining a public speaking improvement group, maybe this would be helpful for you too??", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "277": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1498325895, "Score": 2, "Body": "You can message me if you want to keep it private or post it here if you want multiple people's input :)", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "278": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1498327588, "Score": 2, "Body": "Oh absolutely, this has been on my mind since I had to modify my first Fortran code with all the GoTo's. Coding paradigms have changed dramatically, and languages come with efficient data structures that make for much more readable code. \n\nComputational research should be taking advantage of these, and for that, at least the most important legacy codes need to be updated. It is a one-time investment with long-term returns. ", "Permalink": "https://www.reddit.com/by_id/t3_6j8ylx.json"}, "279": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498376157, "Score": 3, "Body": "So, you gonna write a systematic review, thus I assume you have read a bunch of papers to cite and discuss in your review? Why not submit to one of the journals where those papers were published in?", "Permalink": "https://www.reddit.com/by_id/t3_6jcdag.json"}, "280": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1498413119, "Score": 3, "Body": "Coming from a non computer science field with a lot of legacy code around the place.\n\nYou get excited grad students who want to work discovering new things, rewriting legacy code is something that most people find very boring and you'd struggle to find new students who would just take that job, plus when it comes to funding, no funding agency is going to fund a studentship/postdoc just to rewrite old code, they want people working on new stuff. I think that is what the professors mean when they say that its political. In the long term, rewriting everything might save a lot of time, but its really boring work that no one wants to do or pay for someone else to do.\n\nEDIT: plus, in my country at least, PhD studentships have a limited duration, and students need to be able to get some results to put in their thesis. Spending one or two years, learning the code to just rewrite it will not really give students any new results to put in their theses, not to mention that it will take that one or two years for them to be competent enough to actually be able to improve said code.\n", "Permalink": "https://www.reddit.com/by_id/t3_6j8ylx.json"}, "281": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498417605, "Score": 3, "Body": "&gt; I thought research is all about non-political collaboration?\n\nLMAO", "Permalink": "https://www.reddit.com/by_id/t3_6j8ylx.json"}, "282": {"Subreddit": "PhD", "Author": "inafewminutess", "Date": 1498471554, "Score": 8, "Body": "If your lit review looks too much like a textbook, you probably don't make clear how your research is different/what it adds. Even though to you this might be obvious, contrasting clearly and explicitly helps readers position your research within the literature. ", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "283": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1498472814, "Score": 4, "Body": "Is it possible that you've written too generally about the topic? My supervisor's advice for a literature review is to briefly introduce the overall topic, and then mention the specific literature that you've found gaps in that you're going to improve upon. It's more supposed to be synthesizing the literature to show where your research fits in, rather than overviewing everything that's ever been done. Good luck :)", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "284": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498486940, "Score": 1, "Body": "Okay :) sorry for the late reply. I will message you a paragraph, thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "285": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498488409, "Score": 2, "Body": "Sorry for the double post, but I just signed up to the free version of Grammarly and I like it a lot so far!", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "286": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1498490878, "Score": 1, "Body": "Yeah, it's pretty great!", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "287": {"Subreddit": "PhD", "Author": "sushiking365", "Date": 1498492980, "Score": 1, "Body": "I guess that does make sense. Although the reason I did make it a little general as I was trying to explain the process involved. My research did not involve adding to that process, but was to prove another compound/drug could also cause that process to happen.\n\nI could try and relate a little more to my work.\n\nThanks for the insight !", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "288": {"Subreddit": "PhD", "Author": "sushiking365", "Date": 1498493057, "Score": 2, "Body": " Hmm, interesting way of putting it. I could try and restructure it and add as you mentioned. Hopefully it works. \n\nThanks !", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "289": {"Subreddit": "PhD", "Author": "inafewminutess", "Date": 1498494339, "Score": 1, "Body": "Probably you're better off doing that in its own section, and keeping it away from the literature section. In one of my recent papers I have a section which basically restates another paper, as it's fundamental to my contribution. However, since the contribution doesn't lie in this section I have tried to keep it as brief as possible, and referred to the paper wherever it wasn't needed to understand mine.  ", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "290": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1498497182, "Score": 2, "Body": "There are \"power poses\" you can try before a presentation, which reduce your stress hormones and increase testosterone. There is still debate and conflicting science on whether these poses actually help but I know a lot of people use them and it makes a huge difference for them. \nBascially, if you're able to find 5 solid minutes to do the Wonder Woman pose (feet at about shoulder width, hands on hips, chest out, and breathing deeply - which in itself is a good practice to get into anyway) right before a presentation, you may find it helps you feel more confident in what you're saying and doing. I guess for me, public speaking is mostly about just appearing confident in what you're saying. I'm interested in this method if anyone thinks this could help the OP. ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "291": {"Subreddit": "PhD", "Author": "socim8", "Date": 1498512845, "Score": 1, "Body": "I would add it maybe too much summary/description and not enough building on an argument/analyzing. Check out this blogpost: http://www.raulpacheco.org/2017/05/distinguishing-between-description-and-analysis-in-academic-writing/", "Permalink": "https://www.reddit.com/by_id/t3_6jjy17.json"}, "292": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1498512906, "Score": 1, "Body": "Does your local library have a  graduate research writing help/center? These are the best imo. Also, if you suffer from dyslexia or ADHD like some of my students (ok, maybe me too), then getting medication helps a lot with writing style....or just find that horrid professor you had that was such a stickler on writing styles and ask them if they can help.", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "293": {"Subreddit": "PhD", "Author": "slimwheels00", "Date": 1498535787, "Score": 2, "Body": "Great reply by ViridianVertigo. I'll add a few points along the same lines. \n\n1) Don't try to memorize your talk word for word. A lot of the stress comes from trying to anticipate exactly what you're supposed to say next, and what you may have missed. \n\n2) Break up your presentation into blocks of points you'd like to get across. It's easier to remember themes (that can be triggered by visual cues) than entire paragraphs of information. The most famous speakers use this technique (this is how some people tend to be able to talk for hours - it's not memorization, it's simply remembering themes). \n\n3) Try to structure your presentation as a story that develops as you're going along, with a clear introduction, climax, and conclusion. Also, whenever possible use short stories as examples throughout your presentation. Stories are easier to remember (both for you, and the listener) and relate to.\n\n4) Use visual aids whenever possible, but make sure it doesn't distract from your presentation. If someone has to listen to you and read full blocks of text on a slide at the same time, you're going to lose them. \n\n5) Practice the speech out loud at least 3 times in its entirety, and time yourself. I've given a 7 hour talk, but first spent a whole week practicing every day before that. By the time I was presenting, I already had 30 hours of experience giving the talk :). Made it a much more relaxed experience.\n\n6) This one is going to sound silly. Right before the talk, find a private room where no-one can hear you, and scream as loud as you can while pounding your chest. If it helps, say words of affirmation like \"I am Doctor Extra_Cellular, and I will wow you with my knowledge of cells!!\" I know a few speakers that do this, and I've used this technique to pump myself up before a big talk or meeting. It helps get the blood flowing, and makes you feel a bit more confident right away. \n\nThere's plenty of other things you can do to lose the nerves, but this is a good start. Feel free to PM me if you have questions. ", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "294": {"Subreddit": "PhD", "Author": "extra_cellular", "Date": 1498543618, "Score": 1, "Body": "Thank you so much for this!!!", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "295": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1498562794, "Score": 4, "Body": "It's hard. I've got three. ", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "296": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1498574390, "Score": 3, "Body": "I have had a medical condition pretty much my whole life and I am now half way through a 3 year PhD. I don't have any issues with my supervisors with this as they've been quite supportive for me but I do find it ridiculously frustrating when I can't get anything done.\n\nI don't know if this is possible in your country but this is what I would suggest in Australia. Here you can go to the health centre on campus and have a meeting with a health and disability councillor who will look at your specific needs and issues. In conjunction with your doctor, a \"medical action plan\" can then be written up to give you allowances for your medical condition. This could be anything from \"cannot work more than 4 hours a day\" to \"must have a parking space near the entrance to x building\" to \"needs a chair with arm rests\". This can also include certain meetings or a third party in meetings if mental health is involved. After this action plan has been approved (by medical professionals, not your head of department or anyone) then it must be followed by your supervisors and your department. Also once it's on file it's a good document to have if your good standing status was to be called into question. Is something like this possible at your university?", "Permalink": "https://www.reddit.com/by_id/t3_6jsru9.json"}, "297": {"Subreddit": "PhD", "Author": "Bogizley", "Date": 1498584218, "Score": 3, "Body": "Were they born while you were doing the PhD? ", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "298": {"Subreddit": "PhD", "Author": "LolaCampari", "Date": 1498585129, "Score": 2, "Body": "Welcome to your third year. We all feel like this. Make sure you do your work BUT make time for fun things as well - it's really enticing to keep working allll the time, but that is the one way to get sick and a burn out. Welcome to chat to me about this feeling anytime if you need! ", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "299": {"Subreddit": "PhD", "Author": "extra_cellular", "Date": 1498585785, "Score": 1, "Body": "I'll definitely try this - it's worth a go! Thank you :)", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "300": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1498585821, "Score": 3, "Body": "All 3. One boy and then twins a year and a half later. ", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "301": {"Subreddit": "PhD", "Author": "Bogizley", "Date": 1498585907, "Score": 5, "Body": "Wow!! So you might say it's difficult but doable?? I'm considering this at the moment and don't have much time to decide.", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "302": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1498586963, "Score": 6, "Body": "Difficult but doable. Everyone's experience in grad school is unique. You just have to accept the fact that you can't compare your progress to other people. You may not graduate as fast as some of your peers but that's okay. Your path is your path. ", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "303": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1498587276, "Score": 2, "Body": "I would go right to student services.  If you have documentation of a medical condition and your supervisor is not allowing you appropriate work modifications, there are probably legal ramifications to this.", "Permalink": "https://www.reddit.com/by_id/t3_6jsru9.json"}, "304": {"Subreddit": "PhD", "Author": "Imagine_a_name", "Date": 1498587437, "Score": 2, "Body": "Do you know how short it is going to be? It might vary depending on fields. Anyway, I am in Astrophysics. I have appeared for two phone interviews (one was supposed to be video but it wasn't very clear so we did audio only) and several video interviews. I was asked in advance by some of them to send them a presentation file on my Masters project (the latest for me) and was told that I will be given 10-15 minutes to speak about it.\n\nIn general, they want to know about your motivation and interest other than your knowledge/experience. So, probably the first few questions would be like \"Why do you want to go for a PhD?\", \"Why did you choose this field/topic/university/country?\" etc. Mostly, trying to see if you are doing it only because you couldn't find another job. If that is so, it will be a deal breaker as motivation is a huge factor to go for a PhD.\n\nAfter these \"knowing your intentions\" questions, they will probably get to asking about your past experience (if any) in the field, like internships, projects, or even MOOCs now a days.\n\nFor me, the presentation part came right here. And was followed by some questions related to that work.\n\nAfter this, because I was being interviewed for positions from foreign countries, most of them casually asked me about the interest in their country and learning their language, lightening up the situation for me.\n\nAll the best for your application/s.", "Permalink": "https://www.reddit.com/by_id/t3_6ju81h.json"}, "305": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1498587831, "Score": 3, "Body": "Don't be embarrassed about it - everybody goes through those existential crises during a PhD. There was a time about a year ago that I was 100% sure that my adviser was about to fire me... not being able to keep working at that time was one thing, I hardly had the energy to get out of bed. I spoke to a friend (another student) who gave me some reassurance, which helped to keep me going, though just. \n\nWhat happened? A month later, I won an award at a conference for a paper, and my adviser was mighty pleased. That's when I realized it was all in my head - it was a bad time, results were bad, I had writer's block, etc. It got better, and it always does, from every setback. So hang in there, and if you need to, talk to people you trust about your problems. You don't have to do this alone. \n\nA PhD is full of ups and downs, and the amplitude seems to keep growing with time! But hang in there, you've gotten so far, you can finish. ", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "306": {"Subreddit": "PhD", "Author": "ursath", "Date": 1498593099, "Score": 3, "Body": "Start a papertrail. Like, seriously. Today. Tomorrow. ASAP.\n\n\nStudent support, student services, campus counselling, PhD support groups, PhD mental health support groups, student union advice centre. Human Resources health advisor/disability advisor.\n\n\nHelp is available. We just need to see it, and use it. It is a lonely existence as a PhD so I think that it can be hard to think of other sources of help than our supervisors. Other people in your department that you get on well with might help. PhD mentor or director is usually a position assigned to a member of staff.\n\nEspecially with your supervisors turning a blind eye: create-a-papertrail. Seriously. Email people, go see your GP, get a medical authority to back you up. \n\nI have a close friend who is currently unable to finish the PhD. My friend was in the same situation (life events happened, supervisors were unable/unwilling to help), and my friend kept putting up with it and it has ended in disaster. There is no record of the troubles with anyone because my friend didn't want to seek anyone out (\"It'll be fine\", \"just a few more months\") and now the university is pushing for money and deadlines which my friend cannot pay or meet. \n\nIf you are in the UK, a medical condition can give grounds for intermission, which is a 'pause' on your PhD period, and crucially not subject to tuition fees. Will vary from institution to institution of course. Any uni will have information on this on their website.", "Permalink": "https://www.reddit.com/by_id/t3_6jsru9.json"}, "307": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498598361, "Score": 3, "Body": "I also have three, two were born during my PhD. I made a lot of progress when I only had two but now that I have three I'm progressing slowly (I will still graduate in time, hopefully).", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "308": {"Subreddit": "PhD", "Author": "hacker-l0maker", "Date": 1498602480, "Score": 2, "Body": "Hey!\n\nI just obtained my Ph.D. in physics. \n\nWell, it's never easy to do a Ph.D. So my fellows told. I have never believed that until the third year.\n\nWhat helped personally me was kung fu. Breathing exercises, control, physical strength, and discipline was exactly what I lacked. Yoga or any other sport may also help.\n\nWhich is your subject, by the way?\n\nCheers,", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "309": {"Subreddit": "PhD", "Author": "Bogizley", "Date": 1498609738, "Score": 3, "Body": "How long did you have to stop for, if you don't mind me asking?", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "310": {"Subreddit": "PhD", "Author": "smogcurling", "Date": 1498622363, "Score": 2, "Body": "It's definitely doable. If having kids is important to you, then you'll make it work. You'll just need to have good time management. And really, as the linked article highlights, there are plenty of good reasons to have kids while doing your PhD. (In case you were wondering, 1 kid born during my 1st year; planning to have at least one more before the PhD is done. I didn't take any leave the first time. I will definitely be taking the maximum amount of leave available the next time around.)", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "311": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1498623768, "Score": 4, "Body": "I am six years into an interdisciplinary educational technology program, and graduating in December if I actually manage to write up my thesis. That's the last step. \n\nI started Concerta this week and it's been amazing so far. It's been so nice to realize that the research itself was never the hard part. ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "312": {"Subreddit": "ADPhD", "Author": "spaceblip", "Date": 1498625095, "Score": 4, "Body": "Physics, just wrapping up my MSc and starting on my PhD this September. I'm currently pretending to not have seen emails from the department nagging me to choose a PhD supervisor, sigh. \n\nI know that in theory I can change my mind if I really dislike the supervisor I choose, but I'd rather choose a good one the first time. But this requires me to send lots of emails and meet up with lots of people. I'll get around to it, eventually. ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "313": {"Subreddit": "ADPhD", "Author": "diabeticgolfcourse", "Date": 1498626579, "Score": 4, "Body": "Hi friends! did my MA in Linguistics and now I'm switching gears to do a professional degree (hoping to get a job one day...). In September I will be starting my Master of Health Science to become an audiologist ☺", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "314": {"Subreddit": "ADPhD", "Author": "teslalyf", "Date": 1498627662, "Score": 4, "Body": "I'm somehow managing a MLIS program and a MS in Health Informatics simultaneously. I've found the two subjects keep me just interested enough in both topics without getting bored. ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "315": {"Subreddit": "PhD", "Author": "Mohankumar12345", "Date": 1498631430, "Score": 1, "Body": "Thanks for the tips.", "Permalink": "https://www.reddit.com/by_id/t3_6it040.json"}, "316": {"Subreddit": "PhD", "Author": "Mohankumar12345", "Date": 1498631437, "Score": 1, "Body": "Thanks for the tips.", "Permalink": "https://www.reddit.com/by_id/t3_6it040.json"}, "317": {"Subreddit": "ADPhD", "Author": "msidari", "Date": 1498632638, "Score": 4, "Body": "Hi guys! I'm six months into my PhD in behavioural genetics and psychology.\n\nRecently sought treatment because my supervisor is sending me to a very expensive genetics summer school and I don't want to stare out the window too much... Ritalin is starting to help with that!\n\nThanks for starting the sub, /u/gingersnaplibido ! :)", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "318": {"Subreddit": "ADPhD", "Author": "extremebadgers", "Date": 1498633972, "Score": 5, "Body": "Wind and marine energy. I'm currently doing a masters in it at the moment  but I'm going to start my PhD in October.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "319": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1498646833, "Score": 3, "Body": "First PhD-baby: 4 months, second PhD-baby: 1 month. I plan to graduate after 3.5 years (I already had my master's degree) which I consider to be more or less in time.", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "320": {"Subreddit": "PhD", "Author": "moranr7", "Date": 1498648521, "Score": 1, "Body": "Just about to submit my thesis in the coming days.  Found the end of the second year very tough mentally (not the work, the lifestyle). There are times where we just need to persevere, it is part of the PhD. I am so glad I did.  Just focus on the feeling of obtaining a job you love with your PhD relatively soon.   TL;DR: It's normal, its difficult, but you're strong enough to get through it - persevere. ", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "321": {"Subreddit": "PhD", "Author": "UntrustedProcess", "Date": 1498650170, "Score": 2, "Body": "Assuming you are in the US, before you quit, get legal council.\n\nhttps://www2.ed.gov/about/offices/list/ocr/504faq.html\n\nThe Americans with Disabilities Act protects you as a student in any program at least partially funded with gov money, which is essentially all of them.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6jsru9.json"}, "322": {"Subreddit": "ADPhD", "Author": "proteins911", "Date": 1498652230, "Score": 3, "Body": "Hi! I'm 2 years into a PhD in biomedical engineering.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "323": {"Subreddit": "ADPhD", "Author": "tonightbeyoncerides", "Date": 1498652810, "Score": 3, "Body": "Hey I'm a second year in chemistry. About to go into quals and freaked out I'll fail because i have no research progress ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "324": {"Subreddit": "ADPhD", "Author": "parkercommapeter", "Date": 1498653229, "Score": 3, "Body": "I'm working on getting my CPA (professional accountant) designation. I've just had a few months off from courses for this but start back up at the end of July and feel completely unprepared to balance that with my job (not to mention trying to have a life as well!). I'm aiming to write the certification exam in September 2018, and know I'll need all the help I can get with improving my self-regulation in order to properly prepare.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "325": {"Subreddit": "ADPhD", "Author": "seaturtlesupernova", "Date": 1498654573, "Score": 7, "Body": "I'm starting medical school in July. I just got officially diagnosed and put on Vyvanse earlier this week. My ADHD affects a lot of other areas of my life but I've somehow managed to do well in school without being treated, in fact that's probably the main reason I wasn't diagnosed until now. \n\nBut school is more of a structured environment, so I'm a bit worried about how I will be able to handle the clinical years of medical school and life as a doctor. It won't just be reviewing notes, I'll have to remember everything the patients say, all the things my attending/resident wants me to do, etc.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "326": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1498655236, "Score": 1, "Body": "Do you have a Thesis committee? If so you can discuss with them. You can also submit chapters to them as you write and they can make comments. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "327": {"Subreddit": "ADPhD", "Author": "WiredWierdly", "Date": 1498660037, "Score": 3, "Body": "First year PhD in Electrical Engineering. All your fields sound so interesting and I'm having to restrain myself from googling all them.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "328": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1498667702, "Score": 2, "Body": "Very anticlimatic. Got first round submitted. We met last week with a hand full of changes. He said to take as much time as I needed to finish (10-14 days would probably be right). Then I will be done and also 100% read to submit straight to an A level journal that he is confident in. Meanwhile I am behind on job applications. This is the priority. I might be doing a good deal of nothing between interviews and whenever a job might start as schools generally accept new hires about a year before the job starts. I'm looking forward to a break, I'm hoping it is not that long.", "Permalink": "https://www.reddit.com/by_id/t3_6gag5x.json"}, "329": {"Subreddit": "ADPhD", "Author": "wahoodancer", "Date": 1498671306, "Score": 4, "Body": "I'm in PA school right now. You'll get eased into clinicals and will have figured out a good way to take notes by then. At least in PA school, we get enough practice scenarios in lab to figure out a system for ourselves. ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "330": {"Subreddit": "ADPhD", "Author": "proteins911", "Date": 1498671401, "Score": 4, "Body": "Mine don't. I'm fairly private about my personal life at work. I don't think I'd ever discuss my medical info with my bosses unless it was an extreme situation like hospitalization that would prevent me from coming into work.", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "331": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1498673664, "Score": 1, "Body": "Thanks for all your support, friends. I'm in a speech and language sciences field. I think the summers are the hardest to feel productive which is why I've been feeling so incapable on top of other things. It's good to know everyone else reaches this point too, and also to hear about your experiences!", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "332": {"Subreddit": "ADPhD", "Author": "tonightbeyoncerides", "Date": 1498675731, "Score": 3, "Body": "If I can get my shit together for six productive weeks, I'd have the data for my first paper", "Permalink": "https://www.reddit.com/by_id/t3_6k1w0b.json"}, "333": {"Subreddit": "ADPhD", "Author": "afiwrx", "Date": 1498679357, "Score": 2, "Body": "5th year PhD in entomology. Writing now which is taking forever due to lack of focus and overwhelming work to do. Wish me luck!!", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "334": {"Subreddit": "ADPhD", "Author": "spaceblip", "Date": 1498682011, "Score": 4, "Body": "A few months before I got my diagnosis, I mentioned my younger brother having ADHD to my research supervisor. He said \"aren't we all a bit ADHD these days?\" It wasn't meant maliciously, but at this point, I don't think mentioning it to him would be a good idea. I'm switching supervisors for my PhD anyway. \n\nIn an ideal world, I could tell my supervisor and it wouldn't be a big deal, but I worry about giving the impression that I'm using it as an excuse, or something. It's something I don't mind other people knowing about, heck, I'd rather they know, but I worry that mentioning it at all will just make it look like I'm looking for excuses. \n\nAt this point, if people ask, I just say that I have some medical issues going on. Most people don't ask. ", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "335": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1498683697, "Score": 3, "Body": "I am writing my thesis in LateX so I just pulled a template from a close department at my uni.\n\nWith talks I try to do something very different each time. Mostly because I hate making slides and being creative so I'm always sure I've done it terribly so I'll try something new.", "Permalink": "https://www.reddit.com/by_id/t3_6k2ypr.json"}, "336": {"Subreddit": "ADPhD", "Author": "DrPotato2301", "Date": 1498691903, "Score": 1, "Body": "I'm finishing my first year as a PhD student in Marketing. \n\n\nSidenote: (not related to the question) I just replied to a comment today that it was the first time I saw another PhD student who has adhd when someone mentioned that s/he was a PhD student with ADHD in a comment. But wow, there are quite a few pursuing PhD who's been diagnosed with ADHD. \n\n\nAnd thank you kind sir/madam for creating this subreddit!! ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "337": {"Subreddit": "ADPhD", "Author": "DrPotato2301", "Date": 1498692506, "Score": 4, "Body": "I feel both good and bad in regards to my center. \n\n\nI feel good because all my loving colleagues understand or at least try to understand Adult ADHD. \n\n\nI feel bad because my advisor doesn't get it what it is to have ADHD even though he was surprisingly understanding *when I told him about my ADHD* (totally not what I expected from him) but, he doesn't get it or at least try to understand what is it like to have ADHD as an adult. \n\n\nedit: I just realized I missed out the italicized part. But I meant to say it back when I wrote this comment. 😅", "Permalink": "https://www.reddit.com/by_id/t3_6jy5ij.json"}, "338": {"Subreddit": "ADPhD", "Author": "DrPotato2301", "Date": 1498692775, "Score": 2, "Body": "I'm studying for a test in a portion specified by my advisor. My future in the current PhD program completely depends on it.\n\n\nI have my test on 7th July at 10AM. And if I do well, I might get to stay in the PhD program. If I screw this up, I'll be asked to finish requirements for a masters and graduate with a masters degree. ", "Permalink": "https://www.reddit.com/by_id/t3_6k1w0b.json"}, "339": {"Subreddit": "PhD", "Author": "porterble", "Date": 1498693883, "Score": 2, "Body": "I write in Scrivener, so no visual editing there. Funky stuff I embed in LaTeX wishing the scriv and then export via MML to TeX. \nFor my thesis I use a template from a major publisher and for conference papers just a simple template designed to optimise visual readability. ", "Permalink": "https://www.reddit.com/by_id/t3_6k2ypr.json"}, "340": {"Subreddit": "ADPhD", "Author": "Umbrall", "Date": 1498695670, "Score": 2, "Body": "Undergraduate close to graduation and hoping to apply to some Math/CS PhDs", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "341": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1498696161, "Score": 2, "Body": "SERIOUSLY.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "342": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1498696468, "Score": 3, "Body": "I hear this. Before my psychiatrist diagnosed ADD, my PCP initially thought I had just been manic for years, even though I've never really been depressed. As PhD work got harder I started being less able to consistently meet deadlines, and by the start of year 6, she was kind of lovingly-yet-passive-aggressively like \"okay I kind of need you to start getting it together?\" When I told her that my doctor thought I was bipolar, she was SO excited for me, and kept telling me how brave I was and that I was going to get on medication and have it all be okay soon, etc. When I went back a few months later and told her \"actually no it's ADD\" (which perfectly fits all of the struggles I've been having to get work done), she was kind of like \".... mhm. Welp.\"\n\nIt was really disappointing, because I expected her to be really on board based on how she responded to potential-bipolar, but she clearly doesn't believe that ADD is anything more than laziness. Oh well.", "Permalink": "https://www.reddit.com/by_id/t3_6jy5ij.json"}, "343": {"Subreddit": "ADPhD", "Author": "WiredWierdly", "Date": 1498697527, "Score": 4, "Body": "God no. I would never hear the end of it. I'm amazed that there are people who tell their advisors. ", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "344": {"Subreddit": "ADPhD", "Author": "DrPotato2301", "Date": 1498699410, "Score": 1, "Body": "[YES! SERIOUSLY.] (https://m.imgur.com/gallery/VSp2x) ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "345": {"Subreddit": "ADPhD", "Author": "seaturtlesupernova", "Date": 1498713390, "Score": 1, "Body": "I hope so!  I'm just so forgetful and space out a lot, and there's not much room for that in medicine. If I mess up and forget something important there can be some pretty major consequences.  I don't know if I would be able to live with myself if I did that.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "346": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1498716398, "Score": 5, "Body": "While I love the idea of running away to the circus, I'm not sure how viable it is a career move. \n\nIs it possible for her to take an extended leave of absence just to gather her head and give herself some breathing space? It might give her some perspective on what she actually wants to do. A PhD is hard, and her advisor situation doesn't help. Currently going through advisor issues myself but trying to get back on track. \n\nDoes she actually hate what she's doing or is she just frustrated? Does she need to change her topic? Is she able to? (I'm English so idk how Science PhDs work). In any event, I think she should go to on campus counselling just to talk it out. She probably feels really isolated living apart from you so it might be worth switching to distance or taking a LOA for 6 months. If she misses it she can go back.", "Permalink": "https://www.reddit.com/by_id/t3_6k66j5.json"}, "347": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1498721755, "Score": 3, "Body": "This.\n\nDon't know how it works in the states, but if it is possible to take some leave to clear her head she should definitely take it.\n\nMy university offers free couselling for students and staff, so you should investigate what her institute has to offer and get her to take advantage of it.\n\nI don't know how it works in the states, but I'm the UK there is a pretty strict deadline for finishing, so it's normal for students to tell advisors that they will stop experiments and move on to writing, not sure how applicable that is to the US, but if possible try to be strict with the advisor and move on to be writing.", "Permalink": "https://www.reddit.com/by_id/t3_6k66j5.json"}, "348": {"Subreddit": "PhD", "Author": "Voothai5", "Date": 1498722112, "Score": 1, "Body": "The LoA may be the right thing to do if the graduation date pushes back again. She has active experiments that need tending to for now. I suggest this a lot but she's resistant with the ol' \"If I leave I won't come back\" defense. The school tightened up its continuous enrollment policy which made her worry, but I'll read up on the policy and come prepared. Counseling is another thing I keep suggesting, but she deflects it. Worth another shot I guess.\n\nChanging topic I think has similar implications as in other fields--most notably the time penalty which I'm sure is a deal breaker for her.", "Permalink": "https://www.reddit.com/by_id/t3_6k66j5.json"}, "349": {"Subreddit": "PhD", "Author": "Voothai5", "Date": 1498722699, "Score": 2, "Body": "&gt; I don't know how it works in the states, but I'm the UK there is a pretty strict deadline for finishing, so it's normal for students to tell advisors that they will stop experiments and move on to writing\n\nThat sounds amazing. I'm a pretty vocal critic of the state of the US PhD system at least in comparison to the US JD or MD. It always seems like you're basically an indentured servant of your adviser, so better hope it's a good one. At least the way she makes it out, just going to writing or the next experiment won't work (I kinda get it, future chapters of the dissertation depend on its data).\n\nHearing about her dissertation scope and her post-PhD goals, it seems totally reasonable to cut back the scope a bit (it really is huge). The trick is getting the committee to agree post proposal. :)", "Permalink": "https://www.reddit.com/by_id/t3_6k66j5.json"}, "350": {"Subreddit": "PhD", "Author": "wurdle", "Date": 1498741176, "Score": 4, "Body": "Did they give you any reason(s) for pulling the funding?", "Permalink": "https://www.reddit.com/by_id/t3_6k8123.json"}, "351": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498742145, "Score": 1, "Body": "I'm not entirely sure about that one. I didn't know there were things set up to read thesis chapters. I think proofreading is the main thing that will help, so I'll check if there is one :)", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "352": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1498742231, "Score": 2, "Body": "We have \"writing courses\" that you have to apply to which last a few days long. I have been to a few of them and they have helped somewhat. I don't suffer from dyslexia or ADHD but I do suffer from anxiety. Not sure if that really does anything for writing though.", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "353": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1498744655, "Score": 6, "Body": "&gt; While the PI seems really great and understanding, he did mention that such an arrangement could allow for greater focus on research. Huge, waving, screaming red flag.\n\nI have heard a story of one particular PI in my field (disclaimer: never actually worked with them), who when interviewing for students/posdocs would ask if they were in a relationship and mark that against them as they would be able to spend less time working, as well as arranging group meetings on Sundays to make sure people work on Saturdays. \n\nThe PI you are talking about is probably not that bad, but yes I'd take that as a red flag.\n\nAs for whether long distance relationships can work in general during a postdoc, that really depends more on you and your partner as a couple.\n\nI have friends and colleagues who have been in long distance relationships for 5+ years and counting, moving to new postdocs every 2-3 years, and making it work by taking turns travelling to see each other every weekend, but that is clearly something that not everyone can manage. \n\nOther people I know were living separately for 5-6 months after the first person found a job at one institute, with the time spent by the other partner finishing at their job and find a job at the new institute. I know a number of couples who have done this, but then the question becomes how long the new job lasts.\n\nIn conclusion, it is pretty common, but it is definitely not for everyone, it is more manageable if you know that both of you can eventually move to the same place, but again not everyone can manage this. \n\nI have not done this personally and I am currently facing the same dilemma you are.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "354": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1498745341, "Score": 1, "Body": "Many universities have thesis committees that will assess progress as you go, does yours have this? ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "355": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498745630, "Score": 3, "Body": "I think what helped me make a decision is aquiring a separate source of income.  The path forward became a lot clearer to see when my livelihood didn't wholly depend upon my stipend and whatever postdoc/job income would come next in that path.  I feel less pressure to sacrifice my personal life and I find that I am willing to accept less of the bad that comes along with the good in science.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "356": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1498747787, "Score": 7, "Body": "In the US, a 50% funded stipend is \"full-time fully paid\". I know it sounds ridiculous but at least at USC it was that. As a 50% RA or TA I got about 30k a year. Sometimes we got a TA ship for 25% pay and the RAship for another 25%, or you would TA 2 classes for 50% TAship \n\nAt the end of each semester we had to sign a paper saying we did not work more than 20 hours a week", "Permalink": "https://www.reddit.com/by_id/t3_6k8123.json"}, "357": {"Subreddit": "ADPhD", "Author": "wahoodancer", "Date": 1498747800, "Score": 2, "Body": "Ok, first of all, it's difficult enough to get through the classroom portion, so focus on that for now. Take school one day at a time. They want you to pass. The training builds up for your skills. All of us in our lab scenarios right now are taking our own notes and coming up with our own shorthand and ways to identify pertinent information. Our scenarios are also pertinent to what we are studying and have built in complexity. ", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "358": {"Subreddit": "PhD", "Author": "Voothai5", "Date": 1498749535, "Score": 2, "Body": "It's definitely not uncommon. That factored into my decision to leave academia, although I pretty much had decided I would beforehand.\n\nMy wife and I were both PhD students (she's still finishing up). I was applying for academic jobs and had a contingency to negotiate a dual hire if I got an offer. Never heard of that for post docs.\n\nAnyway, I'm the first one to jump the academic ship and I think that's her plan too (currently living apart anyway, lol). We figure it will easier for us both to get jobs in industry than both in academia, and the time commitment of each is very different.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "359": {"Subreddit": "ADPhD", "Author": "proteins911", "Date": 1498749801, "Score": 3, "Body": "I hear \"aren't we all a bit ADHD these days?\" Sorta comments a lot. I do view them as correct... Most people have trouble focusing, depressed moods, anxiety, etc at times. That doesn't mean that most people need stimulants or SSRIs though. Mental disorders can be hard to explain because they really are just normal things that everyone deals with but magnified. You'd think someone with a PhD would get that though!?", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "360": {"Subreddit": "ADPhD", "Author": "seaturtlesupernova", "Date": 1498751717, "Score": 1, "Body": "Yeah, I know the training is designed to teach you how not to make mistakes like that. Levels of responsibility are added slowly, with lots of supervision, until you are able to handle it on your own.  I know a lot of other med students, both with and without ADHD, probably have the same worries I do.  Some slightly irrational part of me is concerned that ADHD will somehow make me a worse doctor, but I know this is just a manifestation of my nerves about starting school.  I know there are lots of other qualities about myself that will make me a good doctor that far outweigh the negatives of ADHD.  Plus now that I'm being treated that will help too.  I would not even be starting school if there weren't experienced people who believed I would make a good doctor.  Thanks for your help:)", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "361": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1498756064, "Score": 1, "Body": "Writing courses as in one day one on one help. Anxiety can really cloud your mind. Do you go for runs or even take brisk walks? That always helps me. Good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_6j1zfq.json"}, "362": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1498756081, "Score": 1, "Body": "I am very lucky that my department is super pro-families, babies etc. All my supervisors are mothers. I have three members of staff in my department all willing to watch my children while I teach/assess/do oral presentations/have meetings. If a meeting is quite informal they don't mind if the children attend, or if I have to breastfeed while meeting. Otherwise, my mother in law comes to campus and takes the children to play/have a babycino and fries while I do my work.\n\nIt's still very hard. Right now I have tight deadlines, two children who want to play every waking minute, they've just been sick for two weeks, it's now school holidays, half-hourly night wakings (often covered in vomit) ... but that's me talking during a rough patch. And rough patches would happen with children or without. \n\nFor me, family is absolutely the most important. If I couldn't have children during the program, or if I didn't have the flexibility I need as a mother, then I would quit tomorrow. I'm very lucky that (touch wood) I don't need to choose.", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "363": {"Subreddit": "ADPhD", "Author": "spaceblip", "Date": 1498765341, "Score": 2, "Body": "Oh, true, it is technically a true statement, in a sense. I guess it just irks me when people use that as an excuse to be dismissive of ADHD itself. \n\nA PhD doesn't guarantee understanding of mental disorders, unfortunately. That said, thankfully, my research supervisor isn't an asshole. When I've had to work from home for \"health reasons,\" he's always been understanding about it.", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "364": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1498766673, "Score": 2, "Body": "I wouldn't lump in marriage and relationships so readily.\n\nwife&gt;career&gt;gf/friends . . . etc.  Marriage is a deliberate promise that the other is more important than the other things, in my view. Otherwise why would you?\n\nI understand that this reinforces your point (a good one), but your viewpoint shouldn't be a prerequisite to be in academia.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "365": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1498767327, "Score": 5, "Body": "&gt;If science needs me to leave my boyfriend behind and stall marriage and children, I will leave science behind in the dust. Bye Felicia.\n\nBut please try not to. Funneling people into science that are cutthroat, single-minded, get ahead at all costs types while pushing out those who are not makes for a homogenous value/talent pool I don't want to swim in. \n\nIf marriage and family serve as such a significant and consistent barrier to entry, the state of the enterprise needs seriously examined, because we're pushing out valuable talent and squashing creativity. I'm not saying sacrifice your family goals. To the contrary; please make them a priority. Try to gut it out. The more of us do now, the more will be able to later when we're the gatekeepers. I hope. \n\nedit* formatting\n\nedit 2* formatting\n\nedit 3* grammar; my PI is going to love my early dissertation drafts", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "366": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498772157, "Score": 1, "Body": "I appreciate this idea, I really do.  But the barrier to entry is already too high for someone like me, and may have been before I even entered the game.  People talk about economic bubbles like they're a bad thing, but they're kind of a good thing--its a market correction back closer to real value.  If the academic bubble bursts and talented scientists don't even want to try anymore, maybe the gate keepers will be *forced* to change the game.\n\nIf I consider this, or any postdoc that requires a move, I'll be asking for more senior level pay from day 1 and I'll push hard for a dual offer.  They may scoff at that (because who dares negotiate a postdoc position), but then again, I'm free to accept a better offer in biotech.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "367": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1498775895, "Score": 2, "Body": "I have the same attitudes as you - my boyfriend and I have been together a while, and I actually in part chose to do a PhD as it was the most interesting \"job\" I could get without having to move interstate. Of course, I was also interested in doing a PhD before I was with him, but it was the tipping point in my decision.\n\nSo now I've got 2 supervisors across 2 campuses, basically as a result of my wanting to stay put. I'm based on the campus where my boyfriend is finishing off his double degree, and where he's considering pursuing his own PhD. My secondary supervisor is here, my primary is about a 5 hour drive away (which is actually a short distance in Aus..). So far things have been going okay, but my primary supervisor has been big-time pressuring me to move cities. He doesn't seem to take \"I have a house and a partner here\" as a good enough excuse to not move. He has offered me lecturing opportunities if I did move, but I have tutoring opportunities here that are earning me almost as much money. \n\nI'm terrified that he'll give me an ultimatum some day - move, or don't do a PhD. But, like you, I feel like my life comes first and my work's just there to support it. I care a lot about what I'm researching, but I could do it with another supervisor. My secondary is better at the stuff I'm working on anyway. So really, if the ultimatum comes, I'd pick my partner and I'd find myself someone new to work with, regardless of any delays it might incur. As a side note, with my partner finishing up university soon, he also has emphasized that he'd pick life with me over any job. So it goes both ways, which is super important in my opinion.\n\nAlso, I think the comment about greater focus is a red flag. I know that when I was applying for a PhD, people seemed a little put off by my \"in a relationship\" status. I'm not sure if it was because I'm a girl or whether it happens to everyone, but I found it frustrating. Everyone I know through my PhD still seem surprised and occasionally concerned when I mention my boyfriend. It's like researchers are expected to be single and alone... no wonder so many of us struggle.\n\nTL;DR, I think you've got your priorities right and the most important thing is talking it through with your partner to make sure you both have those same priorities. It would be really frustrating if you turned down this opportunity but then he moved for his work later on. If moving doesn't feel right, don't do it. You're not going to change your mind and decide you love it. Best of luck to you :)", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "368": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1498779938, "Score": 5, "Body": "I wouldn't be able to do my PhD without my husband - he has been so supportive, cuddles me, and has put me back together more times I can count.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "369": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1498795714, "Score": 2, "Body": "I did it for 3.5 years during my PhD (Berlin to Bay Area). It wasn't ideal but we talked for an hour every day, saw each other at least once every three months (except the \"final push\" 5 months), and we traveled a lot. When we were together we were 100% focused on each other, and we we were apart we were 90% focused on our research, so my PhD flew by. Now we are both in the Bay Area and things are better! \n\nIt's not for everyone, but I am glad I did it for many reasons. I especially wouldn't recommend it for people who need physical touch as a way to communicate love to each other. It only works for particular relationship styles, I think.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "370": {"Subreddit": "PhD", "Author": "msp13g", "Date": 1498797175, "Score": 2, "Body": "I'm about to head into this. I'm entering a PhD many states away, and my wife is finishing up the last two semesters of her master's before joining me. I know it will be hard, and we are going to try and communicate as much as possible. I appreciate the advice and experiences shared in this thread.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "371": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1498802818, "Score": 6, "Body": "Way too broad of a question. Like asking what kinds of companies are looking to hire B.S. holders. Depends immensely on the field, specialty, individual, etc.", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "372": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498822288, "Score": 4, "Body": "There isn't much that a PhD qualifies you for alone.  But there are many types of jobs that *require* it, along with your other practical skills and experience.\n\nUnfortunately, you often won't be gaining the skills you need for most jobs in a PhD.  The lab skills I used during my biology PhD are pretty much useless in the real world, even in biotechnology.  I'm largely relying on technical skills I developed years before I entered.  The value of my PhD is name brand of my school, the fact that I have some pubs (doesn't really matter what on for jobs in industry ), and that I learned how to better think and talk during the program.", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "373": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498823207, "Score": 2, "Body": "Encourage her to start writing up her work into papers to see if she can push out a pub/chapter/whatever right now.  See if that is enough to convince her committee to graduate her.\n\n\"One more semester\" never results in some noteworthy elevation in quality of the work. \nOne more experiment/control/chapter just doesn't matter in the long run. \nIt looks identical on resumes/CVs.  Most jobs /postdocs/whatever won't be reading that closely into the work to realize the value in what was done during that extra time.\n\nThe key is just to jump through the hoops well enough to *make it through* them, and not wasting a bunch of time lining up each jump.  PIs just want to elevate themselves on the backs of your work, so they'll always tell you that you need to keep your head down for more time.  It's up to the student to put his or her foot down and leave when it benefits *them*.", "Permalink": "https://www.reddit.com/by_id/t3_6k66j5.json"}, "374": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498823629, "Score": 1, "Body": "The biggest issue here is health insurance--a lot of programs don't offer great options.  If yours does, awesome!\n\nI once had a tonsil abcess that kept me out for a week.  My boss asked to see it, like.. open your mouth and show me, I guess in order to verify that it was real.  Later, I slipped and bumped my head and got a concussion.  He asked how much my head was bleeding and if he could feel the lump.  I told him to piss off both times.  If he didn't see the illness or injury happen, I guess he was skeptical of it.\n\nIn my experience, if you can fly under the radar without telling advisors that you are sick, it'll be better for you.  Allow them to think that you are just working diligently from home.  This is hard if your boss is a micromanager, obviously.", "Permalink": "https://www.reddit.com/by_id/t3_6jsru9.json"}, "375": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498824056, "Score": 1, "Body": "I blackout/blur every time I give a talk even after years.  My solution is knowing my shit but actually taking Ativan.  I've heard others have had success with beta blockers, especially if you have that shakey-voice effect.\n\nI don't really buy the concept that it isn't \"real\" if you can't do it without pharmaceuticals, or that you've not practiced enough if you are nervous.  I've been giving talks for over 10 years and no amount of practice stops my baseline physiological reactions to the context.  In fact, I've noticed that my baseline reactions have *lessened* since I began regularly popping Ativan before talks.  Fear conditioning is real, as is fear extinction.  Use the tools available to you and go give a killer talk!\n\nDon't be afraid to go to your doctor for help in this regard.", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "376": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1498826979, "Score": 1, "Body": "The problem is that there are dozens of people willing to do the opposite of you, sacrificing their time and best years of their life to be a better researcher.  The sad thing is that all these people are miserable low-lifes with zero self-confidence who don't have fun.  I prefer your way, honestly.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "377": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498826983, "Score": 1, "Body": "Nobody cares about the dissertation.  Do some combination of what is fastest, easiest, gets you passed and whatever you want :)", "Permalink": "https://www.reddit.com/by_id/t3_6iw5qw.json"}, "378": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1498832231, "Score": 1, "Body": "It can be a toxic environment.  But the good news is that nobody has a gun to our heads keeping us there :)", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "379": {"Subreddit": "PhD", "Author": "Sir_Ebrum", "Date": 1498836243, "Score": 4, "Body": "I wanted to leave the question broad, as to not have the job based on specific area of study/field or technique. I am aware of the specific jobs I can apply for based on my dissertation work. I should have perhaps mentioned a PhD in life sciences.\n \nJobs that I know of that you can benefit from having a PhD regardless of discipline include things like\nData analyst\nScientific/Medical Writer\nConsultant \nTeaching\n\nI do think sometimes we focus so much on the very specific details of our work (which can be limiting) but not the overarching skills we have gained (writing, mentoring, collaborating, data analysis, public speaking etc..)\nBut I was curious about other peoples experience/knowledge with not taking the typical academic (postdoc/faculty) track.\nAs this is something not often communicated at universities. \n", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "380": {"Subreddit": "PhD", "Author": "Sir_Ebrum", "Date": 1498836476, "Score": 2, "Body": "I agree, I have a lot of lab skills but not all of them are transferable to biotech companies. This was not something I thought of until much later in grad school. I was a naive grad student that assumed I would become a PI one day. Maybe I will, but I would still like to know about other options/possibilities.  ", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "381": {"Subreddit": "PhD", "Author": "crunchy_hearts_club", "Date": 1498845719, "Score": 3, "Body": "You should join us at r/gradparents. It's a brand new sub for parents who are in school.", "Permalink": "https://www.reddit.com/by_id/t3_6jr9qp.json"}, "382": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1498849736, "Score": 1, "Body": "I know . . . do whats best for you. I'm just whining as I fight the whirlpool of failure. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "383": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1498852800, "Score": 2, "Body": "Good luck on submitting your thesis, what a great feeling to know it's done!", "Permalink": "https://www.reddit.com/by_id/t3_6jt8tp.json"}, "384": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1498857184, "Score": 4, "Body": "Consulting is a big one.\nLots of mgmt consulting firms will hire, for the PhD part.  \nIf you are from a big enough brand name school, the top consulting firms are open too.", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}}