{"0": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1480564162, "Score": 2, "Body": "I suggest you go to the library and read as many PhD theses as you can similar to your field. Try to find theses not articles, it will give you a better perspective specifically for a thesis. I find that I picked up how to write articles/thesis from reading a lot, it gives you the feeling of the way you should write.", "Permalink": "https://www.reddit.com/by_id/t3_5fnmq4.json"}, "1": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1480629478, "Score": 1, "Body": "In your proposal you should be to state what you *expect* to be novel about your research, but not necessarily know if it's true/correct/accurate, etc... That's for the committee to find out at your defense.", "Permalink": "https://www.reddit.com/by_id/t3_5f8u53.json"}, "2": {"Subreddit": "PhD", "Author": "mobyfreerunner", "Date": 1480670456, "Score": 2, "Body": "Thank you!\n\nYes I thought I was decent at writing academically but writing at the doctoral is quite different! :) \n\nI'll work through it! thank you for taking the time to respond!", "Permalink": "https://www.reddit.com/by_id/t3_5fnmq4.json"}, "3": {"Subreddit": "PhD", "Author": "mobyfreerunner", "Date": 1480670711, "Score": 1, "Body": "This was very helpful! thank you! Thats a good method, outlining what has been done while leaving a gap that your research will attempt fill up. \n\nSort of like putting together a puzzle leaving out one piece and that one piece is your research thesis.\n\nI'm in Social Design, and my research has something to do with Human-Human Interaction. I'm very early on in the process. Still Working on my proposal at this point.", "Permalink": "https://www.reddit.com/by_id/t3_5fnmq4.json"}, "4": {"Subreddit": "PhD", "Author": "richard248", "Date": 1480676362, "Score": 5, "Body": "Sounds interesting based on the title alone, but I have to register before I even find out a single thing about the tool? What am I registering for? ", "Permalink": "https://www.reddit.com/by_id/t3_5fwo41.json"}, "5": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1480720470, "Score": 1, "Body": "When I first joined I went through a severe depression.  I had to go on meds, I wanted to quit but realized it was just me being scared and thinking I didn't belong.\n\nI just started my third year with a lot of research and award winning grants. \n\nHowever, I just got done with qualifying exams, and think I failed.\n\n:(", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "6": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1480720778, "Score": 1, "Body": "Dont do it, you got a job.  Be happy with that.", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "7": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1480720922, "Score": 1, "Body": "I just started the third year of my PhD and had a daughter.  Im trying to make it work, but it is hard.  If you have family that can help go for it, but be prepared to only do one thing well.  Either be a great parent a great student.  Right now I'm doing two things mediocre, and I hate it.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "8": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1480728649, "Score": 3, "Body": "Yeah, failed mine the first time, but passed after I retook it. Are you able to retake it?\n\nThe worst impact that failing the first time had was on my self-esteem. I let it affect me more than I should have. I ended up being successful enough for the rest of my Ph.D. despite this little mishap.", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "9": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1480729704, "Score": 3, "Body": "I just got done with mine, I don't feel confident about it.  If I fail I will be able to take it again though.", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "10": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1480730005, "Score": 5, "Body": "Our school's was quite hard. ~1/3 to 1/2 didn't pass the first time. Again, the most important thing is to not let a failed qualifying exam set you back emotionally. I published 5 papers this year (I'm a senior Ph.D. student now). I no longer believe it was a reflection of my abilities, but I did at the time and it set me back.", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "11": {"Subreddit": "PhD", "Author": "blufox", "Date": 1480742841, "Score": 2, "Body": "I did, and that essentially resulted in my advisor dropping me from his team, and cutting off my funding. Suffered from quite a bit of self doubt, anxiety, and other problems. Did manage to find an advisor who as more approachable. I am about to finish my PhD, and I think I have done OK for what I expected during that time.", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "12": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1480744568, "Score": 2, "Body": "It sounds like you were set up to fail.  Your advisor used it as an excuse to get rid of you.  Im glad you got back on track, congratulations!", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "13": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1480773825, "Score": 2, "Body": "I failed mine in the end of the first year. Retook it in the end of the second year and passed. Nothing really changed because of the failing - my advisor encouraged me to study and to retake it. I am in my third year now and getting ready to defend my proposal (candidacy exam).  ", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "14": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1480800321, "Score": 1, "Body": "Soooo what do you expect from this post? To be told to which lab/university to apply?", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "15": {"Subreddit": "PhD", "Author": "sings_in_the_shower", "Date": 1480806670, "Score": 5, "Body": "Do you have a job lined up?", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "16": {"Subreddit": "PhD", "Author": "jimmytidey", "Date": 1480808408, "Score": 2, "Body": "Very fair question... \n\nIt works by letting you choose papers from Google Scholar, and then it generates a visualisation of how those papers reference each other, and allows you to export the data to Gephi. \n\nI used to find research that I otherwise would not have done.\n\nMore can be read about it here: \nhttps://mystudentvoices.com/scraping-google-scholar-to-write-your-phd-literature-chapter-2ea35f8f4fa1#.y8lwslaxf\n\nYou will need to login and install a plugin, I'd love to make the flow simpler, but I don't have time to do a non-login preview, and, sadly, the plugin is the old way to make such an approach work. \n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5fwo41.json"}, "17": {"Subreddit": "PhD", "Author": "usafbeach", "Date": 1480819222, "Score": 1, "Body": "RemindMe! 14 days \"Check out this citation visualization tool\"", "Permalink": "https://www.reddit.com/by_id/t3_5fwo41.json"}, "18": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1480821448, "Score": 4, "Body": "At this time of speaking I am sneakily applying for several of them. I have yet dropped the bomb to my supervisor. ", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "19": {"Subreddit": "PhD", "Author": "sings_in_the_shower", "Date": 1480836575, "Score": 3, "Body": "You should definitely explore your options and see what is available.", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "20": {"Subreddit": "PhD", "Author": "Lady_Pug", "Date": 1480841606, "Score": 4, "Body": "Unless you want to have a career in academia, definitely don't do a PhD. It's not a cost effective use of your time. Non-academic employers generally don't care for PhD's and in the 3-4 years it would take you to complete you could have developed some other more desirable skills in the work place, and would be earning money during that time too. ", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "21": {"Subreddit": "PhD", "Author": "0_orez", "Date": 1480845180, "Score": 1, "Body": "I need a rough idea of in which university I may have a fair chance because application procedure is expensive and I can afford to send around 10 applications.", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "22": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1480851736, "Score": 1, "Body": "OK, hadn't considered that. Have you tried contacting professors there, i.e. your possible future advisors, and ask for their advice?", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "23": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1480852047, "Score": 2, "Body": "Are you referring to a specific field or  industry? Or just in general? How about R/D jobs?", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "24": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1480856582, "Score": 6, "Body": "What about doing an internship with a company? It's similar to an undergrad doing a year in industry during their studies, and it's considered a good thing to do during your PhD. You should be able to get unpaid leave from your PhD to do it, usually it's for around 3 months, but you could ask to do longer.\n\nI would say that you need to be honest with your supervisor. You need a good working relationship with them and I think you could make the case for how an internship could make you a better PhD student in the long run, by learning new techniques. Also, if you're in a niche field, the people you're applying to could know your supervisor and tell him.\n\nIt would be a shame to drop your PhD at this point but I don't know your situation so I dunno what would be best for you, but definitely consider an internship as a best of both worlds.\n\nI was told that if I dropped out of my PhD I would be \"deeply unpopular\" in academia so yes, it would be a big stain on your CV. The funding that I have been given is for me specifically so if I leave they can't just pass it on to someone else to complete the work.\n\nAlso a PhD is about learning, you're not expected to know everything, but you are expected to be able to learn what you need to know during your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "25": {"Subreddit": "PhD", "Author": "TrappedGrad", "Date": 1480864003, "Score": 3, "Body": "I'd like to say that while this is partially true, with the proper project design and taking advantage of classes available to graduate students...you can easily bridge the gap in fairly significant ways.\n\nCase in point: I didn't know programming, so I picked a project with programming in it...Now I do science and I know some programming.", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "26": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1480865709, "Score": 2, "Body": "At my university and in my program (gesocience/geology), we do things a little different and have what's called \"candidacy\" and \"comprehensive\" exams.  The candidacy exam is taken in the 2nd year, and involves writing two proposals that you present and defend.  One that is more-or-less what you are proposing for your PhD, and the other must be something completely unrelated that you come up with entirely on your own.  It is supposed to show that you not only have depth of knowledge, but breadth...and that you can correctly use the scientific method to propose a reasonable hypothesis...that you can test.  This is the exam that people can and do fail (about a 30% failure rate). If you fail, you may get another chance, but sometimes they simply ask you to leave the program as they determine you don't \"have what it takes\" to be a good scientist.  Everyone dreads this exam because during the \"Defense\" of it, they can literally ask you anything they want, and always get  you to the point of saying \"I don't know\".  Then, they want to see how you react when you don't know. I was asked to derive first principle equations on the board....it was brutal.\n\nAfter my exam, I waited in the hall for 30 minutes while my committee decided my fate. I was greeted with an open door to handshakes....BUT\n\nMy lead committee chair kept me in the room as the others left just to drop this little bomb on me.  He said, \"just so you know, your exam was a squeaker.  You passed by the narrowest of margins and we had to vote several times as we were deadlocked.  I just wanted you to know that.  Now...have a nice weekend!\"\n\nI felt pretty crushed and stupid for about a year after that exam.  BUT, the good news is that its five years later, and I'm now Dr. Lakewoodhiker, and I work in a govt lab, and have an adjunct professor position at a university where I am also teaching this spring!\n\nTry to stay hopeful.  Everyone...and I mean everyone will tell you that candidacy/comps/quals....are an awful experience...because they are.  They are meant to be.  Just stick it out, and retake if you fail (if you can).  You'll learn from it if you do/did fail, and I'm sure your committee just wants to see a little more from you if they haven't asked you to leave the program (or kicked you out).  ", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "27": {"Subreddit": "PhD", "Author": "Lady_Pug", "Date": 1480872011, "Score": 1, "Body": "Definitely, there are some obvious exceptions. I meant more generally. ", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "28": {"Subreddit": "PhD", "Author": "mosquem", "Date": 1480909588, "Score": 1, "Body": "Funding will vary from advisor to advisor, especially as grants come up and get re-evaluated. ", "Permalink": "https://www.reddit.com/by_id/t3_5gjaod.json"}, "29": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1480911166, "Score": 4, "Body": "This sounds like a bit of a scam, to be honest. At least in my field (STEM) In the US most PhD programs will provide funding somehow, through TA, fellowships, grants, and it will vary from year to year. No one I have spoken to would accept a  student who paid out of pocket. $125 for something the website can't even be sure of (which universities/departments/advisors have money when) sounds like a rip-off. ", "Permalink": "https://www.reddit.com/by_id/t3_5gjaod.json"}, "30": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1480950689, "Score": 1, "Body": "It's completely acceptable to call your desired schools and ask about their funding options and levels (full, tuition only, etc.). If you're worried about asking, just know that they expect you to ask about this because they know it is a high priority for everyone. In addition, they'll also put you into contact with other students so that you can talk to them and ask them if it was \"enough\" to get by. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5gjaod.json"}, "31": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480957071, "Score": 3, "Body": "I'd make two different sections: One for history and concepts and another one for the state of the art at your topic. This way every part gets a nice distinction, you can write everything, and if in the second part you need to reference any concept, it's already defined in the former part.\n\nThis is the way I'd plan it.", "Permalink": "https://www.reddit.com/by_id/t3_5gmo93.json"}, "32": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1480962368, "Score": 1, "Body": "That makes sense. I guess they could both go under the same chapter, but I should make 2 different headings?", "Permalink": "https://www.reddit.com/by_id/t3_5gmo93.json"}, "33": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480963472, "Score": 3, "Body": "That's a personal matter, it depends on you and the way you want to expose it. I don't usually make two headings for each part, but instead I use \"small\" headings for every topic, all of them under the general review topic. I just expose every topic in order and make the discussion progress as a rational story.", "Permalink": "https://www.reddit.com/by_id/t3_5gmo93.json"}, "34": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1480996077, "Score": 3, "Body": "You are so incredible!  Your albums are always so artistic and erotic!  I hope all is well and that business is good.  Be Safe! We want to keep you around for a long time!", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "35": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1480997761, "Score": 2, "Body": "Thank you for the kind words! ", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "36": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1480999320, "Score": 1, "Body": ":D\nHUGS to you!", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "37": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481005373, "Score": 2, "Body": "Such a beautiful set framing an incredible body - still fascinated by your ink as well. Thank you for sharing!", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "38": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481005945, "Score": 2, "Body": "You are quite welcome! ", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "39": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1481017732, "Score": 1, "Body": "It's totally ok to show your results in a table, and it's one of the most common ways to do it !", "Permalink": "https://www.reddit.com/by_id/t3_5grwjn.json"}, "40": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1481050834, "Score": 1, "Body": "Hi fellow Biochemist/ biophysicist here! Tbh I found the results and discussion much easier than the introduction. I had my methods laid out for a long time. I would start with making your figures.. then do the results, then discussion, then the introduction, and then the abstract. Methods can be done any time and is imho the easiest section. Introduction and the abstract were the hardest to me, only because you need to have an idea as to what your findings are before you can write a decent introduction.", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "41": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1481062368, "Score": 2, "Body": "Few things.\n\nFirst of all, since you are asking for universities, without knowing if you have any particular areas you are looking at, I would suggest looking at the University of Manchester (UK) as it does a lot of research in the areas you seem to be interested in.\n\nSecondly, I find that academics are usually quite approachable, so try sending friendly emails to potential supervisors/people working in the groups you are interested in to see if they have space/funding opportunities/if there work is of interest to you; don't get too disheartened if they don't respond, some people just won't respond.\n\nFinally depending on what you want to work on, you might consider looking at research groups that are not condensed matter physics but which might have projects in the area. For example, if you are interested in working with semiconductors, you might consider looking at high energy/particle physics/nuclear physics groups as some of those groups will work on things like detector development, and from what i hear those sorts of positions tend to be less competitive as people going into something like particle physics often don't go in it to develop detectors. ", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "42": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1481072214, "Score": 1, "Body": "It's a bit late for somebody deep into the programme.", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "43": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1481072367, "Score": 1, "Body": "I'm doing the exact same thing. Hoping to do my PhD part-time. Since in my country we have to pay for our PhDs, with no funding, and government cutbacks to student support, it's financially infeasible for me to continue to be a full-time PhD student.", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "44": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1481072512, "Score": 1, "Body": "Practically every PhD student misses stuff from the literature review. You thesis / dissertation will rarely, if ever, be accepted without modifications. Just do the best you can and don't sweat it.", "Permalink": "https://www.reddit.com/by_id/t3_5gmo93.json"}, "45": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481072765, "Score": 1, "Body": "Finish the course work. Get a job and make something at work part of your research! ", "Permalink": "https://www.reddit.com/by_id/t3_5gccnu.json"}, "46": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481073002, "Score": 1, "Body": "For me it's not the money, it's the time and feeling like i'm listening to a bunch of random people spout bs. It's frustrating because I need to just work on my stuff... reading random stuff I don't need and listening to other people multiple times a week just eats away at my time. At this stage I need to just study my stuff and get it done. But gotta jump through those never ending hoops. I get why they there, but jeez is it frustrating some times. \n\nBut now I know this is how I feel. I can either complain more, or I can get over it, stop feeling sorry for myself and get my s#1t together.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "47": {"Subreddit": "WitchPhD", "Author": "Whohasathrowaway", "Date": 1481073392, "Score": 2, "Body": "So incredibly sexy and beautiful and…oh my goodness the lingerie has kitties on it and it's adorable. ", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "48": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481073427, "Score": 1, "Body": "Join a group, a sport, go to the gym\n\nFind out about events, conferences, talks... just go and meet people\n\nJoin a committee \n\nVolunteer\n\nFind out when other people study in the shared space, talk and get to know them,\n\nPlay board games or get food/coffee together\n\nGet involved in things, but not too much, don't get overwhelmed or overworked. At the end of the day you have to get your work done too.\n\nFind out if there is an improv group on campus. Go, make friends. Do improv. Might be the best experience you have.\n\n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "49": {"Subreddit": "WitchPhD", "Author": "Whohasathrowaway", "Date": 1481073675, "Score": 2, "Body": "This is a gorgeous shot. If you will forgive for turning Justice Potter Stewart's famous quote on its head: I will not attempt to define art, but I know it when I see it. ", "Permalink": "https://www.reddit.com/by_id/t3_5gvrmz.json"}, "50": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481073724, "Score": 1, "Body": "Sitting down and doing work is 95% of it. The other 5% is sleep. \n\n[be realistic and realize other things happen, but focus on the above]", "Permalink": "https://www.reddit.com/by_id/t3_5caq7r.json"}, "51": {"Subreddit": "WitchPhD", "Author": "GameofWhores", "Date": 1481073830, "Score": 2, "Body": "beautiful ", "Permalink": "https://www.reddit.com/by_id/t3_5gvrmz.json"}, "52": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481073884, "Score": 1, "Body": "Don't quit. \nDon't worry, be happy.\nFind ways to destress and decompress. \n\nMost of the pressure comes from your expectations...\n\nWork hard, be organized and chip away.\n\nTake of yourself.\n\nStay focused and remind yourself why you are there.\n\n\n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5b2sd4.json"}, "53": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481073970, "Score": 1, "Body": "Welcome to grad school.\n\nWork hard so they don't have to edit.\n\nAnticipate.\n\nWrite well.\n\nPay someone to edit it for you.\n\nStop making your profs proof read.\n\nWrite the best work you can under the circumstances. \n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "54": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481075549, "Score": 1, "Body": "Thank you! You are forgiven. :)", "Permalink": "https://www.reddit.com/by_id/t3_5gvrmz.json"}, "55": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481075587, "Score": 1, "Body": "Meow!", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "56": {"Subreddit": "WitchPhD", "Author": "viper67", "Date": 1481120864, "Score": 2, "Body": "I love it. This is extremely classy and quite original. Now that that's out of the way, that's a gorgeous boob. 😘", "Permalink": "https://www.reddit.com/by_id/t3_5gvrmz.json"}, "57": {"Subreddit": "PhD", "Author": "Kinnazo", "Date": 1481120996, "Score": 1, "Body": "Am also interested!", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "58": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1481121199, "Score": 3, "Body": "A PhD is a very different degree than your undergrad. I assume you are in the US. The way a PhD generally works is that in the STEM field  (what I assume you will go into if you are interested in pharma) PhDs are all paid for. Further, you get a stipend to live on as well. In your PhD you will take classes for the first year (depending on program, could be 1.5 years) but the rest of your 5-7 years are spent doing research. A PhD is considered more than a full-time job, so having a job on the side is not really an option.\n\nYour salary can come from a few places. If your advisor is well funded (has lots of grants) he will likely pay your salary through his grants. If your advisor is not well funded,  he will likely make you be a teaching assistant for 1-2 classes a semester, in which case the department pays for your tuition and salary. The third option is for you to apply for your own funding. This is generally done during the first year of your grad school. There are many governmental  (nih, nsf, DoD,..) and private (gates foundation, AHA, ...) sources for funding. Your school might also have a few grants available internally. For most, you need a research proposal, which generally means you need to know what you will be working on (depends whose lab you work in, and what you do).\n\nThe application process from far looks pretty similar to undergrad (you apply to the school, you need letters of reference and personal statements) but the successful applicants generally know who they want to work with  (unlike undergrad, you will spend 90% of your time working for one professor) and have contacted that person telling them they are interested in their lab.\n\nFor most top tier school, you need a good GPA, GRE scores, letters of recommendation  (from tenured/tenure track professors not really others) and a history of research (with hopefully publications with your name on, or poster presentations at national conferences) ", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "59": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1481128046, "Score": 6, "Body": "I know this isn't exactly what you are looking for, but have you tried the software Mendeley? I swear by it. I point it to my folders with all my articles in PDF, and I can use it to search for keywords across articles. So if I am trying to understand concept X, or remember a certain result Y but forgot which article it was in, I just plug in the keywords X or Y and search and all the matches come up. It saves me a lot of time digging trough articles and remembering where I read something. ", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "60": {"Subreddit": "PhD", "Author": "Apfel", "Date": 1481130596, "Score": 1, "Body": "If you're in the UK, a good way in is to get a job as an RA at the University/dept of your choice after you're done with your master's degree. At that point you can then backdoor your way into the best scholarships/projects for PhDs.", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "61": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1481131991, "Score": 4, "Body": "Second for Mendeley, you can highlight and take notes right in the program as well, and you can tag articles so if you have a lot of a similar concept you could give them all the same tag and search that way too (although I normally just search a keyword like you suggested).", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "62": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1481132293, "Score": 3, "Body": "I use Papers, available on Mac and Windows.\nBut Mendeley and a few others seems to do the same job, and do it well !", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "63": {"Subreddit": "PhD", "Author": "ymialien", "Date": 1481133902, "Score": 2, "Body": "This looks like vector art, using a program like illustrator or Affinity Designer (there are other options online, some of them web-based and free) can help either create new vector art, or use freely available art on websites such as freepik.com\n\nVector design programs have a learning curve, but for basic designs it's not too hard!", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "64": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1481134532, "Score": 1, "Body": "Thank you, I'll take a look at free online ressources before trying vector design programs then", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "65": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1481135438, "Score": 1, "Body": "You'll probably want something that generates a vector, rather than a bitmap. Vectors can be scaled to any size without getting pixelated, meaning they look nice in papers. \nI use Illustrator, which is expensive and has a learning curve, but it's the \"best\" tool out there imho. \n\nAlternatives would be to make something from scratch in a free program, like Vectr or Inkscape.\n\nSomething that you can do very quickly is to rough out what you want in Powerpoint or Google Slides and export the slide as a pdf (a vector image), which you can then import into something like Inkscape to do some clean-up / tweaking. The benefit of this is that the creative side of things, like making a rectangle, for instance, is something you probably already know how to do in ppt, but might be more challenging in a new program with weird vector tools. ", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "66": {"Subreddit": "PhD", "Author": "Y4444S", "Date": 1481137061, "Score": 3, "Body": "EVERNOTE. Screencaps, copy and paste, tag/keep in notebooks to organize. I use my phone to take pics of entire pages. Menedely is expensive if I remember correctly. Evernote is free, or $45 if you want to go into power mode. \n\nScrivener also does the thing you're talking about. Scrivener is fabulous, but I like being able to manipulate my notes a little more in evernote to keep my resources. ", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "67": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481138013, "Score": 1, "Body": "Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_5gvrmz.json"}, "68": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1481142131, "Score": 5, "Body": "I use Zotero- similar to Mendeley I believe.  Its free!  ", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "69": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1481142661, "Score": 2, "Body": "If you go to the smart art tab in Power Point I think you could create something similar to the image you posted", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "70": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1481145599, "Score": 6, "Body": "Inkscape", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "71": {"Subreddit": "WitchPhD", "Author": "MTMFDiver", "Date": 1481150675, "Score": 1, "Body": "Very WASP starlet  ;) beautiful as always", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "72": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481155867, "Score": 1, "Body": "WASP? I wouldn't say that...", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "73": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1481156670, "Score": 2, "Body": "I love your little slice of the Internet right here!!  Extra bonus that you are so diligently feeding my addiction...  little bits everyday..  \n\nThe come down is going to be ugly.", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "74": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1481159733, "Score": 2, "Body": "I tend to use drawings.google.com. It is nice because it allows you to align shapes easily but it's just an upgraded paint. The good thing is that it allows to export in several formats, including SVG :-)", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "75": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1481160080, "Score": 2, "Body": "Canva is a pretty good online tool for this sort of thing", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "76": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1481166750, "Score": 1, "Body": "Evernote stopped working for me on Mac :( :( It crashes or randomly the features just don't work.", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "77": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1481170358, "Score": 2, "Body": "Microsoft Visio is pretty good for flowchart looking things.", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "78": {"Subreddit": "PhD", "Author": "Giapiemunstra", "Date": 1481180288, "Score": 3, "Body": "I would recommend Zotero or Docear.", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "79": {"Subreddit": "WitchPhD", "Author": "MTMFDiver", "Date": 1481180363, "Score": 1, "Body": "I think it's more the outfit in combination of you fair skin and dark hair too. ", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "80": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1481191772, "Score": 2, "Body": "Whether this was supposed to be funny or not, it made me laugh. Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_5h1ak9.json"}, "81": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1481193019, "Score": 9, "Body": "Geesh, you aren't supposed to give them the realistic timeframe of 5-7 years. You are supposed say, \"it usually takes 3-4 years, but *in some cases*, it takes up to 5 years\" so that they feel pressured to meet these expectations, and when they fall short of it, they have at least made enough progress to wrap it up by 5-7 years. But c'mon, if we start telling people outright that it takes 5-7 years, can you imagine the consequences?", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "82": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1481219272, "Score": 6, "Body": "&gt; (unlike undergrad, you will spend 90% of your time working for one professor)\n\nCorrection: you will spend 110% of your time working for one professor.", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "83": {"Subreddit": "PhD", "Author": "0_orez", "Date": 1481223481, "Score": 1, "Body": "I have emailed about 20 professors in last two week, but I haven't received a reply yet.", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "84": {"Subreddit": "PhD", "Author": "0_orez", "Date": 1481223562, "Score": 1, "Body": "Thank you, this was helpful.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "85": {"Subreddit": "WitchPhD", "Author": "Hairyladylover", "Date": 1481259535, "Score": 1, "Body": "You're the best :)", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "86": {"Subreddit": "WitchPhD", "Author": "skip_hunter", "Date": 1481268718, "Score": 1, "Body": "Spanksafe! ", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "87": {"Subreddit": "WitchPhD", "Author": "skip_hunter", "Date": 1481268837, "Score": 1, "Body": "Spanksafe! ", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "88": {"Subreddit": "WitchPhD", "Author": "gerchoc44", "Date": 1481272827, "Score": 2, "Body": "I like your butt. ", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "89": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1481310760, "Score": 1, "Body": "A pen....and wait for it....paper. People who use laptops spend more time browsing the internet than taking down the notes. Pen and paper is definitely faster for most people, and you can draw diagrams so much easier. Can't beat pen and paper. Upload it later to a program to revise it", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "90": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1481313642, "Score": 1, "Body": "I just finished, but I am unsure I will even get one published paper. My advisor didn't get tenure after not publishing for 7 yrs, having terrible teaching reviews, getting no grants, and being a general asshole.... He is genuinely surprised and says it's all political! I have been trying for a year to get this paper we submitted revised only for him to tell me he is 'toobusy'. I doubt I will ever talk to him again once he leaves the university here in a couple of weeks. All of my work can be put into two glorious publishable papers (doesn't seem like a lot, but the work took an outrageously long time), I don't know if I will even get one published. Oh and... He never read my thesis (even after annoying him for 6 months to read it), just signed off on it, then complained that it was terrible. Fun times. I liked the research though. :&lt;", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "91": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1481314093, "Score": 1, "Body": "Unfortunately, I have a micromanager advisor who refused to let me turn anything in without her approval - thus the delay. I would prefer to do things on my own bc it would a lot quicker, but I've learned her habits after 4 years.", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "92": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481323397, "Score": 2, "Body": "Josh?", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "93": {"Subreddit": "WitchPhD", "Author": "EastCoastTech", "Date": 1481325746, "Score": 4, "Body": "That outfit is incredibly hot. I would love to be possessed by this demon ", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "94": {"Subreddit": "WitchPhD", "Author": "bb0xx", "Date": 1481330896, "Score": 2, "Body": "You are absolutely, astoundingly gorgeous!", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "95": {"Subreddit": "WitchPhD", "Author": "MTMFDiver", "Date": 1481337583, "Score": 1, "Body": "That is both awesome and woah damn sexy! ", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "96": {"Subreddit": "WitchPhD", "Author": "Quentin22", "Date": 1481357788, "Score": 3, "Body": "You can have my soul.", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "97": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481367356, "Score": 2, "Body": "Away for a few days and this is the first post I return to - beautiful, complete and complimented by how toned you are. Utterly mesmerizing.", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "98": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481367686, "Score": 2, "Body": "Possibly the most beautiful outfit I've seen you in, such intensity in such modest class.", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "99": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481384157, "Score": 1, "Body": "Thank you, good sir. ;)", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "100": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481384212, "Score": 2, "Body": "Your sacrifice is appreciated. ", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "101": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1481384874, "Score": 2, "Body": "Is it weird that I want to wantch you switch all the lights off in my house with your nipples....?\n\nThat, and enjoy you playing with your skulls?\n\nYou give me dirty thoughts.", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "102": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481389557, "Score": 2, "Body": "My lady the pleasure is absolutely mine", "Permalink": "https://www.reddit.com/by_id/t3_5h2to4.json"}, "103": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481394934, "Score": 3, "Body": "It's not weird, only natural. :)", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "104": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1481397518, "Score": 1, "Body": "You're kind!!  And pretty awesome to put yourself out here for us to enjoy!  I really love everything you post! \n\nIt seems like every business has its seasons of activity... especially busy months and then slower times.  Is this a crazy time for you or is it a bit slower with the holidays?", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "105": {"Subreddit": "PhD", "Author": "Y4444S", "Date": 1481402696, "Score": 1, "Body": "Oh no! It runs fine on my 5-year-old Mac, I'm surprised. I had some troubles with it a while ago - I wanted to search things and the OCR on PDFs wasn't working. Uninstalling and re-indexing my notes worked like a charm.", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "106": {"Subreddit": "PhD", "Author": "Bambi1322", "Date": 1481403290, "Score": 6, "Body": "A good place to start would be to identify the prominent academics in the field that you're interested in (happiness). Once you know who they are, start reaching out to them and looking for opportunities at those universities. \n\nFinding the right PhD with the right supervisors is alot of effort... much like the PhD will be when you arrive! \n\nGood luck", "Permalink": "https://www.reddit.com/by_id/t3_5hlu1e.json"}, "107": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1481451483, "Score": 1, "Body": "Positive psych schools\nThere are many popping up\nNorthern European researchers seem to be very active ", "Permalink": "https://www.reddit.com/by_id/t3_5hlu1e.json"}, "108": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1481480343, "Score": 1, "Body": "There's nothing wrong with putting a partial PhD on your CV - it's far better than looking like you were unemployed for years.  It's basically the same scenario as someone who's quit a job, so you should have a careful, well-thought-out answer for in the interview if/when they ask you why you chose to leave: something that demonstrates a reasonable level of personal awareness, shows how your interests fit the company's work better than a PhD, or at least something doesn't make it seem like you'll be a bad employee.", "Permalink": "https://www.reddit.com/by_id/t3_5hms1n.json"}, "109": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1481481975, "Score": 1, "Body": "Same position here, although much less time (only a few months, but left a stable job to pursue a PhD). For me I'm pretty comfortable talking about the skills I worked to develop during that time, and saying that I realized I'd got everything I needed to out of the experience. A PhD is supposed to be \"research training\" in essence, so any trainings attended or skills sharpened are fair game. \n\nIf pressed, I have also done a lot of work to be self-aware about the aspects of PhD life that weren't for me (isolation parlays nicely into 'being a team player', 4 year project management differs greatly from 6months-1 year project management, etc). ", "Permalink": "https://www.reddit.com/by_id/t3_5hms1n.json"}, "110": {"Subreddit": "PhD", "Author": "hechterooskie", "Date": 1481483733, "Score": 1, "Body": "Just curious are you looking at getting out of your PhD program or has this already happened?", "Permalink": "https://www.reddit.com/by_id/t3_5hms1n.json"}, "111": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1481494664, "Score": 1, "Body": "No I want to complete my PhD but I have noticed that a lot of the jobs I was working towards are now more accepting of those with a master's whereas before the requirement was a PhD. Now it is more master's and some years experience with certain skills. So it got me thinking...if my dream job became available sooner than later and I was able to apply for it and meet the requirements, then that was my end goal anyways. But I would still complete my PhD because the program I chose (specifically) has me learning a lot of new skills that the jobs I want would also require you to have.", "Permalink": "https://www.reddit.com/by_id/t3_5hms1n.json"}, "112": {"Subreddit": "WitchPhD", "Author": "Kevin-McCockster", "Date": 1481495661, "Score": 1, "Body": "You remind me of Amélie, a sexy punk rock triple X version. Always a pleasure to see your posts!", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "113": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481497825, "Score": 0, "Body": "try taking SAM-E or 5-HTP. It will cure your anxiety, but might make you less motivated.", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "114": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1481498695, "Score": 1, "Body": "thanks! have you taken this before? do you feel it helps? ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "115": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481500859, "Score": 2, "Body": "Yes. SAM-E affects both dopamine and serotonin levels, while 5-HTP is a serotonin pre-cursor, so only affects the serotonin.\n\nI would try SAM-E. Just take 200mg in the morning and see how you feel that day.\n\nObviously, don't mix with anti-depressants.", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "116": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481505453, "Score": 1, "Body": "I get that a lot! :)", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "117": {"Subreddit": "PhD", "Author": "PierceBrosman", "Date": 1481507799, "Score": 8, "Body": "Physical exercise has always been very helpful for me. Even just going for a walk or a short bike ride. I always feel emotionally better after exercising, and taking a step back from things helps bring clarity and perspective to my work (or other aspects of my life that I am having trouble with). Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "118": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1481512569, "Score": 5, "Body": "Do you work alone in an office? Try going to the library, despite all the noise the fact that people are around does help a lot. You \"have\" to work when you're there.\n\nGood luck!\n\n\nedit: what's a prospectus?", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "119": {"Subreddit": "PhD", "Author": "Hollycopter83", "Date": 1481513960, "Score": 3, "Body": "I've been in your shoes, and it does get a little easier to work after about 30 minutes to an hour of trying. The first 20 mins are the hardest when you sit down -- the anxiety can overwhelm. Just keep trying to think logically, and work through the problems as they arise, and as your brain calms down a bit your creativity will kick in more. Oh, and make sure you are exercising regularly, drinking plenty of water, have a relatively low-clutter space to work in, and eat healthily. good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "120": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1481515977, "Score": 2, "Body": "So I've actually been doing work as a Pharm.D./M.S and just decided to transition into a Pharm.D./Ph.D, doing basically [exactly] pharmaceutical research. \n\nFor Application:\n\nI can't discuss much about the application process, as mine is probably entirely atypical and I don't want to mislead. As for what I've seen for others,  the less optimistic people applied as a MS (which is you paying tuition) just to get their foot in the door, then were fairly rapidly brought in as a PhD student once they proved their chops in the coursework/lab. I'd also concur with what much of everyone else has stated as far as direct-to-PhD, though. \n\nFor School/Projects:\n\nHowever, as far as the balancing work and PhD studies, go I haven't found it to be terribly difficult. I mean I always feel like I never have enough time in the lab, but one of the nice bit of what I do is  about 50% computer modeling and 50% wetbench/clinical work, so I am not always tied down to my desk and can do it at home before going to bed and stuff. \n\nMy PI is pretty [really] awesome and lets me be the driver of my own sort of projects (with his guidance and \"suggestions\" of course), but it's good because I'd say of my several projects, about 60-75% are based on all the grants and what not he has for the lab, then the remainder are a lot of the high risk-high reward projects that are cool to do and if they work would be amazing.\n\nIn pharmaceutics, it can be incredibly interdisciplinary. I, for one, have to have a fairly good knowledge base in statistics, DiffEqs, computer programming, physiology, pharmacology, biochemistry, and microbiology. \n\nAs for Funding:\n \nI've applied to a grant in the past to get me some extra monies, and it has been successful. Now that I'm into the PhD, the department provides me with a stipend for 2 years (anything after that is supposed to be supplied by my PI). I also have plans to apply for some grants outside of this just because I'd like the extra money. \n\n\nIf you have any other questions feel free to ask!", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "121": {"Subreddit": "PhD", "Author": "JForseti", "Date": 1481527385, "Score": 1, "Body": "Third for Mendeley, I have nothing to add, it works great. Close to the end of my PhD now and it's excellent to quickly look up notes from the last few years.\nUnlike what the person below says, Mendeley can be used for free (I do).", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "122": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1481528421, "Score": 1, "Body": "I use zotero to manage my library of papers and usually read them using PaperShip on my iPad where I mark them up with notes and highlights. These sync up with zotero. It's a good system. ", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "123": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1481546605, "Score": 1, "Body": "I started my PhD early this year. I just had my confirmation last month (a report and presentation that confirms your candidature is viable) and got good reviews. I'm having a great time. My supervisors are excellent and supportive, I've made some good collaborative links, I get on well with the other students and faculty, and have some decent results so far. \n\nI guess people in my situation don't feel the need to post on here as much. ", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "124": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1481546898, "Score": 1, "Body": "I also think this metric is useless for academic writing. There is good and bad, clear and unclear academic writing, but by its nature it will be dense and laden with technical terms and jargon. ", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "125": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1481556561, "Score": 2, "Body": "Thank you! It really helps to think about it in that way. I forgot that that's a good trick for anxiety! :) ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "126": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1481556598, "Score": 2, "Body": "Thanks for this comment - per your advice, I will in fact go to the library today!! I think that would help. Thanks for reminding me! \n\nPS A prospectus is a thesis proposal. ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "127": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1481556641, "Score": 3, "Body": "Thanks - everyone's comments are so helpful. I'm glad I asked! I have been ignoring exercise because I keep telling myself that I don't have time, but maybe I will just have to make the time if that will help with the anxiety! :) ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "128": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1481556656, "Score": 1, "Body": "Thanks! Already ordered it. ", "Permalink": "https://www.reddit.com/by_id/t3_5ht2dh.json"}, "129": {"Subreddit": "PhD", "Author": "wandering_hedgehog", "Date": 1481559679, "Score": 2, "Body": " just email them? maybe don't start your email with YO! or HEyyyy....\n\nTell them a little about yourself and why you are emailing them. If there is a publication that interested you, tell them. Leave your contact details. Be persistent... if they don't email back, email again, or call them - they are busy people so they might have forgotten about you - don't take it personally. if you are in the area, see if you can set up a face to face meeting, look at the environment you will be working in (e.g. lab), ask questions. Important: talk to present or past PhD, Masters students or post docs if possible. They will tell you what this person is really like as a supervisor...\n\nHere is an example of what I wrote a while ago for a project that had been advertised online, but i have written similar emails to supervisors asking if they had a position for me, the opportunity to volunteer, were willing to apply for funding with me, etc.\n\n*Dear XXXX\n\nI am emailing you regarding the PhD project advertised on XXXX on PROJECT.\n\nMy name is XXXX and I am in my final year of studying XXXX at the XXXX. My interests lie in neuroscience, with a particular emphasis on XXXX in XXXX modulation of neuronal function and communication. \n\nAs part of my degree I carried out a year-long industrial placement (sandwich placement) at XXX working on XXX function. While my focus has always been on neuroscience, the opportunity to work in a lab and gain experience was too great to overlook. My time at XXX enabled me to broaden my horizons, as well become comfortable and confident with lab work. The year on placement also allows me to graduate with an MSci.\n\nHaving spent an interesting and fruitful year on placement, I have now started work on my honours project. This project is specifically tailored to my interests, and is looking at the XXX and the effects of XXXX, in conjunction with XXX. Based on past performance and recommendations from my lecturers, I am on track for a First Class Honours Degree (BSci).\n\nThe advertised project sounds very exciting, and as you can tell from my honours project, it also sounds in line with my interests, and I was hoping you could tell me more about the details of the project and about funding options, as I understand that it is self-funded.\n\nI look forward to hearing from you. I am available via email as well as mobile (XXXXXX).\n\nKind Regards,\nXXXXXXX*\n \n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5hw8yf.json"}, "130": {"Subreddit": "PhD", "Author": "Knirkefri", "Date": 1481560480, "Score": 7, "Body": "I recently traveled from Europe to the US to give a 20 minute presentation of a minor point from my dissertation. What I took away from the feedback was that my research was \"very interesting\". It's just how it's done - one travels, one mingles a bit, smiles and shakes hands, then one goes back home and does actual work. Maybe academia hasn't caught up with technology, or maybe it's on some level valuable to meet other scholars face to face, but I would rather just stay in my office.", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "131": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1481564782, "Score": 4, "Body": "I'm on my way back from the US in the exact same case. While this might be frustrating, I cope with the fact that now I have a \"personal relationship\" with those people. It's not going to sound very hopeful but in my experience, depending on the field, academia can very well be a mafia where you need to know people in order to get things that should be attributed to merit. It's often hard to estimate and compare the value of PhD students / postdocs, and blind peer review isn't really always blind (or done by the reviewer, I know I've done reviewing in my advisor's name), so what also plays a role is \"who do you know\".\n\nSo a useless meeting will perhaps get you invited as an invited speaker next year instead of someone just as qualified as you just because you have a relationship with the organisers, or maybe they'll think of you when they need some peer review, etc etc. It's a pessimistic view of academia but that's really the only way I've found to give meaning to those useless meetings..", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "132": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1481572393, "Score": 5, "Body": "Sacrificing one of our few world class sectors just to please the Daily Mail with some phoney reduction in migrant stats.", "Permalink": "https://www.reddit.com/by_id/t3_5hxq05.json"}, "133": {"Subreddit": "ELIPhD", "Author": "slimypoo", "Date": 1481576305, "Score": 1, "Body": "kk", "Permalink": "https://www.reddit.com/by_id/t3_5hyojc.json"}, "134": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1481576401, "Score": 1, "Body": "Imagine if you're planing to apply to a UK phd program next year, like myself... But I guess Germany is a nice country with great unis :D", "Permalink": "https://www.reddit.com/by_id/t3_5hxq05.json"}, "135": {"Subreddit": "PhD", "Author": "wandering_hedgehog", "Date": 1481578403, "Score": 1, "Body": "\nHmmm well I don't know about social science (or even actually doing a PhD - I'm kind of in the same boat as you but applying for funding in a biomedical field). Here's my attempt at an answer though:\n\nI can't imagine you would be very successful without a supervisor in your application - funding bodies want to give money to people that will definitely be doing a PhD. For that you need a supervisor (and a uni) to have accepted you. To a supervisor, a PhD student comes with a lot of benefits (namely publications) but also a lot of work (technically). You should probably try to find a supervisor whose interests somewhat align with yours - no sense for them in you researching and publishing on topic X, when they want more publications on topic Y. Is there any way you can twist you idea to fit what they do?\n\nI understand that you are running out of time though. Do you already have your proposal and application ready to go? It might be worth following up with the supervisors you were in touch with before - chase up the ones that never replied (!). Since you already have the proposal and application done, they don't really need to do anything. Saying that, having a potential supervisor read your application before submitting would be very helpful - they tend to know what they're doing. ", "Permalink": "https://www.reddit.com/by_id/t3_5hyzwp.json"}, "136": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481578820, "Score": 2, "Body": "From my understanding of the UK (I'm from the American system of things), you will need a pretty well thought out topic, that needs to gel with a supervisor. Without speaking to a potential supervisor, it will be very difficult to know that your research makes sense both in terms of scope, and also in terms of interests (that they're actually interested in supervising that topic).", "Permalink": "https://www.reddit.com/by_id/t3_5hyzwp.json"}, "137": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1481580289, "Score": 1, "Body": "So sorry you had a rubbish Viva. Thanks for posting your experience, it is a very mysterious process. All the best with the amendments. ", "Permalink": "https://www.reddit.com/by_id/t3_5hs46x.json"}, "138": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481590066, "Score": 1, "Body": "I don't have pointless meetings. If you have nothing to talk about - cancel the meeting.", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "139": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481592438, "Score": 0, "Body": "just stop now. social sciences... wtf", "Permalink": "https://www.reddit.com/by_id/t3_5hyzwp.json"}, "140": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1481602057, "Score": 3, "Body": "Some times you've just got to play the game. I'd say 60% of academia and grad school is putting in the effort to work and collaborate with people, go to weekly seminars, department lunches, make a good impression. It may not be what you want to do but, it may also be necessary. Science is a small world and if you go into meeting with an attitude and it shows that you think this meeting is a waste of time, these people will remember it. Just saying. \n\nMy advice is to pick your battles with this, taking a day to work on a collaboration with your boss isn't the worst thing to do, bond with your boss, make a good impression with your collaborators that you know your shit and call it a day. The only time I'd raise concern about this is if it becomes a weekly thing but occasionally is not big deal in my book. Remember, you are the low man on the totem pole here and your time is not more valuable then theirs and I could see some issues arising from this if you have this attitude. ", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "141": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1481602580, "Score": 1, "Body": "If you have the time, then why not. If you are stretch for time, then it looks like you've already reached that point in your career where you need to ditch out on certain things. If your advisor lets this happen again and again, he is setting a bad example. In today's market, professors can't afford to be like that.", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "142": {"Subreddit": "PhD", "Author": "sorryitsathrowa", "Date": 1481626030, "Score": 1, "Body": "Thanks for your reply. To clarify as it seems to be very different based on your reply at different institutions: the funding is awarded by the university and the department, not the supervisor, so you should ideally have a potential supervisor lined up, but this is also not a guarantee of acceptance or funding. I do actually know people who have applied without a research proposal or a supervisor and been accepted, but I suspect this is more rare than the usual route. Also, your PhD work is supposed to be your own, I know that varies in some fields. So I should have already written a RP on my own and that's for the supervisor to consider whether she/he'd like to supervise me. So I am applying for a placement and funding which are the same application rather than just funding at this point in case it wasn't clear. My application is almost ready - the RP is a draft (I want to tweak it a bit still), but it will be ready for the deadline. My main issue is whether it's insane to even try applying without having found a supervisor who has agreed to take me on. I really don't want to have to wait a full year to apply next year. Part of the reason it's so late is that my family are relocating, so the universities I could apply to has suddenly changed, so that is part of the reason I didn't start sooner than I did. \n\nI know my RP isn't crazy however, I have had some feedback on the RQ that it's a good one, but it's just finding someone who has room for another student (or is responsive to email). I have had some positive feedback from experts in the field, but just not having found a potential sup so far has me rather concerned. ", "Permalink": "https://www.reddit.com/by_id/t3_5hyzwp.json"}, "143": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1481626228, "Score": 7, "Body": "Nothing fun to report, but remember to take your time! Biggest mistake is to try and rush it. Don't be afraid of silence either, don't feel like you have to talk constantly - take a second or two and breathe, then move on to your next point. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "144": {"Subreddit": "PhD", "Author": "sorryitsathrowa", "Date": 1481626241, "Score": 1, "Body": "Thanks for your reply. I have a pretty well developed research question and I have spoken to people in the field who have said it's good - however none of them are in a position to supervise me, unfortunately. I've been told that my PhD research would very much be my own. It's great if your supervisor is interested in your research, but they needn't be. Obviously I would prefer that they were interested, but it's not always the case that you can find the perfect fit. ", "Permalink": "https://www.reddit.com/by_id/t3_5hyzwp.json"}, "145": {"Subreddit": "PhD", "Author": "Throwaway241116", "Date": 1481635791, "Score": 1, "Body": "That's actually really interesting and useful. Thanks. I'm still looking at the funding side and if I could realistically fund myself or get grants etc. ", "Permalink": "https://www.reddit.com/by_id/t3_5gzh1o.json"}, "146": {"Subreddit": "PhD", "Author": "sunnydunerz", "Date": 1481636338, "Score": 3, "Body": "I'm an honours student in epidemiology and presented at my first ever conference this year too. I have no idea how large the conference you're attending is, however I presented in front of maybe 30 people, and the entire ordeal wasn't nearly as bad as I had expected. Just relax, and as mentioned, take your time and don't rush through your slides. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "147": {"Subreddit": "PhD", "Author": "sunnydunerz", "Date": 1481636917, "Score": 1, "Body": "I agree with this. On the flip side, you have some supervisors who are extremely unwilling to go out of their way to meet with you and talk things through. I'd much rather have it your way than be paired with an supervisor who isn't collaborative ", "Permalink": "https://www.reddit.com/by_id/t3_5hxg9d.json"}, "148": {"Subreddit": "PhD", "Author": "BertMacklins", "Date": 1481648886, "Score": 1, "Body": "I was in this position last year - this is just anecdotal advice, based on my experience. \n\n- go and visit them in person and ask them (after making small talk obviously) \n- call them \n- get your other reference to go and speak to them (this is what worked for me, only because I knew one of my refs very well)\n- mark email 'high priority &amp; read receipt'", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "149": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481651741, "Score": 2, "Body": "why? You should be way more relaxed. 8 months in is pretty impressive... how is that even possible?", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "150": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1481660525, "Score": 2, "Body": "I'm doing one at a small conference in March, which will be my 6th month. It'll be fine. Most people only ask questions to be polite, not to be mean, and everyone doing a presentation is likely as nervous as you are", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "151": {"Subreddit": "PhD", "Author": "WhatShouldIDoNoSleep", "Date": 1481665138, "Score": 1, "Body": "I have called them twice today; I can't visit them though because we're states away, and my other references are far from them too. I can try the email thing again though. Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "152": {"Subreddit": "PhD", "Author": "ShittensMaw87", "Date": 1481670301, "Score": 2, "Body": "I had planned to attend this event but unfortunately I was ill. Thanks for posting a summary of the various talks! ", "Permalink": "https://www.reddit.com/by_id/t3_5i3n64.json"}, "153": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1481672768, "Score": 1, "Body": "One semester seems like a small sample size to be drawing any conclusions.", "Permalink": "https://www.reddit.com/by_id/t3_5i1me5.json"}, "154": {"Subreddit": "PhD", "Author": "Lee_the_scientist", "Date": 1481679562, "Score": 1, "Body": "I may be new to this as a student but I'm not new to this process, I've been in research labs for a few years.", "Permalink": "https://www.reddit.com/by_id/t3_5i1me5.json"}, "155": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1481699230, "Score": 11, "Body": "Let me get this straight... You're about to defend your thesis to receive a PhD and you're asking on Reddit what you should study?", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "156": {"Subreddit": "PhD", "Author": "sings_in_the_shower", "Date": 1481700033, "Score": 2, "Body": "Advice: Don't screw up.", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "157": {"Subreddit": "PhD", "Author": "caz-", "Date": 1481700656, "Score": 2, "Body": "I can't really give meaningful advice because I didn't have to do a defence, but aren't you just going to be asked questions about your thesis? You should know it in detail. \n\nConsidering that your examiners will be experts in the broader field you are working in, I'm guessing they might ask related questions that you might have trouble with, but you should just be able to be honest. For example, if they ask \"can your technique be used in conjunction with method X?\", I would think it would be perfectly acceptable to tell them that you're not familiar with method X, unless it's something really common that you *should* know, or that you've discussed in your literature review.\n\nBut yeah, you know more about your topic than they do, so is there really anything to worry about?", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "158": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1481709599, "Score": 1, "Body": "In the same boat, getting paranoid. :(", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "159": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1481724170, "Score": 2, "Body": "Which country are you in? Which university? \n\nI had my defence last week at a UK university. \n\nMy examiners asked me first to give an overview of the thesis, might not be a bad idea to have a 3-5min summary of it, assuming you are in something vaugely STEM:\n1) What the problem is \n2) Why it is bad/what have others done to fix it/what you had done to measure it\n3) What you did to address it\n4) What you measured as your improvement and why it beats what others have done. \n\nFollowing that, we went roughly page by page through the document and they asked questions about things they didn't understand or didn't agree with. \n\nIn many cases, even after 20-30mins of conversation, we still didn't agree, but we could agree on what changes we could make to the document to make everyone happy. For example, I used a specific abstraction, they didn't think it was necessary, I did. We all agreed that if I provide an explanation about why it is necessary (only a couple of sentences) then we'd all be happy. \n\nMostly the examiners were trying to figure out \na) if I had actually done the work and actually knew what I was talking about\nb) if they could actually understand the work and agree that it was worth of a PhD\nc) if we could all have an intelligent conversation as fellow researchers (which would make me qualified for the degree). \n\nOverall, you should try to enjoy the defense. It's the one and only time that someone will truly give a shit about what you've spent the last 5 years working on. \n", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "160": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1481724673, "Score": 2, "Body": "RE: preparation\n1) read the document cover to cover, ideally twice if you can. Highlight/underline any key phrases that summarise the problem. e.g. you will probably have something like a thesis statement \"it is the thesis of this dissertation that dogs jump higher for red balls\" and some kind of conclusion statement \"In conclusion, I showed in this dissertation I showed that dogs jump higher for red balls\".\n\n2) work on your overview presentation/summary. Do not assume that the examiners are experts in your field. You are the expert now. Try to approach them as masters level educated, smart, interested people. \n\n3) think about your method and analysis and try to come up with some brief words about why your method and analysis backs up your thesis/conclusions. This will be pretty much the core of what you'll be examined on.\n\n4) relax. If you've got this far, the defence is scary and should not be taken lightly, but it is also pretty much a formality and you should try to have fun with it. ", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "161": {"Subreddit": "PhD", "Author": "EvieeG", "Date": 1481727139, "Score": 1, "Body": "The link doesn't work :(", "Permalink": "https://www.reddit.com/by_id/t3_5fwo41.json"}, "162": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1481729259, "Score": 1, "Body": "Breathe. \n\nI'm working on my PhD too so I've never done a defense, but I have done plenty of public speaking. So my advice is to breathe. \n\nRemember you are an expert on this topic. You are probably one of the only experts in the world on this topic, if you found your gap appropriately. Your life has been consumed by this topic. You eat, sleep, and breathe your topic. So just breathe. Don't let them fluster you, and if they do understand that they know damn well how scared you must be. If they ask a question you don't know the answer to, breathe and think for a moment.", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "163": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1481735465, "Score": 1, "Body": "There's nothing to study.  Relax, you should already be an expert at any question they could possibly throw at you.  I had a few curve balls I wasn't expecting, but if you are at defense, you have already done the tough part.  [Rarely anything bad happens](https://www.reddit.com/r/GradSchool/comments/2fqjm5/does_anyone_know_someone_who_had_failed_their_phd/).", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "164": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1481735610, "Score": 1, "Body": "Assuming you have whatever presentation, etc. already in the bag.  It seems like you were at that point.", "Permalink": "https://www.reddit.com/by_id/t3_5i8mjd.json"}, "165": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481743529, "Score": 1, "Body": "No promises, but if 2/3 or 3/4 are submitted, sometimes they go ahead and take your application. **Call each institution** and tell them your problem.", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "166": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1481744509, "Score": 1, "Body": "I would ask your HOD about the references. Perhaps you have a reference from your Masters or even Bachelor's if they were at different Uni? I would have a research statement just in case you are asked in an interview. Most Unis are concerned heavily with research output/scope so it would be good to have an idea of this if asked at least. \n\nIf your HOD asked you to apply, you are in a good position, so don't sweat it too much - just be aware that competition for these types of positions is usually very high, so you want to make sure you put your best foot forward - regardless of the experience you have already at the Uni in the past. ", "Permalink": "https://www.reddit.com/by_id/t3_5ibrct.json"}, "167": {"Subreddit": "WitchPhD", "Author": "Modernishlife", "Date": 1481745707, "Score": 2, "Body": "Beautiful shot", "Permalink": "https://www.reddit.com/by_id/t3_5icf8t.json"}, "168": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481749102, "Score": 2, "Body": "Depends on the field.  \nIn some fields it's extra money (ie. business), whereas in other fields it's a vital and necessary component of the funding package (liberal arts, most social sciences).  \n  \nAlso varies by school regarding procedure. If you are able to submit it on your own, you should. If doing so is not practical, then don't. If you submit a POS, it can change. Just copy courses off the departmental website and course calendar. I think the harder part would be having an adviser.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "169": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481749158, "Score": 2, "Body": "Also heavily depends what country. The above was based on knowledge of USA system. European system is completely different.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "170": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481749174, "Score": 1, "Body": "It's Computer Science, STEM, so from what I'm told online I should be expecting a stipend...", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "171": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481749212, "Score": 2, "Body": "USA", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "172": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481749223, "Score": 1, "Body": "If it asks for teaching statement, give teaching statement, and not research statement.", "Permalink": "https://www.reddit.com/by_id/t3_5ibrct.json"}, "173": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1481751095, "Score": 1, "Body": "If you can get a place at Max Planck I would go for that, but apply based on your supervisor relationship and project interest", "Permalink": "https://www.reddit.com/by_id/t3_5g9e9y.json"}, "174": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1481754174, "Score": 1, "Body": "One of my referee's did the same thing. He ended up submitting it the day of the deadline. I had to give him a call to remind him, he was sorry he hadnt done it sooner and said he'd had it on his to do list. They've likely just forgotten. Give them a nudge", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "175": {"Subreddit": "PhD", "Author": "WhatShouldIDoNoSleep", "Date": 1481758588, "Score": 3, "Body": "Do you have someone else who could write one for you? That's what I ended up doing", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "176": {"Subreddit": "PhD", "Author": "WhatShouldIDoNoSleep", "Date": 1481758625, "Score": 1, "Body": "I actually got someone to write the last ones for me; not my original recommender but it doesn't matter, a letter of rec is a letter of rec yknow? Regardless, thank you for the advice! ", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "177": {"Subreddit": "PhD", "Author": "WhatShouldIDoNoSleep", "Date": 1481758666, "Score": 0, "Body": "I did :/ I called her twice and emailed her twice in the past week. I think there's just extenuating circumstances that I'm not aware of. Regardless, I *did* get someone else to write my letters so it's all good now. Thank you though! ", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "178": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481777692, "Score": 3, "Body": "So sounds like the fellowship would be extra money in addition to the stipend, then. STEM tends to be well funded.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "179": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1481782560, "Score": 8, "Body": "I'm in a similar situation, but I'm thinking, \"I've already sunk 4 years into it, I better fucking graduate.\"\n\nI ended up going wih hedging my bets. I converted my PhD to part-time and started looking for full-time work whilst ABD. I'm doing my PhD in the weekends, but even if I don't pass I've still got a job and work experience, i.e. I won't be starting my career from scratch.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "180": {"Subreddit": "PhD", "Author": "highlysensitivehuman", "Date": 1481783807, "Score": 6, "Body": "That sounds very smart, thank you for sharing. I think applying to jobs and getting some work experience would be helpful and give me some perspective. Was your school amenable to part-time PhD-ing? Do they know you work FT?", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "181": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1481791172, "Score": 1, "Body": "Can you transfer to a different programme?", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "182": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1481796176, "Score": 2, "Body": "They know and they're supportive. My advisor is on board too.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "183": {"Subreddit": "PhD", "Author": "atypic", "Date": 1481798975, "Score": -2, "Body": "yeah... just leave. phd is supposed to be fun.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "184": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1481800001, "Score": 1, "Body": "I trust my recommender because he said he's going to do it in time just yesterday. Even if it's going to be late, I was told that admission committee will not start processing immediately. So I am just going to wait. Plus, my SOP talks about my work under the recommender, so I am not having someone else doing it all of the sudden.", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "185": {"Subreddit": "PhD", "Author": "FreepostPlus", "Date": 1481802756, "Score": 4, "Body": "I don't know if fun is the right word. I'd say it's a challenge with a subject the researcher has a passion for. I like what I do a lot, but unfortunately my constant stress does not equal fun. ", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "186": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481811557, "Score": 1, "Body": "No, I know that, I asked about deadlines, and the necessity of applying for fellowships.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "187": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481811631, "Score": 1, "Body": "Great!", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "188": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1481812692, "Score": 0, "Body": "Depends on the country/program. I'm off to my first conference for my PhD at 10 months in and that's pretty standard here. However our PhDs are only 3 years and have no coursework. If you're not ABD at 6 months in then you're in trouble.", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "189": {"Subreddit": "PhD", "Author": "pipistrello1419", "Date": 1481813811, "Score": 1, "Body": "You're v welcome! Hopefully it was useful :)", "Permalink": "https://www.reddit.com/by_id/t3_5i3n64.json"}, "190": {"Subreddit": "PhD", "Author": "Baconate69", "Date": 1481817424, "Score": 6, "Body": "I just graduated with a PhD. I didn't really feel like I was ever going to graduate until I stopped getting bogged down with the small details of my dissertation and trying to get everything the exact way I wanted it. Focus on the big picture. What are your dissertation's specific aims, and what is the path of least resistance to get there? What can you NOT put in your dissertation and still pass? Once you have a clear direction of where you're going you'll get the motivation to slog through the work to get there. \n\nOtherwise if you truly feel like the PhD isn't helping your career, then make a plan for what is the best path for your career. Maybe it really is the right decision to quit and do something more worthwhile, and you could use those 2 years more wisely gaining experience somewhere else. It all comes down to having a plan and executing. Hope that helps.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "191": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481821674, "Score": 3, "Body": "Then you answered your own question. If you already have a stipend, then you don't \"need\" a fellowship. It's just extra money that makes life easier to live as a grad student.  \n  \nThe deadlines are fixed. If it says it's due in December, that means the committee is going to meet in January to decide which applicants get the fellowship money. If there are no good applicants in January, then you may be able to apply late. However disciplines like the liberal arts will always make sure their applications are in early, because funding is so key for them.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "192": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481824220, "Score": 1, "Body": "Ok, I think I've misunderstood you and may have communicated wrong. Let me clarify: I have been told from *random redditors* and *articles online* that STEM gives stipends. And you've said that STEM *tends* to be well funded. I'm looking for *contingency*.\n\n&gt; Most of my [college] applications will be in review until February. However, most of the Fellowship's I can apply for that say they are for first year students, need an advisor AND a Program of Study, **while also having deadlines where, if they haven't already passed, they will pass well before my projected acceptance.**\n\nSome of these have not passed, lets assume I'm talking about those.\n\n&gt; *I don't know if I need to apply to Fellowship's at all*\n\nSo... **Should I apply to Fellowships as backup**, and if so:\n\n&gt; How am I supposed to know my POS this early in the application process?\n\nAs well as details in my research and advisors I don't have (both of which are requested often in these fellowship applications).\n\n**Is it something I have missed out on, not having applied to fellowships already, or is it something not everyone does and I still have plenty of other options?**\n\nNote I have 6 college applications in, and am *hoping* one will give me funding. Is that hope **warranted?**\n\n----\n\nThank you for your help. Just wanted to clarify my questions.\n\nI'm a little panic/stressed so sorry if these sound mean in any way. (I hear that's going to be my life for a while huh? lol)", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "193": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481824954, "Score": 0, "Body": "Europe is messed up this way :D", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "194": {"Subreddit": "PhD", "Author": "ydinpoika", "Date": 1481827891, "Score": 6, "Body": "I just quit my PhD. My last day was today, and I start my new job next month. It was the hardest decision I have ever made, but I personally felt it was the right one for me. I had no data after two years of experiments due to equipment failure, and, to make matters worse, my advisor is leaving my university for a university in a different state at the end of the calendar year. With little to no progress after so much effort, I found myself in a similar position to you; I dreaded getting up in the morning to go to campus and was also seriously considered wrapping my car around a tree. I went to counseling to talk over the decision and get over the feelings of regret and guilt if I did decide to quit, and eventually had the epiphany that I was having \"healthy\" procrastination. My brain was trying to tell me that I no longer had the passion for what I was studying, and that I could find something that would rekindle my fire and drive. I ended up finding a great job that lined up more with what I felt my talents are. So, with that in mind, my advice for you is to seriously reconsider what you want to do with the PhD, and whether it is absolutely necessary for what you want to do. Good luck, and I hope my story and advice helps! Also, don't commit any act of self harm; the fact that you are ABD means that you are among the best and brightest in the world! You are worth it, and will find your calling one way or another!", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "195": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481830485, "Score": 1, "Body": "Stunning - but the question I have to ask is did you prepare the shot yourself or was someone lucky to enough to help?", "Permalink": "https://www.reddit.com/by_id/t3_5icf8t.json"}, "196": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1481833235, "Score": 0, "Body": "I'm not in Europe but yes haha.", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "197": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481834539, "Score": 0, "Body": "Australia as well.", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "198": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481835005, "Score": 1, "Body": "Myself.", "Permalink": "https://www.reddit.com/by_id/t3_5icf8t.json"}, "199": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1481836213, "Score": 1, "Body": "Then you're even more talented - because it's picture perfect!", "Permalink": "https://www.reddit.com/by_id/t3_5icf8t.json"}, "200": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481837375, "Score": 1, "Body": "Josh is that you?", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "201": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481837454, "Score": 0, "Body": "Finish what you started! Get it done! Do your best. Find out what they expect and work you butt off to do it well. Why not... you have the rest of your life to regret it either way... might as well get that piece of paper. ", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "202": {"Subreddit": "PhD", "Author": "highlysensitivehuman", "Date": 1481842326, "Score": 1, "Body": "I am not sure. I'm in my 5th year and it is unusual to transfer this late without moving alongside an advisor. And I worry I'm so burnt out from this experience that I would waste and therefore not deserve a second chance. (Really internalized the shame.)", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "203": {"Subreddit": "PhD", "Author": "highlysensitivehuman", "Date": 1481842744, "Score": 1, "Body": "Are you trying to help or trying to get me to commit suicide? I honestly can't tell by your comment.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "204": {"Subreddit": "PhD", "Author": "WhatShouldIDoNoSleep", "Date": 1481842892, "Score": 1, "Body": "I don't blame you; and hey, if it helps my original recommender got back to me and wrote my letters; I'm sure he'll get yours in too! ", "Permalink": "https://www.reddit.com/by_id/t3_5i1632.json"}, "205": {"Subreddit": "WitchPhD", "Author": "Rimefang", "Date": 1481843184, "Score": 1, "Body": "Question: Was this costume a request? ", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "206": {"Subreddit": "PhD", "Author": "highlysensitivehuman", "Date": 1481843205, "Score": 1, "Body": "Wow, congratulations! I am so grateful to hear your experience. Yes, I too am hoping I'll find a more rewarding use for my skills/intelligence, and that I won't regret leaving. Thank you for sharing :-)", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "207": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": 1481845981, "Score": 2, "Body": "This is what I am doing. It's entirely manageable to work on your PhD part-time while working full-time. I don't feel as much pressure which is actually yielding better results then if I was only focused on the dissertation. Plus it's finally nice to make some cash doing the things that I love. \n\nMy committee is 100% on board with this. Although, I'm lucky that I am working on research that isn't backed by a grant or something that might not be compatible with my relaxed approach.", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "208": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481846691, "Score": 2, "Body": "No, you're putting that spin on it. Please don't put words in my mouth. If you're having thoughts like that, then you should seriously seek help and support. \n\nI was simply saying you should give it a shot. Try your best. Go for it.\n\nThat's pretty straight forward. \n\nMy thoughts are that you should give it a go.\nIf you really hate it and want to quit, then do that.\nIf you can do it, then do it.\n\nClear enough? \n\nBest of luck,\n\nI hope you figure it out either way! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "209": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481847497, "Score": 2, "Body": "Have Fun\nRelax\nSmile\nTake your time\nLess is more = manage the time\nListen to any questions carefully, note them, think and be honest, be humble and open minded. \nSay thank you\nMake friends\n", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "210": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1481847948, "Score": 1, "Body": "Or go anywhere and make your own project with someone familiar with the lit, methods, etc... \nThen get hired to lead that part of the department and teach courses,\nWrite a book,\nBecome a public intellectual\nFound a whole new research program\nWrite more books\nBecome chair \nRetire\nWrite a book about it all\nHave a position and scholarship named after yourself\nEtc...\nWake up,\nGo to library, realize the A.I. Will do it all in a fraction of the time...\nBecome a painter\n ", "Permalink": "https://www.reddit.com/by_id/t3_5hlu1e.json"}, "211": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1481859406, "Score": 1, "Body": "Honestly, OP, I've had a bit of experience that makes me feel a kinship with you. 4th year Psychology PhD in a foreign country, got really depressed due to no data collected after 3 years, was told to take time off and come back. I am now in a new project, and am honestly being more motivated, joyful, and enthusiastic about PhD. \n\nI know each of our journeys will turn out differently, and you may decide that this negative experience is way too crazy to keep going - I think I know what that feels like. Just know that either way, you will make the choice that best fits what you need right now. PhD or not really doesn't matter in the long term. Life is way bigger than that. ", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "212": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1481861318, "Score": 1, "Body": "How panicked you should be depends on the range of schools you are applying to. If you are applying to schools within the Top 50 of whatever your discipline uses to rank schools, then you can rest assured, funding in STEM will adequately cover your expenses, to the extent that stipends cover expenses (they force upon you a decent, but frugal lifestyle).  \n  \nIf you're applying to schools outside the top 50, then what type of school is it? Does it have a large endowment? Is it a private school? Schools with more money tend to fund their PhD students better than schools without. Also a helpful way to find out, is email their PhD students (listed on the website) and just ask how funding works.  \n  \nIf you're determined to apply to fellowships, then as I said in a previous post, you can determine POS by simply looking at the website/course calendar, and just make your best guess. It doesn't matter what you put there, and it isn't going to force you to it. It's simply to apply for funding.  \n  \nAs to details of advisors and research, again, you just take your best guess. You put down someone you want to work with, and you put down what you'd want to work on. \n  \n  \nI think at the end of the day, you need to just take a deep breathe and remember: you are not the first person to have applied, and you won't be the last. There's a strong institutional system in place. As long as you are following all the directions on \"how to apply\" on each of the universities respective websites, then *you will be fine*.\n  \nBtw, I hope you are applying to more than 6 schools. Between 15-20 is a safe number.\n\n  \nAnd yes, grad school is a stressful, neurotic filled time. And it doesn't get much better if you decide to stay in the academy and apply for academic jobs afterwards. Then you are filled with pre-tenure anxiety.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "213": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1481897005, "Score": 1, "Body": "&gt; Btw, I hope you are applying to more than 6 schools. Between 15-20 is a safe number.\n\n:/\n\nGreat, I thought 6 was overboard. Anyway, I've gotten into 1 so far with a hope for grant funding...\n\nIt took me forever to do those applications and pushed my references patiences, and cost me hundreds of dollars, so that's incredible to think about doubling it.\n\nThe universities I applied to are spread out in rankings, 2 are top 10, 2 are around #50, 2 are around #100.\n\nThanks for your help!", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "214": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1481910837, "Score": 3, "Body": "That's like a teenager talking about how daunting life is.", "Permalink": "https://www.reddit.com/by_id/t3_5ip2k0.json"}, "215": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1481939709, "Score": 9, "Body": "This shit is fucking long and poorly written. Mistakes on first page and throughout the survey. also, who the fuck told you it's Ok to have 45 minute survey consisting of a battery of psych. measures? Why would anyone would to do this for free...", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "216": {"Subreddit": "PhD", "Author": "Akropop", "Date": 1481940028, "Score": 6, "Body": "I didn't understand the questions, so I stopped taking the test.", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "217": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1481943692, "Score": 1, "Body": "Nope!", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "218": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1481973182, "Score": 2, "Body": "Way underrated !\nI was just notified I'll have to give a conference too, and it'll be my first ever. I take good of everything you mentioned, thank you a lot !", "Permalink": "https://www.reddit.com/by_id/t3_5i2y4d.json"}, "219": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1481981136, "Score": 2, "Body": "Typos abound and the categories are poor.  If you were my student I would ask for a revision.  ", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "220": {"Subreddit": "WitchPhD", "Author": "Rimefang", "Date": 1481990310, "Score": 1, "Body": "It would make for some serious erotic role play. All you're missing is a whip. ", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "221": {"Subreddit": "PhD", "Author": "GlbdS", "Date": 1481996870, "Score": 3, "Body": "\"I clench my jaws and my shoulders get tight when I see the angry faces on the news\"\n\n\"Listening to the shrill screams of a terrified child in a dentist's waiting room makes me feel nervous\"\n\n\"I sense my body responding when the one I love touches me\"\n\nHoly shit you need to take that thing down before your supervisor sees it", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "222": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1481997023, "Score": 1, "Body": "Unfortunately OP, this is spot on. It's a terribly designed survey. I assume you're a PhD student? ", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "223": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1482008987, "Score": 2, "Body": "Hi Caroline: \n\nJust going through this again. It's a very problematic survey. You really need to take this off and get some help with it. How it received IRB approval is confounding.  A few issues, other than the ones posed ITT. \n\n&gt; What was the title of the class? \n\nThis could very likely reveal the identities of the respondents. I teach courses that have very unique titles. There's no way in hell I'd reveal that here. Already the results are going to be skewed. \n\n&gt; If you are a university instructor, was it a basic course (100 or 1000 level course) or upper level course (200 or 2000 and above)?   \n\nSince when is a second year (200) level course \"upper level\"? You should make more accurate distinctions here. I teach mainly grad courses, which can be lower level (for grad students) but are much more \"upper level\" compared to undergrad courses. \n\n&gt; If you were to indicate your age group (e.g., teenage, young adult, middle age, older adult, etc.) please write what it would be in the space provided:\n\nWhy word it like this? **WAY** to much hedging for a survey, which should seek clarity. Just ask: \"What is your age group?\" \n\n&gt; Based on your teaching in general, please indicate your opinion about each of the statements below.\n\nThey're not \"statements\" below; they're \"questions\"\n\n&gt; Based on your teaching in general, please indicate your opinion about each of the statements below. \n\nSame. \n\n&gt; How well can you keep a few problem students **form** ruining an entire lesson? \n\nBasic spelling mistakes. Amateur hour, I'm afraid. \n\n&gt;  People make too much of the feelings and sensitivity of animals.\n\nWTF? (I can guess why this item is included btw, but still dafuq?)\n\n&gt; Directions: For the next set of questions, please think about how you normally interact with other people. \n\nInconsistent font size\n\n&gt; Another's laughter is not catching for me.\n\nPoorly phrased. \n\n&gt; Directions: For the next set of questions, please think about how you normally interact with other people. \n\n&gt; Little children sometimes cry for no reason\n\nWhat the fuck does that have to do with how I \"normally interact with people\"?? \n\nI need to stop. Someone with a high level of expertise in psychometrics and survey design would annihilate this research. \n", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "224": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1482009232, "Score": 1, "Body": "Her supervisor **AND** IRB already approved it. Makes one wonder what the rigor is at Ohio University...\n", "Permalink": "https://www.reddit.com/by_id/t3_5irt4r.json"}, "225": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1482018339, "Score": 1, "Body": "For those who have said that they are doing their PhDs part time and working full time...how many of you are in sciences? Because no way in hell can I fathom having a science-type PhD with tons of lab work and data analysis to be done part time...", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "226": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1482039337, "Score": 2, "Body": "Congratulations on your first acceptance and good luck with the rest of your application cycle.", "Permalink": "https://www.reddit.com/by_id/t3_5icjyt.json"}, "227": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1482050257, "Score": 6, "Body": "It can seem like a load of shit, getting a list of corrections from someone who probably didn't even ask the right questions. But the thing is just do them, because then when it comes around again they won't be able to contest that you didn't do them. I had a friend who was doing some work on polymer insulation, and he got a bunch of corrections related to Metallurgy which wasn't even within the scope. Trust me you won't get failed though, you already mostly passed so congrats 😁", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "228": {"Subreddit": "PhD", "Author": "Zoombiniton", "Date": 1482060344, "Score": 3, "Body": "It's still a little raw now but you'll realise once it sinks in - you passed! These things are designed to be brutal. Your internal/external weren't in there to do you any favours, and if you get a rough one then they'll take that to heart and just start tearing you to shreds. \n\nStill, it's over and you passed. And you got some feedback, so you can now use it to help with what happens next. \n\nWanna try and publish it? You can - you know know what to work on to make a better paper. \n\nWanna try and get yourself into a postdoc elsewhere? You can - tie up the loose ends on this project, find another project that you're interested in and learn from this. \n\nWanna get the hell out of academia so that you never have to sit through that again? You can! \n\nIt might not feel like it now, but it's a major positive. Congratulations doctor. ", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "229": {"Subreddit": "PhD", "Author": "esguerrero", "Date": 1482060434, "Score": 3, "Body": "I don't know your method approach, in any case, in different fields it is expected to fulfill or answer some research questions or hypotheses. When I defended my Ph.D. thesis some of the examiners tried to move the discussion to their fields, asking details about topics out of the thesis main track, so my advice is, say in the beginning of your presentation what your research questions/hypotheses are, how you fulfill/answered those Q/Hs, and the most important advice: every time that an examiner asks about not connected details, say something but state that, that particular thing is out of you thesis scope. You're expert in something specific, don't let an examiner drag your topic to her/his research topic. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "230": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482070751, "Score": 3, "Body": "You can't be failed on your corrections as far as I know. You will get a letter stating that you have been awarded the PhD subject to the corrections being completed. Dont worry. Vivas are tough, and most of the time examiners want to make you feel you still have so much to learn rather than congratulating you on what you do know, or have discovered. ", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "231": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1482093404, "Score": 3, "Body": "Thank you, very kind words. I will do the corrections to the letter, just worrying about the internal being vindictive.", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "232": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1482093484, "Score": 2, "Body": "Thanks also, I won't be publishing it I just want to forget the whole thing as it's been 4 years of hell. I've already moved into a good career at arms reach of science so once this is over I'm not going to look back.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "233": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1482093517, "Score": 1, "Body": "You can't? That's good to know, the examiner is just the type who'd be vindictive.", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "234": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1482093542, "Score": 1, "Body": "I've already had my viva so this advice is a little moot now but thanks anyway!", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "235": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482118463, "Score": 9, "Body": "Anywhere between 30k and 450k, depending on the discipline and university.", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "236": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1482118874, "Score": 3, "Body": "The pay for a tenure track professor position varies wildly. University prestige, private vs. public, discipline, the amount of research funds you bring in, etc. all have a large bearing on your income. Generally, assistant professors (bottom of the ladder) can expect to make between $45-150,000 (can be lower for the humanities and other non-STEM fields).\n\nBut honestly, its a great challenge to actually become a professor, and you don't become a professor to make the big bucks. You want to make enough to live comfortably of course, but if that is what primarily motivates you, or even makes up 1/2 of your motivation, it's best to apply your efforts elsewhere. People that have put their heart and soul into academic research are motivated by other things, like their scientific curiosities, name-recognition, the academic process, etc.. I see a lot of people who put so much highly skilled effort into their research, it's hard to think they wouldn't be millionaires in the private sector.", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "237": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1482122208, "Score": 5, "Body": "I am still in my PhD but here is what my supervisors/others have told me:\n\n1. The topic won't necessarily push you in a certain direction but the skills you learnt may. If you have been using a certain instrument/programming language/method throughout your research then this can mean you will be eligible for certain positions and not others.\n\n2. Changing cities (and country) after you finish your PhD is the direction for the vast majority of the grads I know. I am in Australia though so this tends to change things a bit. The advice from my supervisors was to go international immediately after I graduate or I will never be a competitive candidate for a permanent position in my home country.\n\n3. This will depend on the field, the country, the department/institution and the group/supervisor. Until you are head of department though you will always have a supervisor and you will generally have to justify something to them at some point.", "Permalink": "https://www.reddit.com/by_id/t3_5j4fky.json"}, "238": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1482160941, "Score": 3, "Body": "I suspect that there is a great deal of variability in this regard depending on which field you're talking about. \n1) For biology, some people stick to the focus of their thesis through their post-doc and then into their career. Many do not. The most important thing, as /u/antihero790 has pointed out, is the skills that your learn, not necessarily the topic. For instance, I did tons of human tissue culture, gene expression, cloning, and a few other things in grad school and I will continue to use them for as long as they are relevant. When I finished my PhD, I went on to do a post-doc that used none of those things and was on a very different topic. I wanted to expand my skillset during my postdoc because it's far more difficult to do once you start an actual career. So I added bioinformatics to my skillset. Now I'm a new professor and I'm starting my research program that uses all of my skills (tissue culture, bioinformatics, etc.) to answer new problems. \n2) If you want to stay in academia, the idea is that you actually want to get away from your mentor/current network after graduation in order to show that you can be productive independently at a new place. I cheated and stayed at the same place for my PhD and postdoc, but I was working on entirely different topics, so there wasn't any overlap.\n3) By the time you are midway through your PhD you should be able to identify and design research projects independently. That's one of the major components of being a doctoral level researcher. In terms of the logistics of actually being able to execute those, well, that's more an economics question than anything else. Who will pay for the research? If you have the time, money, and space to do it, there's nothing stopping you. When I interviewed for my postdoc, I went into the interview with a research project already sketched out. I was hired, and given free reign to do the research, though under the mentorship of my advisor. Now that I'm a professor, I can basically do whatever the hell I want, as long as I keep in mind that it needs to be publishable and fundable or else I won't get tenure (i.e. I'll get fired). ", "Permalink": "https://www.reddit.com/by_id/t3_5j4fky.json"}, "239": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1482163459, "Score": 1, "Body": "What discipline? What rank is your institution? (you generally tend to be hired at an institution that is at least n-1 tiers below your current institution, unless you have tremendous publications)", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "240": {"Subreddit": "PhD", "Author": "esguerrero", "Date": 1482176644, "Score": 2, "Body": "/u/ProfessorBurns is right. I'm computing science post-doc in Sweden and I'm independent from my supervisor, I applied for funding and right now I'm following a different path. Here in Europe is a plus to visit other research groups and it's really a nice experience.", "Permalink": "https://www.reddit.com/by_id/t3_5j4fky.json"}, "241": {"Subreddit": "PhD", "Author": "Infectious_Pen", "Date": 1482179868, "Score": 1, "Body": "Researching viruses, so biology. I'm interviewing at UPitt, UPenn, Emory, UNorthCarolina, and Harvard. ", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "242": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1482185476, "Score": 1, "Body": "those are fine schools, you should be making the upper range for your discipline if you're able to secure a tenure track position at one of those institutions. good luck.  \n  \nThe private schools will probably pay more than the public ones.", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "243": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1482194644, "Score": 1, "Body": "I just finished in October and I'm exploring a PostDoc with the researcher who authored the tool I used for my research. I debated going back and forth between taking the post-doc or not (already have a faculty position) but it seems worth it.", "Permalink": "https://www.reddit.com/by_id/t3_5j4fky.json"}, "244": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1482253621, "Score": 3, "Body": "Congratulations, I know the feeling(s) - of submitting, of it taking forever, and of not enjoying much in the way of job prospects. \n\nI think the only thing I can recommend is to take seriously any opportunity to develop whatever skills and interests you have already, in ways that you haven't used them before. Don't know what that means in terms of your discipline. For me, that meant getting bits of teaching experience outside university; writing and reviewing for non-peer review websites; doing work that had nothing to do with my PhD topic. \n\nBut that is, to be fair, a luxury that I'm sure not everyone could afford. ", "Permalink": "https://www.reddit.com/by_id/t3_5jdlwg.json"}, "245": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1482256603, "Score": 3, "Body": "Write down as much as you can, especially when starting out and reading a lot of books/papers to learn about the subject, write down what you learn (properly referenced) this helped me a lot when I got to the thesis writing stage.\n\nAlso be prepared to have days when you work a lot, there is no escaping the fact that there will be days where you will work 15 hours+, maybe even all nighters, and it is surprisingly easy for this to become the norm; don't let this happen as you will just and up burnt out and hating your PhD.\n\nMake sure you socialise a lot, with people at your institute/where you live to maintain your sanity, but also with people at any outside meeting/conferences you attend as this networking aspect is very important for a future career, what it's learning what people are working on giving you ideas for the future, or getting people to find out who you are so they might employ you in future.\n\nMost importantly, enjoy it, you will be spending 3+ years working in an area you are passionate about, there will be plenty of times when you are stuck in the lab/library for weeks seemingly getting no-where, but eventually you will get an interesting result of discover something and it will all be worth while. ", "Permalink": "https://www.reddit.com/by_id/t3_5jec9q.json"}, "246": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1482259262, "Score": 10, "Body": "&gt; what to expect\n\nA lot of PhD students complaining about being PhD students", "Permalink": "https://www.reddit.com/by_id/t3_5jec9q.json"}, "247": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1482262906, "Score": 2, "Body": "Remember that ultimately YOU are responsible for your experimental design, CONTROLS, data, and thesis! It is up to YOU to ensure that the controls are appropriate and to gather that data as those controls are your ammunition when you come to defend, so think carefully and consider the literature when you are designing your experiments. Your supervisor is there to advise you, decide what controls you think are appropriate and have a discussion with them to double check. Make it easy for them to understand if they aren't familiar with a particular experiment.\n\nMy problems stemmed from relying on my supervisor to correct me if I was wrong, and God I wish now that I had sought the answers for myself. Is it easy? Hell no. Make it easier for future you in any way you can!!!   ", "Permalink": "https://www.reddit.com/by_id/t3_5jec9q.json"}, "248": {"Subreddit": "PhD", "Author": "moranr7", "Date": 1482327491, "Score": 2, "Body": "Huge congratulations, that's a long time to persevere. ", "Permalink": "https://www.reddit.com/by_id/t3_5jdlwg.json"}, "249": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1482340009, "Score": 1, "Body": "god damnit i've only just lost 15 pounds!!", "Permalink": "https://www.reddit.com/by_id/t3_5jec9q.json"}, "250": {"Subreddit": "PhD", "Author": "robocaller", "Date": 1482356423, "Score": 4, "Body": "I can't speak to the military experience. But I wouldn't let age discourage you. I'm 31 with about 9 years of experience in the field (education). Granted, I have a number of colleagues my age and a little younger but I also have colleagues in their late 30s and early 40s. Experience would be a plus, but the way you describe your story it may not be experience in psychology. If it is, more power to you.\n\nI will say this though, if you're looking for a funded position, they are super competitive. If you lack work experience in psych, then you may want to consider a Masters before jumping straight into a PhD. It may make you more competitive. That being the case, maybe there is a way to do that part time while gaining field experience with the military, if that's even an option. \n\nLastly, are you willing to relocate? Keep your options open to follow the funding. My wife and I moved to Europe and split our time between two different countries each for funding, but the money is good (or can be).", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "251": {"Subreddit": "PhD", "Author": "TJC9878", "Date": 1482358864, "Score": 1, "Body": "Thanks for the response. For a little background, I'm completing my BS Psych degree completely online through Arizona State, but I'm stationed in California. I'll have just enough time to complete my degree before I retire, and my goal is to be accepted into PhD program either shortly before or shortly after my retirement date. That said, I would prefer to get into Indiana University since my wife's family is close by and we intend to live in that area eventually anyways. But, I do intend to keep my options open and apply to several different schools. My family and I are used to the instability of military life, so moving to another city where we might not have any support system in place would be nothing new. \n\nThe problem with trying for a Master's degree first is that I'm not sure I would be able to be a full-time student living on just my military pension. At least with a funded PhD program, I could use the stipend as extra income and live comfortably. I do realize those programs are highly competitive, which is why I'm working so hard to keep my GPA high and will study my ass off to do well on the GREs. My main concern (besides lack of research experience) is how the boards would view not only my age, but my wide range of skills, even though they might not directly relate to psychology. My little bit of wishful thinking leads me to believe that they would probably favor someone who has 20+ years of skills that have taught me to work well under extreme pressure, makes me a valuable team member, and a reliable self-starter who can work well with minimal to no supervision...but I could be completely wrong and will need to have at least some research experience.", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "252": {"Subreddit": "PhD", "Author": "bomchikawowow", "Date": 1482370027, "Score": 3, "Body": "Totally different circumstances but at 34 I started a PhD. The best PhD student I have ever met was 42 when he started and an ex-cop who got his masters by distance on his days off. He's a genius and such a good person to work with because he has the mindset that you need for a PhD: Don't get rattled, keep moving, and get things done. I have learned so much from him. \n\nTL;DR - keep on keepin on OP, you're in no way too old and you have so much of the skill that the rest of us spend most of the time learning. A PhD is a marathon and you have the goods. ", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "253": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1482370033, "Score": 5, "Body": "Have you tried using a pomodoro timer app?  You work for 25 min with no distractions, then 5 min break. After 4 pomodoros you get a 20 min break. It works pretty well for me", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "254": {"Subreddit": "PhD", "Author": "TJC9878", "Date": 1482370429, "Score": 1, "Body": "That's very encouraging to hear, thank you!", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "255": {"Subreddit": "PhD", "Author": "throwawayladystuff", "Date": 1482373284, "Score": 3, "Body": "So - I just tried it the 45min or so - and it worked surprisingly well! Not perfectly, but somehow the idea that *something* was keeping track of time really worked.\n\nFingers crossed it wasnt beginners luck - thanks again!", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "256": {"Subreddit": "PhD", "Author": "Akropop", "Date": 1482376089, "Score": 1, "Body": "I'm in a similar boat and will  try this. Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "257": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1482377283, "Score": 2, "Body": "I disagree with the above comment, especially at your age if you want to go PhD go straight for it, no master's. Having no research experience isn't a killer, but you'll need good test scores. \n\nDo realize that (especially at your age) a PhD is a bad investment, professional degrees take less time and pay more. But, if you're really motivated to be a college professor or do research it's the way to go.", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "258": {"Subreddit": "PhD", "Author": "N140067", "Date": 1482384369, "Score": 2, "Body": "So funny it hurts", "Permalink": "https://www.reddit.com/by_id/t3_5jnw0j.json"}, "259": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1482400365, "Score": 1, "Body": "Pomodoro or similar is a great suggestion; I'd suggest also doing it on a larger scale with your day; i.e., commit to only working from 9-5 (or whatever hours work for you) and not working outside of those hours.  ", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "260": {"Subreddit": "PhD", "Author": "aimeemwalsh", "Date": 1482420689, "Score": 1, "Body": "I don't know if it would make a huge impact on your career. Though if you're applying to do a PhD it'd be definitely worth having on your CV if you're interviewed for funding. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "261": {"Subreddit": "PhD", "Author": "isntballs", "Date": 1482420710, "Score": 4, "Body": "While this is certainly funny, make sure that if you're serious about pursuing a PhD, you go into it with a mindset very different from what you have typed into google here!  First, no one \"gets\" a PhD, it is earned.  Earned through an insane amount of hard work and dedication.  Second, don't go into it thinking it is \"your\" PhD.  This implies that there is a PhD hanging out in space for everyone on the planet who chooses to go after it.  I personally don't think this is true.  You do not have a right to the phd, you have to be good at a subject and very interested in it to dedicate time at this high level.   Think more \"pursuing a PhD\" than \"getting your PhD\" and best of luck on your journey!! ", "Permalink": "https://www.reddit.com/by_id/t3_5jnw0j.json"}, "262": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482420987, "Score": 2, "Body": "The time based solutions are options, but I found the best way was to set myself a target of 500 words a day. 500 good words. \n\nI also broke down each chapter into sections, with section headings, and noted how many words I thought each section should be. That way I had a chapter by chapter structure outline, for which I just had to fill the gaps. \n\nThe 500 word a day helped a lot. Some days were a breeze and I would be finished in a couple of hours, and then take the rest of the day off guilt free, or do fiddly jobs like references or reading. Other days the 500 would be difficult, as it would be a difficult section, or I would need to check literature, etc. \n\nIn the end I got through it though! Am sure you will as well..", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "263": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482422650, "Score": 2, "Body": "Why did you apply if you did not want to go? In grand sheme of things a poster sessions does not matter. HOWEVER, unless you are already ACCEPTED, then people who make these decisions would probably be there to listen to you present. I would even email them and let them know you are presenting.", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "264": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1482425104, "Score": 0, "Body": "Really? Wouldn't some job in industry pay better than academia?", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "265": {"Subreddit": "PhD", "Author": "Larianna", "Date": 1482426676, "Score": 8, "Body": "I started teaching in my Masters, in 2011. I got my own class right away, I was never just a grader, and had no idea about teaching at the time. The first few weeks I was terrified, but my students ended up being the people who made graduate school survivable, and teaching was the awesomest thing I've ever done. Can't imagine doing anything else but college teaching now, so I have been an instructor for the past 5 years and am in my 2nd PhD year. \n\nYou will be nervous, that is part of the process and happens every time I get a new class. However, think about it this way. There's a reason you are in a PhD program. You're fucking awesome at what you do, and teaching is the most rewarding way to share your beautiful brains with the world. Create a detailed syllabus for yourself, plan as far ahead as you can, but be prepared to improvise and change that plan as you go. Having it will give you a sense of control and stability to start with. Practice your lesson with a friend. Timing is key. Begin with a think-pair-share task (just google) to get your students involved and engaged. If you're super nervous, practice mindfulness and breathing exercises daily, it's helped me more than Xanax and Mood Stabilizers, haha. It will help you manage the stess of grad school with the teaching, which will be a ton of work. It helps me to live healthy during the semester, eat well, get enough sleep, work out - you want your brain to run smoothly and your mind to be as clear as possible. \nEverything else depends on the size of your class and the subject you teach.", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "266": {"Subreddit": "PhD", "Author": "suzmeister", "Date": 1482426869, "Score": 6, "Body": "Does your university offer any teacher training? I'm getting teacher training next semester and will be doing some teaching alongside it. Sorry I have no real advice, I'm in the same boat!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "267": {"Subreddit": "PhD", "Author": "Suhaylo4", "Date": 1482428521, "Score": 5, "Body": "I use the fake it til you make it strategy. It's working so far. ", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "268": {"Subreddit": "PhD", "Author": "TJC9878", "Date": 1482428831, "Score": 1, "Body": "I assume you're talking about a PsyD compared to a PhD? If so, from what I understand, PsyDs are more clinical-based and typically unfunded. Although I haven't completely ruled out a PsyD, my interests lie more in scientific research...plus I'm not sure I'd be able to support my family while seeking an unfunded degree. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "269": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1482429277, "Score": 5, "Body": "Get senior students/professor syllabi and structure your course similarly. Get a mentor (usually a senior professor) that you can use as a sounding board. Use the university teaching resources.", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "270": {"Subreddit": "PhD", "Author": "aimeemwalsh", "Date": 1482430060, "Score": 2, "Body": "Thank you so much for this - this is a super encouragement. I'm terrified of teaching at this stage. It's comforting that you've grown to enjoy it! How did you manage changes to your class plan when you were new to teaching? I've the fear, haha! \n\nThe Imposter Syndrome is still strong at the moment as I've just started (and moved institutions &amp; countries). I'll have to carry around a screenshot of your post - thank you! I toyed with beginning to take anti anxiety meds but I think you're right with the mindfulness! Bracing myself for the hectic schedule ahead. \n\nThank you again! ", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "271": {"Subreddit": "PhD", "Author": "aimeemwalsh", "Date": 1482430208, "Score": 2, "Body": "I've done the teacher training at the uni - though it wasn't subject specific. So, just going to try and replicate other seminars I've experienced and hope for the best! When do you start teaching? I start end of January. ", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "272": {"Subreddit": "PhD", "Author": "aimeemwalsh", "Date": 1482430320, "Score": 1, "Body": "This is always my go to! I have to keep reminding myself (I hope) everybody is feeling as unsure of themselves starting out. How far through are you? ", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "273": {"Subreddit": "PhD", "Author": "aimeemwalsh", "Date": 1482430398, "Score": 1, "Body": "Thank you! I'm going to arrange a meeting with the module convenor and hopefully bounce my ideas of them. ", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "274": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1482432296, "Score": 1, "Body": "I applied to phd programs meaning this poster presentation is too late to be used on my CV for this years application. I've not applied to the conference yet, that deadline is in Jan. I'm trying to decide if it's worth the money. ", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "275": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482434200, "Score": 1, "Body": "if professors from universities you applied to are attending that conference prior to making a decision, then apply.", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "276": {"Subreddit": "PhD", "Author": "Retro21", "Date": 1482434646, "Score": 0, "Body": "$1,400 to put a poster up of your PhD? No thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "277": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1482434885, "Score": 1, "Body": "A lot of conferences have funding available for students who need financial help getting there; I'd suggest seeing if that's a possibility before committing one way or another.\n\nThe other thing you'll want to check is whether the professors you're applying to work with are attending themselves.  If not, it seems like a lot of money for little potential gain.", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "278": {"Subreddit": "PhD", "Author": "suzmeister", "Date": 1482436180, "Score": 1, "Body": "Definitely a good idea to use previous seminars as inspiration! When I last gave a presentation I acted confident even though I was really a nervous wreck, I think faking it actually works because it was the best presentation I've ever given. What worries me with teaching is that it's not just a presentation, I can act confident all I want but I need to interact with the students and be able to answer their questions! Absolutely terrifies me! I also struggle with imposter syndrome so I'm not feeling very confident in myself just now. I'm teaching in January too! Just one class to start plus demonstrating in labs every week. Good luck for January! Let us know how your first lecture goes!", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "279": {"Subreddit": "PhD", "Author": "suzmeister", "Date": 1482436253, "Score": 1, "Body": "Haha! I just said this in another comment. I fake confidence and it seems to pay off!", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "280": {"Subreddit": "WitchPhD", "Author": "thedude0121", "Date": 1482439629, "Score": 1, "Body": "Oh myyyy I must leave some handprints on it ", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "281": {"Subreddit": "WitchPhD", "Author": "Bob_A_Fet", "Date": 1482439840, "Score": 1, "Body": "Stay ups or proper stockings?", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "282": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1482439950, "Score": 1, "Body": "These ones are stay-ups! I feel a garter belt would have been too much in the way here. ", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "283": {"Subreddit": "WitchPhD", "Author": "Bob_A_Fet", "Date": 1482440005, "Score": 2, "Body": "Really cute!  Love the mystery of longer skirts :)", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "284": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482440906, "Score": 1, "Body": "Thanks for taking the time to write and for the insight.  I see your point.  I have a masters and have been working on a few research projects which I really enjoy.  It made me think I may like the topic enough to pursue a PhD.  From everything I heard, it's not easy and even if you love your topic going in, by the end, you may not have the same feel for it coming out. Thanks again!", "Permalink": "https://www.reddit.com/by_id/t3_5jnw0j.json"}, "285": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1482442386, "Score": 2, "Body": "Beautiful and smooth", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "286": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1482451072, "Score": 2, "Body": "Hello! I'm 2.5 years into teaching and just finished my PhD this past semester. The faculty I work with are wonderful, very supportive, very open to sharing materials and brainstorming. It is very independent though and when you're as new as I was- I didn't even know what questions to ask! I totally know what what you mean by imposter syndrome and I still battle with it. The most important thing is to be vulnerable and be a sponge with other faculty, but not in front of the students! I swear- they smell vulnerability.", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "287": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1482452146, "Score": 2, "Body": "whatever you do- spend a lot...A LOT of time researcher your mentor and know what you want to get out of that relationship. It can make or break the PhD experience.", "Permalink": "https://www.reddit.com/by_id/t3_5jnw0j.json"}, "288": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482456573, "Score": 1, "Body": "Great tip! Thanks so much! ", "Permalink": "https://www.reddit.com/by_id/t3_5jnw0j.json"}, "289": {"Subreddit": "PhD", "Author": "caz-", "Date": 1482459211, "Score": 5, "Body": "It probably depends on where you do it. In my course, the PhD is usually started out as a masters. If you want to continue on to a PhD, you apply for a transfer, which involves an oral presentation in front of internal examiners and a report which is basically a tiny (30--50 page) thesis, but can have a huge \"Future Work\" section. If they're happy with your progress and your research plan, you get transferred to the PhD. If not, you get to leave with a Masters (unless you do *really* badly).\n\nSo, basically, for me the PhD was the same as the masters except for the length, the standard expected, and the completeness of the final work. At the end of the masters---at my institution, anyway---you don't really need any complete results. You can present what you have, explain what it means, and talk about where this could go in the future. The PhD is where you actually carry out that 'future work' and tie up as many loose ends as you can.", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "290": {"Subreddit": "PhD", "Author": "gatech03", "Date": 1482463062, "Score": 1, "Body": "I agree with this strategy!\n\nPersonally, I also like to drive each section of lit review by discussing how my research is specifically building on previous work. It can be a bit on the nose, but highlights the contributions nicely.", "Permalink": "https://www.reddit.com/by_id/t3_5gmo93.json"}, "291": {"Subreddit": "PhD", "Author": "exphysphd", "Date": 1482466306, "Score": 19, "Body": "During my masters interview a prof told me \"a Master's is like writing a chapter in someone's else's book, whereas a PhD is starting your own\".", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "292": {"Subreddit": "PhD", "Author": "Larianna", "Date": 1482498338, "Score": 1, "Body": "Im so glad you found my response helpful :) \n\nI will say that I do take Venlafaxine for depression, and it happens to help me with other moods like fear and anger as well. However, while that may be a great crutch, it doesn't help the root cause of the issue, which is where self-care and mindfulness come in. It can't harm to check in with a psychologist (I go to therapy as well, but typically my sessions go like: Doc, if I didn't have my students , and have the reward of seeing them learn, I would go nuts.) \n\nImposter syndrome is rough to deal with. Many in \"upper\" academia, especially if you don't fall into a dominant group, suffer from that. You'll hear the most brilliant women profs in the sciences confess that they think they aren't smart enough to do the job, because elites tend to make outsiders feel awful, like they don't belong. I feel you, Im also a foreigner and second language speaker, and Im very sensitive about people pointing that out. My advice, find friends who feel the same way. You can also talk to your advisors and Profs about it, you'll be surprised about how many can relate. \n\nChanges in plans and the syllabus honestly don't bother me, Im pretty spontaneous by nature. I think that once you get a feel for the state of expertise and knowledge your students are at, you will know what I mean. Sometimes you'll overestimate what they can do, other times you'll underestimate them. You can adjust to their needs as you go, and don't be afraid to tell them that you will customize the class as you go. Most students will appreciate a teacher who actually cares, pays attention, and listens.", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "293": {"Subreddit": "PhD", "Author": "gand-me-ungli", "Date": 1482503168, "Score": 3, "Body": "Other grad students constantly whingeing about their PhD", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "294": {"Subreddit": "PhD", "Author": "z-nut", "Date": 1482504013, "Score": 1, "Body": "To be honest, my \"single-player\" gaming days started to die in high school, aside from the occasional Zelda game. I found that local multiplayer has worked well in a collegiate setting and is absolutely a blast.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "295": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482508501, "Score": 2, "Body": "I have just finished my PhD. Thought of getting a PS4 to congratulate myself, as I had stayed away from gaming for the last five or so years. Am veering against it though, as I could imagine six months going by without me doing an iota!", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "296": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1482509126, "Score": 4, "Body": "if its something you enjoy, go for it. No need to give up your hobbies while starting a PhD. You need things to keep you happy and sane. Work-life balance and all that. \n\nIm in my 3rd year and while Im not a gamer, I have several hobbies I havent given up, and theyre mainly my oulet when needed", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "297": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1482510382, "Score": 1, "Body": "i still game on the regular.  \nyou need to find some outlet for your stress.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "298": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1482510394, "Score": 1, "Body": "You're military training will give you the mental toughness and time management skills to deal with the challenges of a PhD. Also, being in the great physical shape from the military will help you with your stress levels. Those are a few of the good things going for you that will set you apart from others.\n\nDisclaimer: I'm not in the military though I have worked at a military research lab before and had a good friend in college who was in ROTC.", "Permalink": "https://www.reddit.com/by_id/t3_5jm6vc.json"}, "299": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1482511172, "Score": 1, "Body": "Exactly. I don't do WoW binges as I did when I was a student, but I still game (BF1, Hearthstone) two nights a week maybe. You need to keep hobbies, a PhD is done in the long run ", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "300": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482511219, "Score": 2, "Body": "OP: Thanks!  This is very good insight.  I've been doing research that I really enjoy and that's what made me think of the PhD to continue my education and provide an opportunity to continue my research.  Thanks again for taking the time to reply. ", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "301": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482511238, "Score": 1, "Body": "OP: Thanks!  This helps a lot!", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "302": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482511277, "Score": 1, "Body": "OP: Lol!  I work for an RI US University and can see this....Thanks for taking the time to help me. ", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "303": {"Subreddit": "PhD", "Author": "gand-me-ungli", "Date": 1482511622, "Score": 1, "Body": "Haha oh I'm sorry, I didn't particularly mean to be unhelpful, just a bit of snark-sprinkling on the Internet!", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "304": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1482514378, "Score": 1, "Body": "Congrats!", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "305": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1482515202, "Score": 1, "Body": "Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_5jsxhk.json"}, "306": {"Subreddit": "WitchPhD", "Author": "criature", "Date": 1482516701, "Score": 1, "Body": "Que buen disfraz, guapa!! Dan ganas de morder esos pezones deliciosos!!", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "307": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1482516762, "Score": 3, "Body": "You've such an enticing body - definitely more full length required :)", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "308": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1482518938, "Score": 1, "Body": "No, it was helpful. I truly appreciate everyone taking the time to respond to me. I had the same thought (about them complaining) while listing to some PhD candidates I know. It's helpful to know that just isn't my perspective on the situation. Thanks again! ", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "309": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482520485, "Score": 1, "Body": "i have gotten bored with games. The last game I really enjoyed was The Witcher.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "310": {"Subreddit": "WitchPhD", "Author": "dicknoobian", "Date": 1482523079, "Score": 2, "Body": "You definitely got me at my full length! &lt;3", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "311": {"Subreddit": "PhD", "Author": "Suhaylo4", "Date": 1482526963, "Score": 1, "Body": "Yep, in 2nd year now, I'm probably on the PS4 about 10 hours a week. Planning to get a new gaming laptop or build a pc in the new year. ", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "312": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1482530555, "Score": 2, "Body": "I'm getting a PhD from a top 5 engineering program. I've been given the green light to graduate in 2017, and I've published 8 papers so far, 3 are 1st author papers. I still game, but it happens in bursts. Every 1-3 months, I'll find a new game and drop ~2-3 days into it. I'd say this comes out to ~100-150 hours of gaming/year.\nI don't really feel like it holds me back, but I'd say this is also due to a narrowed range of activities. I only watch a few movies each year and maybe 1-2 TV shows. Other than this, I don't watch TV (so no cooking shows, sports, etc.). In other words, I still game, but it uses up a good chunk of my minimal personal time.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "313": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482531068, "Score": 4, "Body": "What kind of a clustefucky mess is this? Who gives a shit about that boss? Just submit the paper.", "Permalink": "https://www.reddit.com/by_id/t3_5jzdim.json"}, "314": {"Subreddit": "PhD", "Author": "UntrustedProcess", "Date": 1482531299, "Score": 2, "Body": "Liberty University is not for profit and has a technology management DBA.  ", "Permalink": "https://www.reddit.com/by_id/t3_5jznaf.json"}, "315": {"Subreddit": "PhD", "Author": "_throwawayaccount___", "Date": 1482532243, "Score": 1, "Body": "tell me about it. I think the issue is that he used his boss's facility to take these measurements. ", "Permalink": "https://www.reddit.com/by_id/t3_5jzdim.json"}, "316": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1482539943, "Score": 2, "Body": "I think his boss is being a little bit unethical. The person who did the imaging should be a co-author as they did contribute extensively. Their boss also being a co-author tends to be a choice. Their boss wanting to essentially have them removed as a co-author to deal with issues in their lab seems very wrong.", "Permalink": "https://www.reddit.com/by_id/t3_5jzdim.json"}, "317": {"Subreddit": "PhD", "Author": "gundamx4", "Date": 1482550428, "Score": 1, "Body": "Looks like this is exactly the type of program I'm looking for, thanks for the information.", "Permalink": "https://www.reddit.com/by_id/t3_5jznaf.json"}, "318": {"Subreddit": "WitchPhD", "Author": "gerchoc44", "Date": 1482564016, "Score": 2, "Body": "You are so beautiful, oh my. ", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "319": {"Subreddit": "WitchPhD", "Author": "tasty_yumyum", "Date": 1482573772, "Score": 2, "Body": "Loving everything about this. ", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "320": {"Subreddit": "PhD", "Author": "EvieeG", "Date": 1482583181, "Score": 1, "Body": "I still have hobbies, which involves playing games, and I also have time to socialise :) ", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "321": {"Subreddit": "PhD", "Author": "_throwawayaccount___", "Date": 1482589623, "Score": 1, "Body": "I agree. In the end though, it ultimately depends on how the collaborator choose to handle the situation, and he seems complacent about doing what his \"boss\" tells him (even though he is officially his own professor)", "Permalink": "https://www.reddit.com/by_id/t3_5jzdim.json"}, "322": {"Subreddit": "PhD", "Author": "rollawaythestone", "Date": 1482607791, "Score": 1, "Body": "I have been doing tabletop gaming once a week for a few years now as I wrap up my PhD. Some nights I can't make it as I'm busy, but normally I can always spare at least a night a week for some marathon gaming.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "323": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482619742, "Score": 7, "Body": "Don;t have to. chose to.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "324": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1482622321, "Score": 5, "Body": "I got to the point where xmas is just a day.\n", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "325": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482622640, "Score": 8, "Body": "Not me. Off till 2017 :-). \n\nSorry, but it feels good. ", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "326": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1482626506, "Score": 4, "Body": "I've given myself 3 days off. De-stress, then back on it.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "327": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1482632746, "Score": 1, "Body": "I still get in about 10 hours of PC gaming a week, followed by 8 hours of boardgames. However, you really need to schedule these things in advance. It really helps if you're single and don't have pets.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "328": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1482634509, "Score": -7, "Body": "Must feel good to get a PhD in 7 years.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "329": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482640597, "Score": 1, "Body": "You're gorgeous! My 5'th limb agrees fully to that! \n", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "330": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1482641019, "Score": 3, "Body": "writing dissertation proposal", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "331": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482642774, "Score": 1, "Body": "Food for thought: If you don't like people saying that they pleasure themselves to nudes of yourself, why are you even bothering posting said nudes?\n", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "332": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1482644837, "Score": 3, "Body": "When did I ever say that?", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "333": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482645692, "Score": 1, "Body": "Well, I'm pretty sure that you downvoted my first post I wrote to here, and when I PM'd you about me wanting to learn about Hanukkah, you told me to fuck off. So, In a very roundabout way, you're essentially saying that you don't like it when people say that they like pleasuring themselves to your nudes.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "334": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1482646117, "Score": 6, "Body": "That's wild and nonsensical extrapolation. ", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "335": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482646271, "Score": 1, "Body": "If ya say so. I still don't know why you told me to fuck off when I PM'd you, though. That was actually totally uncalled for and unwarranted.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "336": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1482646740, "Score": 5, "Body": "Your message seemed ignorant and rubbed me the wrong way. ", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "337": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482646934, "Score": 3, "Body": "¯ \\ _ (ツ) _ / ¯ Well, I'm very sorry about that :( I didn't mean to offend you. Let's just be happy, and give thanks to the higher powers for this wonderful world, despite all the bad shit happening in it. :)", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "338": {"Subreddit": "WitchPhD", "Author": "Kevin-McCockster", "Date": 1482647094, "Score": 3, "Body": "You have the most adorable nipples, I love their shape!", "Permalink": "https://www.reddit.com/by_id/t3_5k6b7a.json"}, "339": {"Subreddit": "WitchPhD", "Author": "CommentSomething", "Date": 1482649376, "Score": 1, "Body": "8 crazy nights", "Permalink": "https://www.reddit.com/by_id/t3_5k6b7a.json"}, "340": {"Subreddit": "PhD", "Author": "Chondriac", "Date": 1482649948, "Score": 2, "Body": "Why do you want to do a PhD?", "Permalink": "https://www.reddit.com/by_id/t3_5k6n2x.json"}, "341": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482658267, "Score": 2, "Body": "Where did you get the 7 from?", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "342": {"Subreddit": "WitchPhD", "Author": "bandannick", "Date": 1482658457, "Score": 2, "Body": "Putting the \"She\" in \"Yeshewa\". ", "Permalink": "https://www.reddit.com/by_id/t3_5k6b7a.json"}, "343": {"Subreddit": "PhD", "Author": "Feargus1", "Date": 1482668465, "Score": 4, "Body": "Have to revise a manuscript so was told \"don't take too much of a holiday\" ", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "344": {"Subreddit": "WitchPhD", "Author": "youneversawmehere", "Date": 1482668602, "Score": 2, "Body": "Wow, that first shot is a jaw dropper. You'd think sweaters were specifically invented for tits like yours. ", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "345": {"Subreddit": "WitchPhD", "Author": "lockaway7", "Date": 1482673899, "Score": 3, "Body": "Hahaha what?  Try reading that again when you can reply with two hands.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "346": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1482677337, "Score": 2, "Body": "I'm also working. I have a conference in mid January that I didn't get time to prepare for before the break. It's actually kind of nice that we're locked out of the lab here until the 3rd so I can't work on anything else.\n\nI did take today (25th) off though because I had family stuff on from 6am-9pm. I was surprisingly not stressed.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "347": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1482677443, "Score": 2, "Body": "r/gradadmissions can help you more than this sub.", "Permalink": "https://www.reddit.com/by_id/t3_5k6n2x.json"}, "348": {"Subreddit": "WitchPhD", "Author": "HelpingOutPops", "Date": 1482679003, "Score": 1, "Body": "Your PM was uncalled for and unwarranted.  Did she ask you to message her?  Why do you seem to be under the impression this woman owes you anything at all?  She's given her body freely for you to enjoy from a distance, and all you've done is try and ask for more.  She's completely entitled to tell you to fuck off.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "349": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1482683926, "Score": 2, "Body": "Moi!\n\nHooray hooray running an ANOVA today", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "350": {"Subreddit": "PhD", "Author": "rollawaythestone", "Date": 1482688835, "Score": 1, "Body": "It might not have made it onto your CV in time, but it would give you something to talk about if you go for an interview at any prospective school. $1400 is a lot of money though - if it's going to be a burden to come up with the money don't do it. ", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "351": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1482691331, "Score": 3, "Body": "I would imagine a PhD in Data Science would give you so much more scope for interesting jobs when you finish. Especially in this day and age. ", "Permalink": "https://www.reddit.com/by_id/t3_5k8fl0.json"}, "352": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482693026, "Score": 2, "Body": "You don't even know what I said in the PM. I was asking her about Hanukkah, wanting to learn about something new to me. I swear, people don't like other people to be curious about new things anymore...", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "353": {"Subreddit": "PhD", "Author": "British_Sky", "Date": 1482693786, "Score": 1, "Body": "I primarily want to do research because I think I like to do projects at my pace (with the deadlines provided), I like public speaking and writing, coming up with my own ideas and approaches to solve problems that I find very profound and I really like programming, working on memory management and OS kernel programming. I believe that academia would be a perfect fit for me as this would help me publish my research, share my knowledge so others can use it as well and get to travel and collaborate with people from different countries and similar interests.", "Permalink": "https://www.reddit.com/by_id/t3_5k6n2x.json"}, "354": {"Subreddit": "PhD", "Author": "British_Sky", "Date": 1482693801, "Score": 1, "Body": "Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_5k6n2x.json"}, "355": {"Subreddit": "PhD", "Author": "Alpacatastic", "Date": 1482694144, "Score": 2, "Body": "No official work (though I probably should be revising some of my teaching materials) but studying for comprehensive exams most of the time. Except for when I am procrastinating on Reddit. Still nice to visit home though.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "356": {"Subreddit": "PhD", "Author": "morbosam", "Date": 1482697693, "Score": 3, "Body": "Moro, \nGreetings from the lab, where nothing works and no one knows why. But still i am required to make up a story on why it is not working. \n", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "357": {"Subreddit": "PhD", "Author": "elfradlschneck", "Date": 1482697816, "Score": 3, "Body": "1. If you are not interested in your field the chances you will finish a PhD in said field are small.\n2. I have changed fields for my PhD and I'm doing fine. ", "Permalink": "https://www.reddit.com/by_id/t3_5k8fl0.json"}, "358": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1482716629, "Score": 1, "Body": "It's supposed to be that way. You passed with corrections, which pretty much means you passed with flying colours.\n\n*Nobody* passes without corrections.\n\nRemember to celebrate!", "Permalink": "https://www.reddit.com/by_id/t3_5iz614.json"}, "359": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1482730569, "Score": 1, "Body": "I should be writing my dissertation proposal.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "360": {"Subreddit": "PhD", "Author": "tkaykey", "Date": 1482738837, "Score": 1, "Body": "I gave up gaming when I entered my PhD. Still have time for friends, but I got too addicted to gaming to continue playing through my program.", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "361": {"Subreddit": "PhD", "Author": "tkaykey", "Date": 1482739533, "Score": 1, "Body": "I was very nervous about teaching at first, but the students were better than I expected. Just be consistent how you deal with them and be available. I don't think there is too much you can do other than that.", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "362": {"Subreddit": "WitchPhD", "Author": "HelpingOutPops", "Date": 1482747455, "Score": 3, "Body": "I don't need to see what you said in the P.M.  She's not a fucking Jewish Heritage professor and it's not her responsibility to teach you about other cultures.  If you really want to learn that stuff there are myriad ways you could go about it that don't involve approaching random strangers and putting them in the position to have to refuse a request they never should have received in the first place.\n\nReading your comments, I doubt you had any malicious intent so I will cut you some slack in that regard, but man, you're hearing it right now: that kind of stuff is not going to make you any friends.  Nobody from *any* culture wants strangers to just put them on the spot to be a cultural ambassador for free, and for no good reason.  And if all that wasn't enough, doing it in the specific context of her being a poster here it just makes your message even more creepy and bizarre and uncalled-for.\n\nIf you're curious, go read a book.  There is a time and place to ask someone to help teach you something and that time and place is the polar opposite in every way, shape and form compared to the time and place you did ask.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "363": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482778013, "Score": 5, "Body": "Did you have an agreement with the research institution for you to enter their PhD program? I am really confused. All I understand is that you are frustrated.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "364": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482778086, "Score": 2, "Body": "Look at placements, salaries, and research articles in the two fields. There you find your answer. Just cause you Macc program made you read bunch of financial archival papers does not mean all accounting research is like that.", "Permalink": "https://www.reddit.com/by_id/t3_5k8fl0.json"}, "365": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1482778526, "Score": 3, "Body": "The only agreement I have is the contract with my current employer. I tried getting an agreement with the research institution, but they denied (my application). My employer does have an agreement with the institution though.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "366": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482778732, "Score": 3, "Body": "So... you are upset because they did not admit you the PhD program? Have you talked to the department / PhD advisor at the university?", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "367": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1482779009, "Score": 1, "Body": "Correct and yes, I spoke to the person leading the project. There are a lot of other factors of course, but laying those out would make a very long post. ", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "368": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1482779209, "Score": 1, "Body": "Mostly upset because I think I could have persuaded them when they would have showed more interest. It seems like the institution cares  about collecting funds and somebody who is good at writing articles, rather then finding new knowledge. ", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "369": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1482779996, "Score": 4, "Body": "Apply to other places for next year. Don't burn bridges. \nBe humble.\nKeep learning.\nWork on turning some of your work into a publication.\nWas this person already in the PhD program? \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "370": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1482780844, "Score": 2, "Body": "The hired person is from a country with a total different culture and climate, making it more difficult as there is way more to learn for him. Thanks for the tips, although I saw this as my only chance to ever to a PhD, not burning bridges would indeed be wise. And I'm actually working on an publication myself as well :)", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "371": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482782841, "Score": 7, "Body": "Seems like you don't have many options. You can't make them want to work with you. If you really want to pursue a PhD you should apply elsewhere. You can coauthor with their incoming student - that would actually benefit you. I don't see how not cooperating help you in any way.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "372": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1482782904, "Score": 2, "Body": "Probably true. Science PhDs are awful. There is never enough money and PhD students area treated like crap. Almost as bad as humanities.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "373": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1482783610, "Score": 1, "Body": "Just keep reminding yourself that the more you do now, the easier and less writing there will be when the defense comes. That's my only motivation.", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "374": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1482783928, "Score": 1, "Body": "Unfortunately, I am *also* attending a conference in 1.5 weeks, and preparing a conference paper for the student paper competition of a summer conference in 2.5 weeks. It's hard to set the priorities. I also enjoy spending Christmas vacation with my family... Ahhh....", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "375": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1482785892, "Score": 10, "Body": "&gt; somebody who is good at writing articles\n\nOf course they care about someone who is good at writing articles!  Writing up and publishing your work is a key part of the PhD process, and proven experience with this is a huge plus in applications.  Having a student who's an incompetent or disinterested writer is a massive time suck to a supervisor.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "376": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1482788141, "Score": 6, "Body": "Why are you concerned about the other person's culture? Don't underestimate people. \n\nYou're trying to rationalize your frustration and how the situation stacked against you...\n\nHandle it with tact and professionalism. Don't act like you got screwed. There are probably many reasons why it turned out this way.\n\nWork hard. Hold your head up high and keep at it.\n\nWho knows what doors will open in the future. \n\nBest of luck. ", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "377": {"Subreddit": "PhD", "Author": "W2doW2do", "Date": 1482799538, "Score": 1, "Body": "The reason of this post is that it indeed does not make sense to not help out, and ofcourse to vent. I saw this particular phd as a golden opportunity, as I know so many about this particular subject already, but I guess working as coauthor can benefit me in the long run.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "378": {"Subreddit": "PhD", "Author": "SigiPhobos", "Date": 1482805927, "Score": 1, "Body": "I ended up passing, it took them forever to let me know.", "Permalink": "https://www.reddit.com/by_id/t3_5g6gmq.json"}, "379": {"Subreddit": "PhD", "Author": "Avais_", "Date": 1482816861, "Score": 2, "Body": "Admission in a research based program is elusive, it is mostly a guess work what blocked your path. I is good that you have started writing and at least you know that publication is an important part (which might have given an edge to the inexperienced guy). Help the guy so that s/he would be able to facilitate your understanding of academic writing and also to co-author with that person or other fellows in the institution. Networking is also important in academics/any other field.", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "380": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1482854283, "Score": 2, "Body": "That's the reality of life at many research institutions. A good lesson to learn early on. ", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "381": {"Subreddit": "PhD", "Author": "linkht", "Date": 1482860565, "Score": 2, "Body": "It's just an oral offer. You should have been more careful.  I understand your feelings but I suggest u to accept the truth and apply for another phd in the future. Now you can teach the guy and thus you two may publish some great paper together, which is a very good result, right?", "Permalink": "https://www.reddit.com/by_id/t3_5keyvk.json"}, "382": {"Subreddit": "PhD", "Author": "linkht", "Date": 1482860697, "Score": 1, "Body": "Hhhhh", "Permalink": "https://www.reddit.com/by_id/t3_5ip2k0.json"}, "383": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1482891439, "Score": 1, "Body": "Hello - you aren't  a fraud. I have had issues with this as well (my factory setting tends to be anxious) and thought I was weird until I started reading about 'imposter syndrome.' I have started new jobs and my PhD convinced that they had the wrong person or that they muddled the paperwork. Having a panic attack or two when you're  making a huge life change is normal but if it shifts to the point where your anxiety is making it so bad that you can't  function then you might potentially want to see someone even if it's just to get coping strategies. Just knkwing how to talk yourself through this studf can make a world of difference. When you get to Australia take advantage of the various social groups and activities available through the university as it is easy to feel alienated but it gets easier over time. \n\nWhich part of Australia are you moving to? I have lived in Adelaide, Melbourne, Sydney, and Canberra. ", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "384": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1482894317, "Score": 2, "Body": "Hi! Thank you for replying! I sometimes make the joke that im 'Anxiety Girl'. It's just the stakes are so high this time round. Will monitor these thoughts and try to counter them by reminding myself just how excited I am to start working on this project. I'm going to be at Melbourne uni and also living at a residential college for the first year, I thought putting myself in a ready made community might be a good idea...", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "385": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1482894846, "Score": 1, "Body": "Good idea with the community living - and Melbourne uni is terrific.  \n\n Anxiety wise - if it keeps happening it  might even be worth tracking how your feeling for a couple of weeks just to identify if it's a problem. Tbh I would be more surprised if you weren't stressing out a little bit, just don't let it swallow you.  \n\nMelbourne  is an amazing city and by far one of my favourites (it's the only other AU city I would live in). The public transport is great and there is sooooo much going on there all the time. If you get a chance to travel around the Mornington Peninsula is beautiful as are the surrounding mountains. I'm  excited for you :) just remember take big deep breaths and I'm sure everything will be awesome. ", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "386": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1482895330, "Score": 1, "Body": "Thank you! This is so comforting! I best start packing now- all the best :)", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "387": {"Subreddit": "WitchPhD", "Author": "erie_eunit", "Date": 1482895357, "Score": 1, "Body": "Sure, if you say so.", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "388": {"Subreddit": "PhD", "Author": "SamaSoft", "Date": 1482930361, "Score": 5, "Body": "It sounds like you have imposter syndrome. It's a common thing experienced by PhD students. Good luck with your PhD, YOU have EARNED the place, so go and smash it! ", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "389": {"Subreddit": "PhD", "Author": "SamaSoft", "Date": 1482930454, "Score": 2, "Body": "I should probably be revising for exams right now...", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "390": {"Subreddit": "PhD", "Author": "Sland", "Date": 1482941996, "Score": 3, "Body": "That's a shitty feeling. You're definitely not alone feeling that way! This [image](https://cdn.psychologytoday.com/sites/default/files/field_blog_entry_images/1429677066685.rendition-medium.jpg) helped me put things in perspective. The reality is that the feeling won't go away, but you can acknowledge it, realize it's not helpful or real, and move on. I feel like tons of people in grad school have anxiety problems. I started doing [daily meditations](https://www.headspace.com/) and it's really helped me keep my cool (I used to have pretty radical mood/motivation swings a few times a year).\n\nJust make sure you take care of your mental and physical health, and try to enjoy the ride! Like my old M.Sc. advisor used to say, if doing a Ph.D. was easy, everyone would have one!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "391": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1482944913, "Score": 1, "Body": "Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "392": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1482945004, "Score": 1, "Body": "Thank you! You are right about mindfulness, I used to do it but not so much recently, will get back on it! ", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "393": {"Subreddit": "PhD", "Author": "elfradlschneck", "Date": 1482955730, "Score": 1, "Body": "Do you know the [academic phrasebank of the U of Manchester](http://www.phrasebank.manchester.ac.uk/)? I find it quite useful at times when I don't know how to put something. I'm not a native English speaker, though.", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "394": {"Subreddit": "PhD", "Author": "throwawayladystuff", "Date": 1482956340, "Score": 1, "Body": "Thanks! Because it's by publication and not chapters the words aren't that useful because the papers are so short in and of themselves... but yeah, even sometimes just 'two sentences'! is useful. :)", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "395": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1482969295, "Score": 2, "Body": "Don't forget to always keep an eye on the big picture: your future.  Too many PhD students get caught up in the day to day of their science, and forget to take care of themselves.  This includes your health, both physical and mental, as well as making moves every year to do things that will help you on your eventual job hunt.\n\nIt's not an if, but a when, your thoughts will turn from experiments to your life after the PhD.  This is a pearl of wisdom that is never internalized too early for anyone, but especially for PhD trainees.  Academia can be an extremely isolating environment.  Only you can prevent that from becoming the case for you!", "Permalink": "https://www.reddit.com/by_id/t3_5jec9q.json"}, "396": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1482970674, "Score": 2, "Body": "Just remember: everyone is afraid, even if they don't show it.  You're just like everyone else - you'll never feel more confident until you start!\n\nOne piece of advice: when you start something new, reserve a little time for something you absolutely love and are excellent at in your schedule.  It helps not only balance you, mentally, but it also serves as a built-in example to yourself that you are capable of success and excellence.  This becomes very powerful when you're facing new challenges in your new journey!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "397": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1482983893, "Score": 1, "Body": "Great advice, thank you!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "398": {"Subreddit": "WitchPhD", "Author": "Paddleboarder69", "Date": 1482985225, "Score": 2, "Body": "Stunning selfie of a magnificent body", "Permalink": "https://www.reddit.com/by_id/t3_5jyg18.json"}, "399": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1483003900, "Score": 2, "Body": "I moved to the Netherlands (from Canada) for my PhD.  It was a really good move - the PhD system there is excellent, the pay was quite good, and I enjoyed living in a new country and learning a new culture/language.  It was a similar system of having no coursework but instead doing only individual research; I really liked it because by the time I finished a bachelors and masters I felt that taking courses was not a very efficient way for me to learn the specific things I needed for my own work.  The advisor thing might not be as bad as you think - I technically only had one advisor, but there was a formal system in place for regular evaluations which included oversight from other professors to make sure things kept on track.  \n\nYou could also inquire at /r/askacademia which is a fairly large sub, though asking whether anyone has completed this type of PhD in \"another country\" might get you some sarcastic \"yes\" comments as it's really quite a common thing in many places.", "Permalink": "https://www.reddit.com/by_id/t3_5kuxpp.json"}, "400": {"Subreddit": "PhD", "Author": "elfradlschneck", "Date": 1483004629, "Score": 2, "Body": "I'm Austrian but our system is quite similar to the German one. \n1) I'm currently in my third year of individual PhD at an Austrian university.\n2) Yes, usually you have to pick a professor; you should have a look at their research group's website to see if there are any open positions for PhD students; if yes, send them your application. If there are no open positions or if you can't find any information, you can send it anyway but chances you get a reply are lower. I sent dozens of applications and only got a handful of responses, but eventually managed to get a PhD position this way. If the professor knows you, it is usually much easier.\n\nUsually you have a secondary advisor so there is not only the professor to talk to. In fact, you will probably spend much more time with your secondary advisor. You should also talk to someone who is already in the professor's group to find out if the supervision provided by the professor is adequate (and, to be blunt, find out if he/she is an asshole). ", "Permalink": "https://www.reddit.com/by_id/t3_5kuxpp.json"}, "401": {"Subreddit": "PhD", "Author": "SqrrlBait", "Date": 1483007382, "Score": 1, "Body": "Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "402": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1483009336, "Score": 1, "Body": "You can do it!", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "403": {"Subreddit": "PhD", "Author": "chazgray", "Date": 1483015038, "Score": 1, "Body": "Go get 'em OP!", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "404": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1483017503, "Score": 7, "Body": "Hold your ground, hold your ground !\nGraduate students, Ph'dudes, my brothers ! I see in your eyes the same fear that would take the heart of me. A day may come when the courage of men fails, when we forsake our co-authors and break all bonds of fellowship, but it is not this day. An hour of angry supervisors and shattered lab equipment, when academia comes crashing down !\nBut it is not this day ! This day we graduate ! By all that you hold dear in your manuscript, I bid you stand, Fish Sticks Forty !", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "405": {"Subreddit": "PhD", "Author": "cerys2005", "Date": 1483020928, "Score": 2, "Body": "I don't have to work, but I feel guilty when I go a day without making some effort to work on my thesis. :(", "Permalink": "https://www.reddit.com/by_id/t3_5k5dud.json"}, "406": {"Subreddit": "PhD", "Author": "justrudeandginger", "Date": 1483025835, "Score": 1, "Body": "Thank you so much for the insight!", "Permalink": "https://www.reddit.com/by_id/t3_5kuxpp.json"}, "407": {"Subreddit": "PhD", "Author": "justrudeandginger", "Date": 1483025989, "Score": 1, "Body": "Thank you for sharing your experience. I'm starting to think that an individual track may be a better decision after all. Also thank you for the rec/heads up!", "Permalink": "https://www.reddit.com/by_id/t3_5kuxpp.json"}, "408": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1483027703, "Score": 1, "Body": "2 hours to go, OP! Smash that defence! ", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "409": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1483029649, "Score": 1, "Body": "Yeah, JUST. DO IT.", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "410": {"Subreddit": "PhD", "Author": "jhpy1024", "Date": 1483033942, "Score": 1, "Body": "Let us know how it goes/went!", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "411": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483038696, "Score": 1, "Body": "A PhD, depending on your future career, may end up being harder to justify than a Masters.  It doesn't necessarily make the years of your PhD tougher, but what it does mean is that you will want to be mentally prepared for your own state of mind at the end of it.  That state of mind can be a lot more weary than when you began.  On the other hand, some people with Masters wish they got their PhD for career development purposes; it all depends on what you end up wanting for your life, and what makes you feel fulfilled and happy. \n\nDon't expect it to necessarily be the same things that you think you want, and what make you feel fulfilled and happy now :)", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "412": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1483039762, "Score": 1, "Body": "&gt; Anyone else in this boat too?\n\nI would imagine you're quite a rare case. ", "Permalink": "https://www.reddit.com/by_id/t3_5kynfi.json"}, "413": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483041512, "Score": 1, "Body": "If it won't break your bank, it may help you show your conviction and dedication to the academic lifestyle.\n\nOn the other hand, having good research experiences and networking on your own time is a much more cost efficient and ultimately more impactful way to help you get into grad school.  \n\nPhD posters, to be honest, don't really matter until you are presenting on your thesis work to potential collaborators or future postdoc PIs.  It's good public speaking practice for your science, but everyone should ideally practice that in different ways throughout their year anyway, instead of pouring everything into a single conference presentation.", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "414": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1483043164, "Score": 2, "Body": "How can you be a STEM PhD and have a stipend that only covers rent?\n\nYou should disclose your university so that no one ever goes there.", "Permalink": "https://www.reddit.com/by_id/t3_5kynfi.json"}, "415": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1483047723, "Score": 1, "Body": "How'd it go?", "Permalink": "https://www.reddit.com/by_id/t3_5kvpy2.json"}, "416": {"Subreddit": "WitchPhD", "Author": "Etheostoma", "Date": 1483078161, "Score": 3, "Body": "Damn. I love your fuzzy legs and fare complexion. Such a beautiful combo.", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "417": {"Subreddit": "PhD", "Author": "CleverDan520", "Date": 1483107737, "Score": 2, "Body": "Find the uni's list of faculty then Google them, check out their Web pages, search for their publications, etc. Most will have a Web page with a blurb on their research.\n\nYou could try finding institutions by searching authors from your standard academic journal about volcanology.", "Permalink": "https://www.reddit.com/by_id/t3_5l19xb.json"}, "418": {"Subreddit": "PhD", "Author": "madhatter10-9", "Date": 1483121023, "Score": 1, "Body": "Depends on a lot of factors. I'm currently doing a PhD studying the microbiome in Germany and it's great. I too am interested in working in Academia and I enjoy constantly learning new things. For example, as part of this phd i'm also learning bioinformatics which is great. Everyone has their own reasons but if you are dedicated and extremely interested in a particular subject then go for it. I can't speak for US PhDs but tbh that seems to be where most of the horror stories come from. I don't think anyone is 100% sure and there's times where you seriously question your decision but that's the same for everyone. I guess a good way to measure is to look at the requirements for a phd/phd program and see if you meet them first of all. Secondly, are there programs/professors/specific projects you know you would be extremely interesting to you. Thirdly, like i mentioned do you enjoy learning, can you dedicate yourself to a subject for 3-4 years or 6-7 in the US. If you have any other questions, ask away, not sure if I answered everything for you. ", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "419": {"Subreddit": "PhD", "Author": "redditrabbit19", "Date": 1483121793, "Score": 1, "Body": "Thank you so much! Why would US have most of the horror stories? I am not a US citizen; would you recommend me to finish my PhD in a different country if I want to pursue one?", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "420": {"Subreddit": "PhD", "Author": "madhatter10-9", "Date": 1483122655, "Score": 1, "Body": "Well it's much longer and the pressure on both professors, postdocs and grad students seems to be much greater than in Europe. Yeah definitely. I'm from the UK but i moved to Germany to do mine. I would only suggest moving abroad if you're sure about it though as it can get quite lonely and be difficult to meet new people. ", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "421": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1483125069, "Score": 1, "Body": "Hmm, /u/madhatter10-9's right, most of the PhD horror stories *do* seem to come from the US, although I have no idea why.  I never noticed that before.  I was a US PhD horror story myself, and indeed, I moved to a group in Europe to finish, and it's much better here.", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "422": {"Subreddit": "PhD", "Author": "PierceBrosman", "Date": 1483132582, "Score": 2, "Body": "&gt; I read some posts in the reddit, there are a lot of students who regret starting it\n\nA lot of the people that come to this subreddit do it to rant/vent; don't take it as a true cross section of what it's like to be a PhD student. That being said, it is stressful and hard work for little/no pay. If you're only in it for the money, then I recommend staying away. If you love learning and want to make it your life, I recommend considering it!", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "423": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483146759, "Score": 1, "Body": "I graduated, but had been doing other things during my PhD that helped me land my job outside academia right out of grad school (writing, organizing, freelance reporting, etc).  Honestly I'm glad I followed my heart, despite all my fears and misgivings and assumptions about being undervalued and underappreciated outside academia, because the world outside academia can be just as messed up and crazy, but also provides so much more flexibility and joy because it's a much better fit for my personality and interests.  This may also be quite true for you.  \n\nBefore you started your PhD, what were some of your favorite activities, passions or interests?\n\nMy advice: never try to consume yourself with what others will think.  It's easy to say, really really hard to do, especially after spending so much time in academia, but what others think really doesn't matter in the end.  It's your life.  They don't suffer when you suffer.  And only you can reap the benefits of taking action to make yourself happy.  1 or 2 years after you leave the ivory tower, you will look back and so many of the worries that are at the top of your mind now won't even register as a concern anymore.  Changing your environment is one of the fastest ways to change your expectations and concerns.\n\nIf you are in a toxic environment, the best thing you can do for yourself is to get yourself out of it, and to engage in something you really love and enjoy.  You need to distract yourself in a guided fashion, because otherwise you'll marinate in self doubt, guilt, shame and whatever social pressures your program has erected to keep people going.  If you're already pretty sure you want to leave, that's probably the right thing to do.  Don't damage your body or your mental health for the sake of someone else's approval.  Their approval will not return you your health or your self confidence.\n\nWhat does matter though, is what you have lined up next.  I'm pretty sure that you will feel really confident leaving if you have an idea of what you want to pursue next.  This angst you're feeling will be the same at the end of your PhD if you choose to continue, only you will be 2 years older, with 2 more years of your life passed in what sounds like relative misery.  If you are already in the process of leaving, try not to focus on the drama of what you're getting out of.  Instead, try to think about how to build yourself a soft landing pad, where you can heal and move on with your life with new purpose and energy.  That can mean living with family for a bit, it can mean traveling for a bit.  It can mean volunteering for awhile.  Whatever it takes to get yourself feeling hopeful and interested in life again.\n\nWhat did you initially start your management PhD to do?  (Also I'm a bit intrigued by what you're studying.  I know bio PhDs to be 7-8 years, but that's long even for us.)", "Permalink": "https://www.reddit.com/by_id/t3_5ifn5y.json"}, "424": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483147630, "Score": 1, "Body": "1.  No; definitely not.  It depends on if the topic of your thesis and the nature of your experience, both inside and outside your PhD work.  If your skills are relatively easy to apply to careers outside the lab/research group, you will have more options in integrating that exact skillset into your future work.  Most people stop caring about that pretty quick once they enter the \"real world\" though, because your priorities and concerns quickly change :P  If you're talking about academia, or straight research careers in industry, then you may be more constrained given people like to hire those who have the best fit for a position, which will include experience and skillsets. \n\n2.  No.  In fact I think it's easier to move after the completion of a PhD, especially if you get a job that's not related to academia.  Even within academia, you have to follow the job market, and you will build a new community in your new home.  The world is also a small place, and if you frequent well traveled circles in your topic of interest, you may be surprised to see many of the same people popping up.  What I've found is that, although I miss the community I built in grad school, it means I have a bigger network now (I moved from the East Coast of the US to the West Coast for my job, and now instead of just having one big friend group on the east coast, I have two.)  People move all over the country and world after they graduate, chasing jobs or SOs.  Our adult world is centered around making and maintaining global networks these days. \n\n3. All researchers, regardless of their status, have to at least initially get hired by appealing to the hiring committee in a university or institution or company.  That means someone will always be technically \"in charge\", at least until you get to the very very top of an org, in which case you're likely not doing research anymore anyway (C-suite people, dept heads, deans, etc are usually doing admin or strategic work).  \n\nAs you begin on a research career, you will have to continually pass board approvals, get funding or project proposals approved, or go through academic tenure reviews, all of which will judge the quality and nature of your work based on external assessments.  Politics will also come into play in this question, so being a great people person never hurts and matters more and more the higher you get in an organization, regardless of who you are.  I suppose the stage you're looking for is a senior PI or researcher who runs their own research dept, and who also has the approval and trust of their supervisor (perhaps a dean, president or a VP).\n\nHope this is helpful!", "Permalink": "https://www.reddit.com/by_id/t3_5j4fky.json"}, "425": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1483154570, "Score": 3, "Body": "How labor-intensive will it be to correct? Is it something that you can revise on your own without input from an advisor?  \n  \nIt's probably worth exploring the necessary revisions at least partially on your own before escalating the issue. You may find that the analysis doesn't change too drastically and be able to patch the changes in without creating a stir. Your committee will also probably be grateful that you took the time to investigate the issue and find out exactly what will change before turning to them.  \n  \n", "Permalink": "https://www.reddit.com/by_id/t3_5l63j5.json"}, "426": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483156584, "Score": 1, "Body": "No one goes into biology professorships to make bank, that's for sure!  I'd expect between 60-80K for a starting research prof job (assistant prof), likely closer to the bottom range (http://www1.salary.com/Asst-Professor-Biology-Salaries.html).  If you advance up the tenure track (assuming you're in a tenure track position), you should see an increase in your salary as you go.\n\nActual numbers will depend greatly on varying factors: which university, what department, if you come with your own grant money, your research reputation, your network and connections at that institution, your research skillsets and expertise that you bring to the department.  As a starting faculty, the competitiveness of your salary is also dependent on factors like teaching load, research startup package, and if you're talking a 9 month or 12 month salary.\n\nTo put this into perspective, bachelor and masters students can expect to be making this range of salary within 5 years of working (aka while we're in grad school), depending on what industry and field they're in.  PhDs, being a terminal degree, may be able to advance into management more easily, but we also have a later start in the real world as well.  In the end, it all comes down to taking a path that satisfies your own interests and passions while being able to make a living.", "Permalink": "https://www.reddit.com/by_id/t3_5j3rdx.json"}, "427": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1483156945, "Score": 1, "Body": "Along the lines of the pomodoro, I've found Toggl to be very useful.  I like having the automatic reminders. Being able to look at my own performance, and have it on my phone, also helps me stay accountable.  https://toggl.com/\n\nAlso, give yourself cheat time that is contingent on writing a certain amount.  Do something you love, ONLY after you've finished your allotted assignment for the day, and start EASY.  Make it easy to accomplish your goal, and increase it day by day, otherwise you'll just give up right away and never get any traction.  This is how you build a good habit, and maintain it, day by day :) \n\n(Also, sorry to hear about your personal life; that's terrible and I hope you're getting support from family and friends during this hard time.  At the same time, while it sucks, it may also be a good thing (you probably don't want to spend the rest of your life with a bro who couldn't stick with you for your research fieldwork.))", "Permalink": "https://www.reddit.com/by_id/t3_5jnolc.json"}, "428": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483164160, "Score": 1, "Body": "I think they just might not have practices and systems in place to protect students in the US. I'm in Australia and I don't know anyone with only one advisor/supervisor. Having another faculty member involved keeps most people in line. We also have annual reports here where we can lodge any supervisory issues and they are sent to our deputy vice Chancellor for research to deal with.", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "429": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1483175375, "Score": 1, "Body": "I'm not sure. I need to talk to my old boss/friend who's an expert because it may not be possible to analyse it in the way I want. The way I've done it is a simplified model you can use based on said assumption, the other way requires more data than I have in order to fill in the gaps where the assumption is not met.\n\nThe internal will no doubt view it as a serious error of judgement.", "Permalink": "https://www.reddit.com/by_id/t3_5l63j5.json"}, "430": {"Subreddit": "PhD", "Author": "Leefa", "Date": 1483205239, "Score": 3, "Body": "if you follow the cited sources for the info in the Wikipedia article, and look up the authors of those cited papers, you may find some useful info on academic backgrounds ", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "431": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483205707, "Score": 1, "Body": "Definitely should have tried that. Thanks for the tip!", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "432": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483209180, "Score": 0, "Body": "As a Ph.D. 5th year student from the US, I have plenty of my own horror stories and have heard many myself. I started my own program with two others and the other two did not end up making it (1 left after 2 years, the other left after 4).\n\nI already have 8 papers (3 1st author in journals with IF 4-10) and several more are expected of me in the next year before I can graduate. While the process has been a greater challenge than I ever could have anticipated, it has its benefits. I feel like I've learned and developed much more in the past few years than at any point in my life (for instance, much more than my entire time in high school or in my B.S. program). I've been afforded a lot of resources to devote to research and have been able to attend ~8 large conferences (100s to 1000s of people). For some time, I was jaded about how agonizingly difficult everything has been, but I also recognize that it has turned me into a better researcher than I would have been under more lax conditions.\n\nWhat matters most is your own personal goals. If you really want to be challenged and come out of your Ph.D. a rockstar, maybe the high level of pressure, expectations, and resources will be to the benefit of you and your career in the long run. It being longer and more difficult is not necessarily a bad thing.", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}}