{"0": {"Subreddit": "PhD", "Author": "ai_4_life", "Date": 1464752958, "Score": 3, "Body": "I think this is the hardest part of doing a Ph.D., especially if your advisor(s) don't micromanage you. Some people seem to be better than others. I think the best thing is to take care of yourself (food, sleep, excercise) and that helps you better deal with stress. Honestly, much of my procrastination (which seems to cause my mismanagement of time) comes from feeling overwhelmed or underwhelmed. Either I have too much to do or I feel like my research doesn't really matter. Pretty sure I deal with bouts of imposter syndrome. I have a strong publication record but feel like I haven't made any real progress in the scientific community. Some days to get through it I literally say to myself: \"I won't quit, I'll force myself to wait for them to kick me out. \" Doesn't work though haha I just passed my proposal defense and things look bright for my dissertation (according to my advisors). I put a lot of trust in them.\n\nEdit #1: I realize I didn't really answer your question. One thing I do is to try to set appointments that will help me keep a schedule (i.e. make meeting times early in the morning to help me wake up on time or end the day with them to help keep me in the lab or on campus for the whole day). ", "Permalink": "https://www.reddit.com/by_id/t3_4ltv7i.json"}, "1": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464753393, "Score": 2, "Body": "Thanks for responding - massive achievement to be in a position to say \"things look bright for my dissertation\" - sounds like you're already smashing it! ", "Permalink": "https://www.reddit.com/by_id/t3_4ltv7i.json"}, "2": {"Subreddit": "PhD", "Author": "-izzle", "Date": 1464761185, "Score": 1, "Body": "Don't let others dictate your worth. It sounds like you need some time off to gather new energy so you can finish. Also, before you continue with a post doc, make sure that it's really what you want. If it is – great! If it's not – whatever. There are millions of things to do in life other than science which you would also find interesting.", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "3": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1464810355, "Score": 4, "Body": "okay. first of all, i want you to forget about comparing yourself and your work output to that of young, single men. no, fuck that. you have two kids!! just being here is a victory. and anybody insinuating otherwise can go choke on a dick.\n\nsecond of all, work output really depends on discipline. do people in your field primarily publish in conferences or journals? if the latter, don't beat yourself up about low output! you'll be lucky to get first author in two publications if your discipline is low-output and journals-based. wait until you have some research to your name and then write a manuscript you can shop around. \n\nif on the other hand you're in something like computer science where conferences are much more desirable than journals and one paper a year is standard or even low output, try and structure your work into bite-sized chunks you can shop to relevant conferences. again, original work is always better - even a lit review can be made publishable. \n\nbut i think the underlying issue here is that you're not sure you're still hungry for this doctorate. and that's okay! you've got nothing to prove to anybody. if finances aren't an issue can you suspend your status while you mull things over?\n\n*source: 2 kids, on mat leave*", "Permalink": "https://www.reddit.com/by_id/t3_4m210n.json"}, "4": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1464817083, "Score": 2, "Body": "&gt; I dunno, guys.  I'm struggling.\n\nOf course you are struggling.  You are a PhD student.  Go check out the misery on r/GradSchool.  Being a PhD student is usually a terrible experience.  Don't attribute it to your kids, or your husband: most of the other miserable posters don't have these, and they are still depressed/anxious/suicidal.  It's the system: almost all PhD students spend their days having their \"inferiority\" rubbed in their noses.\n\nThe first time I tried a PhD, I had custom-built my life to perfectly support my studies.  I had a calm stable supportive partner, home, finances, stress-relieving hobbies, no kids or pets or anything distracting; I was smart, focused, motivated, and had a good background in the subject.  In short, I had my life more together than pretty much all my professors.  And they were so bitter over it, they wouldn't work with me.  But the miserable students whose lives were in shambles, they were happy to help and graduate.  So it's not about homelife.\n\nYou absolutely can do a PhD.  RP, paper-writing, and literature familiarity are masterable.\n\nBut here's what you need to do.  You need to make up your mind what path you are going to pursue with your life, and then go do that.  **There is no path in life that is easy.**  If you don't decide on the goal, you'll never get there.  Whatever you want to do, you can do it, or at least make great progress toward that goal.  But there's not time to do everything that crosses your mind, so you have to choose the most important, commit to it, and pursue it.  For me, personally, this was getting a PhD: I nuked pretty much everything else in my life to make that happen.  But of course, the answer will be different for everybody.  Everyone's goal is unique.\n\n&gt; At my graduation ceremony one of my lecturers [...] doing a PhD [...] So I applied\n&gt;\n&gt; I fell pregnant again\n&gt; \n&gt; I was just told to write them for experience\n&gt; \n&gt; If it leads places then great\n\nThese are not the words of someone who has made up their mind what the goal is.  Decide, and commit!  \n\nWhatever you choose, you can do it.  I believe in you.", "Permalink": "https://www.reddit.com/by_id/t3_4m210n.json"}, "5": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1464821694, "Score": 1, "Body": "I felt the same way during the end of my PhD. It's been a year since graduating and I somewhat still feel like this. I've talked to other grad students and it seems as if the younger students (like myself) have this \"wtf am I doing?!\" feeling. I think it's because all we have done is school school school with no real job. The older grad students have worked in the industry field and go to grad school knowing what they want to do when they come out. \n\nI was pretty close to quitting but I didn't. I had already invested too much time. You should just finish your PhD. If your PI lets you stay on for a few months after, take that time to figure out what to do. \n\nI recently started working at a small biotech (n=6) company and man oh man grad school does NOT prepare you for the industry job market. Plus my boss is borderline disrespectful and it's making me hate science. I hate that fact that the science world believes you move 1000 times before you can set into a city. How the fuck is anyone suppose to have a family? I should've just been a vet...", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "6": {"Subreddit": "PhD", "Author": "Phdconfusion", "Date": 1464826493, "Score": 2, "Body": "The kids are absolutely a problem, as far as doing a PhD is concerned. I would like to do it just to say I've done it. I'd been thinking about it before my supervisor approached me so I went for it. \n\nI feel terrible that I didn't even manage my first milestone. I had to request an extension because it was due a week before maternity leave started and I had so much still to do on it. And now I have two children, this is my day: up at 6 when the older one wakes. Can't get anything done towards study while he's awake. He goes to bed at 7pm. Baby is up and down until 12-1am. If she's asleep then I can work but it gets frequently interrupted if she cries or needs food or changing or wakes up to play. Sometimes her noises wake up her brother so I have to try to get him back to sleep while juggling her, as she gurgles and giggles and tries to wake him to play. So I don't get a solid chunk of time where I can sit down and focus. I've been trying to do a PP for a 10 minute presentation for two weeks now. It's half done. And I hate that time spent with her makes me feel guilty that I'm not working. If I didn't have children then I would have heaps of time to dedicate to the work but right now I just can't see how it's possible. And I'm only at the RP stage. It hasn't even got crazy yet. I hear of students hitting this stage 2 years in. I'm about 6 months in. \n\nIt doesn't help that the kids (mainly the older one) have been sick for the last 3 weeks but I really can't use that as an excuse. They are kids. There is always going to be something. \n\nThank you for your response. I really do appreciate it. ", "Permalink": "https://www.reddit.com/by_id/t3_4m210n.json"}, "7": {"Subreddit": "PhD", "Author": "Phdconfusion", "Date": 1464827101, "Score": 3, "Body": "I'm on maternity leave til the end of the year so my status is already suspended. So I do have time, I just keep thinking \"man, if I'm going to quit then just do it now so I don't have to stress about the RP\".\n\nI'm expected to publish 4 times, that will form the bulk of my thesis. I'm not too concerned that the two I wrote didn't get published - none of it was my research, I was just given results and told to write a paper. So a flawed methodology preventing publication doesn't feel like something I should worry about. \n\nI'm struggling to find time to work, and I know it will get easier when the kids grow up. But we'd like another baby so that will start the cycle again. ", "Permalink": "https://www.reddit.com/by_id/t3_4m210n.json"}, "8": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1464972306, "Score": 2, "Body": "Why would you want to go back? lol", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "9": {"Subreddit": "PhD", "Author": "FinchPR", "Date": 1464979159, "Score": 1, "Body": "There can be more opportunities in an location that I will prefer within industrial engineering after a few years. Thinking in the long run.", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "10": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1464981321, "Score": 5, "Body": "PhD in Illustration? \n\nHere is the deal: If you need to pay (loans, whatever) for a PhD - its a scam.\n\nPhD student GET PAID because ITS A JOB.", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "11": {"Subreddit": "PhD", "Author": "porterble", "Date": 1464987225, "Score": 1, "Body": "Really depends on the institutions involved. Im currently on my 3rd specialty, and although i could go back and teach in others the skill falloff is quite severe.", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "12": {"Subreddit": "PhD", "Author": "clefairykid", "Date": 1465040780, "Score": 1, "Body": "Oh they offered a scholarship payment, but only if I go via the honours route and manage to get 85 or higher on that, which they seemed more than confident would happen based on my record so far. It's not a lot of money but they reckon that \"Teaching supplements that\" I have no idea by how much though, it's difficult trying to talk money when I feel like I have very little idea about the process as it is ", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "13": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465051730, "Score": 2, "Body": "Are you in the US?", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "14": {"Subreddit": "PhD", "Author": "clefairykid", "Date": 1465091073, "Score": 1, "Body": "no, Australia\nso far asI can tell it's not always standard that you get paid to do a phd, unemployment here is insane for everyone in every industry at every level so it's not surprising, plus the government slashed funding so even at the bachelors level we only see one tutor about 5 minutes a week and there are whole week were they dont pay the tutors at all", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "15": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465091111, "Score": 1, "Body": "eh I don't know how it works there", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "16": {"Subreddit": "PhD", "Author": "clefairykid", "Date": 1465092124, "Score": 1, "Body": "mmm I figure that's another reason I won't find any answers on the internet xD", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "17": {"Subreddit": "PhD", "Author": "FreshProphet", "Date": 1465126939, "Score": 1, "Body": "I feel the same with you though I am a very beginner of phd. But I think if you choose this way why not continue with smile? I think everything will become better if you believe ^_^ So cheer up~", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "18": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465130566, "Score": 2, "Body": "Entering my third year. You basically wrote down all my feelings for me. I keep going because if I quit I'll feel like I wasted two years of my time and opportunity cost that I would have made in the field. If I don't finish it was all for nothing. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "19": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465131319, "Score": 1, "Body": "That's the single thing that's stopped me from leaving, is that I'd be throwing away four years.  On the other hand, if I stay, how many more years am I throwing away by staying here doing nothing of value?  My resume is going to be complete dogshit after this.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "20": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1465140024, "Score": 1, "Body": "&gt; pretend to look at my work, pretend to read what I've written, pretend to have an interest in my success. Everything is pretend\n\nYes, this is absolutely right.  You are perceiving this correctly.\n\nWhy is it this way?  Obscure reasons.  Reasons involving the background of someone who becomes a professor and why they become a professor, and reasons involving the pressures of the academic system in shaping how professors spend their time.  But none of this matters.  What matters is: What exactly is your goal, and, given that you now have more insight on the system, does a PhD help you reach that goal?  For some people the answer is yes: they want to use the PhD as a credential to gain respectability for their research; or their parents never went to college and they want to prove PhD's are doable; or they are good at negotiating collaborations in bureaucracy and want to work behind the scenes wrestling over funding.  For other people the answer is no: they wanted to prove they were smart, and realized that banging their head against a keyboard for 5 years was not the way to do it; or they wanted a stable job and realized that the academic pipeline was not a good path; or they loved a particular subject but realized that academia ruined it for them.\n\n&gt; pretend to care about writing papers (my adviser hasn't published a journal paper in...ten years?)\n\nI am sure you realize this, but this is not the track record of a reputable professor.  Because I've never seen someone exit satisfied with their experience working for a professor like this, I warn all prospective doctoral researchers to only work for professors with a vigorous publication record.\n\n&gt; Originally I wanted to be a professor, but if being a professor means being anything like my adviser than I'd rather scrub fucking toilets.\n\nThat's fine.  There's many different kinds of professors out there; if you still want to be a professor, you don't have to be at all like your advisor.  Remember back to when you first wanted to be a professor: what qualities did your professor role models have, that you wanted to be like?  Or, you don't have to be a professor at all, if that's not your goal.\n\nAlso, are you being careful to attend conferences and symposiums and stay in contact with lots of researchers outside your immediate group?  That's critical to helping you see the bigger picture.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "21": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465142274, "Score": 1, "Body": "Fair question. I hadn't realized you've already put in 4 years without proposing. How long are you funded for? ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "22": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465142491, "Score": 1, "Body": "Another thought, why not start applying for industry jobs right now? If you get a decent offer, then fuck it and bail. If you don't get an offer then at least you know your not missing some opportunity cost. You just keep plugging away until you either finish your PhD or get a sweet job offer. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "23": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465143906, "Score": 1, "Body": "It's too late to work with someone who actually has a good publication record.  My advisers will just blame the student, saying it's our fault we didn't write journal papers, even though they wouldn't ever read it and allow us to submit it.  We have all the responsibility, but none of the power.\n\nI did the PhD 'cus I wanted to do something new, not spend every moment fighting the rest of academia.  The PhD at this point isn't even about the research, it's just playing a game of how much the student can be tortured.  It's just a giant hazing ritual where we pretend that our thesis will actually ever be read by someone, when in all likelihood it will collect dust, never to read by a single soul.\n\nBeing a professor means I'd then have to continue this through a post-doc, and then spend more time in academia aiming for tenure.  My professor role model actually aimed to create a successful student, but all I've experienced is that students are successful in spite of the professor, through their own effort and their own will, not due to the support received.\n\nI just hope that sticking it out for another year, two years, three years (I've been hearing I'll graduate in a year for the past two years now) the PhD itself will allow me to do something worthwhile somewhere else.  I'm going to industry.  Since I'll have no journal publications (in my field) I'm not doing multiple years of a post-doc to catch up.\n\nI go to multiple conferences every year and I have a ton of conference publications.  I know the bigger picture in terms of my research, but my adviser doesn't agree.  \"GPUs aren't used in real settings,\" is what she told me.  So now I have to go back to what she knows, the same stuff from the 70s, doing mean and variance and just repeating what's already been done.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "24": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465144268, "Score": 1, "Body": "My adviser's grant has \"ended\" for the past two years, yet she keeps chugging away.  I get a half TA from the department, and half RA from her.  The department has recently hated how long students are taking to graduate and so don't give TAs out to people who are behind 4-5 years.  I'm glad for this, because I'll finally have a reason to say that I need to leave.\n\nEven if I'm not funded, they'll still expect me to stay and continue without being paid.  They've already said as much.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "25": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465144342, "Score": 1, "Body": "I probably should.  Even though I don't wanna bail, maybe I can use the offer as incentive for my adviser to hurry the fuck up and help me graduate.  She pretty much never graduates anyone in a respectable amount of time unless they have urgent situations, like needing to leave the country.  Since I live here and have money saved up, I'm kinda screwed.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "26": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1465146042, "Score": 1, "Body": "&gt; It's too late\n\nNo, it's not too late.  It's not too late until you're dead.  Lots of people not only suffer through all the bullshit you are describing, but also get forced out by their advisor without their PhD, and have to start from scratch elsewhere.  I was one of the second timers, along with about 25% of my world-famous group here.\n\nBut it all depends on what your goal is.  That is what you must decide and work towards.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "27": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465150281, "Score": -2, "Body": "wrong field. not worth it. go to business.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "28": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465152429, "Score": 2, "Body": "What?", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "29": {"Subreddit": "PhD", "Author": "CantHearYouBot", "Date": 1465152436, "Score": 1, "Body": "#WRONG FIELD. NOT WORTH IT. GO TO BUSINESS.\n***\n\n##[^^^I ^^^am ^^^a ^^^bot, ^^^and ^^^I ^^^don't ^^^respond ^^^to ^^^myself.](https://np.reddit.com/r/CantHearYouBot/)", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "30": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465152483, "Score": 1, "Body": "Forced out?  Whaaaaaaaaaat.  That's ridiculous.  There's nothing the school can do at that point?", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "31": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465152612, "Score": -3, "Body": "I am saying you are in the wrong field. PhD in natural sciences sucks. transfer to management at least. Should be generic enough and they like quants.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "32": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465152656, "Score": 2, "Body": "Who said anything about natural sciences?  I'm in electrical engineering.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "33": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465152765, "Score": 1, "Body": "This is pretty common in physics actually.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "34": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465152816, "Score": -3, "Body": "same shit to me.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "35": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1465162348, "Score": 2, "Body": "Come on over to r/GradSchool, and check out all the posts 'it seems like [my advisor] is laying the groundwork for my failure', 'I feel like [my advisor] has bullied me, abused his position of power, and left me hung out to dry', 'This afternoon, my supervisor calls me to his office to say it still didn't go great, and that I'm 'borderline'.' etc. \n\n&gt; this is the third topic I'm working on, as every 1-2 years she changes my focus\n\nBy the way, one of the classic techniques to fail out a PhD researcher is to prevent them from ever defending (\"not ready\"), while the department eventually withdraws support (\"taking too long\").  Please reach out and ask us if you decide to continue and need help strategizing how to handle this situation.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "36": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465163417, "Score": 1, "Body": "Well, I don't think she's particularly malicious like that, merely that she's incompetent.  I've come to realize that she's similarly disorganized and flighty in every aspect.  I don't believe she's setting me up for failure purposefully, it's just that she's incompetent and doesn't know better (or care to learn).  I'll definitely check out the sub, though.  It would be nice to know I'm not alone.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "37": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465163760, "Score": 1, "Body": "Okay bud.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "38": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465166366, "Score": 1, "Body": "They are really narcissistic these people aren't they. I don't know what school you're going to but I want to bail for you. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "39": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465166524, "Score": 2, "Body": "And that's why you're in business.... ass, elbow, can't tell the difference. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "40": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465166865, "Score": 1, "Body": "I applaud you for being a PhD student and a mom. I have no idea how you're juggling all of that. I literally quit everything to focus only on my PhD, and I feel like I'm still failing most of the time. I think you are totally awesome for doing what you're doing. Which ever path you decide, you should be proud of yourself. ", "Permalink": "https://www.reddit.com/by_id/t3_4m210n.json"}, "41": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465168715, "Score": 1, "Body": "may be. It does not make a difference because tenure track employment prospects are just as shitty in ee as in physics.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "42": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465172055, "Score": 1, "Body": "They are extremely narcissistic and cynical and stay only within the lab so they have their little echo chamber.  Thanks for listening to my ranting.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "43": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465179091, "Score": 1, "Body": "Thanks for the positive vibes. I'm sure you're a joy to have at Christmas dinner. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "44": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465180470, "Score": 1, "Body": "life is hard. truth is inconvenient. better pretend everything is rosy.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "45": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1465226800, "Score": 2, "Body": "The only thing lawyers care about is your law degree, admittance to the bar, and legal work experience. \n\nWhere you go to law school and your GPA are significant factors. If you don't have the transcript to get into a top 15 (ish) law school, and you just have to get more education, then consider getting a Master's degree to bring your GPA up. \n\nMixing a JD and *anything* is a horrible idea - your grades in law school will suffer, which defeats the goal of getting a good job at a law firm. \n\nI'll leave it to the experts to comment on a PhD in philosophy. ", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "46": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1465227399, "Score": 1, "Body": "I'm not a PhD student, but I have spent a lot of time with incompetent managers. \n\nRule #1: Your success is your responsibility, nobody else's. \n\nGet help from these folks who can offer advice on the delicacies of working in the academic environment, and draw up **your** action plan for finishing your dissertation. Talk to experienced researchers and professors about where you are, and what you should have to do to finish. Craft it with real details regarding durations, dates, names, and places. \n\nThen (and here's where the advice and politics come into play) get your adviser to review it. If you get *anything* but constructive criticism (i.e. specific changes to make based on their understanding of your status and progress) then (again - this is delicate) figure out how to get it in front of another professor. \n\nYou want to establish the understanding in your department that **you** are trying to finish, and it's your adviser that's in your way. Not in a malicious sense - this is not \"it's their fault\"; but rather by showing other professors and leaders in the department that you are doing the work, that you have an intelligent plan, and you are simply trying to get done. \n\nNever ever cast blame. If someone says something like \"You should run this past your adviser\" then a polite response might be something like \"Yes, I did, but I was hoping I could get additional constructive feedback.\" \n\nDon't worry about your adviser or their motivations - that's not your problem. Worry about finishing your degree - that is your problem and nobody else's. \n\nGood luck. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "47": {"Subreddit": "PhD", "Author": "avtges", "Date": 1465228312, "Score": 1, "Body": "So, maybe just a Philosophy PhD - I guess my overall goal is to see whether my ideas are worthy of a doctorate, wanted to make it practical with the law degree.", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "48": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465233653, "Score": 2, "Body": "You really can't weigh your options until you know if youve got the extension or not. I really think your PI should recognize that it took guts for you to come forward and admit you had a mistake. If you lose funding, you need to make ends meet. You may not find a job directly related to your research, but you cant be picky when you've got no income. ", "Permalink": "https://www.reddit.com/by_id/t3_4mtn7c.json"}, "49": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1465234837, "Score": 2, "Body": "Devil's advocate: If you don't think it's practical... ", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "50": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1465235082, "Score": 1, "Body": "A PhD in philosophy might give credibility in *some* fields, but you need to figure out how it will impact your ideal career and how \"writing philosophical works\" fits into the larger picture (how to make that pay the bills).  A JD/PhD combo will likely overqualify or mis-qualify you for many careers, unless you plan to be a law professor.\n\nThis may help some: \nhttp://www.apaonline.org/?page=nonacademic\n\nI'm personally glad that I finished my masters before starting in on my own PhD program. I was able to leverage that to further my career, where I then learned a lot of practical knowledge that I'm now applying in my PhD program. YMMD", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "51": {"Subreddit": "PhD", "Author": "avtges", "Date": 1465235514, "Score": 1, "Body": "lol yeah I don't think a PhD in philosophy is a practical pursuit at all. But I have a great fall-back career and time. I just want to put my effort into real philosophical research. ", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "52": {"Subreddit": "PhD", "Author": "avtges", "Date": 1465235669, "Score": 1, "Body": "Thanks man, good advice and I'm checking out the link now. I think a master's program is too costly for me right now, that's the only reason why I want to bypass it.", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "53": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1465240342, "Score": 1, "Body": "I am in my 10th year of grad school, I am about to be thrown out by the department without getting my PhD, it's very sad and frustrating. I have realized how important it is to have a good advisor somebody who knows his research and actually cares and pays attention to your work.\nMy 10 years are down the drain, I should have quit very very long ago but because I am not a quitter I did not and look what's happening to me now, the department will most certainly thrown me out in a matter of days. \nIf you want to quit after 3 years, quit it, it's better than staying for 3 more years and realizing you havent moved at all.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "54": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465243264, "Score": 1, "Body": "Tenth year?  I'm hoping that includes masters?  Damn man, that sucks.  Have you at least gained some publications or some skills on your own in this time?  Maybe some skills you can use to make yourself look attractive?  Have you started applying for jobs?  I've spent a chunk of time learning how to program a GPU in the hopes that it'll make me hireable after this, 'cus I'm not gaining much else from the things I do directly with my adviser.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "55": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1465244878, "Score": 1, "Body": "I can relate to you, I got in the PhD program at my univ. because I had very good grades in undergrad, just like you I used to study a lot in my undergrad, I was very good at mugging things up and having a photographic memory helped.\n\nAgain like you I am not a naturally intelligent person, I passed my qualifiers and my masters courses easily with good grades but again those dont require much work besides mugging up and going through past years exams.\n\nfast forward I am in my 10th year of grad school, my PhD research has been a complete disaster, I think it is very important to have a natural inclination/intuition towards sciences if you want to do a STEM PhD, or you need to be extremely lucky to be with an advisor under whom you are basically just working as a technician running his equations, his codes (it happens a lot).\n\nIn my case I ended up with someone who expects me to do everything on my own, and because I am not naturally intelligent and dont have a natural intuition towards sciences it has been very very hard, I would say that I learned a lot about myself and it has improved my critical thinking a lot, but if I could go back in time I wouldnt do this. Today I am sad, depressed, helpless, and hopeless because even after 10 years I dont know where I stand.\n\nSo if you dont have a natural intuition or you dont have a very good advisor, drop out before you end up regretting it!", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "56": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465247734, "Score": 1, "Body": "Not sure who told you that PhD in philosophy gives you any cred with anyone... PhD in philosophy is completely useless.", "Permalink": "https://www.reddit.com/by_id/t3_4mt9hs.json"}, "57": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1465254830, "Score": 1, "Body": "Even if your results are wrong, they're still results. Most people, if not everyone, understands the somewhat arbitrary deadlines in research, so if you go to a conference and are able to present your research progress in a sound way, and discuss the flaws, then you've won half the battle. You won't be getting any job offers though...", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "58": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1465272446, "Score": 1, "Body": "You will get hundres of views! Which is hundreds more than article cites. LMAO", "Permalink": "https://www.reddit.com/by_id/t3_4mwo4l.json"}, "59": {"Subreddit": "PhD", "Author": "geoffpk", "Date": 1465299697, "Score": 1, "Body": "Haha, most likely! I won't be staying in academia and instead pursue a manufacturing business startup; 'real' impact vs citations or increasing my researcher 'impact factor'", "Permalink": "https://www.reddit.com/by_id/t3_4mwo4l.json"}, "60": {"Subreddit": "PhD", "Author": "sylviatis", "Date": 1465358918, "Score": 1, "Body": "Seems helpful. Will try that method once i get over the hump", "Permalink": "https://www.reddit.com/by_id/t3_4jw44g.json"}, "61": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1465362382, "Score": 1, "Body": "I am in my 7 th year this September. I started in an Inorganic chemistry lab, and realized it was not focused on the biology as much as I had hoped. So, I switched labs almost two years in. I have spent years on my project and my advisor was just rejected tenure (his fault, he had no publications). I am currently writing my thesis and have had to redo analysis on all of my data to generate accurate models, because the previous models were not accurate at all. I am also afraid that my advisor has checked out and I will have to switch primaries.  Talk to your department. You may still be able to write the thesis up with what you currently have or find an alternate solution. Anyways departments are usually very helpful over advisors, because it is in the departments and the universities best interest to graduate you.  I know a lot of people who have had different situations do not despair and hang in there.", "Permalink": "https://www.reddit.com/by_id/t3_4mtn7c.json"}, "62": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1465364253, "Score": 1, "Body": "Then don't go into academia... there's plenty of jobs outside academia.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "63": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1465366115, "Score": 2, "Body": "I am nearing the beginning of my 7th year in September and I am writing my thesis. When I first came to the lab my advisor didn't have any publications, and I joined on a project where it was difficult to learn the technique and difficult to acquire the data. My advisor has been pretty unhelpful in terms of trouble shooting data acquisition, data analysis, and now the writing process. I have had to figure most things out on my own, even in terms of how the papers are written. Now it is 5 years since I have been in his lab (switched almost two years in) and he still has no publications, has graduated one Master's student all while being on 50/50 teaching and research with the department. Surprise, surprise he did not get tenure, and now I have this overwhelming feeling that since he did not get tenure he feels no obligation to me to see me graduate. He even said editing my thesis would be an astronomical feet (It is currently 150 pages will most likely be 175). I have put up with a decent amount of abuse from the guy, he is very condescending, and is blunt and rude to not only his graduate students, but also to fellow faculty.  I also feel that my advisor is lacking in knowledge of the subject area, because he would have had us try other models in order to test things.  I still feel that it is worth it and if I quit now I would regret it for the rest of my life. In the end I know I have grown as a person, and developed quite a few skills. I don't plan on going into academia, it looks terrible, but if I did I would know what not to do.  My advice is talk to your other committee members, that is what they are there for. If need be appoint a co-advisor and have them look at your writing/publications. A lot of people have a tough time in their PhD, especially when the advisor is incompetent or lazy. it just means you have to work harder to find your own solutions.\n", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "64": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465402414, "Score": 1, "Body": "Oh man, if they didn't get tenure..that suuuuuuuuucks.  I can't even imagine going through that.  My adviser does the same thing, where her knowledge sucks so she'll just have us try random models willy nilly, throwing shit at the wall to see what sticks.  I've also developed a lot of skills, one that is particularly marketable (GPU programming), so I don't think it's a total loss, it's just...hugely disappointing to have progress be halted by someone who is incompetent but holds so much power.  My other committee members are all buddy buddy with my adviser, so what she says will be the final thing.  Working hard to find solutions is perfectly doable, and I've done so, it's just far too easy for the adviser to say 'no' and that's it.\n\nThat said, I feel yah on the condescension bit.  It's very demotivating, sorry you have to experience it, too.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "65": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465402505, "Score": 1, "Body": "Well, you do have a point there.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "66": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1465411655, "Score": 1, "Body": "sounds normal for this point in your doctorate, tbh. try and persevere, but remember that your health comes first - if the stress gets to be too much there's nothing wrong with taking a break.\n\nit would probably be a good ego boost to get something published. try doing a bite-sized chunk of research - say, a one- or two-month project - and writing it up for a relevant conference, workshop, or journal. might give you some research motivation and direction too.", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "67": {"Subreddit": "PhD", "Author": "ai_4_life", "Date": 1465411963, "Score": 2, "Body": "I can relate to part of this. Thanks for posting. Not sure if I can help, but I have a few questions if you don't mind:\n\nHow many publications are generally expected for a PhD student in your field? And if you don't mind, what is your field? \n\nHow long ago did you defend your proposal? Did you get any feedback from it? I'm asking because I have felt serious drops (or complete lack thereof of motivation for my work) but if your committee passed you on your proposal that should mean there is some value to your research, even if you don't see/feel that value now.\n\nDiscipline is an issue you can solve. Motivation comes and goes. It's important to remind yourself for your own reasons for getting a PhD. If it really is all just because most people in your family has a higher degree, don't do a PhD. That's such a poor reason. Surely there was something else about it you liked and gave you energy to make it this far. \n\nRegarding the dissertation and jobs, hard to say anything helpful without knowing the field. \n\nWould love to chat more, feel free to pm me - I have recently struggled in my PhD (i'm about the same spot you are, defended proposal and just finished my 4th year). I was dealing with depression and stress that my work wasn't beneficial or important. I have the problem that I think so many things are just obvious after I discover them because over time they seem small. Also, I deal with stress that I didn't work hard enough and somebody is call me out on my work and that there's no value in it, or its all been done before.  \n\n", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "68": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1465412480, "Score": 1, "Body": "Ya lucky for me my other committee members don't really like my advisor and the department is willing to do whatever to get me to graduate since I am so close. I have a plan which helps. I'll be honest if you have to do what she wants to just get the degree then just do it, even if she's wrong. If you have no plans in staying academia (sounds like you don't) then it's not as big of an issue. Your advisors recommendation letter means fuck all in industry. It's your skills and what you can bring to the table for a company.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "69": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465412635, "Score": 1, "Body": "That's what I've been doing.  When she tells me to do something stupid, I just shut up and do it, even if it means wasting a lot of time.  Only times I don't is when she gives the equivalent of \"cure cancer.\"  Yeah okay bud, let me know when you wanna flesh out that grand idea before I attempt that.\n\nYeah my plan right now is just to continue expanding my skill set to be attractive.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "70": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1465415322, "Score": 1, "Body": "I had talked to a postdoc recently and she had to physically sneak into the lab at night in order to finish because the advisor didn't like her and purposefully put road blocks to prevent her from graduating. Academia is ripe with stories like these,  it's sad.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "71": {"Subreddit": "PhD", "Author": "totalthrowawar", "Date": 1465415420, "Score": 1, "Body": "Daaaaamn.  That's gotta be really rough.", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "72": {"Subreddit": "PhD", "Author": "throwawayyy01234", "Date": 1465423017, "Score": 2, "Body": "Thanks for the reassurance. I actually am working on a bite-sized chunk of research (maybe a large bite) at the moment to do exactly what you suggested. But even that is tripping me up; it's taking me longer than it should (because I am moving slowly, because I am not enjoying it), which is frustrating my advisor, which just makes me more anxious and less excited about working on it. Bad cycle to be stuck in. I'm actually now considering taking some time off to get an internship or something, just to take a break from all of this and figure out what I really want.", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "73": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": 1465423651, "Score": 7, "Body": "I won't lie-- the PhD is hard. Honestly, getting to the end is the hardest thing I've ever done. But, PhD students have learned to vent in \"safe\" environments (such as this sub). And, holy jeeze is it worth it.  \nFirst, a non-obvious benefit is the feeling you get at conquering this beast. It's stressful and challenging, but oh so rewarding.    \nSecond, after getting a PhD you know you're capable of learning almost anything. And, you'll be a premiere expert in your research area.  \nAlso, new job opportunities are opened through the PhD. For example, you can become a professor, a researcher at a top lab, or even a consultant at a prestigious firm (McKinsey, BCG, etc). Many companies are looking exclusively for PhD's because they know what we're capable of accomplishing.   \nSo, if you don't want 3-5 years of uncertainty and stress, then the PhD probably isn't for you. You can definitely make more money by getting a job in this time. But, the research skills and shear drive that you get are definitely worth it, if you're willing to put in the time. ", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "74": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1465423755, "Score": 4, "Body": "There's a lot of aspects of higher academia that are absurd and broken and actually make it very difficult to do research in the first place.  Higher academia is an industry like any other, with customers and advertizing and deliverables.\n\nSo, it depends on your goals.  Don't do a PhD to be able to do research; you can do that at home in your basement.  Do do a PhD because doctoral researcher status is the only way you'll be able to use Machine X for your research.  Do do a PhD because it will gain you an 'in' with the particular scientific research community you want to interact with.  Do do a PhD because you are passionate about teaching a particular subject and want a career teaching that subject to undergrads, even though you'd make more money for less work elsewhere.\n\nDon't do a PhD planning to discover anything new while doing your PhD, but you might do a PhD to gain the skills necessary to publicize something new that you discovered elsewhere.\n\nTL;DR: Doing a PhD is often horrible, but some downstream goals make it worthwhile.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "75": {"Subreddit": "PhD", "Author": "throwawayyy01234", "Date": 1465425266, "Score": 4, "Body": "Also note that you're getting a specific subset of PhD students posting here. As other said, everyone struggles at times, but the people posting on Reddit asking for advice are likely those struggling more (or more often) than others.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "76": {"Subreddit": "PhD", "Author": "caz-", "Date": 1465427046, "Score": 3, "Body": "My experience has been totally positive. \n\nI don't know if the country I did it in makes a difference; I'm in Australia, where we can go straight into PhD after the undergraduate degree, the whole PhD only takes 3-4 years, and there is no viva.\n\nHaving good supervisors certainly helps. My supervisors have let me be completely independent; that is, they have never coerced me into working on problems that *they* want solved. But, they have also been 100% supportive when I need help or guidance.\n\nIt's also important to be working on a topic that you enjoy. A lot of the negative experiences are from people whose parents pushed them into a certain field, or who still aren't sure what they want to be doing.\n\nMy thesis was accepted literally about a week ago. I'm still not sure if it will land me a better job or higher pay or whatever, but I wouldn't change it for the world. Personally, that sense of accomplishment, and even just the ego boost of being able to tell people I have a PhD, make it all worthwhile.\n\ntl;dr: If you are passionate about research and about a particular topic, and you can find good supervisors, go for it.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "77": {"Subreddit": "PhD", "Author": "silverphoinix", "Date": 1465440494, "Score": 6, "Body": "Came here to say basically this. \n\nIt's a very valid point to raise that venting in safe spaces often makes it look like there on only negatives. I have done this myself by venting to my gf (who was previously considering a PhD) who is now very much unsure about the prospect. However she also gets to see the joy when I fix some of my experiments, or when my papers get published, and when I get to go to other countries to use huge facilities for *my* research. That joy is hard to see in places like this, so everyone should remember just because bad is frequently seen, doesn't mean its frequently bad.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "78": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1465454573, "Score": 2, "Body": "+1 for Australia. I have a friend doing it in Canada and they gave her so much shit for getting a B+ in one of her qualifying units or whatever they are called.\n\nMy experience has been very positive so far. I just finished my 2nd year and love it. I won't lie, there's been a lot of tears down the road but the overall balance is positive. I guess that my supervisor has a lot to do with that, he's been really supportive and lets me work independently doing pretty much anything I've wanted. My negative experiences had to do with the nature of research (not knowing the answers or ruining my experiments) but I definitely don't regret going for a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "79": {"Subreddit": "PhD", "Author": "nomdeprune", "Date": 1465455015, "Score": 3, "Body": "My PhD was one of the hardest things I've done but, despite finishing it more than a decade ago and having progressed a long way since in both work and family life, it's still the thing I'm proudest of.\n\nI have never worked in a field that's directly related to my PhD, but my PhD has still contributed directly to several career successes. I earn more now because I have a PhD.\n\nThe experience of working pretty much by myself for four years to accomplish something big helped me to know myself far better than I did before it.\n\nA PhD is hard and you go through some tough times, but I think even that is good. If you can get through it you'll always know that you are a very capable and persistent human being.\n\nAnd finally, I just think the opportunity to be funded to focus on and explore something that I was very interested in was one of the luckiest things that ever happened to me. I'm pretty sure I'll never get the chance again to be so single minded.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "80": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1465455348, "Score": 1, "Body": "Which university do you go to? I'm doing my phd, I don't have a scholarship but I get by as a TA for my supervisor's units. I sort of have an agreement with him, so I get to \"bill him\" for student consultation appointments. Students learn more and do better in exams and I get paid, it's a win-win.\n\nSorry, just read the area that you are in, I'm in STEM. I met a girl once who was doing an MPhil in Art (painting or something) at Curtin if that helps.", "Permalink": "https://www.reddit.com/by_id/t3_4mburb.json"}, "81": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1465458631, "Score": 3, "Body": "There are plenty of positives, and other commenters are pointing out, you're getting a very real but also very non-representative slice from this subreddit.  You could try asking questions at /r/askacademia - most of those people are still in academia, so presumably they had a somewhat higher rate of being happy with their PhDs.\n\nPersonally, I really enjoyed my PhD.  I learned a lot, had plenty of independence and access to the tools I needed, and had (and still have) a good professional relationship with my supervisor.  The pay and hours were fine, mostly because I was in the Netherlands, where PhD students are treated like employees instead of students (there's a standard contract for pay, vacation, pension, etc for PhD students there).  I enjoyed most of my work and got along fine with most of my my colleagues.  There were things that could have been better, of course, but that's the case with most jobs.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "82": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1465466266, "Score": 3, "Body": "Who wouldn't want 3-5 years of consistent uncertainty, stress and self doubt. Seems like great fun!\n\nI am almost there with mine. Friends from my lab have finished, and the overwhelmingly majority have said they didn't feel a huge sense of accomplishment. Just a massive sense of relief! Some landed good jobs, others not, and some are still looking...", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "83": {"Subreddit": "PhD", "Author": "ciarandeceol", "Date": 1465473152, "Score": 1, "Body": "Thanks for that link. Very interesting about students being treated like employees. It's can look similar here in Ireland if one looks from the outside. However you are still indeed a student.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "84": {"Subreddit": "PhD", "Author": "ciarandeceol", "Date": 1465473189, "Score": 2, "Body": "From my research online, Australian PhD students seem to be very happy. You guys must have a great system. ", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "85": {"Subreddit": "PhD", "Author": "ciarandeceol", "Date": 1465473277, "Score": 2, "Body": "Big thank you to all who replied. I've taken all your comments on board and it's made me rethink my position. Thanks for the input.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "86": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": 1465490922, "Score": 5, "Body": "My SO never considered the grad school route, so he really doesn't understand the process or see the benefits. Add to that, I'm always complaining about my advisor, lab mates, research setbacks, (lack of) funding, .... So, he has an extremely negative view of the whole process. I guess I could have censored some of what I said to him, but he's my safe space. The worst of it was when he tried to convince me to get a job and dump my degree. I don't blame him. I was unhappy and miserable to be around.     \nBut, it turns out that moment was the lowest point. Our conversation forced me to think about my personal motivations and to consider if the degree was worth it. Then, I came up with a 6 month plan and a renewed drive to finish... and now I'm finally done!! The past couple weeks have been a continuous party in our house :) We opened a wine we had saved from our honeymoon and a craft beer we bought during a trip to the west coast. One for the defense and the other for my job offer.  \nI don't think my SO will ever completely agree that the PhD was 100% worth the pain, but I think he is starting to understand why I stubbornly pushed through to the end.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "87": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": 1465492624, "Score": 1, "Body": "I've heard a similar division in relief vs accomplishment. Right now, most of my sense of accomplishment comes from printing out the dang document and handing it to my committee. I mean, my god, its a giant document. Maybe that's a combination of relief and accomplishment? ", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "88": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1465505813, "Score": 2, "Body": "The top posts on this sub and other grad school subreddits are all negative, I agree. But, I think it's a massive bias. People who are sucessful and enjoy there time within PhD programs are significantly less likely to come and post here.\n\nOr to put it another way, what would happen if someone made a post \"PhD programs are awesome\", I'm paid to do research and I'm not in the private sector, I'm not sure why all of you are so depressed. They'd be downvoted. Massively.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "89": {"Subreddit": "PhD", "Author": "invictus_SaM", "Date": 1465513825, "Score": 1, "Body": "You should think seriously about the time commitment. Almost all the people who go down the PhD path are excited about research and science. But even in the best circumstances there could be many disappointing aspects in PhD life. I am submitting in the next couple of weeks, after a 5+ year PhD. Spending half of my 20s on something that although seemed very interesting in the beginning, may change very little in the outside world, constantly being evaluated and judged by academics who are not necessarily nice all the time, and finally the feeling that your life has not progressed after putting in so many hours of work are the highest negative things for me. If you decide to do a PhD it is good to go into it with an open eye. ", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "90": {"Subreddit": "PhD", "Author": "invictus_SaM", "Date": 1465547532, "Score": 2, "Body": "It might not be that bad as you think. It looks like you have worked hard and you are not alone in that at the end of the day all the science work load is on the PhD students. Advisors, coauthors, and reviewers just don't focus and really don't necessarily care. You maybe able to publish an erratum for your paper, if you can get corrected results in a reasonable time. ", "Permalink": "https://www.reddit.com/by_id/t3_4mtn7c.json"}, "91": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1465553099, "Score": 3, "Body": "I'm sure people can answer here - but if you've only just finished, you might finder it much more effective to talk to one of your professors/lecturers, who will not only know the general scene, but will also understand where you're coming from (and how best to proceed if you like what you hear). ", "Permalink": "https://www.reddit.com/by_id/t3_4ne86j.json"}, "92": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1465557588, "Score": 2, "Body": "I agree... still, it's pretty safe to say that a PhD is a transformative experience... it's an intellectual challenge above anything else. ", "Permalink": "https://www.reddit.com/by_id/t3_4ne86j.json"}, "93": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1465561655, "Score": 1, "Body": "I'm pretty much in the same boat, but dammit I've spent 4 years already so I better fucking graduate!\n\nI'm meeting my advisor on Monday and I'm dreading it. I have no journal articles or conference papers in the pipeline and only 30,000 words in my thesis.", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "94": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1465561837, "Score": 1, "Body": "You're always welcome to come here and vent. We do give the impression its all doom and gloom, but it's really because this is one of the few places interactive (non-interactive we have Piled Higher and Deeper) where we can voice common frustrations and our innermost fears.", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "95": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1465562849, "Score": 4, "Body": "Are there no actual PhD students where you are currently or professors that you could chat with? I find it hard to believe you can complete a master's without meeting any! :D\n\nEvery field us different so people that are going through or have gone through it in your field are the best source of info.\n\nIt is hard but so much depends on your adviser and school. This is why you should ask around.", "Permalink": "https://www.reddit.com/by_id/t3_4ne86j.json"}, "96": {"Subreddit": "PhD", "Author": "ciarandeceol", "Date": 1465570245, "Score": 1, "Body": "Good advice here. I'm am European and most PhD's here take 3 - 4 years for completion. The time investment is probably the biggest factor in my decision making right now.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "97": {"Subreddit": "PhD", "Author": "FinchPR", "Date": 1465576786, "Score": 1, "Body": "What you mean with 3rd specialty?  In terms of the skills, that's one of the beauty's of industrial engineers we can apply our skills to many areas. What I was worry about is in terms of teaching institutions admins, do they look if the candidate was teaching in a business school rather that an engineer school?", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "98": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1465578961, "Score": 1, "Body": "Thanks for your response, it's good that you have started writing your thesis, this means you will at least get the degree you worked for.", "Permalink": "https://www.reddit.com/by_id/t3_4mtn7c.json"}, "99": {"Subreddit": "PhD", "Author": "porterble", "Date": 1465597726, "Score": 1, "Body": "As in im in my third completely different discipline. Psychology &gt; Maths/Telecoms &gt; Ancient History/Theology\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "100": {"Subreddit": "PhD", "Author": "MallocBaldwin", "Date": 1465691932, "Score": 3, "Body": "One small bit of advice is to be wary of building something. If, like me, you come from a more programming/software background, there is a temptation to make a product and \"sell\" it to your advisors. That doesn't fly with academics. Instead, try to focus on finding an approach to solving a problem in established literature and set about improving it. Do your best to treat every paper like a cross-examination, whereby you try to poke holes in it and find some way a process/solution can be improved.\n\nIt is also tempting at first to have an idea and think there is no literature to support building on it as a dissertation topic. This usually means one of two things: you haven't looked hard enough yet or the idea really isn't that novel (at least from an academic standpoint). However, there are certainly outliers to that rule which make for fantastic dissertations.\n\nOverall, I just want to wish you good luck! I am in year 4 after a 2 year MSEE and subsequent year off. Now I am back at it. Stay focused! It is definitely worth your time, both professionally and personally.", "Permalink": "https://www.reddit.com/by_id/t3_4ngieu.json"}, "101": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1465741668, "Score": 1, "Body": "Are you so interested in something that you are willing to work at it more than a typical 40/hr per week career (for instance, 50-75)? Are you willing to accept a lower paying job, that is harder to get, in order to follow that interest? Are you willing to sacrifice many other things in your life (hobbies, personal relationships, etc.) in order to pursue that particular discipline and become an expert at it? For many people getting a PhD, the answers were 'yes' and they don't regret that decision. For people thinking it was 'just the next step after a Master's or Bachelor's degree and to get better pay, they usually wind up very unhappy with their decision.", "Permalink": "https://www.reddit.com/by_id/t3_4n7842.json"}, "102": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1465742363, "Score": 2, "Body": "PostDoc#, You#, A Bunch of Other Authors. (Year). Title of Study.  Journal of Acceptance. Issue   #These authors contributed equally to this manuscript\n\nDoesn't look so bad. And given that you are just in your second year (if I read correctly), that's not a bad way to start, so long as you get another 1 or 2 with your name appearing first by the end of your PhD.\n\nI've run into some bizarre social situations in my own PhD - where one person that was of higher authority was being unreasonable and very moody, so I tried talking to my advisor about it. Unfortunately, it always blew up in my face despite my argument being pretty sound. It was almost as if my advisor didn't quite have the time to even listen to what I was saying and properly weigh the situation. After going at it this way for a few years and only digging myself deeper, I just began to 'play along as best as possible' and that generally cleared things up.\n\nI feel bad saying it, but you may just want to suck it up and take it. Particularly so if you've tried a few times already to set things straight or get your way and the situation only got more tense. Again, I feel bad for giving that advice, but I wouldn't be giving it if the opposite approach didn't dig me into my own horrible situation. One of the great lessons I've learned: There's a lot of weird people in academia.", "Permalink": "https://www.reddit.com/by_id/t3_4nqeyw.json"}, "103": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1465756809, "Score": 3, "Body": "Was there no director of postgraduate studies or someone higher than your supervisor you could have raised your concerns to? \n\nDo you not have any sort of annual review system// or yearly monitoring system whereas you could have pointed these out. \n\nWhat are your action points now? How much time do you have left? Still time for an experiment, just writing up? Just about to submit? Depending on those lengths you still may have some time to make a change, although perhaps a small one. ", "Permalink": "https://www.reddit.com/by_id/t3_4nqeyw.json"}, "104": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1465785174, "Score": 2, "Body": "&gt; be wary of building something.\n\nThis is great advice. Be constantly checking in that you are making an original contribution that is of the size and standard expected at PhD. A friend of mine developed what seemed like novel software but it just wasn't enough, that is a really stressful situation! ", "Permalink": "https://www.reddit.com/by_id/t3_4ngieu.json"}, "105": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1465803485, "Score": 5, "Body": "After a couple of months of struggling to even stay awake for the entire day due to stress and having no idea where I was going, I have finally finished reading two relevant core texts for analysis and have a solid/substantial plan for Chapter 1.", "Permalink": "https://www.reddit.com/by_id/t3_4ntnrr.json"}, "106": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1465803826, "Score": 3, "Body": "After alot of reading I can finally see a theoretical and possibly conceptual framework developing in my mind. Time to scribble it down!", "Permalink": "https://www.reddit.com/by_id/t3_4ntnrr.json"}, "107": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1465816269, "Score": 1, "Body": "Yessss!!", "Permalink": "https://www.reddit.com/by_id/t3_4ntnrr.json"}, "108": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1465816402, "Score": 1, "Body": "Sounds promising - good for you!", "Permalink": "https://www.reddit.com/by_id/t3_4ntnrr.json"}, "109": {"Subreddit": "PhD", "Author": "throwawayyy01234", "Date": 1465822857, "Score": 2, "Body": "Yeah, I'm kind of in that mentality--I've put THIS much of my life into getting this degree, and *all* that's left is just writing this damn dissertation (ha! *all*). But then I think *shit*, I can't graduate until I finish this damn dissertation; how am I possibly going to do this?", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "110": {"Subreddit": "PhD", "Author": "aecone", "Date": 1465834258, "Score": 1, "Body": "\"One small bit of advice is to be wary of building something. If, like me, you come from a more programming/software background, there is a temptation to make a product and \"sell\" it to your advisors. That doesn't fly with academics.\"\n\nI am an incoming PhD to a B1G 10 iSchool and this is exactly what I planned on doing over the next few years.   This is what I wrote about on my personal statement (and I was accepted).  I have built a healthcare provider application for a very large hospital system and I plan to research the following:\nThis research will explore the following technical and clinical questions:\n•\tWhat are the alternative approaches for this system to modernize its software development?\n•\tWould the entrenched culture allow and support an open source software project?\n•\tWould an automated tool be a superior alternative to the paper process?  What are the positive and negative impacts on workflow by replacing a paper process with an automated workflow tool?\n•\tWhat additional considerations can be realized by this project?\n•\tIs the project worthy of communication to the broader health care marketplace as a use case demonstration of open source, open standards development to achieve a customized, license-free, stable enterprise solution rapidly and economically?\n\nIt is not clear to me now why this would not fly with academics.\n ", "Permalink": "https://www.reddit.com/by_id/t3_4ngieu.json"}, "111": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1465918462, "Score": 2, "Body": "Really hard question. \n\nI mean, I think the best thing a companion can do is to give a PhD-er something to do that *isn't* the question. That could be going out places, or watching a movie together, or taking a break for the weekend; so he's thinking about enjoying himself, and (hopefully) repairing/recreating himself to work better when he gets back to work the next day. \n\nI love things that take me away from computers, screens, phones etc - like a day of hiking, running, whatever - where it's impossible to do anything with my work even if I wanted to. And my friends play a big role in making that happen. (I'm not currently a PhD student but have effectively the same sort of life pattern). \n\nBut that might not be appropriate in this case. I'm sure there'll be other ideas on this thread. ", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "112": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1465930080, "Score": 2, "Body": "Pretty much this I would imagine.\n\nThough it is important to also know what the research is about, and be involved, even at a surface level. Take some interest in it, even if it may be difficult to understand. Sometimes during a Phd you feel like the only people that actually understand the problems you are facing is yourself, which can feel quite isolating. \n\nI am nearly finished my Phd, but one of the most disheartening things about it has been that literally nobody close to me could actually explain properly what I have been researching. They have asked, and I have explained, but I think that they just don't have a full grasp of it, so have never been interested in asking any more. And the one thing I am not going to do in time away from a PhD is just talk about it without people asking, if you get me...", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "113": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1465934357, "Score": 5, "Body": "i don't, i just trawl through past references i've made or google phrases i remember from the article. \n\n0/10, would not recommend. \n\n(i'd stick with what you know, personally. if it ain't broke why fix it? having said that, don't take my advice - see above)", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "114": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1465935174, "Score": 1, "Body": "Doing a PhD is incredibly stressful and everyone copes with it in different ways. That being said, a.) you're not going to get advice on how to support him from strangers online and b.) you need to make sure you're taking care of yourself too. \nTalk to him and see what kind of support he needs, does he want to talk about his frustrations with work, or come home and forget about them. Does he need you to help him problem solve, or just be an ear to vent? \nI could tell you what works for me, but its not going to help you. Sorry if that sounded tough.", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "115": {"Subreddit": "PhD", "Author": "esgresh", "Date": 1465937638, "Score": 5, "Body": "I use endnote although I think I actually prefer Mendeley which is free. You upload your reference and can attach the pdf. You can search by author, title, content...etc and can make folders to help sort everything. There is also a plug in for word so it will automatically format citations and references. ", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "116": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1465939874, "Score": 1, "Body": "I religiously make Cornell notes. Currently exploring ways to digitise these... Considering a database.", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "117": {"Subreddit": "PhD", "Author": "instagnome", "Date": 1465940325, "Score": 3, "Body": "I put everything I read in EndNote and in a simple spreadsheet with columns for name of article and notes/thoughts. \nI tried Evernote for a while using index cards with tags. It was pretty but I found it too much work and I like seeing all my stuff on one page. ", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "118": {"Subreddit": "PhD", "Author": "im_in_the_pants", "Date": 1465946354, "Score": 5, "Body": "guys ill never stress it enough: check Zotero out!! And it's addon Zotfile. everything open source and free, it integrates into any browser, automatically recognize everything, also automatically scan pdfs for indexing, it has tags and all kinds of cool stuff. plus, it is made for citations, so it integrates into word and allows citation without effort", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "119": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1465950874, "Score": 2, "Body": "No one ever did it that way....", "Permalink": "https://www.reddit.com/by_id/t3_4o3yz5.json"}, "120": {"Subreddit": "PhD", "Author": "apolotary", "Date": 1465953591, "Score": 2, "Body": "I second Mendeley (even though I just try to memorize it like the other comment above says)", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "121": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1465958533, "Score": 2, "Body": "I don't personally use zotero, but a lot of people around me do and speak highly of it. ", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "122": {"Subreddit": "PhD", "Author": "katyshea", "Date": 1465959386, "Score": 1, "Body": "Have you talked to your PI about your future plans, getting your own paper, etc? Aside from having issues with the post doc? How much longer does this project have?\n I'll just be starting my first year in August, but I've been working in the lab for two years. When I told my post doc I was changing projects, he did not take it well. However he's seemed to have gotten over it. The one thing I've learned so far is that it's important to know when to say no. ", "Permalink": "https://www.reddit.com/by_id/t3_4nqeyw.json"}, "123": {"Subreddit": "PhD", "Author": "caz-", "Date": 1465962073, "Score": 1, "Body": "I just started putting them straight into a document that eventually became my thesis.\n\n&gt;Bloggs et al. [7] argue that... There is, however, evidence to support alternative explanations [8,9]. Smith and Jones [10,11] found that there was...\n\nPut them in logical sections, like \"Experimental\", \"Theoretical\", \"Speculative\", or specific topics related to your work; e.g., \"algorithms\", \"hardware\", \"machine learning\", \"computer vision\", etc. Most of this will probably go in your first two or three chapters (or however big your lit. review is), but as you go further it will start to blend a lot more with your own work.\n\nWhen you actually come to write your own stuff down, you will already have a pretty good framework for turning sections into papers and also for completing your thesis.\n\nI never found this to be problematic in terms of finding things when I need to re-read a paper, and when I came to write my thesis, it was almost finished already. :)\n\nIf you've put stuff in that doesn't fit and is just general reading material, you can just remove it when you're tidying up your final draft.", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "124": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1465965532, "Score": 1, "Body": "If you think you need a PhD to attract a woman, you're doing it all wrong.", "Permalink": "https://www.reddit.com/by_id/t3_4o3yz5.json"}, "125": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1465965807, "Score": 2, "Body": "So with it will I be able to save all the things I've read, and then search via notes tied to those articles? For example for every article about sleep add the tag sleep, and fine said articles?\n\nI just started using Mendeley, and can't believe it doesn't have this functionality. The search only appears to work on article titles.", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "126": {"Subreddit": "PhD", "Author": "itsworthatry", "Date": 1465973038, "Score": 1, "Body": "Thanks for your reply. I'll try and see if he needs some distractions. ", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "127": {"Subreddit": "PhD", "Author": "itsworthatry", "Date": 1465973177, "Score": 1, "Body": "Thanks for your reply. I have tried to understand his project, and have a basic grasp on it. But unfortunately I have very little knowledge of his field, so I'm very limited. But I listen when he talks, and try to cheer him on if what he tells me sounds like a good thing. ", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "128": {"Subreddit": "PhD", "Author": "itsworthatry", "Date": 1465973303, "Score": 2, "Body": "Thanks for your reply. Actually advice from strangers does help. Because my bf is not always good at figuring out what he needs, so when he isn't I sometimes suggest a few things, then he thinks about it, and then maybe it triggers a solution that suits him. ", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "129": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1465974040, "Score": 1, "Body": "This is pretty close to my current system... I'm trying to move to a \"write as you read\" model where I am actually writing chunks of thesis as I read... This may be a pipe dream... time will tell! ", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "130": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1466002051, "Score": 4, "Body": "What is expected at the end of research?  A dissertation with original thought and provable evidence of that thought.  Plus, you'll have to defend it against a panel that consists of your PhD adviser and other faculty, students, etc.  \n\nHow to do research - Well, IEEE, ACM, Google Scholar, conferences, all produce/have papers in your field.  You have to start somewhere, so when you find an adviser in the area of research you want to learn, get on board with their research and papers.  Get ready to read, and by read I mean reading everything.  If you are skimming material, read the introduction and the conclusion.  This will give you an idea on what the paper is about.  If you want to know more, read it.  See the references?  Ya, go read those as well.  Continue reading.  Reading isn't enough though, you have to understand those papers that you read all the way.  What does that take?  Well depending on the individual it could be once through or several times through and testing their results.  \n\nOriginal work?  Well, it means something no one else did that is substantial enough to get your PhD.  I'm not sure what you are asking here.  Most PhD's are taking someone else's work and going far enough to earn your PhD.  It isn't about doing your own thing, you have to put in the research and publish time as well.  Most professors want to see that you can indeed conduct research, present your findings, and continue forward with new research.  I'd say you'll probably start by spending 80%+ time on the group's research and 40% time on teaching/research on their stuff (if you are being paid by school) and then the rest of the time catching up on sleep.  \n\nHuge teams working in the area?  Then find them, talk with them, see if you can contribute to their research in any way.  But before you do that, find a good adviser.  They make all the difference in the world.\n\nGood luck to you my friend.  PhD's are hard, but if you stick it out, you can achieve it!", "Permalink": "https://www.reddit.com/by_id/t3_4o5tz8.json"}, "131": {"Subreddit": "PhD", "Author": "DATAh4ck3r", "Date": 1466009025, "Score": 2, "Body": "Thanks for the very helpful reply. I am indeed a little apprehensive given the picture of being a grad student that is painted by general population. Off to reading, then!", "Permalink": "https://www.reddit.com/by_id/t3_4o5tz8.json"}, "132": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1466010497, "Score": 3, "Body": "Good luck to you friend.  Hope to see you on here in a few years helping other future students or telling us how you rocked out your defense and are graduating into some role you really wanted!  ", "Permalink": "https://www.reddit.com/by_id/t3_4o5tz8.json"}, "133": {"Subreddit": "PhD", "Author": "im_in_the_pants", "Date": 1466012366, "Score": 2, "Body": "yes, you can import stuff from either the browser extension (pretty much anything), then it goes into the folder you selected in Zotero. Then, to each one of the documents you imported you can add notes, tie em up together (i.e. if they are different chapters of a book), assign tags and also assign hotkeys to tags for when you have to add tags quickly (i use this for example to assign the tags \"read\" \"to be read\", or to divide different articles for different sections of a paper im writing). its pretty cool and it really takes one second to learn. if you add the extension Zotfile, when you import a PDF you are able to automatically search for the metadata (therefore it automatically fills in the info about author, title etc), and if you open the PDF and highlight text, you can then extract that text automatically in a new note.\nthe primary use of zotero is for citations: since it keeps every document organized and with all the info, when you are writing your paper you simply add the citation from the word (or openoffice) extension and it automatically keeps it updated with the changes you make in your zotero archive, and it automatically creates the bibliography for you in the citation style you prefer. i love it really", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "134": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1466024924, "Score": 3, "Body": "This sounds amazing, thank you for the info! I think adding the entire text of the document into the notes section is particularly ingenious, making it so that you move past the limited search capabilities of PDF's. I'll definitely have to check this out.", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "135": {"Subreddit": "PhD", "Author": "FinchPR", "Date": 1466116051, "Score": 1, "Body": "Wow. You move around. ", "Permalink": "https://www.reddit.com/by_id/t3_4mbiyz.json"}, "136": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1466159086, "Score": 2, "Body": "Are you enrolled in a PhD for a field that you know nothing about?", "Permalink": "https://www.reddit.com/by_id/t3_4ofuck.json"}, "137": {"Subreddit": "PhD", "Author": "cheezburgapocalypse", "Date": 1466182346, "Score": 1, "Body": "I am a 3rd year PhD student in Control Engineering, I sometimes use neural net techniques for adaptive control purposes, with applications on UAVs, satellites, etc. I had a BEng in Aerospace Engineering and an MSc in Mechanical Engineering. To be able to publish in the field, you need\n\n- Matrix algebra and Calculus for proofs,\n- Matlab/Simulink/Octave/C/C++/Java/Python etc. skills for simulations and implementation.\n\nIt may be a challenge for you to switch from a qualitative field to a quantitative one (not that I know pharmacy that well), but a student with determination can certainly do it (I learnt all essential control and implementation skills myself). If you take existing methods and apply them on the field of pharmacy, say for \"predictive prescription\", this might be conference paper worthy. More sophisticated analysis and proofs are required for journal papers, which are typically expected from PhD graduates.", "Permalink": "https://www.reddit.com/by_id/t3_4ojm8h.json"}, "138": {"Subreddit": "PhD", "Author": "huyouer", "Date": 1466206467, "Score": 1, "Body": "Can't agree with you more.  I am finishing my postdoc now.  Oh my gosh!  Academia is filled with nasty nasty and weird people! I used to look up to those big shot scientists. But after I heard more and more bad stories from those labs. I realized that many of those big shots are just assholes who built their success on luck and slaving countless researchers. I am sick of academia and am leaving for sure!", "Permalink": "https://www.reddit.com/by_id/t3_4nqeyw.json"}, "139": {"Subreddit": "PhD", "Author": "huyouer", "Date": 1466209457, "Score": 1, "Body": "That reminded me of my past few years. I can see that you don't like research at all. My suggestions are:\n \n1. How far do you think you're away from getting your PhD? If you can get your degree with the current project published. DO IT. PhD is still valuable than master degree and will give you a higher level position when you look for jobs.  Motivate yourself for a different reason - rather than solving complicated world's problems or deepening our knowledge or making our society a better place or whatever glorious reasons you used to have, change the reason to that you want to leave academia and be happy again, so getting your paper out is the only key to that.  Don't worry about the value or significance of your study - it does not matter to you if you are leaving academia. Most of the studies in science are crap anyway.  So work every possible way (except unethical conducts) to get it out as fast as you can.  \n\n2. If you think you will not have any publication in the next 1 or 2 years simply because the project is a dead end and you can't stand doing current research for even one more day, man up and tell your advisor your thought. Get a master degree immediately and look for other jobs.  If you decide to go this route, make it happen as soon as possible and move on. It's called cut loss. You might have a less valuable degree status than PhD but you cut your opportunity cost - it might not be a bad thing and you might come ahead in a few years both professionally and financially compared to getting a PhD. I have several friends who chose this route and they never regretted doing so. They were very happy with their choice. \n\n3. No matter what your final choice is, start thinking about your future career direction and preparing for it NOW! This is the most important thing.  There are several options to go:\na) getting additional training (apply for a different program) for certain jobs - medical school, law school, business school or a master program that has a very good job prospect such as accounting, computer science, statistics, finance etc. However, this option requires you to stay in school for another few years and may incur debt.\nb) Consider jobs that do not require additional formal training such as consulting, scientific writing, sales, etc. Although these jobs usually only need a bachelor degree, a PhD will probably put you at a higher starting position, especially in certain specialized industries. \n\n4. Unless your depression is severe, do not take anti-depressant. Those drugs will turn you into a walking dead. Try to hint yourself constantly that things will turn and it's the end of the tunnel.  You will stay positive and get through this soon.", "Permalink": "https://www.reddit.com/by_id/t3_4n6e7v.json"}, "140": {"Subreddit": "PhD", "Author": "huyouer", "Date": 1466209891, "Score": 1, "Body": "There is a term in investing called \"cut loss\". Two years is not a waste. Get a master and leave if you're really unhappy with the PHD study. Cutting loss now is still way better than incurring another few years (who knows how long) of opportunity cost of getting a PhD. \n\nI wouldn't suggest you this if you were into your 5th or 6th year of PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_4mlp3y.json"}, "141": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466214010, "Score": 1, "Body": "Yeah, I've had a few moments where I was working 12-14 hours a day, trying to keep up with everything. And still, the PI would tell me that I wasn't keeping up with all my tasks and that I was a 'disappointment'. I was like, \"Look, you are putting so much on my plate that you are essentially asking me to not sleep at night\". Half of them don't really care, they just want to get or stay ahead.", "Permalink": "https://www.reddit.com/by_id/t3_4nqeyw.json"}, "142": {"Subreddit": "PhD", "Author": "RandomPhysicist", "Date": 1466274839, "Score": 2, "Body": "It's little things like this that are really nice! My PhD is in quantum physics so it's a bit hard for a layman to understand and my long-term girlfriend is not really academically minded but she still tries to understand kinda what I'm doing which feels really great. I definitely have to echo what people have said above as well about talking about / doing other things. It's great to chill and not think about research at the weekend and in the evenings! At the same time, make sure if he has a deadline coming up / tons of work to do to give him space to work on it and then relax together when it's over.", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "143": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1466293797, "Score": 2, "Body": "First off, by asking this question, you're already an amazing girlfriend. He's a lucky guy.  What i want from my girlfriend is just someone to listen to me talk out ideas outloud and to vent at times. I want to quit at least twice a month and she talks me down. It's crazy helpful to just have someone around who will listen without trying to necessarily annoy you with \"you should do this\" suggestions. Also, be understanding when he wants to do work on weird days at odd hours. ", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "144": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1466293876, "Score": 1, "Body": "So true", "Permalink": "https://www.reddit.com/by_id/t3_4o1lhv.json"}, "145": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1466425805, "Score": 1, "Body": "There are a lot of software out there and in the end it's really a question of personal preference. No matter which one you choose you will need to invest time to master all the capabilities. \n\nPersonally I work with Zotero. It will format automatically your reference list, insert quotations highlighted in a pdf and so much more.\n", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "146": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1466435972, "Score": 1, "Body": "I go for the Word document approach. In my own experience (which is not everyone's), the gains in efficiency through a reference manager are lost through tedious things that you don't expect to happen. ", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "147": {"Subreddit": "PhD", "Author": "YuePing", "Date": 1466452790, "Score": 2, "Body": "I do something similar to you. But I use a document with some copy and paste (including interesting figure) from the paper (this saves a lot of time). To compare methodologies, this is a bit more specific, so I have a spreadsheet for every detailed \"survey\" I want to do - I just fill the fields when I find needed.\n\nI use the Mendeley citations to cross-reference the sources with my bib database, so that when I'm writing a formal report/paper it becomes easier.", "Permalink": "https://www.reddit.com/by_id/t3_4o2r44.json"}, "148": {"Subreddit": "PhD", "Author": "countryboycoyote", "Date": 1466455396, "Score": 1, "Body": "do you save anything in zotero except information about the document? do you save quotations?", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "149": {"Subreddit": "PhD", "Author": "porterble", "Date": 1466487867, "Score": 1, "Body": "Zotero works a treat here. I have a quotations document attached to all of my reference that i have quotes extracted from. Works really well and is easily searchable.", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "150": {"Subreddit": "PhD", "Author": "blufox", "Date": 1466496880, "Score": 1, "Body": "Use the bib file directly. Treat it as a markup document, and add the quotations under headings of book or paper. The bib file recognizes only entries that start with '@'. So long as you keep that in mind, the bib file can be of great use.\n\n    ## On theories of Metaphysics\n\n    * We have a great quote here.\n\n    @article{M:4,\n    author = {Myself, Me},\n    journal = {Journal of Metaphisical Logic},\n    title = {{On theories of Metaphysics}},\n    volume = {35},\n    year = {1970},\n    }\n\n    ## On theories of Real physics\n\n    * We have another great quote here.\n\n    @article{T:4,\n    author = {Myself, Me},\n    journal = {Journal of Phisical Logic},\n    title = {{On theories of Physics}},\n    volume = {35},\n    year = {1970},\n    }\n\nI am experimenting with attaching the bib content of a paper directly to the file itself with `setfattr` and reading with `getfattr`. It solves the problem of associating the file with bib, but it is linux specific.\n\nThe great thing about doing this is that any quotation is just a `grep` away, and you can reuse the markup file as your bibtex file in latex.", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "151": {"Subreddit": "PhD", "Author": "HAL9000000", "Date": 1466665107, "Score": 2, "Body": "Definitely talk to another faculty member, preferably senior, tenured faculty. One thing I learned over time was that there are almost certainly faculty in your department who you are underestimating. So go tell them what you're doing and ask for ideas. It might even end up that they don't have an answer but they can direct you to someone who might be able to help. Maybe you'll even identify a new committee member.\n\nAlso, whenever I got stuck I found it helpful and mentally stimulating to read relevant literature. Without reading, you're trying to generate ideas from your own mind. If you're reading the literature, you're getting ideas from others that might open up your mind to new ideas admit your own work.", "Permalink": "https://www.reddit.com/by_id/t3_4pcyhp.json"}, "152": {"Subreddit": "PhD", "Author": "countryboycoyote", "Date": 1466693747, "Score": 1, "Body": "thank you guys, i think i will try both the zotero and plaintext method.", "Permalink": "https://www.reddit.com/by_id/t3_4oyfxn.json"}, "153": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466693797, "Score": 2, "Body": "I have a different take - if you are 2.5 years into your PhD like you mention, you should be at a stage where you are able to come up with some ideas on your own, and your advisor should give you feedback on the ideas you present. If I were in your shoes, I would make a greater push to come up with ideas (with help from attending conferences, reading papers, etc.), and would be less inclined to 'start over' with your PhD like you expect a switch to result in. I just finished my 4th year (will hopefully graduate next May) and I am coming up with 95% of the ideas at this point.\n\nThe PhD degree itself is a representation that YOU have contributed something novel to your field, aka a thesis.", "Permalink": "https://www.reddit.com/by_id/t3_4pcyhp.json"}, "154": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466694289, "Score": 3, "Body": "If you feel like you absolutely want to be part of the 'frontier of psychology and virtual reality', then do it. There are many academic fields that are inflated, like biology, psychology, etc. where some minor percentage make it in academia, but within these broad fields there are little niches that one can expect to grow very rapidly in the next few decades, and psychology with a focus on virtual reality will be one of them. This much is very obvious, and is a game changer for this particular circumstance. If you love what you do, you really 'give it your all', and intuitively you can expect that field (or sub-field, in this case) to grow rapidly, then you should do it.", "Permalink": "https://www.reddit.com/by_id/t3_4pgp6w.json"}, "155": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466694744, "Score": 1, "Body": "I don't mean to come off as insensitive, but typically I would tell people in your circumstance to not pursue a PhD. You go into a PhD when you are so interested or dedicated to some question that you are willing to dedicate your life to it. When you ask what research field to dedicate your PhD to, it sounds like your interests are far from where they need to be in order to be successful and make it worthwhile.", "Permalink": "https://www.reddit.com/by_id/t3_4ofuck.json"}, "156": {"Subreddit": "PhD", "Author": "Whirly123", "Date": 1466694799, "Score": 1, "Body": "That's very encouraging thank you. I do agree it does look very obvious that the subfield will take off although I was hoping my perception was not being too coloured by my desire to do it.", "Permalink": "https://www.reddit.com/by_id/t3_4pgp6w.json"}, "157": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466694971, "Score": 2, "Body": "Yeah, when I read your post, my first reaction was, \"Wow, there's going to be a very high demand for that in a decade when millions of people have a virtual reality helmet in their homes\" - for entertainment, psychotherapy, etc. etc. I don't think I would have that reaction for many other psychology posts, tbh.", "Permalink": "https://www.reddit.com/by_id/t3_4pgp6w.json"}, "158": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1466704396, "Score": 1, "Body": "*Qualifier: have not started my PhD program yet*\n\nIt sounds like you maybe didn't fit in well with your advisor? Is that correct? How do you feel about your post-doc advisor? Is there a chance it is a better fit for you and your personality/advising needs? Maybe if you find the right environment (I would forget ranking), you'll find it's better.\n\nThat said - you know your mental health. Preserve your mental state above all else. What prospects excite you more? Could you take a year off before doing a post-doc? What if you did something wildly different than your studies? In what position will you be your best self?\n\nBeing depressed in your position won't be good for anyone - you, your employer, your family. Do what's right for you. And what's right for you may not be what your family wants, but that's their problem. ", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "159": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466705393, "Score": 10, "Body": "If I were in your shoes, I would go for the post-doc position at the place that offered you one, or at some other university. Here are my reasons:\n\n1) It seems like your negative feelings *may be* situational, and could turn around if you found yourself in a more social, and more socially accepting environment. When my own atmosphere is bad, I also start to have negative thoughts about the research. Of course, the opposite is true when the atmosphere is healthy.\n\n2). \"I didn't prepare for the job market in industry.\" Since you really have no other direction to go in, you might as well just take the job to get a salary and benefits in the immediate future. Post-doc positions are relatively short, and can be anywhere for 1-3 years in length. For the first few months, test to see if 1) is true. If not, plan to leave after 1 year of work and in the meantime, get skills and build a CV to apply for something outside of academia.\n", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "160": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1466708063, "Score": 2, "Body": "This. Good advice. ", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "161": {"Subreddit": "PhD", "Author": "cbaruob", "Date": 1466708702, "Score": 2, "Body": "I'm doing a PhD in the UK researching VR/AR and a few other students in my lab are doing projects with psychology and VR. Given that VR has such a huge hype around it the last few years there's a lot of grants and funding for it. \n\nBesides the usual stuff like using VR for phobias, anxiety, rehabilitation etc, there's also Human Factors, Human-machine interaction etc which is a good mix of the two. In my department (Electronic &amp; Systems Engineering) there are 2 professors and a few other lecturers who have psychology degrees, so there are academic positions outside psychology which is slightly less competitive.\n\nIf you find Defence or Aerospace interesting there are loads of industry jobs doing R&amp;D in VR.", "Permalink": "https://www.reddit.com/by_id/t3_4pgp6w.json"}, "162": {"Subreddit": "PhD", "Author": "chubecca89", "Date": 1466711203, "Score": 1, "Body": "This makes a lot of sense. \nFor sure my thoughts are partly situational, as there is a negative atmosphere in my group.\nOn the other hand if I turned down the postdoc, I would have unemployment benefits which would give me time to prepare for the job search.\nI just don't know which of the two choices would be better for my mental well-being, as I am a very anxious person", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "163": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1466723486, "Score": 6, "Body": "1. Getting a PhD is not about learning to teach, it's about doing cutting-edge research in a very specific field.  What is it that you are qualified to become a world expert on, and what do you want to become a world expert on?  Are you willing to spend 4+ years doing self-directed research on this topic for little money?\n\n2. I don't know if the MBA qualifies you for PhDs in fields other than management.  In Canada it's usually (though not always) common to have a masters in the field before embarking on a PhD, and getting into PhD programs is competitive and generally requires research experience.  Did your MBA include research?  Did you get your work published in peer-reviewed journals?  Someone on the business side of things can probably tell you if it's common for MBAs to go on to PhDs.\n\n3. You keep saying \"professor\" but you don't seem to have much idea of the realities of this kind of job.  I'd suggest you check out [this past thread](https://www.reddit.com/r/AskAcademia/comments/smtsz/question_about_becoming_a_professor/) for some facts and opinions.  In short: this is an incredibly competitive job to get, even after a few years of postdoctoral work after a PhD.  If you are one of the lucky few to land a job, you will probably need to be focused on getting in research grants, running a research group, and publishing your work - far more than on teaching.  The exception may be if you're specifically looking to teach at a community college or primarily undergraduate institution, and even then some places will require you to still be active in research.  \n\n4. You'll be taking a massive, massive pay cut.  PhDs don't get paid that much, postdocs don't get paid much more, and maaaybe in 6-8 years if you're one of the lucky few who gets a tenure-track assistant professor job at a highly-ranked university will you start to make more money than the average Canadian.", "Permalink": "https://www.reddit.com/by_id/t3_4pj9xs.json"}, "164": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1466724966, "Score": 1, "Body": "I second this person's opinion entirely. Getting a PhD is not about wanting to teach the subject and avoid the 'politics and bureaucracy' of your current job. It's about pushing the understanding or depth of a subject past its current limit by making new discoveries or through the introduction of theories, models, etc. \n\nThe PhD is about self sacrifice for the above goal.", "Permalink": "https://www.reddit.com/by_id/t3_4pj9xs.json"}, "165": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1466734305, "Score": 1, "Body": "I agree with the other comments left on this, as a Canadian in a PhD program currently. \n\nHowever, I do know people who have had unrelated MAs gain acceptance into the Humanities program I am a part of, so your MBA might not be a big deal, depending on where you apply. Mainly, when writing your proposal for acceptance, you need to consider whether or not the research you wish to undertake is questionable, new, and possible with the current staff in that department for your comps committee.\n\nAnd being a professor isn't necessarily the best track here - it's a goal I want because I love teaching and being a TA; I was lucky to be nominated for 3 teaching awards this year, and I know that my previous experience in teaching with my OCT helps. But I also push hard on my academics to attend conferences, publish articles (finally got two underway!), and be part of conference committees, co-chairing panels at conferences, and more.\n\nThere's definitely a pay cut to consider too. I make WAY below minimum wage on my grant, and luckily my husband supplements our income or I'd be unable to even afford rent. \n\nAs for politics - you'll never get away from it. Ever. It's always going to be there in whatever form it takes, it's just whether you want to \"play the game\" so to speak, or not. Academics, once you're at a high enough position or tenure, means you can possibly ignore politics, but it's a long way to go to get there, and most universities are avoiding tenure positions to provide contract.\n\nI'd suggest applying to colleges to teach first and see if you like it. If you have years of industry experience, places like Humber, Centennial, etc., would be interested in having you as a part time instructor. it's a good way to get your feet wet without the commitment of a PhD at the moment.", "Permalink": "https://www.reddit.com/by_id/t3_4pj9xs.json"}, "166": {"Subreddit": "PhD", "Author": "EIEIw", "Date": 1466760606, "Score": 2, "Body": "Look for another job, quit/pass over the post-doc once you have a firm offer.", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "167": {"Subreddit": "PhD", "Author": "Whirly123", "Date": 1466766869, "Score": 1, "Body": "That's more excellent news! I hadn't even considered Aerospace. Kind of excited now.", "Permalink": "https://www.reddit.com/by_id/t3_4pgp6w.json"}, "168": {"Subreddit": "PhD", "Author": "EvermoreCR", "Date": 1466780803, "Score": 0, "Body": "For the money: get a Master degree or a very good IT certification, and a nicely well paid job.", "Permalink": "https://www.reddit.com/by_id/t3_4pnbu3.json"}, "169": {"Subreddit": "PhD", "Author": "Lordcynic", "Date": 1466781688, "Score": 2, "Body": "Once you get your PhD, you should probably try applying for a federal positions. A PhD with no other experience will get you a gs-11 position, a minimum of $59,246, more money if you live in an area with a higher cost of living. You apply on usajobs.com, if you have any questions message me.", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "170": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": 1466784483, "Score": 2, "Body": "I don't know, it guess it depends on one's priorities. Personally I'm halfway through my PhD at age 28 and we're financially stable as my program is fully financed and my husband works as well.\nThe desire of starting a family is eating me alive, but I know it just can't happen now. The actual problem though is that in 1,5 years, when I graduate, I will probably have shitty project or short term contracts that allow for zero financial stability.\nThe alternative would have been to stay in my passion-unrelated ok-paid unlimited contract office job and have one maternity leave after the other. After all, the job wasn't that bad.\nI'll never know which way would have made me happier, but I took the decision to pursue a PhD so I can figure out whether academia works for me. I still don't know if it does.\nIn the meantime I just keep doing what I'm doing and put my heart into doing a good job so that, eventually, we will be in a position to have and maintain a family.", "Permalink": "https://www.reddit.com/by_id/t3_4pnbu3.json"}, "171": {"Subreddit": "PhD", "Author": "EvermoreCR", "Date": 1466786393, "Score": 3, "Body": "I think it's very ambitious, both projects will need a lot time and effort.\n\nP.D.\nDo you have a big savings account? family = big expenses. ", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "172": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1466798008, "Score": 6, "Body": "Don't listen to people who ask about money.  You can make it work, if you wait to have 'enough' money for a kid you'll never have one.  I tried it and to be honest, when my little one arrived I realized that my time with my kid was more precious than my time reading research.  Just me personally.  I know a few who have done it and they say that time management is very important and that it can be done.  Personally I've seen two guys complete a PhD in computer science while having kid(s).  Good luck to you!", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "173": {"Subreddit": "PhD", "Author": "bobwoodshed", "Date": 1466801275, "Score": 4, "Body": "It's possible, but it takes really great time management.  Anecdotally, the people I've seen do this either thrive because they have enormous support networks nearby or look like overwhelmed zombies because they don't sleep.   ", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "174": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1466816490, "Score": 5, "Body": "I have four kids and my last one was born two days before my dissertation defense!  It's not easy, but fun and worth it. Right now I'm sitting with my kids on vacation playing cards with family. \n\nFirst kid turns your life upside down my wife just said talking to her about your post.  Subscribe to daddit.  Don't wait though. You don't want to be 70 at your kids high school graduation!  Sorry for the stream of concious, all comments coming out.  Also my wife was very supportive and helped me proof stuff. She was amazing (she isnt holding a gun to my head ;)).  Get your family going and hold on tight!!", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "175": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1466874009, "Score": 2, "Body": "I'm not saying you shouldn't leave, but there are some advantages to being a bit to the side of your advisor's expertise.  Working on something that's genuinely \"yours\" will give you a lot of room for independence and self-direction, which can be very valuable experience in a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_4psniv.json"}, "176": {"Subreddit": "PhDCafe", "Author": "TeaWithBiscuit", "Date": 1466880861, "Score": 1, "Body": "Sigh. Sadly, my Uni is planning something quite similar. They claim that there is 'pressure from above' to make better use of the space in the school, and this means we need to 'redesign'. Which... essentially boils down to cramming more PhD students into smaller spaces with less desk space, little storage, and scarcely any privacy. \n\nWe tried to fight back, but pretty much lost. It's been a very disheartening experience. The worst part is that it creates a cyclical problem: worse working conditions lead to less people coming into the office, which leads to the University saying that they want more of our space because it's underutilized, which leads to another re-design for even worse space.", "Permalink": "https://www.reddit.com/by_id/t3_4ptfy3.json"}, "177": {"Subreddit": "PhDCafe", "Author": "omking", "Date": 1466890941, "Score": 1, "Body": "Thanks TeaWithBiscuit. The office attendance thing does seem to be a recurring theme, and something that our own grad school administrators seem to be preoccupied with. But, as you say, make the workplace more desirable and... There is a two-fold argument, assuming that the policy of the university is to provide desks: (1)  does the space meet the legal requirements as set out by the HSE? (which in our case it does not appear to on space per occupant); (2) does is represent the kind of environment which is attractive to prospective postgrads and conducive to a positive working environment?", "Permalink": "https://www.reddit.com/by_id/t3_4ptfy3.json"}, "178": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1466897950, "Score": 1, "Body": "I don't know what field you're in, but in my field (neuroscience) \"transferring\" in grad school just isn't possible. Most new advisers would see it as a red flag -- \"If you up and decided that you didn't enjoy the research you said you did, what's to say that you won't do the same thing to me in a year's time?\" I totally understand your position, but depending on the field it's generally not accepted. \n\nOne huge thing you can do is find national/international conferences in your field that include your new focus. If your adviser has good funding, he might financially support you going. If not, consider paying for it yourself. That way you can meet other people, both PhDs and grad students, with similar interests, and you can form collaborations. Even if their lab is across the world you can still collaborate, meet over Skype frequently, co-author publications, spend an occasional summer or semester in their lab, etc. Collaborations make science go round! It's a great way to be doing the research you want while still keeping your school and adviser. \n\n(As a side note, my friend wanted to do a specific type of research that her adviser did not do, she continued pestering and pestering her adviser about it, and now several years later that's the entire focus of her adviser's lab! If your adviser has an open mind like you say, it could mean good things for both of you. You never know.) Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_4psniv.json"}, "179": {"Subreddit": "PhD", "Author": "tripreality00", "Date": 1466987854, "Score": 3, "Body": "Finished my first core course of my PhD program. Enrolled in my fall qualifiers just taking it a day at a time. ", "Permalink": "https://www.reddit.com/by_id/t3_4q013m.json"}, "180": {"Subreddit": "PhD", "Author": "happy_and_proud", "Date": 1466994228, "Score": 1, "Body": "Advisor said no to me graduating by Aug. now I have no funding to register for fall AND even if I register I have to work from back home cause my husband has to go back to work in Sep! I am in a very bad situation, but this is PhD life I guess.", "Permalink": "https://www.reddit.com/by_id/t3_4q013m.json"}, "181": {"Subreddit": "PhD", "Author": "anonorhinos", "Date": 1467023307, "Score": 1, "Body": "It's the same in NZ too. Usually people in our department get work as a tutor or a research assistant in the interim.  ", "Permalink": "https://www.reddit.com/by_id/t3_4pkffn.json"}, "182": {"Subreddit": "PhD", "Author": "phdizone", "Date": 1467031743, "Score": 1, "Body": "PhDiZone includes PhD and Master Degree holders to guide you step by step in writing your journals and papers successfully. ", "Permalink": "https://www.reddit.com/by_id/t3_4q35gh.json"}, "183": {"Subreddit": "PhD", "Author": "Knirkefri", "Date": 1467040557, "Score": 1, "Body": "Norway: Yup. But we get unemployment benefits from the state because we live in a magical land of fairies and money. For now.\n\nedit: \"yup\" answers your final question, not the question in the title. As in \"yes, it's like that here as well\" and \"no, the university does not support.\"", "Permalink": "https://www.reddit.com/by_id/t3_4pkffn.json"}, "184": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1467051078, "Score": 1, "Body": "Between the cattiness of women in research who hate other women in research, the sexual harassment, the feeling of defeat of research, I really don't want to stick in this program anymore even though I'm going into my last year come September. It's just so difficult to force myself to come to lab every day knowing things won't be working, I'm terrible at writing (so many edits for everything!), my peers are cruel and relentless, I feel so lonely here, I'm completely unmotivated where I haven't done anything worth publishing in months.", "Permalink": "https://www.reddit.com/by_id/t3_4q013m.json"}, "185": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1467051347, "Score": 1, "Body": "Where do you work and what do you do? I've been trying to find an out from academia and research and I'm nearing the end of my PhD (hopefully). I'm not sure what my options are and have only recently started asking what's in store for me in the future :C", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "186": {"Subreddit": "PhD", "Author": "tripreality00", "Date": 1467082162, "Score": 3, "Body": "/r/humblebrag\n\n\nBut seriously do a PhD because you love your field not for money. End of thread. ", "Permalink": "https://www.reddit.com/by_id/t3_4q4a3k.json"}, "187": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1467086949, "Score": 1, "Body": "Oh no, sounds like you're having a really rough time! It is normal to not do anything worth publishing for 6 months... Is your supervisor aware that you are not making a lot of progress at the moment? Are you able to take a break at all during summer? Sometimes it helps to step away and have a chance to remember why you wanted to research your topic in the first place. All the best with the rest of the week. ", "Permalink": "https://www.reddit.com/by_id/t3_4q013m.json"}, "188": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1467128756, "Score": 1, "Body": "Yeah my supervisor is aware and has given me some room to sort things out.. But she would like to have a paper published this summer (I've been writing like mad) and a lot more things to be done before I leave. She's a bit on the passive side so I'm really not sure if she is the type to let someone graduate before they're ready (I'm really not sure if I have enough publications done to graduate!)\nI get 2 weeks off in the summer although I'm not sure when I'm taking them yet. Hopefully the upcoming long weekend (Canada Day) will help me de-stress!", "Permalink": "https://www.reddit.com/by_id/t3_4q013m.json"}, "189": {"Subreddit": "PhD", "Author": "FinchPR", "Date": 1467131224, "Score": 1, "Body": "I understand your feelings. I had the same issues working on an aerospace corp. I love teaching, I have taught to adults and teens since I finished my masters, GED and SATs exam preparation. \rUnfortunately in today economy and job markets even to teach in a small university or college where the teaching mission is more important than research the required qualifications includes possessing a PhD. \rSo, this is what I did and my recommendations to you.\r\r1. Save some money\r2. Look for a Ph.D. Program in industrial and Systems, Management Engineering- this is important, because engineering pay more during Ph.D. and most don't required a undergrad in engineering.\r3. Look for a short Ph.D. program. Some programs require up to 130 credits and some required only 72 credits.\r4. Look for a program who let you use your MBA credits towards your PhD. I got 18 credits from my masters, leaving me only 54 credits to complete.\r5. Find a professor/advisor who work on health care systems management. You will have an advantage here. I worked on renewable energy evaluations, similar to what I was doing when working.\r6. Let your department head and advisor that you are interested to go to a teaching institution, and you want to have the opportunity to be a grad teaching assistant or an instructor of any course. I teach 4 courses  by myself during my PhD.\r7. Work very very very hard to finish your project-dissertation as soon as possible 😊. Is doable in 3-4 years.\r8. Apply for work on small institutions, where teaching is more important. These positions are mostly teach 4 courses per semester. Also the work schedule is only 9-10 months. Which is great.\r\rThe good thing about industrial engineering is that you have more job opportunities, you can work at management department, management science dept, industrial engineering, dept, or go back to industry and be a better boss.\r\r** all these recommendation are base on US institutions. No idea about CAN.\r\r\r", "Permalink": "https://www.reddit.com/by_id/t3_4pj9xs.json"}, "190": {"Subreddit": "PhD", "Author": "filsdepub", "Date": 1467133246, "Score": 6, "Body": "I would personally have a very polite and courteous talk with the Dean, and carefully explain my case. That thesis is going to be linked to the school, they surely don't want bad science published like that. \n\nAre there other people who feel the same as you and want to take actions, or are you alone?\n\nGood luck with that tough situation, although it could very well be solved if you stay calm and prove your point.", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "191": {"Subreddit": "PhD", "Author": "Lattice_Bowel_Mvmnts", "Date": 1467134502, "Score": 6, "Body": "I encourage you to talk to someone in authority in a factual and professional manner.  I really can't provide any more help, but I understand the frustration as a family member is working on his PhD in the same field as I am, at another school, and it is barely fit to meet the scope and novelty of a senior project course.  The school he attends should be ashamed, but I feel like I'm not in a position to say anything as we are at different institutions.  So, give that clown one for me!!", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "192": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467134511, "Score": 2, "Body": "Is this in the US?", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "193": {"Subreddit": "PhD", "Author": "batmansjockstrap", "Date": 1467140969, "Score": 1, "Body": "Thanks for the advice, but I'm not sire if goning down offical channels will work out well for all invovled. I was hoping if there were maybe someone I could anonymously contact and show the level of fraud going on. I know that sounds harsh, and a bit arrogant of me, but in this case it is so obviously substandard. The thesis also contains major mistakes (forgot to mention), which were let slide. ", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "194": {"Subreddit": "PhD", "Author": "batmansjockstrap", "Date": 1467141001, "Score": 1, "Body": "No in Europe.  ", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "195": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467141585, "Score": 3, "Body": "If you are a student as well, I would be concerned about retaliation for even bringing this up. Don't fuck yourself up just because you want to get on high moral ground and fight some fuckers.", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "196": {"Subreddit": "PhD", "Author": "batmansjockstrap", "Date": 1467141819, "Score": 1, "Body": "Thanks, I know this could really work out bad for me, so I will proceed cautiously, If I will do anything at all. \n\n&gt;Don't fuck yourself up just because you want to get on high moral ground\n\nThis isn't a simple case of being pretentious, he has taken my data, and put in really shit thesis, full of mistakes, with no novelty, which brings us all down and makes us all look bad. ", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "197": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467142322, "Score": 1, "Body": "How did he take your data? If you collected the data how did he have access? Did he copy something you did using public data?", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "198": {"Subreddit": "PhD", "Author": "unpopular_opinion", "Date": 1467154868, "Score": 4, "Body": "You are acting as if you found the first substandard PhD thesis. \n\nHere is another example: https://mygraduateschool.wordpress.com/2012/08/09/the-sham-ph-d/\n\nI understand your feelings (your PhD devalues, because of shit like this), but the intelligent course of action is to just rest in the fact that today you learned something. \n\nThe academic world has absolutely nothing to do with some idealistic picture of science anymore in many cases. Cheap labor is one way to label obtaining a PhD. If the price for cheap labor is giving these pesky humans an extra title, then so be it (even if they don't deserve it). ", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "199": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467171483, "Score": 11, "Body": "mistake. No such thing as a PhD you have to pay for. PhD students are paid to be PhD students. No such thing as an online PhD program. This is a diploma mill - nothing more. No one will care you have a \"degree\" from Grand Canyon \"university\"", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "200": {"Subreddit": "PhD", "Author": "EIEIw", "Date": 1467185913, "Score": 3, "Body": "Don't do it", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "201": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1467200716, "Score": 2, "Body": "A PhD is all about seminars and discussions with your colleagues  (fellow students). No way a PhD can be done online. It just makes no sense. Do it for real in a recognized university or don't. There are very good public universities in the US. \n\nOh! I forgot: a PhD is also all about research. If you have no interest in this, don't do it. ", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "202": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1467205364, "Score": 3, "Body": "I agree with what these guys are saying.  Don't waste your time and money on an online PhD.  It isn't accredited because PhD's don't care about accreditation.  PhD's are about publishing new works, seminars, papers, research, and discussions with fellow colleagues and colleagues in the same area of research.  \n\nAlso, if you care not for research and expanding the field, please don't try to do a PhD.  This is how most Master's students become Master's students.  ", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "203": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1467210059, "Score": 1, "Body": "In some departments, as is the case in mine, you \"have\" to share your data. Either because of peer pressure (supervisor asks you to share and you don't want to appear as not a team player, or you share an office with 7 other PhD candidates and plain refusing would make you look bad for every witness -- that's the case in my department), or because of a lack of resources (our lab does not have a lot of money for infrastructure -&gt; limited data storage capacities -&gt; everyone has access to the shared drive -- that's also the case in my department). \n\nSo yes, plenty of ways data sharing could happen without you really wanting it...", "Permalink": "https://www.reddit.com/by_id/t3_4qac5v.json"}, "204": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1467220411, "Score": 2, "Body": "Some phd won't be recognized in the US. Depending on where you want to work, you would need to verify that. ", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "205": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467221379, "Score": 4, "Body": "90% of the time you can only get academic jobs at peer institutions or lower", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "206": {"Subreddit": "PhD", "Author": "anxiety_dude", "Date": 1467221403, "Score": 1, "Body": "&gt;HELP\n\nI had the exact problem you mentioned. In certain social situations, for absolutely no reason, my body would have a panic reaction. I could be completely calm in my head wondering WHY this was even happening since I wasn't nervous at all, yet my body's reaction was through the roof. After coming to grips with the fact that I actually had a problem that was out of my control, I looked into the possibility that this was a form of social anxiety and did some research online.\n\nLook into getting a simple prescription for \"beta-blockers\". They are essentially blood pressure medicine (millions of Americans are taking beta-blockers right now), but are also prescribed to treat some kinds of social anxiety. It has the side-effect of preventing these sorts of everyday \"fight or flight\" reactions and lets you actually be physically calm and interact normally in these situations without the feeling of fear. The most commonly prescribed drug is \"propranolol\" aka \"inderall\". It is a safe, generic, off-patent drug that any doctor will let you self-prescribe if you tell him you want to try it out.\n\nGoogle for \"beta-blockers\" and see if most of what people are saying about them matches your situation. Go see a doctor and tell them you want to try them.", "Permalink": "https://www.reddit.com/by_id/t3_4qg81z.json"}, "207": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1467221744, "Score": 2, "Body": "Yes you can. .. just put the reference. ", "Permalink": "https://www.reddit.com/by_id/t3_4qeqe6.json"}, "208": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467232449, "Score": 2, "Body": "Seems like op disappeared. Probably too dumb to listen to anyone here.", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "209": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1467233669, "Score": 2, "Body": "(liceinwonderland 2015, upublished)", "Permalink": "https://www.reddit.com/by_id/t3_4qeqe6.json"}, "210": {"Subreddit": "PhD", "Author": "SalingerPoe", "Date": 1467247433, "Score": 2, "Body": "Where do you want to work? If you want to work in North America you'll need to get a PhD from North America as even some European degrees have trouble getting validated in North America. But if you want to work in China then you should probably go for it. I can't compare the education \"quality\" but you may want to consider the validation process too. ", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "211": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1467247452, "Score": 1, "Body": "I knew one guy who did it. He was a couple of years into his PhD when the kid was born. He somehow made it work with a grad school stipend for a couple years and then living off some money from his start up. His start up was from before the PhD, otherwise I think it wouldn't be possible to handle so much at once, and his PhD research tied directly in to his startup. His dissertation was one of the best I've seen.\n\nI think important factors that made it possible were 1) he had some side money besides stipend 2) he didn't have the kid until after his course requirements and qualifier were done (after first two years).", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "212": {"Subreddit": "PhD", "Author": "downtownblue", "Date": 1467253106, "Score": 3, "Body": "Fair or not, I think this is quite spot on... (well, maybe not he percentage, but the point.)", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "213": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1467256832, "Score": 2, "Body": "Also where your professors that you interact with, and where they got their phd matters a lot. There are certain views and philosophy of science that top phd holders from the usa will hold. Also peer effects. Your peers from China would be very different than from a top 30 usa institution and you learn a lot from your peers.", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "214": {"Subreddit": "PhD", "Author": "SLGC", "Date": 1467268711, "Score": 4, "Body": "OP: **Don't** diagnose yourself, and don't let people on the internet prescribe you pills. See a doctor/therapist and get your problems worked out. Some levels of anxiety can be a normal part of life to guide us, but it can also be completely and utterly devastating. Seek help if it is really that bad, and you're not just scared of owning up to your problems.\n\nStart talking to your supervisor. She must be extremely frustrated that you're just ducking out of your meetings without regard for the time, energy and money she puts in. You have behaved pretty immaturely towards her and you're feeling the consequences of not owning up to your responsibilities as her doctoral students, and then your mind is filling in the blanks about what she thinks of you, coupled with the feelings of inadequacy and failure. It sucks and it's going to keep sucking unless you start talking to her.\n\nYou say you didn't have the proper background: Do you think they accepted you because you're an exceptional liar? Do you think she planned to teach you because you fooled them to think you can learn? Probably not. You are your own harshest critic.", "Permalink": "https://www.reddit.com/by_id/t3_4qg81z.json"}, "215": {"Subreddit": "PhD", "Author": "liceinwonderland", "Date": 1467270339, "Score": 1, "Body": "Thanks!!!", "Permalink": "https://www.reddit.com/by_id/t3_4qeqe6.json"}, "216": {"Subreddit": "PhD", "Author": "freddosmsc", "Date": 1467285312, "Score": 1, "Body": "Υοu're spot on.\n\nAlso, OP, please don't let it become worse. Act as soon as possible and stop it before it becomes a normality in your life, because then it will be much harder to get rid of it.", "Permalink": "https://www.reddit.com/by_id/t3_4qg81z.json"}, "217": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467293291, "Score": 1, "Body": "I think it also depends if you used human subjects.  If you used human subjects then there are restrictions.", "Permalink": "https://www.reddit.com/by_id/t3_4qeqe6.json"}, "218": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467293554, "Score": 1, "Body": "It depends on who accredited the program.  If it is APA accredited that's a plus.  There is a distinction between clinical psychology programs that allow one to apply for state licensure and non clinical programs that only allow one to teach.  \nNot all online programs are diploma mills.  I am currently in a PhD program, CACREP accredited, and it is very difficult.  There are several good online programs such as Cappella and Walden, that are APA accredited.", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "219": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467293654, "Score": -1, "Body": "I'm certain you are not a doc student, you clearly are clueless", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "220": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467294053, "Score": 1, "Body": "In my experience the hours required for school and the time to care for a baby can not be done by a normal human.  Unless you are willing and able to relinquish a great deal of your childcare responsibilities, or go to school part time then it is incredibly difficult.  \nMy kids are teens and fairly self-sufficient, there are days I don't even see them.  Sometimes a few days.  I can not imagine trying to do it with a baby and I worked and wrote a book when my kids were small.  A PhD is on a completely different level. \n", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "221": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467294110, "Score": 1, "Body": "Plus he is male.  The expectations on mothers and fathers are different.\nSorry, just read OP he is also a guy.", "Permalink": "https://www.reddit.com/by_id/t3_4pnnze.json"}, "222": {"Subreddit": "PhD", "Author": "judgejudyrules", "Date": 1467294345, "Score": 2, "Body": "I would encourage you to know what the expectations are.  In the US in academia the belief is that you will work toward gaining tenure.  To do this you must publish and bring money to the university you are employed by.  There is high competition and not much respect if you are untenured", "Permalink": "https://www.reddit.com/by_id/t3_4pi0mz.json"}, "223": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1467297898, "Score": 2, "Body": "Don't waste your time.  A PhD isn't worth almost anything unless you have the skills and experience working in a research field to back it up, and you won't be able to gain the necessary skills from an online program.  You need to be spending *thousands* of hours, in person, discussing and arguing and debating with others in your field, to gain the necessary experience.\n\nWhy not pursue a PhD at a real university?", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "224": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1467298927, "Score": 3, "Body": "China has a bit of a reputation of having a corruption problem in academia.  However, China is huge and PhD's vary widely (just like the US!).  You'll have to be willing to demonstrate, after your PhD, that yes you really are a PhD-level expert in your field, but assuming you have a good and vigorous grad experience, this will be no problem: people who deserved their PhDs and people who didn't deserve their PhDs are like night and day to hiring committees, and people who are brave enough to do their degree abroad are often stronger candidates from their experiences.\n\nSo, yeah, I'd go for it, if you'll get a good educational experience (work with good people, publish good papers, etc).", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "225": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1467299005, "Score": 1, "Body": "So on top of the 30+ hours of classwork, most PhD students spend months or even years of cumulative time reading research on the area of interest.  Whether it be building up a conference paper with supporting details or attempting to find a dissertation topic.  There are instances where a PhD student will be months into their dissertation only to have to pivot because someone produces something close to or even the same as their dissertation.  If you are committed for the paper and not the journey, you will likely fail to complete it.  PhD work is far different than the undergrad and most master's programs.  \n\nAs far as industry, if you have a PhD and no work experience or even some work experience, most places will see your PhD as 'too expensive' for the same reason that you articulated in your reply \"I'm worth more!!!\".  Just research \"Does a PhD enhance or hurt job prospects\" and read about how to continue outside of academic environment.  Most industries would rather have a Master's than a PhD for actual work.  The mindset that you have a PhD sometimes convinces the people you are trying to work for that you are a thinker and not a do'er.  \n\nThat being said, PhD work is hard.  I haven't completed mine yet and it is by far the hardest thing I've done.  I have a Master's and undergrad in computer science with a minor in math.  I have built safety critical real-time software, healthcare software, legal software, and helped start a company.  I have a kid and I've done some pretty difficult transitions in life.  But keeping with the program is by far the hardest thing I've done and hope to finish sometime soon.  Look up depression and PhD students (you'd be surprised by the statistics).  Just giving you fair warning.  If you have the mindset of \"I'll do it for the piece of paper\" I'd love to talk with you after you finish to see where your mindset will be afterwards =)", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "226": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1467299933, "Score": 3, "Body": "dumb you are", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "227": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1467300534, "Score": 2, "Body": "&gt; some European degrees have trouble getting validated in North America\n\nWhat field?  I know dozens of EU PhDs working in the US, at research universities and government labs, both Europeans and Americans, and the worst difficulty I've ever seen is a little extra bureaucratic paperwork.", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}, "228": {"Subreddit": "PhD", "Author": "SalingerPoe", "Date": 1467300630, "Score": 2, "Body": "Mostly the humanities. ", "Permalink": "https://www.reddit.com/by_id/t3_4qga52.json"}}