{"0": {"Subreddit": "PhD", "Author": "liketheguyontv", "Date": "1438618980", "Score": 1, "Body": "As a PhD student, myself, I believe both you and I are overreacting. I appear to be in a similar situation. The crazy thing is that we've been told what needs to be done- great response, btw, from sadmoody- but we focus on the entirety of the field and fail to truly \"focus\". This has been my problem for a couple of years now.\n\nThe best advice I can give so that you don't waste as much time as I did is to explore your problem with deadlines that you give yourself. I'm simply repeating what others have told me. Write, write, and write. Let the writing help you think through your research and it will start to form itself as sadmoody said.\n\nI gotta get off reddit now and start writing...", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "1": {"Subreddit": "PhD", "Author": "ColourlessGreenIdeas", "Date": "1439111908", "Score": 1, "Body": "I'm in a different area of CS. In my area, most papers give an outline about open issues in the current research and/or possible avenues for follow-up research. These outlines are typically found at the end of the paper (\"Future Work\"). Sometime they also found in a sub-section called \"Validity\" of the section describing the results.\n\nHave you considered using these outlines as a starting point for your own research?", "Permalink": "https://www.reddit.com/by_id/t3_3f5ij1.json"}, "2": {"Subreddit": "PhD", "Author": "BeardySam", "Date": "1439197978", "Score": 1, "Body": "Yeah keep well away from the word student, and say you're a young professional or phd researcher when asked. If they press, emphasise that you get paid a regular income, but avoid giving the amount or words like grant or stipend. ", "Permalink": "https://www.reddit.com/by_id/t3_3bqe7i.json"}, "3": {"Subreddit": "PhD", "Author": "decon89", "Date": "1439280075", "Score": 1, "Body": "Humanist here. Not so many graphs in our papers, lots of concepts and text in general though. I always read the abstract followed by the conclusion. If the conclusion or research question asked in the paper does not make complete sense to me, I also read the introduction to catch on the premise of the paper. If I'm doing similar research experiments I read their method section for insights, or faults. Same goes for the discussion. ", "Permalink": "https://www.reddit.com/by_id/t3_34p2yd.json"}, "4": {"Subreddit": "PhD", "Author": "decon89", "Date": "1439280172", "Score": 1, "Body": "Hidden rules of phd research. \nThe craft of research. \n\nJust search amazon. Last book is a must read for all researchers, even BAs ☺\n", "Permalink": "https://www.reddit.com/by_id/t3_33p6b1.json"}, "5": {"Subreddit": "PhD", "Author": "wakkaflokka", "Date": "1439389816", "Score": 1, "Body": "There's no answer for this. Just like any job with any degree, it all depends on what you do after your doctorate. Furthermore, how demanding getting your doctorate is depends on your field, the lab you choose, and how hard you want to work.", "Permalink": "https://www.reddit.com/by_id/t3_3e4qcd.json"}, "6": {"Subreddit": "PhD", "Author": "brimacki", "Date": "1439438756", "Score": 1, "Body": "You're thinking about Resident Advisors. OP is looking for a research assistant.\n\nOP: Ask around the labs in your department. The other graduate students who have already passed quals will probably be glad to hand over any materials they used to prepare. You should also check with your department for old exams and maybe even for study outlines that the professors have prepared. You should study with other students who are going to take quals with you. You will probably not be able to get a student who has already passed quals to help you because they are probably no longer interested enough in reviewing the fundamentals.", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "7": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": "1439443862", "Score": 1, "Body": "I know that RAs are research assistants. ", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "8": {"Subreddit": "PhD", "Author": "infil", "Date": "1439451015", "Score": 1, "Body": "Congrats! I just wrote the last sentence of my final conclusion. Feels strange, after all that time. Still have to do a few revisions, format the whole thing, print and submit it.", "Permalink": "https://www.reddit.com/by_id/t3_3az2ca.json"}, "9": {"Subreddit": "DoctorZoidbergPhD", "Author": "Shock-Jock", "Date": "1439587951", "Score": 2, "Body": "wtf iz dis", "Permalink": "https://www.reddit.com/by_id/t3_3fjbjg.json"}, "10": {"Subreddit": "PhD", "Author": "EarendiI", "Date": "1439697992", "Score": 1, "Body": "These are my opinions if you're interested in the US.\n\n1. It depends on where you're interested in working in afterwards country-wise. Academia openings are rare and competitive in the US due to scarce funding at the moment. For any one faculty opening there's likely to be 100-200 applicants from what I heard in my department.\n\n2. As long as you have decent research experience, you'll be fine. Microbiology PhD programs in the US doesn't require you to have a Masters to apply. You can get in with a bachelor's but research experience is quite important.\n\n3. I don't know how true this is but one of my professors told me if the program doesn't offer funding, it's probably a crap school anyway. Most programs offer guaranteed funding for this field. It's typically RA but in the case that your boss is broke, you can usually TA for department funding.\n\n4. Application deadlines are usually in December. Latest you should take the GRE (required examination for PhD programs) by late October/very early November as it takes ~2-3 weeks or so to get your scores in time for your application. Take as much time as you can to study for the GRE. Start scouting the programs you're interested in and prepare your personal statements etc. You'll need to plan time to get your professors to review them for you if you want.\n\n5. You won't know till you're invited for interviews. You can then talk to different faculty members and get a feel about their lab. Even within the same program there's different lab cultures depending on the PI. You won't really know until you join a program and do lab rotations and talk to the people in the lab.", "Permalink": "https://www.reddit.com/by_id/t3_3gcptr.json"}, "11": {"Subreddit": "PhD", "Author": "alphanumericsheeppig", "Date": "1439805859", "Score": 2, "Body": "Yes, it is OK. I wrote my thesis in LaTeX using TexStudio, and used Beamer for presentations. For tables and spreadsheets and stuff, I used LibreOffice Calc.", "Permalink": "https://www.reddit.com/by_id/t3_3harh6.json"}, "12": {"Subreddit": "PhD", "Author": "Max_Thunder", "Date": "1439912963", "Score": 1, "Body": "Very shitty. Lots of Ph.Ds don't find jobs and look for postdocs. Postdoc needs are a lot more precise, so you have to find the right postdoc at the right moment. There are a lot less scholarships and PIs would have to pay more out of their funds, so they don't want too many postdocs. Perhaps the situation is better in Europe, I heard Switzerland paid well.", "Permalink": "https://www.reddit.com/by_id/t3_3e4qcd.json"}, "13": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1439914997", "Score": 2, "Body": "The 3 points at the end paint a rosier picture than the way things actually are.  Take it from me, I got my Ph.D  in December, then congress cut the funding to my specific area of research.  Professors at NREL and CU Boulder told me they could not take me on as a post doc because of those funding cuts, so I applied to various other industry and government jobs.  \n\nWant to know what really matter most?\n\n1) Do you have a social connection to a person or people at the company, particularly the one making the decision to hire.\n\n2)  do you have between 3 and 5 years experience doing that specific job (quality assurance, quality control, environmental assessments).\n\ni had an interview at Hewlett Packard.  They wanted someone who could do Xray fluorescence spectroscopy, GCMS, FTIR, HPLC, UV Vis, flame ionization spectroscopy, etc, also they should know how to put a computer together and any mechanical engineering experience was a plus.  They offered $15/hour with no benefits.  I was still willing to do it cause my SO makes good money and it was good experience.  They turned me down after an interview, too overqualified they said.  Maybe there are industry managers who appreciate the skills a PhD brings to the table, but the far more likely scenario is that they are gonna hire the B.S. who knows a guy and has a year of experience doing the same job already.", "Permalink": "https://www.reddit.com/by_id/t3_3hfny4.json"}, "14": {"Subreddit": "PhD", "Author": "carlc75", "Date": "1439971370", "Score": 2, "Body": "Hi there!\n\nFully agree with your #1, networks matter and academia is a fantastic place for growing your own. Industry people go to conferences and you should talk to them!\n\nNot sure about #2 though, because if you are going for a role similar to your field, then the PhD is your experience doing that role.\n\nI'm unfamiliar with the American jobs market, but in the U.K. it's still quite rare for an industry manager to know off the bat what a PhD can offer them. That's where it falls on you to use your doctorally honed communication skills to market yourself and show them how useful you will be. \n\nA PhD isn't an automatic pass highly paid job, but used cunningly it can give you an excellent head start.", "Permalink": "https://www.reddit.com/by_id/t3_3hfny4.json"}, "15": {"Subreddit": "PhD", "Author": "legends444", "Date": "1440126396", "Score": 1, "Body": "People get stressed out about their PhD just like with any other educational setting or work environment. It's best to tailor any sort of advice or support to that particular context so that the information is relevant and you can relate to others.", "Permalink": "https://www.reddit.com/by_id/t3_3hspsr.json"}, "16": {"Subreddit": "DoctorZoidbergPhD", "Author": "orangepolders", "Date": "1440522846", "Score": 1, "Body": "unban hail69hydra", "Permalink": "https://www.reddit.com/by_id/t3_3fjbjg.json"}, "17": {"Subreddit": "PhD", "Author": "houdeshb", "Date": "1440598271", "Score": 1, "Body": "I found libreoffice/openoffice hard to use in academia.  When instructors or teammates would provide course or project material it would be in either Word, Excel, PowerPoint.  When viewing these documents in libreoffice /openoffice would throw off the formatting and be hard to follow or read, sometimes. I found Google Docs to be a great alternative - it has great support for Word, Excel, and PowerPoint.  In addition, my work is usually done in LaTeX for dissertation and PhD work.", "Permalink": "https://www.reddit.com/by_id/t3_3harh6.json"}, "18": {"Subreddit": "PhD", "Author": "FizDev", "Date": "1440635336", "Score": 1, "Body": "1) I typically search articles using [Google Scholar](http://scholar.google.com).\n\n2) Visit the websites of universities that interest you (e.g., [McGill](http://www.cs.mcgill.ca/research/areas), [Harvard](http://www.seas.harvard.edu/faculty-research/research)). By looking at their different research groups and the publications of the professors, you'll get an idea of what they are working on.", "Permalink": "https://www.reddit.com/by_id/t3_3e5fy6.json"}, "19": {"Subreddit": "PhD", "Author": "[deleted]", "Date": "1440667305", "Score": 1, "Body": "You'll get laughed out of the room or at least looked down by everyone because nothing will look like the way its supposed to in real Microsoft Office.", "Permalink": "https://www.reddit.com/by_id/t3_3harh6.json"}, "20": {"Subreddit": "PhD", "Author": "houdeshb", "Date": "1440689215", "Score": 1, "Body": "Your university library should have subscriptions to [IEEE Xplore Digital Library](http://ieeexplore.ieee.org/Xplore/home.jsp) &amp; [ACM Digital Library](http://dl.acm.org/) these are the best starting source for any research material.  In addition, if your university library doesn't have subscription to either of the sources then you can request student access.", "Permalink": "https://www.reddit.com/by_id/t3_3e5fy6.json"}, "21": {"Subreddit": "PhD", "Author": "redditmat", "Date": "1440693172", "Score": 1, "Body": "One of the things I worry about. I am considering working around these issues. However, I might succumb to the pressure and end up installing a virtual machine to get microsoft office working. \n\nThanks", "Permalink": "https://www.reddit.com/by_id/t3_3harh6.json"}, "22": {"Subreddit": "PhD", "Author": "DrSecretan", "Date": "1440807897", "Score": 2, "Body": "I have never known an undergrad research assistant. I'm in social science, maybe it's different in other fields.", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "23": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": "1440809165", "Score": 1, "Body": "Which social science? In psychology, all our research assistants are undergraduates.", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "24": {"Subreddit": "PhD", "Author": "DrSecretan", "Date": "1440814167", "Score": 2, "Body": "Ah, I'm in urban studies. I don't know much about psychology, but I hear you guys do a lot more manpower intensive research than we do, so I guess that's why we have less undergrad research assistants.", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "25": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": "1440814815", "Score": 1, "Body": "Lots of data collection, entry etc. ", "Permalink": "https://www.reddit.com/by_id/t3_3cbcyl.json"}, "26": {"Subreddit": "PhD", "Author": "bkabi", "Date": "1440995685", "Score": 2, "Body": "In the same boat. It's painful!", "Permalink": "https://www.reddit.com/by_id/t3_3j0nj8.json"}, "27": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": "1441008032", "Score": 1, "Body": "Very glad to have company at this dismal time.\nHow far have you got?", "Permalink": "https://www.reddit.com/by_id/t3_3j0nj8.json"}, "28": {"Subreddit": "PhD", "Author": "RussianWhizKid", "Date": "1441042411", "Score": 2, "Body": "I just started my PhD in MSE as well, what exactly happened, did you get stuck with a advisor you don't like?", "Permalink": "https://www.reddit.com/by_id/t3_3j3isv.json"}}