{"0": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1493652968, "Score": 3, "Body": "It depends on the field, in my field authorlists are normally 10+, so not many people can be first author's, i think as long as you have a decent number of publications with your name on them and can point your contribution to potential employers you'd be ok.", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "1": {"Subreddit": "PhD", "Author": "welp____see_ya_later", "Date": 1493660621, "Score": 6, "Body": "No first-author paper, recent Ph.D. grad here; interviewing now for industry, so I can comment on this pretty directly. Computational biology field, specifically. \n\nUsually, computational-oriented folks don't even think to ask (when I'm interviewing), but people with bio backgrounds do and often seem judgmental about that. I try to come up with a stock answer that spins things well, but, there's only so much I can do. Something like \"I took three projects to the point of publication but chose to focus on learning new things and moving on rather than publish them.\" \n\nI tend to think that this is a slight negative on my application, although by no means prohibitive in terms of being able to get offers. Most companies, after all, don't write papers. ", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "2": {"Subreddit": "PhD", "Author": "welp____see_ya_later", "Date": 1493660821, "Score": 4, "Body": "Of course, the real reason why I have no papers, more succinctly, or more to the point, is that my Ph.D. advisor sucked (shocker) and wouldn't help me actually write the damned papers at all, because he basically DGAF about my existence to the point where I often wondered if he even remembers my name. Fortunately I had the skills to learn how to do the research, but writing papers was too much. \n\nI guess there also is some truth to my explanation above, in the sense that if I thought it were really vitally necessary, I would have learned how to do it by myself or somehow found the help to do so, but knowing that I was going into industry, I didn't bother. ", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "3": {"Subreddit": "PhD", "Author": "Nishanthk", "Date": 1493675991, "Score": 2, "Body": "We have group meetings every week, and after 5 years each one is stressful to try to get enough meaningful results. What I've learned is, try to set yourself up with the work you're doing. Go back to the basics, outline your hypothesis for every experiment. Discuss your results in relation to your hypothesis. Then discuss what you think this means. Whether you think the experiment failed and why, or whether you think the results lead you to a new question and your next hypothesis setting you up for another experiment. \n\nI've found there are two distinct advantages to this. 1) sometimes when you think an experiment has failed, your adivsor/colleagues might see an anomaly that may be really interesting to pursue. 2) You get to constantly reaffirm the direction you're taking with your advisor. If you propose a new experiment then he knows what to expect the next meeting as far as results. \n\nLastly, this took my the longest to learn, be absolutely meticulous in the design and preparation of your experiment. Meaning, have a good reason/literature source for everything you do that way when/if something seems off you can be sure your process is correct and you can focus on what's new. ", "Permalink": "https://www.reddit.com/by_id/t3_66cnws.json"}, "4": {"Subreddit": "PhD", "Author": "Nishanthk", "Date": 1493676435, "Score": 1, "Body": "The GPA will definitely be a red flag, but PhD programs tend not to have hard cutoffs so you can come back from a 3.3 for sure. When I was applying I was told if you have &gt;3.7(which I didn't) you have nothing to worry about. Here are the two things that worked well for me to get around it. \n\n1) Network. Talk to advisors, see if you can do summer externships in labs you want to do your PhD in, and see if you know anyone who's doing a PhD at the schools or departments you're interested in. I know for our school the PhD students have a big say in who we accept/don't accept or even interview. So going to meet someone ahead of time could give you enough pull to get to the interview stage.\n\n2) Expect the GPA question. I got asked flat out why my GPA was low, and prepared a meaningful answer to the question and showed that I was able to do something about my grades later in college (I got a couple C's my sophomore year).\n\nAs for research experience, it doesn't need to be meaningful. Just needs to show that you worked in a lab, and can explain your experience and understanding of what that means. It's more of a way to see if you would handle the type of work in a research lab as its very different from industry. ", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}, "5": {"Subreddit": "PhD", "Author": "Seawallrunner", "Date": 1493691369, "Score": 2, "Body": "Yes, it's worth the extra effort and time. Keep at it.", "Permalink": "https://www.reddit.com/by_id/t3_68p1bj.json"}, "6": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1493697988, "Score": -2, "Body": "Gtfo", "Permalink": "https://www.reddit.com/by_id/t3_68p1bj.json"}, "7": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493705048, "Score": 3, "Body": "I don't think it would affect your employability at all honestly. If you can write a good CV with all of the awards, conferences, and co-authored papers as well as any other skills you've picked up along the way, I don't think many employees would even ask. I think all of that would make you pretty damn appealing to an employer that's in industry and not in academia.", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "8": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1493705779, "Score": 3, "Body": "I had a separate thread about working with a toxic supervisor :( The question I posted here is like a continuation of that. I had no choice but to take control to whatever extent I could and hope it'll do. I'm about 2 months away from submitting my thesis, so I'm nervous if the stuff I'd invested time in the past couple of years would be sufficient. Thank you for your insights!", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "9": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1493716184, "Score": 3, "Body": "I have had this exact question. I have two papers written... Ready to be sent out, but my advisor needs to look them over and edit them. He didn't do it for my thesis, just signed off. Some of the conclusions of the data he had seen for the first time at my defense, even though he had drafts of my chapters for over 6 months (graduated December weee). My advisor didn't get tenure and in my case is ultimately just lazy as he is always 'too busy' (regardless of doing 3 or 18 contact hrs a week). I have my thesis available on Google so if people want the information it is there (it was decently difficult to do, hidden Markov modeling and electrophysiology). I have given up having them ever published, but I am concerned about getting a job. I feel that maybe I just need to try harder xD.\n\nEdit:phone is dumb", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "10": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1493716663, "Score": 2, "Body": "Depends to be honest. My advisor, even though I was producing results, would get pissy if he didn't see us in the lab while he was at school. Basically he wanted us to be in the lab 50 hrs a week, even if we were reading papers. Some advisors require you to check in, like a job, and if you aren't there enough they get all edgelord like. Others only care about results (regardless of quality), and other advisors still have a happy medium (results and a decent amount of lab time). I would not worry about it unless your advisor mentions something. Another idea is to ask others their expectations. It's helpful to know what is expected of you.", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "11": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493719286, "Score": 1, "Body": "I'm sort of lucky in that my primary advisor is working on a different campus to me (my secondary's on my campus though so at least I can knock on someone's door if I need help). I catch up with him fortnightly ('cause he's too busy for more than that) and he's fine with that. Honestly it just seems like he wants to get papers published because that's what he can get his name on. So as long as I'm producing results he's happy. So yeah, advisors are happy it seems, I guess it's more just me feeling like I should be working longer, because I actually feel like my undergraduate degree was more time-intense. The PhD is more mentally full-on, but it's all just one giant \"subject\" so when I'm finished working on something and am waiting for feedback there's not much more I *can* do, which feels a bit unsettling after the stress of doing an honours year with coursework and a thesis all together last year.", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "12": {"Subreddit": "PhD", "Author": "ohmygammit", "Date": 1493738933, "Score": 2, "Body": "Depends what you want after you graduate, if you want to go to industry, then do what you need to get out asap. If you want to stay in academia, then reapply for grants and such and finish strong. ", "Permalink": "https://www.reddit.com/by_id/t3_68p1bj.json"}, "13": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1493765329, "Score": 2, "Body": "I've found graduate degrees.. have varying levels of busy. there will be times where you are super busy and overwhelmed and other times where you have very little to do (Except Thesis writing there is always something to do ). In my opinion it is the nature of the beast. \n", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "14": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493765916, "Score": 3, "Body": "Good: I learned a lot about myself. I i was taught a lot of skills like jumping through hoops, politics, surmounting difficulties, listening to advice, when something is a losing battle (when to back off) and when to stand my ground. I learned what sort of thinker I am. I learned that I am tenacious, determined, probably stubborn and by God I will finish what I start. \n\nBad: Mental health, physical health and finances... ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "15": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493766581, "Score": 1, "Body": "Um yea.....  \nMy boyfriend and I were joking about ways to fuck with him in the last couple of months. The last 6-8 months this got really bad. I just defended last week. Any kind of dealings with him felt like one step forward and two steps back. I started to feel absolutely insane. How many times can he ask me to do things differently? I swear he would have me do rewrites that just flip flopped back and forth. And there were a few emails that got contentious and I had to back off a bit. It felt like I was banging my head against a brick wall. ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "16": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493766773, "Score": 1, "Body": "Good work. That two weeks can turn into the worst six months of your life finishing your dissertation. That was my experience. I'll never learn though...", "Permalink": "https://www.reddit.com/by_id/t3_66fn2n.json"}, "17": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493766962, "Score": 1, "Body": "I don't have any help for you but formatting for me nearly pushes me over the edge.", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "18": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493770510, "Score": 1, "Body": "Well thank you for your opinion, it's rather reassuring! I have been continuously working on my thesis in the \"down\" periods, so I'll just keep on doing that :)", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "19": {"Subreddit": "PhD", "Author": "welp____see_ya_later", "Date": 1493779052, "Score": 3, "Body": "Good luck! Job searching sucks, I've found, but it's better than a Ph.D. for me still, because at least I don't have to deal with destructively critical labmates who I constantly felt inferior to.\n\nAlso it's a societally-recognized reason to be upset (looking for jobs). Tell a non-Ph.D. (i.e., most people) that being a Ph.D. student is making you sad and they'll look at you like you're a privileged, out of touch buffoon that can't appreciate your good fortune. Tell a non-Ph.D. that job searching is making you sad and they're more likely to emphasize, I've found, 'cause it's something most people struggle with at some point. So I guess it's less isolating in that way. ", "Permalink": "https://www.reddit.com/by_id/t3_68lvqn.json"}, "20": {"Subreddit": "PhD", "Author": "wyuchen", "Date": 1493781889, "Score": 1, "Body": "The hell is this?", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "21": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1493831857, "Score": 8, "Body": "honestly the first few weeks will probably be weird depending on your discipline and you'll be spending alot of time thinking what the fuck am I supposed to be doing. I'd schedule a few meetings with your supervisor, try to formulate a few ideas for a first project, and do general background reading those first few weeks + meet everyone else in the lab and just generally get comfortable moving in your new space/ office. You wont be expected to produce anything amazing your first month there. I'd spend your time there getting to know the ropes and coming to term with your subject area.", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "22": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1493835299, "Score": 3, "Body": "u/advait 's [post from 2 days ago](https://www.reddit.com/r/GradSchool/comments/68n2ec/graduated_a_few_days_ago_so_heres_a_list_of_my/) was SUPER helpful for me! I particularly liked the first book he listed: it's answering all the questions I have bubbling in the back of my head being in a similar position as you are right now, OP!", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "23": {"Subreddit": "PhD", "Author": "enpaix", "Date": 1493858485, "Score": 6, "Body": "I'm in Australia where we have a different process, but perhaps my story can help.\n\nAt the end of our first 12 months we have to submit an extensive 'confirmation paper' and present an oral report of our research. I'd had a busy 12 months working on a few other projects so wasn't fully on top of my phd, but managed to whack together the paper and my presentation went smoothly. Thought I was all in the clear, right?\n\nWrong!\n\nAt my panel meeting I got torn to shreds. Supervisors had massive problems with my design, methodology, research questions. I went in feeling confident and came out a deflated mess. They 'passed' me, but only on the condition that I submit my report again in 3 months time. \n\nI was flat, angry, frustrated. I felt like they didn't understand my project. I felt insulted that I was being made to jump another hurdle while all my peers were off preparing for fieldwork.\n\nThat was over a year ago now. What I've learned since is that a phd is not a sprint, it's a marathon. Everyone will have problems at one point or another. Everyone will hit a wall at some point (or 2, or 3, or 10). What's important is how you bounce back from those moments.\n\nStick with it, lean on those around you for guidance and support. Get angry and use that anger to show your supervisors they're wrong. Setbacks are frustrating, but with time and perseverance they pass. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "24": {"Subreddit": "PhD", "Author": "enpaix", "Date": 1493858680, "Score": 4, "Body": "Also definitely talk to your advisor about any mental health issues when you feel comfortable. It's academia, I'm pretty sure having a mental health problem is a prerequisite! ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "25": {"Subreddit": "PhD", "Author": "e2-718", "Date": 1493861524, "Score": 1, "Body": "I guess I've always wanted to make a career out of research. And even if I get to be a little older and realize that it's not something I want to do professionally I feel like going to a doctorate wouldn't be a bad move. I've always liked being challenged, learning new things and being a student. I understand that it's going to be more stressful and time consuming than working as an undergrad has been but to be honest as long as I don't put myself in debt getting an education I don't think I would mind spending a few years on it.\n\nAnd I haven't done much research on any specific programs or schools I'm interested in yet but I have taken a few classes on energy systems and I've gained a lot of interest in learning more about the subject. ", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}, "26": {"Subreddit": "PhD", "Author": "wyuchen", "Date": 1493868462, "Score": 3, "Body": "I cannot empathize, but I don't think you should be feeling \"extremely shitty.\" You know what could have been worse? Failing and getting kicked out of the PhD program. \n\nIt sounds like you're thinking about it like \"my committee doesn't think I'm qualified enough and have a good enough understanding to outright pass me.\" Instead, think about it this way: \"my committee thinks there are areas that can be improved on, but they think I have what it takes to succeed and they want me to prove it.\" Show them that you are capable of formulating your own ideas and conducting in-depth analysis. They are giving you a chance because they do believe you can succeed. So you should believe in yourself as well, saddle up, and show them how great you really are. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "27": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493871891, "Score": 5, "Body": "It sounds like you're pretty on top of it already! The most important thing to talk to your supervisor about at the start is what the broad plan is. By the end of my first PhD day I knew roughly what topics I was going to work on, for how long, and how it would all tie together. Having that big picture awareness has been very, very important for me when I hit motivational ruts (happens a lot).\n\nAlso if you're going to get started early, I would suggest learning about your field from sources such as textbooks, scientific articles, and so forth before diving into the super-technical literature. I'm lucky that my undergrad thesis led into my PhD topic so I already knew the field, but if you're starting on a new topic then I think it's a good idea to build up to it. You don't have to if you feel confident, it's just a suggestion based on how I felt when I started research.\n\nGood luck! I hope you enjoy your PhD rollercoaster ride :)", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "28": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493873245, "Score": 3, "Body": "Don't feel shitty! I know a few PhD students further along than I am, and a few of the ones who are excelling have been asked to re-do components. I don't think that it suggests you're not good enough or haven't done well enough, but rather that your panel believe in you and believe that you can do better.\n\nAs for your anxiety and panic disorders, you're not alone in the world of academia. I've got similar problems and doing a PhD has worsened them, and I'm seeing a counselor now. I definitely think you could tell your advisor about it without it sounding like you're blaming your disorders. Something like \"I've got anxiety problems so I find oral exams really hard, I'm looking forward to showing my understanding better during the written exam\" would probably work, but how you want to tell them is totally up to you. If you're not already seeing a counselor, most universities offer counselling services for free/cheap so you could talk to them about techniques to manage your anxieties in the context of PhD assessment and study. It can only help!\n\nGood luck with your written component, I'm sure you'll do excellently and prove that you know exactly what you're doing! :)", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "29": {"Subreddit": "PhD", "Author": "NoctoNeural", "Date": 1493876719, "Score": 6, "Body": "If seeing it work as you type is your concern, then you can check out online latex sites like sharelatex or overleaf. They are collaborative too. So multiple people can work on a draft at the same time. The advantages of using latex over any word processor is just huge. Oh btw, the online latex sites do support medeley integration. ", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "30": {"Subreddit": "PhD", "Author": "mosquitoman45", "Date": 1493877608, "Score": 4, "Body": "If as the previous poster said Latex is compatible with mendely (referencing software) then learning the new platform might be advantageous to you in the long run. \n\nYour supervisor may have some foresight and maybe pushing you towards latex for a specific reason. Try and clarify this with him/her.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "31": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493878458, "Score": 3, "Body": "Thank you!! I'm definitely going to check these out, this could be the perfect middle-ground solution. I haven't used mendely before, always EndNote, but I'm happy to learn new referencing software if it makes using LaTeX less painful!", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "32": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493878606, "Score": 2, "Body": "Yeah I'm definitely going to look into that! I will try to clarify with my supervisor more too. Every time I mention it he just says it's \"more powerful\" with no reasoning as to why. He has said it's good for maths, but my project is unlikely to have heavy maths until the later stages. Hopefully we'll find a middle ground that we're both happy with :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "33": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1493882762, "Score": 4, "Body": "In addition to these suggestions, I think getting to know people from neighbouring labs (and others within the department) because you'll be spending time and sharing spaces with them. Maybe you work in similar fields and they are good resources of technical expertise, research experience, etc. It's a fantastic place to start networking and make new friends. ", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "34": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1493883247, "Score": 2, "Body": "I have a similar issue. I find it hard to 'think' in latex. I just wrote a few pages in word,and then transcribed to latex. It took longer, but I treated it like a detailed proof read.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "35": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493885279, "Score": 1, "Body": "That's a good way to think about it! That was what I was planning if I can't come up with a better solution. The frustrating thing at the moment is that I wrote an entire article in Word and my supervisor didn't even know until I mentioned it, because it was based on a template from the journal and looked exactly the same. Bit hard to understand why he wants me to use something else when he couldn't even tell the difference haha", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "36": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1493885304, "Score": 3, "Body": "Depending on your field and cultural environment, a thesis manuscript can be huge. Some colleagues submitted 600-page dissertations, bibliography excluded. Word has a tendency to not properly function after a certain document size, and a thesis with pictures can rapidly grow.\n\nLaTeX is an acquired taste. It's got a (not very steep) learning curve, but once you're set you can't really go back, imo. Also, since it's all plain text, your document can be hundreds of pages long with dozens of images, it'll never crash. Internal references are very well integrated, too, making it a walk in a park (i.e. the kind of walk in which someone else is walking and you're just chilling in your stroller) when you change your whole structure and copy paste blocks of text from one chapter to another: when the document is compiled, the references just get updated, and work.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "37": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493885810, "Score": 1, "Body": "Thanks for your feedback, it does sound like I should give it another try. I'm in engineering, and I'm covering 3 pretty different topics so I do expect my thesis to be huge. Using a tool that aids in visualizing it as I go would likely help me use LaTeX more, so I'm going to look into that as well. Are there any resources you'd recommend for learning LaTeX effectively?", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "38": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1493886229, "Score": 2, "Body": "I just dove right into it really. If you're in engineering, LaTeX will help you greatly with displaying equations! \n\nAs someone else reported before, Overleaf is quite cool and I think it really takes you by the hand.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "39": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493886455, "Score": 1, "Body": "Alright, I'll look into Overleaf and give it another shot. Thanks again for your feedback. I feel a lot more optimistic about giving it a go after reading all these comments :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "40": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1493894405, "Score": 2, "Body": "Check out ShareLatex. It takes a lot of the hassle out of latex, renders in the same page, and is free and online!", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "41": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493896636, "Score": 1, "Body": "Thanks! I'll look into that one too. So many options!", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "42": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1493901149, "Score": 3, "Body": "The learning curve for Latex is really not that steep. In fact my girlfriend picked it up in a week for a manuscript, and she never used anything like that before and never wrote a line of code.\n\nThe main pro of Latex is that you only have to care about what you want to write. No need to think about how it is displayed : no more fiddling with margins, pictures, references and so on.\n\nHaving wrote manuscripts with Word first, then Latex : learning Latex was very quick, and I really don't want to use Word anymore, for anything.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "43": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1493905036, "Score": 1, "Body": "Thank you - I'll have a look in my current uni's library", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "44": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1493905092, "Score": 1, "Body": "Thanks for the advice. I'm excited to start!", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "45": {"Subreddit": "PhD", "Author": "babelbubbles", "Date": 1493907177, "Score": 2, "Body": "Try lyx! It shows you the formatting like word, but is latex under the hood! Great for gradually transitioning to latex without the pain. \n\nMaybe your advisor is being picky, but in some fields, not knowing latex is unacceptable- if everyone does collaboration in overleaf, you don't want to be the clueless person who's scared to edit things.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "46": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1493908186, "Score": 2, "Body": "I wrote my thesis in LaTex; I used a lot of high resolution microscopy in my work and frankly I think word would struggle to cope with the images. LaTeX manages this easily. My whole group uses it,so I didn't have huge choice. \n\nPublishing is a pain, my supervisor is very well established, and no journal will really turn him down. So he hasn't submitted anything in word in a while. No such laxity when it comes to the meagre plebs...so I spent a reasonable amount of time transcribing between systems. ", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "47": {"Subreddit": "PhD", "Author": "decon89", "Date": 1493919016, "Score": 3, "Body": "Following this. On my last year, feel that I have learn a lot, but how it will apply to future industry jobs is more uncertain. Mostly because I live and work in an academic environment which means my knowledge and focus is less on the newest thing in industry. Also, in academia we solely focus on research for the sake of research (or at least, this is the goal). Going into industry which focus on profit, feels a little alien at the moment. However, I can easily see there being a job available for me at the university, which I would go for.", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "48": {"Subreddit": "PhD", "Author": "JillianaJones", "Date": 1493919038, "Score": 5, "Body": "I think it depends on the field. My field, archaeology, depending on what you want to do the PhD may be a necessity, but if you're just wanting to do CRM or shovelbumming it, then the cost of the PhD, if not fully funded, is not a good return on investment and frequently not needed for the job. I can confirm for you that academia can absolutely get pretty toxic.", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "49": {"Subreddit": "PhD", "Author": "rranyard", "Date": 1493923636, "Score": 2, "Body": "What do you mean by toxic?", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "50": {"Subreddit": "PhD", "Author": "JillianaJones", "Date": 1493928338, "Score": 4, "Body": "It can be very cutthroat, paranoid, unethical, unsupportive, etc. ", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "51": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1493929305, "Score": 1, "Body": "I'd say that even if you have plans for being a professor, well, the stats in something like molecular genetics are not great. You'll need an addition 3-6 years of post-doc following your PhD and even after that, the number of people who end up getting a job in academia are like 1 in 6, and far lower than that if you are only looking at tenure-track research positions.  \nI don't want to discourage you, but when I started, no one mentioned the stats for this sort of thing.  \nHere's a [link](http://www.the-scientist.com/?articles.view/articleNo/47732/title/Addressing-Biomedical-Science-s-PhD-Problem/) to a recent piece on the topic.  \nIf you want a PhD, but aren't interested or optimistic about a faculty job, find a lab to get your PhD in that has a track record of getting their graduates and postdocs industry positions. In other words, plan waaaay ahead what you want to do and how you'll do it right from the get-go. Don't futz around waffling about whether to stay in academia or maybe go into industry or you'll end up being attractive to neither.", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "52": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1493929337, "Score": 1, "Body": "How easy will it be to change the template to one from another journal in word?", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "53": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1493929509, "Score": 2, "Body": "You're going to love bibtex referencing!", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "54": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1493932332, "Score": 4, "Body": "Work a full day every day. Come in at 9, leave at 5.30. Treat it like a job and you'll get loads done. If your contract says you have 6 weeks off, take 6 weeks off, not 8 or 9. When you get home, switch off. Keep work and home separate. Obviously there will be times where this is not the case and recently I have been doing some light work at home, or at the weekends, but just treat it like a job. Also don't bite off more than you can chew, but do take on a little more work to challenge yourself. I'm 6 months in with 1 published paper, and another one soon, and probably a 3rd before the end of the 1st year", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "55": {"Subreddit": "PhD", "Author": "rranyard", "Date": 1493932535, "Score": 1, "Body": "Ah ok yes definitely. I've noticed current department is very political with regards to who knows/likes who and who gets support/funding/recognition. ", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "56": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1493933574, "Score": 1, "Body": "I'm currently doing an MSc and I've been treating it like a 9-5 job with weekends off, so hopefully I can keep it up. \n\nAre you submitting your thesis by papers? ", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "57": {"Subreddit": "PhD", "Author": "Aleaj", "Date": 1493936800, "Score": 2, "Body": "I am pursuing my PhD in an industrial environment (I would say 90% of my time in my company, 10% at Uni when I need to do some testing and experiments). This way makes it a work experience on its own.\n\nEven if you don't want to stay in Academia forever, having completed a PhD (no matter the topic) proves that you can carry your own project out, manage it, do the research, the admin, the writing part and so on. It proves that you are an independent researcher, you can build a plan of experiments, compare it to the literature and identify the gap in knowledge (in no particular order).\n\nI see it as a way of developing a thinking process and experimenting it, more than learning something on a specific topic (after all, it's still called a Philospher's degree, the thought process is in there !).\nIf money is not an issue (my PhD is fully funded), it's definitely worth doing if you're interested in research and curious. \n\nedit: typos", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "58": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1493938613, "Score": 1, "Body": "Probably not, I asked about this but my supervisor isn't keen on the idea and neither is the university's official stance. Writing a thesis in full will give me something nice to have and look back on when I'm done. Also many people still look down on the PhD by publication. It would be easier though, probably why people don't like it", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "59": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493938782, "Score": 1, "Body": "So you did need to use Word when targeting journals?", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "60": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493938848, "Score": 1, "Body": "It probably wouldn't be too easy, but my supervisor wants me to target exclusively IEEE journals, so they all have the same template. ", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "61": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493939009, "Score": 1, "Body": "I'll have a look at that. I have so many options to try now haha. Seeing the formatting while using LaTeX is really the perfect solution. I'm not worried about having to write the formatting in \"code\" because like, computer systems engineering degree, but I just find it really difficult to visualize and write when I can't see what it is actually going to look like. So yeah. Both is ideal haha. Thanks for your help :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "62": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493939082, "Score": 1, "Body": "Well now is the perfect time for me to give learning it a go. My supervisor had me writing an article from day 1, but with that done I can spend more time on my dissertation and learning LaTeX to go along with it. Thanks :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "63": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493939562, "Score": 5, "Body": "Hi! I'm nowhere near finishing my PhD, but I thought I'd tell you a few things my close-to-the-end or finished friends have told me. A lecturer and now a friend of mine gave me the advice \"If you want to go out and earn lots of money, don't do a PhD. If you want to be an academic or get into research, even in industry, you need to do a PhD\". I made a decision to do a PhD based on that advice.\n\nWhen I started my PhD, I thought that it probably wasn't going to help me get a job in most industries other than research-based ones. However several people have told me that the employment prospects for PhD graduates are much, much higher than undergrad or masters graduates. This is in Australia though, so it might not be the same everywhere. For me it was reassuring to know that even if I didn't get my dream research job, I'd have good chances anywhere else as well. It makes sense really - by completing a PhD, you prove that you're self-motivated, capable of collaboration, able to specialize, and dozens more things.\n\nLastly, just about everyone I know says it's affected their mental health. So that's probably why you've had people telling you it ruined their lives and self-esteem. As long as you can manage your time in a way that you still do things you enjoy, and are able to seek help if you need it, then you'll be able to manage a PhD. Oh, and if you've been accepted into a PhD then you are definitely not dumb - more like the opposite of it.\n\nSorry that I can't share my own personal experience too much, but hopefully the advice others have given me will be helpful to you too :)\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "64": {"Subreddit": "PhD", "Author": "elemonop", "Date": 1493945803, "Score": 1, "Body": "Thanks for your reply! It is a fully funded position (otherwise I wouldn't be able to do it) and it's in a good institution as well so I would hope that it will be worth it in the end. \n\n\nI don't mind having to work long hours , but I find toxic the fact that being abusive to yourself and team is okay as long as you publish. Also the pressure to get grants for research and the related.", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "65": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1493945998, "Score": 1, "Body": "Did you defend successfully? ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "66": {"Subreddit": "PhD", "Author": "elemonop", "Date": 1493946038, "Score": 1, "Body": "Thanks! What you learnt might not be directly applied to industry jobs but I would think that a set of skills you gained during the PhD would come in handy. Also, hopefully the PhD would se you apart from other candidates. \n\n\nI think in the industry there's a lot more money to do research, even if the goal is profit. I hear that securing grants in academia is a very tedious process. ", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "67": {"Subreddit": "PhD", "Author": "elemonop", "Date": 1493946325, "Score": 2, "Body": "Thanks for your reply! Well, in case I decide to go down the professor path, I would start applying to post-doctoral positions during my final year. Otherwise, I'd apply to industrial jobs. I know that it is insanely competitive and it's only going to get worse.\n\n\nThe lab that I'm most probably going to join is a fairly new lab and no PhD students have graduated yet. Although, the lab consists of around 10 people and most are post-docs. I don't think there are any labs in my institution with a known track record of getting alumni into industry positions. I think I will have made up my mind towards the end of the degree (hopefully).", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "68": {"Subreddit": "PhD", "Author": "elemonop", "Date": 1493946494, "Score": 5, "Body": "Thanks for your input! Yes, I would think that even if you don't end up  directly putting your PhD to work, it still give you good credentials and a skill set that will be appreciated by any employer. Mine is fully funded as well, so hopefully it will be worth it! Part of the PhD is to undertake a professional internship for a few months so that should give me a glimpse of the industrial world. ", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "69": {"Subreddit": "PhD", "Author": "elemonop", "Date": 1493946828, "Score": 2, "Body": "Hey, and thanks for replying! Sometimes, yes, I hear many people saying that job prospects for PhD graduates are much better than the rest. But, I've also heard you might be considered overqualified or end up doing jobs that earn you the same salary of someone who only has a master/bachelor's degree which would be useless (I'm in the UK).\n\n\nThanks for the words of encouragement and good luck to you for the rest of your PhD!", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "70": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1493958097, "Score": 1, "Body": "It depends on where you want to end up career-wise. Do you want to do lab work at a company or university or do you want to develop and manage the research? Some people are very happy just doing the bench work and some people want to plan it and be in charge of directing the actual work. You just have to figure out what you want. There is something for everyone.\n\nYou will get a higher profile job, have better prospects for advancement and make more money with a PhD. In life sciences or physical sciences, that is. If you are thinking of biotech then a PhD is absolutely required for high level career advancement, but not required to work in biotech and carve out a niche for yourself.\n\nGetting a PhD is hard. It is an insane amount of work and mentally very taxing, both emotionally and intellectually. For me it was worth it. You just have to decide what you want.", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "71": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493979598, "Score": 1, "Body": "I did. Just about at my breaking point with everything. Part of me wonders if he was just preparing me for it because I thought he was going to nail me with all the crap he has brought up in the last few months. I became a neurotic mess and felt like every time he would read something it was like he was reading it again for the first time. He brought none of it up. I stressed so much about every crazy thing he came up with in the last 4-6 months to the point of almost losing my mind. I walked out of there in disbelief. I almost ran off of campus because I didn't want to see any member of my committee thinking they might change their mind. Hahaha. ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "72": {"Subreddit": "PhD", "Author": "lintelotiel", "Date": 1493979637, "Score": 3, "Body": "I have worked with both LaTeX and word for writing theses (LaTeX for honours, and word for my phd). Word really struggled at times with the large document (especially with the very large references library) and several 'glitches' crept into the file that would have to be manually fixed each draft (yet magically re-appeared the next time the file was opened). LaTeX was great and is particularly necessary within some scientific and mathematical fields - I'm sure elsewhere as well. There are many features I like in word and I find it more intuitive to use usually (mainly because I've used it more), but LaTeX is more powerful, has the same features if you go looking, and for large projects definitely my preferred format.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "73": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493980679, "Score": 2, "Body": "Qualifying exams were the worst part of the PhD in my opinion. What I can see now, in retrospect, is that they helped me truly get a handle on a subject area. Conditional passes/revisions were relatively common in my dept (I had revisions on both qualifying exams.) This really solidified, for me, the value in the somewhat ego crushing process of having to revise, reorganize, do over, etc. i didn't have to do a lot of that during coursework. Quals were almost an exercise in revisions and dealing with a committee that had all different notions of what they wanted. It was also an exercise, in the ego crushing sense, of having to do what they wanted in order to pass the dang thing, as excruciating and lame and nonsensical as some of the revisions were. I felt like my dissertation was growth from that where I had to learn where to stand my ground and acknowledge when I had to do what my advisor and/or committee and (in my case because I am in social sciences,) what the IRB wanted. So it was a learning process in two ways. It took me a few years for me to appreciate the painful experience. I do appreciate it because I really believe that it expanded the breadth of my knowledge in the field and that it gave me that foundational background. The revisions were part of that. And just the whole difficulty of the  process does serve a point, at least it did for me. And, there were some people in my dept that outright failed and had to retake their exams. I think on all levels from what I have heard from others and my own experience is that it sucks. It's like you can soar through coursework and then get punched in the face. Working through it will make the other stuff that comes later seem easier. At least that was my experience. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "74": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493981322, "Score": 2, "Body": "Oh and the anxiety stuff? Yea. I started seeing a therapist and that helped. But during my phd defense last week, as usual, I started sweating and going off on tangents and got through about half of my slides. I even made a joke about it. I also blanked on an important question. I got some feedback from my advisor about the fact that what I blanked about was in my dissertation's policy recommendations and he said something along the lines of \"even if you don't remember it.\" I was like \"yea, story of my life. Not new news.\" So I took that feedback in stride. I passed. I know it's a issue of mine. I made a joke about how I am about to drown in my own sweat. Some people are better at this. I'm a work in progress. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "75": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493982020, "Score": 2, "Body": "One other thing. My advisor does know about my mental health stuff but it was a decision I thought about. He was informed through the university, officially, as a disability (which gives you no passes in grad school.) however someone mentioned doing it this way because then it cannot (or should not) be used against you and is subject to privacy laws. \n\n\n\nAnd another thing, your advisor probably has an idea of your capabilities from working with you. I don't think it's too uncommon, especially with orals, to blank on stuff. That's just my opinion though. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "76": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1493982703, "Score": 2, "Body": "Yes. Many journals want word submissions since the editing and layout aren't done in LaTex compatible systems.", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "77": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1493982838, "Score": 2, "Body": "I just completed my phd last week. As of this past Tuesday, I may actually have had a PhD however, I don't know exactly when those letters are attached. \n\n\n\nAm I walking in graduation asks everyone I know?\n-nope, didn't plan ahead. Didn't open those emails. \n\n\nWhat am I doing next?\n-I'm not really sure exactly.\n\n\nI am an awful planner. However, I am stubborn and hard working.", "Permalink": "https://www.reddit.com/by_id/t3_67kf49.json"}, "78": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1493984184, "Score": 3, "Body": "&gt; I'm not the biggest fan of the work of an academic,\n\nThen why are you even considering a PhD? Outside of academia, a PhD is hardly a career booster.\n\n&gt; but realise that [a PhD] will likely be less stressful than the same work if I were to use my MSc and go for an MBA.\n\nI think you're going find some pushback about that, a PhD is hardly a walk in the park (which is why you should absolutely *not* do one unless you enjoy the work of an academic and are actively pursuing a career in academia).\n\nAs I understand it an MBA is for those *already* in a management position and need the resume boost to move higher up the ladder. Regardless of your grades, I expect you'll have trouble getting admitted into a worthwhile school without any management experience. It's not my field though, so I could be off base...\n\nHonestly, it sounds like you're sticking to what you know (university) because you're good at it. Given that you've been studying business strategy for the last four years (I assume your undergrad was relevant to that), go out and use your knowledge! In 3-4 years time, you'll probably be lucky you didn't invest that time in a doctorate and you'll be in a far stronger position to pursue an MBA.", "Permalink": "https://www.reddit.com/by_id/t3_69dxsf.json"}, "79": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1493986595, "Score": 2, "Body": "I'm gonna disagree that a PHD is hardly a career booster. It depends on the field. Going into molecular genetics with biotech in mind? A PhD is your golden ticket. It depends on your field and ultimate careel goals.", "Permalink": "https://www.reddit.com/by_id/t3_69dxsf.json"}, "80": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493987307, "Score": 2, "Body": "Thanks for your feedback :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "81": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493987351, "Score": 1, "Body": "Okay, I'll have a look into whether that's something I need to worry about too. Thank you :)", "Permalink": "https://www.reddit.com/by_id/t3_695hx7.json"}, "82": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1493987949, "Score": 2, "Body": "/u/Stinky_McCrunchyface is right to be fair, but I can't see a PhD boosting your career prospects in business enough to justify the time. \n\nIt's good that you weren't planning on trying to jump straight into an MBA, thanks for clearing that up. I think regardless, a year or two in industry will give you a different perspective and allow you to re-evaluate your goals. Not to mention it would be nice to have some money for a change, ha!", "Permalink": "https://www.reddit.com/by_id/t3_69dxsf.json"}, "83": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1493994671, "Score": 2, "Body": "As a strategy professor your primary focus would be research (and some teaching) but you will also be able to do consulting.\n\nI don't think an MBA will be a major differentiator in the US - it's becoming the new bachelors (top ~10 schools excluded). On the other hand - if you did a PhD in strategy at a good US school, you could get a foot in the door in the States and land a job as an AP after making 6 figures (in the US). Having said all that, it's not a means to an end, you have to have a passion for it ", "Permalink": "https://www.reddit.com/by_id/t3_69dxsf.json"}, "84": {"Subreddit": "PhD", "Author": "decon89", "Date": 1493999143, "Score": 1, "Body": "Indeed. I'm sure that what I have learnt can be applied to industry. Depends on your field of study. I do interaction design in childrens education, which is very much integrated with industry. If you have studied something like philosophy, I would imagine it being harder to find a job - just an assumption that I have. ", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "85": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1494007194, "Score": 1, "Body": "This is not going to be a popular response but you can't and shouldn't blame your failure on your anxiety and panic attacks. Whilst that may the underlying cause as a scientist you will have to give presentations and answer questions, you will have a viva and you need to be able to communicate your ideas well, if you can't then maybe you shouldn't be doing a PhD. I'm sure you do really know your stuff but that's the reason for this conditional pass, and you have to prove it. Sorry to hear about that, but they've given you a chance, so seize the moment. Work on your verbal skills because it's an important skill for any scientist", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "86": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494013932, "Score": 1, "Body": "I understand what you're getting at, but I am well aware of how important verbal skills are and I am a fine presenter, teacher, and communicator. General knowledge oral exams are different in the sense that you have no idea what you're \"presenting\" on. You have to learn as much as possible and hope they don't ask about that one thing you forgot to look over. I've become very good at managing my anxiety in most every situation (I've had it most of my life), but this was a whole new ballgame. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "87": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494014086, "Score": 3, "Body": "I am thoroughly convinced that being a good researcher only requires an ability to handle rejection and a huge amount of perseverance XD", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "88": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494014148, "Score": 1, "Body": "You may be right about that! ^_^", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "89": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494014444, "Score": 1, "Body": "I agree! I will definitely use this as a learning experience and another chance to prove myself. I just have to rest my mind and then get back to it! ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "90": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1494014580, "Score": 1, "Body": "Yeah but the idea of an oral exam is to test you on the broad range of your subject, there is no cramming for all the sections. You should know the whole subject inside and out, so that when they ask you a question you dont even need to think about it", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "91": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494014895, "Score": 1, "Body": "Lol but that's completely unrealistic. No one knows any field inside and out. And of course it's not about cramming. I was reading and thinking through ideas for months on top of working at least 11 hours a day including weekends. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "92": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1494016842, "Score": 2, "Body": "A few reasons: it felt like the right time - I'd finally worked out a good topic and found a supervisor, plus I was in a job where I had this horrendous bully as a boss. So I decided to quit, and start uni part time, while working part time. I've had to take a huge pay cut (c. $15,000) but I know it's temporary, and luckily my family are supportive.", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "93": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1494025601, "Score": 1, "Body": "Well, I was a school teacher so with my assistantship I'm only making about 8k less than I was before. ", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "94": {"Subreddit": "PhD", "Author": "professormoriarty5", "Date": 1494025649, "Score": 2, "Body": "Man that's rough. I'm glad you got to vent like you needed. If it helps, I read your vent and I feel for you!\n\nI don't know about other fields, but in my field that kind of treatment is pretty unheard of. I have heard of neglectful advisors (mine definitely is) and intense advisors (I have someone on my committee like that), but never one that actively insults you and your work. All negative comments I have gotten have always been constructive. I'm glad you are transitioning to a different advisor (I'm not quite sure how that works; I have the same advisor from entering the program until graduation). I found my advisor to be too neglectful for my taste so I got some mentors from a national lab and am working there until graduation. It's made me feel so much happier in my PhD work. Hopefully the same happens to you after you switch advisors!", "Permalink": "https://www.reddit.com/by_id/t3_69gh63.json"}, "95": {"Subreddit": "PhD", "Author": "josephtheepi", "Date": 1494027128, "Score": 1, "Body": "I should say the drop in income (assuming the going rate for RA stipend) would be between $25k-$30k per year.", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "96": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1494031895, "Score": 2, "Body": "This was a big factor for me. I had just gotten promoted when I got an offer to go back, but the promotion had me heading straight into corporate middle management - something in which I have no experience or desire to take part. I figured that out at about the same time the offer for a PhD spot came in. Also, my pay wasn't supposed to much of a cut - so we figured that either way in 3-5 years I'd be making very little, may as well have a PhD and a chance at a career I'll enjoy. \n\n*edited to add that the pay cut was larger than advertised ", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "97": {"Subreddit": "PhD", "Author": "fukkmewbagofdix", "Date": 1494034205, "Score": 1, "Body": "My new advisor is awesome so I think things will get better. It just put me in such a funk. Thanks for reading ;)", "Permalink": "https://www.reddit.com/by_id/t3_69gh63.json"}, "98": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1494042862, "Score": 1, "Body": "Congrats to you though!!! ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "99": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1494046892, "Score": 4, "Body": "I left a very nice salary, because even when I'd gotten the promotion, worked with great people, worked flexible hours, found a clear career path...I still hated my job. Granted, some of it was the nature of the industry and the clients, and some of it was having to do what someone else wanted me to do, but I just wanted to get back to my studies and what I care about.\n\nIn the back of my mind I knew I always wanted to go back to school - I loved my major in undergrad and wanted to delve in further, but after I'd kind of worn out the interest in industry, I sat back and went, \"huh. I guess it's finally time!\" \n\nAnd I don't regret it a bit. Compared to most grad students, I have a nice amount saved up for the future, and I've found I have a lot more perspective and wisdom (not knowledge, for sure, but wisdom) than some of my peers. I appreciate my flexibility, I love being able to study what I want and take classes, and I am on the way to doing what I've always wanted to do. Having worked makes school that much more precious. And, as a nice bonus, it made me stand out as an applicant.\n\nI also choose to actively not think about the fact that I will be making less when I get out than I did going in ;) I don't know if PhD has the best ROI in many cases....but I'm happy to be here.", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "100": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1494057310, "Score": 0, "Body": "Is not having one affecting your work? I don't have one and I think I'm doing fine. ", "Permalink": "https://www.reddit.com/by_id/t3_69j5wb.json"}, "101": {"Subreddit": "PhD", "Author": "sethzard", "Date": 1494061616, "Score": 1, "Body": "I found it's mostly about making sure you know your stuff. Be able to to talk cogently about any lab work you've done and why you want to do the project. ", "Permalink": "https://www.reddit.com/by_id/t3_69k6g2.json"}, "102": {"Subreddit": "PhD", "Author": "ImSingleItsTerminal", "Date": 1494062896, "Score": 1, "Body": "I thinking venting is a good idea. Don't feel bad about posting this!\n\nActually, something I've noticed in other subs is a weekly complaint and weekly praise thread. It's something that can be created by an automoderator. I think it's a good idea for this sub too. ", "Permalink": "https://www.reddit.com/by_id/t3_69gh63.json"}, "103": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1494075467, "Score": 2, "Body": "Besides the obvious preparation in terms of knowing about 'stars' in the field that you're interested in, and your perspective supervisor.  Id say prep on some of the key strengths of the institute.\n\nA few things I noticed from my interviews last year, which I hadn't really seen online was the question \"Explain your Master's research to someone without a scientific background\".  Surprisingly it's hard to do that on the spot, so definitely think about how you could engage the public and by doing that you'll have practice in explaining complex things in a much more simpler way.\n\nAlso think of some other questions like if I were to ask you which figures from past and present would you invite to a dinner party and why.  \n\nEdit:\nAnother key question I was asked multiple times was regarding a scientific problem and how I dealt with it.  At the time I had an issue with an experiment so I didn't have my answer but I explained what I was doing and planning.  I later found out they liked that I had a calm attitude to problems, and dealt with it in a methodical way.\n\nI was also strangely asked in one interview (my very first one and I totally messed it up) how would I deal with conflict in a laboratory environment.  There's a very good chance none of these things will be asked but I thought it would be good to share the broad angles they could come from.\n\nMore than anything you just need to convince them that you're a calm, collected and capable person.  Don't be too confident because it reads as arrogance and no one wants to work with arrogant people, but don't be too self-deprecating because you do need a strong spine for a PhD in any field.  I wish you the best of luck!  If this studentship doesn't pan out then don't be too deflated, my first interview was what I thought was my dream position, but I ended up doing my PhD in a much better institute and with a better team.  Good luck! x", "Permalink": "https://www.reddit.com/by_id/t3_69k6g2.json"}, "104": {"Subreddit": "PhD", "Author": "josephtheepi", "Date": 1494076682, "Score": 1, "Body": "Very thoughtful insight. Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "105": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1494079303, "Score": 0, "Body": "Do you mean a tablet/laptop combo? I've found that having a laptop and external monitor work much better so you're not hunched over a small laptop screen trying to read for hours. ", "Permalink": "https://www.reddit.com/by_id/t3_69j5wb.json"}, "106": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1494087663, "Score": 2, "Body": "After doing my master's I had 3 different jobs in science (one of them being a very nicely paid pharma position), and I went back to do my PhD at 28. And really, I didn't think twice about it. After working for a few years, I knew it was what I wanted to do, and the prospect of losing the decent paycheck for a few years wasn't a real concern when I knew it was the right choice. Even if the PhD doesn't work out or doesn't help you achieve what you intended, it's still better than looking back in twenty years time wondering if you should have gone back to school to do the PhD you always wanted to do.", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "107": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1494088094, "Score": 3, "Body": "I wouldn't try to gauge your work based on hours spent working. I know some PhDs who spend a good 12 hours a day in the lab/office, but spend half that time pissing about/talking/watching videos on youtube. But they say they work 12 hours a day.\nI worked in industry before my PhD, so I try to keep regularish hours of 8-5 mon-fri, though obviously get caught working longer sometimes.\nI'd definitely reiterate asking your advisor if they think you're on track and achieving enough.", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "108": {"Subreddit": "PhD", "Author": "PersianCats08", "Date": 1494094665, "Score": 1, "Body": "Breathe. ", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "109": {"Subreddit": "PhD", "Author": "Akropop", "Date": 1494095148, "Score": 4, "Body": "You might be able to put it in a proceedings paper. Two birds, one stone.", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "110": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1494095818, "Score": 5, "Body": "Usually your PI will have a good feel for this. They need publications too. It also depends on your field. Working on Cas9 or HIV, think long and hard. Working on fish herpesviruses, probably unlikely to get scooped.", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "111": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1494096289, "Score": 1, "Body": "I'm not working on world-changing, hot topic stuff, so I guess I will be fine. I do utilise some custom-designed lab equipment so I suppose it will be a case of just not giving away too much detail.\n", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "112": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1494103254, "Score": 1, "Body": "By the end of a PhD you are expected to be THE expert in the very niche field you have worked on, so you should have good groundwork ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "113": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494105494, "Score": 1, "Body": "I agree, but that by no means requires knowing every idea tangentially related to your research inside and out by the second year of your program. We're always learning, yes? It's okay not to know it all. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "114": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1494107886, "Score": 2, "Body": "I present unpublished work but usually when I'm already about to start writing it up (or already doing so).", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "115": {"Subreddit": "PhD", "Author": "mensgarb", "Date": 1494111522, "Score": 11, "Body": "In my field, it's standard to present research at a conference in order to get a first round of feedback before submitting for publication.", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "116": {"Subreddit": "PhD", "Author": "FutureDrHou", "Date": 1494115536, "Score": 7, "Body": "But it feels good. ", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "117": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1494126732, "Score": 1, "Body": "Thanks :) So far so good with my supervisor, I'm actually ahead of schedule with my first major milestone so that's good. I'll just keep checking in with him, and making sure the time I do work is productive time.", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "118": {"Subreddit": "PhD", "Author": "feces4all", "Date": 1494137579, "Score": 1, "Body": "I'm doing the same/similar thing as you. Teaching at a small university and trying to get a PhD at a bigger one. Teaching three+ courses at a time and taking 2 at a time. \n\nYou are not crazy. But it is extremely stressful. No one else understands. Hearing other people in this thread trying to do the same thing as me is actually somewhat a relief. \n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "119": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1494142173, "Score": 1, "Body": "The way I perceive it, there are two sides to this attitude.\n\nOn the one hand, it sounds like your present mindset  probably allows you to devote more than sufficient efforts to your project, which should -in general- ensure that you can succesfully wrap this study up in a timely manner. A PhD is mostly about gaining experience, and that requires time and dedication, as you are demonstrating. The sooner you can get the formalities over with, the earlier you can focus on the next step in your career and life. You're PhD project is already in full swing, but you are obviously free to seek out opportunities associated with more personal freedom after it is over. Showing dedication will furthermore increase your appeal towards future employers and may open doors that would remain closed otherwise. \n\nHowever, a PhD project can also escalate. The stress  that often accompanies the PhD lifestyle makes us more susceptible to psychological predicaments than most other demographics, which is obviously detrimental to the efficiency and creativity we all seek. There is also something to be said for growing as a person rather than just as an academic. Academia is not the healthiest of environments and only moving in that ecosystem will not only challenge your psyche but also your view of world, despite it all probably not being as bad as it may seem. Such effects are to be avoided: happiness remains more important than academic success!\n\nTaking a step back every now and then will allow you to evaluate your progress and to consider your approach to challenges more objectively. Personally, I also choose to allocate some time for fun side projects. These force me to shift focus, allow me to learn new things and may still result in a publication, which may help me later as well. Returning to the main tasks at hand afterwards makes them briefly feel like a \"new\" endeavour rather than more of the same. Finally, be programmed to also actively seek romance, excitement and leisure from time to time. This relativates the importance of the project you are working on and will make you into a more experienced and \"life-smart\" person, which will positively influence aspects superseding your academic career! ", "Permalink": "https://www.reddit.com/by_id/t3_69pdpl.json"}, "120": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1494142774, "Score": 5, "Body": "I worked 25 hours a week for 4.5 years after my bachelor's to get my PhD, was published numerous times in high impact journals, and now I'm doing a post doc at a school that is #9 in the US in my field.\n\nI'm not saying this to brag but I just want people to know it's not all horror stories.", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "121": {"Subreddit": "PhD", "Author": "Arfusman", "Date": 1494156097, "Score": 8, "Body": "I'm in the second year of my PhD and I'm really enjoying it. The research is cool and it's nice to be totally in charge of the direction it goes. \n\nNot all horror stories! ", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "122": {"Subreddit": "PhD", "Author": "Littlemissquick", "Date": 1494156163, "Score": 4, "Body": "I haven't published yet (I'm in the middle of my fieldwork/data collection) and it's not a priority of mine right now. In many way I'm behind the curve of the others in my cohort (took quite a bit longer to do my probationary viva), and still feel like I have a long way to go in understanding all of the literature relevant to my field... but for all the stresses and uneasiness I wouldn't change it at all because my way of thinking and understanding the world is already so much deeper and empathetic than when I started. It's humbling. So maybe not masochistic in and of itself but addicted to the growing pains. ", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "123": {"Subreddit": "PhD", "Author": "Arfusman", "Date": 1494156528, "Score": 6, "Body": "Yeah Id almost say that most presentations I've seen at conferences were either unpublished or in review ", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "124": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1494164746, "Score": 4, "Body": "*60% of the time - works everytime*", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "125": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1494171838, "Score": 1, "Body": "That's logical. I suppose it's reasonably unlikely for someone to copy the work and beat you to publication if you're already close to submitting it.", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "126": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1494174685, "Score": 5, "Body": "I, too, felt this way three years ago....", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "127": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1494174803, "Score": 3, "Body": "Yep. On paper I'm quite successful. In reality I'm probably going to master out this summer. ", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "128": {"Subreddit": "PhD", "Author": "PwincessBwuttahcup", "Date": 1494189795, "Score": 2, "Body": "Yes.", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "129": {"Subreddit": "PhD", "Author": "rws247", "Date": 1494254941, "Score": 1, "Body": "This behavior is search-engine specific. Where are you searching? Maybe that search engine uses a different system?", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "130": {"Subreddit": "PhD", "Author": "Embers93", "Date": 1494255128, "Score": 1, "Body": "Hmm, I'm searching PsycInfo. I'm not sure I have a way around that? ", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "131": {"Subreddit": "PhD", "Author": "rws247", "Date": 1494255747, "Score": 1, "Body": "At the very least, you could try omitting 'of' from your search. They don't seem to respect the quotation marks anyhow.", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "132": {"Subreddit": "PhD", "Author": "Embers93", "Date": 1494255868, "Score": 2, "Body": "I'll give it a go *sigh* thanks for your help :) ", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "133": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1494265418, "Score": 1, "Body": "Thank you all for the answers. They helped a lot\n", "Permalink": "https://www.reddit.com/by_id/t3_69k6g2.json"}, "134": {"Subreddit": "PhD", "Author": "epigeneticjoe", "Date": 1494268900, "Score": 6, "Body": "Rankings are less important than the actual pipelines individual graduate programs have as to where their graduates end up (postdoc, professorship, govt, industry, etc).\n\nDoing your PhD at your undergrad institution is usually discouraged, some fields see it as an opportunity to work/learn from a different set of faculty mentors.", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "135": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1494277071, "Score": 6, "Body": "I could be completely off here based on your field (which I have no experience with), but the program ranking should not be a primary reason to choose a program.  The department faculty and your adviser are much more important factors in my experience.", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "136": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1494285608, "Score": 5, "Body": "Rankings mean nothing. Your advisor, your work, and the connections you'll get from the two of those mean everything. ", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "137": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1494295741, "Score": 3, "Body": "Thank you all for the answers! I really appreciate the reassurance and the education that rankings don't mean shite. :) Crisis averted.", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "138": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1494298838, "Score": 1, "Body": "\"Managed to get a 6 week lab project' - Where exactly did you attend because this is a very poor model. For my Bsc I did a 12 week project and a small 4 week project. For my Masters I did 9 months. My gf has 2 published paper for her Bsc (very very lucky, but still). I had none for my masters but by the time I came to Phd I had a lot of research experience. You essentially have less than a 2 year student who decided to do a summer project. My advice would be to do another masters, as this wil set you up well. Maybe just apply to lower ranked institutions. Plenty of people start Phd late, the reason many people in their 30's dont graduate is because they have a wife and kids, and priorities change. life gets in the way", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "139": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1494345046, "Score": 1, "Body": "We've all been there before. Once you start, you'll wonder why you were ever concerned. ", "Permalink": "https://www.reddit.com/by_id/t3_69z4qh.json"}, "140": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1494354860, "Score": 6, "Body": "Of course you can say you are already a PhD student, it gives more credibility to your stance such as having more taining and possessing more independence. Your academic merit has been validated by your current university. You also have experience in applying for grants, and great technical and communication skills.\n\n'Erasing a year and a half of work' and hiding your progress is not how I would sell myself. My perspective from hearing what you described is you pushed for progress and wrote a high ranking grant proposals with minimal resources and limited guidance. If the labs you applied is in your field of expertise, showing them skimmed version of your grant application (not whole idea to be scooped) and a proof of your rank should attest your expertise. Every PI would appreciate a highly independent student who comes trained. \n\nAs for the reason to jump labs, I feel 'my lab ran out of funding and my research is not supported by any grant' is enough reason to switch labs. Mentioning you being a not good fit only brings more questions and scrutiny. Now, the reality is whenever you switch labs (I did once in my 4th year within same school), the first thing PIs would do is to talk among themselves because they are on the same side. So they would write emails to your advisor asking how this student is blah blah. Just be ready to take some negative pressure from your current advisor. Now go write those emails with the confidence as an expert who can bring grants into the lab of your choosing. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6a70b3.json"}, "141": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1494367714, "Score": 3, "Body": "https://www.youtube.com/watch?v=4MkRMp3roKQ\n\nhttps://www.youtube.com/results?q=PhD+tips&amp;sp=EgIYAQ%253D%253D", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "142": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1494368070, "Score": 1, "Body": "Thank you - I'll check them out ", "Permalink": "https://www.reddit.com/by_id/t3_690wm7.json"}, "143": {"Subreddit": "PhD", "Author": "mechmathy", "Date": 1494371216, "Score": 3, "Body": "My advise would be that you should first talk to your current advisor about how you feel, and let him know that you are planning to move on. I still can't read how he is as a person or how your relationship is exactly, but optimistically speaking he should help you move on. On a pessimistic note he might not help you, but it would anyway be better to get it cleared. \n\nWhen you do apply to new professors, I would suggest to be honest and open about what you went through, and why you plan to move to a different lab. But you should also put a positive spin to it highlighting your work and contributions over the last year. Yes, I would mention it in the initial mail itself, and also in the CV. \n\nYou should definitely not feel yourself to be a failure, and you should not erase what you have done. From what I have seen, it is very common to shift labs for a PhD. It is like finding a partner for four years or much more, and taking time in finding the right person is worthwhile. Think about how you would look back at this 10 years down the line -- an year spent in another lab would not change much to your career. I think it is very important to have the right advisor through your PhD, it can change many parameters of how your career gets shaped.\n\nMost often your professors from your previous university would not have a problem in writing the letters again, especially when they know you personally. Again, just being honest about it to them would also help them tune their letters to your advantage.\n\nHope that helps! With that I wish you the very best in finding the right place, where you can enjoy your graduate studies!", "Permalink": "https://www.reddit.com/by_id/t3_6a70b3.json"}, "144": {"Subreddit": "PhD", "Author": "m_m_m91", "Date": 1494377178, "Score": 3, "Body": "I strongly advise you to talk to your current advisor first. Chances are the next position you apply is going to get in touch with your current advisor. Academia is a pretty small world, people know each other, take no risk talk to your current advisor be honest to him. \n\nAlternatively the easier way out is to try and ask for more help. You could look for someone who knows what you are doing and tell your advisor to put you in touch with that person for more guidance. \n\nBut your current advisor needs to be aware of your plans. Unfortunately thats how academia works your whole life kind of depends on your advisor. ", "Permalink": "https://www.reddit.com/by_id/t3_6a70b3.json"}, "145": {"Subreddit": "PhD", "Author": "Saikoujikan", "Date": 1494379825, "Score": 3, "Body": "Sorry, meant to write 12 week lab project for the MSc. Not sure why I halved it in my mind. I'll edit that in the main post. The MSc was at Bristol, and it was a combinations of Taut modules with a number of exams, a 3000 word literary review, and then the 12 week project assessed by a project proposal, dissertation, and defence. All in the span of a year.\nDid you by chance do an MRes?\nI don't tend to apply based on the institution rank, I apply based on the science being done. I couldn't care less where on the league table the university manages to get itself, if it's got a good Immunology department, then I'm all over it.", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "146": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1494456615, "Score": 4, "Body": "You're retarded. ", "Permalink": "https://www.reddit.com/by_id/t3_6acdga.json"}, "147": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1494492617, "Score": 1, "Body": "I had similar issues regarding even asking for references. Emailing potential supervisors was really hard, I used to get super scared sending.", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "148": {"Subreddit": "PhD", "Author": "ursath", "Date": 1494496873, "Score": 2, "Body": " *I can't bring myself to keep asking her to take a look at it*\n\nYou need to address this. Now. During your PhD, you will constantly be exposed to situations in which you are stuck. Asking for help and for input is part of being an academic. \n\nOf course it is normal to be worried; this is new territory and you are tackling things you haven't done before. But being a good researcher also includes what you do in the face of adversity. Many PhD students waste as much as 2 years being stuck on a method or literature review or writing. Do you want to be that guy?\n\nYour future supervisor has given you feedback and you haven't responded in 4 months. Your internal struggle looks different from the outside: maybe you just don't care enough to reply in 4 months- no-one knows what is going on inside you. \n\nTry and see your potential supervisor face to face. Be upfront about what you are stuck with. A good supervisor knows how difficult starting off as a PhD student is, and she will have been through some of those things herself. She won't bite your head off. And if she does, she's not going to be a good supervisor for you.\n\nIf you can't speak to her, speak to someone else at your current institution/department, perhaps a lecturer that you used to get on with. If emailing is too formal &amp; stressful, look up their office hours and drop by. Literally start with \"Hey, I am applying for a PhD and I am looking at this topic. I am stuck with X. Since you are well-versed in the area, I was wondering if you could perhaps give me a few pointers of where to look?\". You're not asking for them to do the work for you, just advice.\n\nDon't forget, a PhD is meant to be hard. You are not meant to know the things that you don't know. That's ahead of you. Best of luck.", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "149": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1494508108, "Score": 9, "Body": "First off, congratulations on your PhD! That's a huge achievement and you should be celebrating that, not stuck in this terrible situation. Also sorry to hear about your health issues. No job is worth sacrificing your health over and that should come first, always.\n\nI'm sympathetic to what you're going through as I had big issues with my supervisor too. It sounds like you're being taken advantage of here, and I advise you to start protecting yourself asap. I don't know whether you should quit, but I do advise you to do the following:\n\nCollect any and all evidence of inappropriate requests, unfair demands, etc. Create a paper trail by communicating through email, and save those emails.\n\nTalk to HR or your department confidentially. Show them said evidence. Holding the possibility of a reference over your head like this is extremely unprofessional. As is expecting you to be an unpaid lab tech. Find out what your rights are. You might find, like I did, that your supervisor's threats are empty because you own the intellectual property on your PhD work. This varies by institution but if it turns out you own it, then you can publish it without her if you choose.\n\nWhatever you choose to do, I hope it works out for you! Good luck!\n\n*Edited to add: I'd be surprised if she is allowed to fire you and get someone else to finish YOUR paper based on YOUR data. That certainly wouldn't fly in my area, in fact she would have no claim on the data at all unless you signed it over. First point of call should be finding out who owns the data!", "Permalink": "https://www.reddit.com/by_id/t3_6ajs3a.json"}, "150": {"Subreddit": "PhD", "Author": "tripreality00", "Date": 1494508645, "Score": 3, "Body": "You'll probably get a lot of flack for an online PhD in this sub. I'm currently doing my PhD online from Rutgers and will be taking my qualifying exam in the fall. I'm doing my PhD purely as an achievement for myself. I've been working in industry full time and have no intentions of working in academia. You should probably discuss with the program and your advisors how dissertation hours work for you. ", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "151": {"Subreddit": "PhD", "Author": "ShadowRex", "Date": 1494508994, "Score": 2, "Body": "I appreciate your comment. Do you have an advisor, and if so have you discussed or determined what level of commitment the program takes on top of a full time job? Do you already have a masters degree, and how long are you expecting your program to take? Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "152": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1494510194, "Score": 3, "Body": "&gt;I have been the unofficial lab tech throughout my PhD . . . \n\nHey I do this too (2nd year PhD)! I thought I was the only one. \n\n&gt;She has refused any holiday request, including a request to see my father . . . \n\nWhy do you have to ask for time off? I don't even tell my adviser unless I'm going to be gone for multiple days and need somebody to take care of the animals in my absence. \n\nKudos to you for being mature and working hard. I may have quit \"with prejudice\" and done something immature and unprofessional. I wish you the best for your health. ", "Permalink": "https://www.reddit.com/by_id/t3_6ajs3a.json"}, "153": {"Subreddit": "PhD", "Author": "gracethefishy", "Date": 1494511781, "Score": 2, "Body": "Yes. This is why I am also a distance swimmer.", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "154": {"Subreddit": "PhD", "Author": "tripreality00", "Date": 1494513878, "Score": 2, "Body": "I do have an advisor. I just completed my second year in my program and only have two courses left before I've met my requirements before dissertation. It's taken just as much work as a full time job in my opinion and has been hard to balance at times. I had an undergrad degree in a related field and had an MBA when I started this program. I have 7 years to complete my program but I am on track to finish in 4. ", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "155": {"Subreddit": "PhD", "Author": "ShadowRex", "Date": 1494514032, "Score": 2, "Body": "Have the first 2 years only been taking graduate level classes? If so, I feel relatively confident in being able to balance that after getting my M.S. part time. I do need to follow your suggestion of determining what dissertation hours look like since I really have no insight into that.", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "156": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1494515043, "Score": 1, "Body": "Super congrats on your PhD :) :) I'm in the middle of setting up my thesis defense right now *internalscreaming*\n\nYou haven't said where in the world you are - if you are in Europe or some other country with good health care it might be worth a trip to the doctor to say all that you said here, no sleep, always stressed, plus other health concerns on your plate and ask if he can suggest a short period of mental health leave. It would give you some time to gather your mental/emotional resources which are understandable depleted following a long period of working in such a stressful environment. \n\nLook after yourself, self-care is important and you have a lot on your mind right now. Sending you good vibes from California :)", "Permalink": "https://www.reddit.com/by_id/t3_6ajs3a.json"}, "157": {"Subreddit": "PhD", "Author": "nohwonlyabrokendream", "Date": 1494520516, "Score": 1, "Body": "12 week is still pretty short. Im getting my MS in Biochemistry in America. This is my first year. We focus little on classes, i only have to take 6 classes which Im almost done. The only time I spend doing lab work. Our thesis project is usually 16 months long. At the end of it you should have enough data to at least publish 1 paper in a journal. I agree with /u/ssrix maybe you should do another masters. You should apply in the US, you get a stipend to do your masters so you dont have to work while you study. You do however have to TA some classes though.", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "158": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1494521059, "Score": 1, "Body": "so adding up to mental damage, you want to receive muscle and physical damage as well? \n\nwe are soul mates. doing karate in spare time just to keep my PhD barely surviving. ", "Permalink": "https://www.reddit.com/by_id/t3_69oald.json"}, "159": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1494533273, "Score": 2, "Body": "Right, you have to kind of know your field to know if an online PhD is worth it. I'm not in engineering, but in my field of education depending on what you want to do online is okay. Probably not if your dream is to be a university professor but just fine for principals. Researchers would depend on the company culture. ", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "160": {"Subreddit": "PhD", "Author": "gamorasoya", "Date": 1494535432, "Score": 1, "Body": "It is true that if I got into a PhD program, being stuck is a given. The difference my brain sees is that I am not yet in the program, hence, I should not be entitled to asking/showing my draft for a professional's opinion. I know, it's very DUMB and sad. \n\nAnd nope, I certainly would not want to be the same guy being stuck on something over and over again. If that happens though I would start questioning the reliability of the supervisor/supervisors advice. \n\nWhen I received her comments, i did reply back immediately saying I will take her suggestions and send another draft once everything is done. Youre right though, maybe she thinks im not into this because i havent sent the updated piece after months. Seeing her face to face can be the best solution if only I was in the same country as shes in at the moment. Darn it..\n\nUgh this brain of mine just worries too much, too much of little things. Because I tend to keep typing and deleting things thinking it isnt good enough or perfect. But believe it or not, your reply gives me a push to not think too much about what she will think of my draft. I'll send in the draft as soon as I make the necessary changes better and see how it goes. Thank you again. Cheers!", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "161": {"Subreddit": "PhD", "Author": "gamorasoya", "Date": 1494535693, "Score": 1, "Body": "Well, that is exactly how I am at the moment. The salutations and closing words are still difficult for me! Have you gotten over this horror I feel? ", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "162": {"Subreddit": "PhD", "Author": "ursath", "Date": 1494540654, "Score": 1, "Body": "Please believe me when I say- this is completely normal. Really. So, so, so many PhDs start off thinking that they first need to be perfect or get everything right, and then you are entitled.\n\nAs someone who supervises undergraduates, let me tell you this: If I didn't think someone could do a PhD, have what it takes, I would never agree to be their supervisor. The fact that your potential supervisor AGREED to supervise you is a sign. She wouldn't have gone over your application if she felt you wouldn't be up for it anyway. \n\nIt's neither dumb or sad, it's a long journey and you are just starting off. I would recommend checking piledhigheranddeeper comics; it really helps knowing how common your feelings are. Most PhDs are superb undergraduate/postgraduate students with top marks, so they are used to surpassing all expectations. But a PhD is hard, and you can no longer do that. So that feels like you've regressed- but things have just gotten harder.\n\nDon't beat yourself up so much :) You'll get there! Maybe check academia.stackexchange, lots of questions of pre-PhD students in similar positions. It can help to know you are not alone, even though it might feel that way!", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "163": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1494541472, "Score": 1, "Body": "Regarding your first paragraph, you should make sure you are not too niche (warning bells go off in my head anytime I hear a prospective student saying they found the holy grail of research that no one has done before). Most of the low hanging fruit in marketing and management has already been explored (if it's important to marketing and management, it will have been explored; that means if it hasn't been explored, one of your tasks is to convey the importance of the topic you are interested in studying). You want to have a research program broad enough that you can get an academic job when you graduate (schools will evaluate your potential to publish). \n\n  \nThat being said, having a professor look at your work and give you honest feedback will greatly increase your chances of having a workable research proposal.", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "164": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1494541619, "Score": 1, "Body": "Imo, once it's past first round of reviews, is a good time to start sending off unpublished work to conferences. (In business)", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "165": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1494541713, "Score": 2, "Body": "I had to force myself through it, I thought of  in like this \"I want this more than I am scared of this\" may not be the best way, but it worked. ", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "166": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1494541860, "Score": 2, "Body": "I was bored, frustrated, underappreciated, squandered and unhappy. A PhD is always something I thought I would do, I didn't even care I was earning less money", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "167": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1494541900, "Score": 1, "Body": "also, guardians of the galaxy reference in name? ", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "168": {"Subreddit": "PhD", "Author": "gamorasoya", "Date": 1494591178, "Score": 1, "Body": "Thats actually a good way to think about this whole thing. Since I received replied on my post, ive decided not to mind what they think about my draft and me personally. Theyll either like me or not and theyll forget about my funny sounding emails in the long run anyway :D\nAhh..gamora, yes from guardians of the galaxy haha! I couldnt come up with a username that hasnt been used yet and i just came back from watching the movie so..", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "169": {"Subreddit": "PhD", "Author": "gamorasoya", "Date": 1494592012, "Score": 1, "Body": "I cant thank you enough, really! I think PhD comics is hilarious and yes ive been checking it out through an instagram page. I'll be surely checking out academia.stackexchange because I havent heard of it before. Thank you again!", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "170": {"Subreddit": "PhD", "Author": "gamorasoya", "Date": 1494592708, "Score": 1, "Body": "Yes that was my main worry before I talked to my potential supervisor. Since it is in her field, she gave pointers and assured that it is a good topic to tackle. I dont think it is a holy grail but it definitely is an interesting topic to research on. Few articles have suggested to think about going this route under their future research/limitations since it could be a fruitful one. \n\n**\"one of your tasks is to convey the importance of the topic you are interested in studying\"**\nThat is the main thing im finding difficult. Ive tried to point out its importance but it just sounds too general. \n\nI am very thankful that she agreed on looking at my draft but cant help thinking that it's a waste of her time. Nonetheless I'll try one more time and see where it goes! Thank you for replying :D", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "171": {"Subreddit": "PhD", "Author": "TrappedGrad", "Date": 1494601409, "Score": 3, "Body": "I'm also someone who's got a project where I've discovered that 90-99% of the science underpinning it is all flawed/false.  \n\nI think to me, that was the biggest red flag.  I've been in longer than you it sounds like...almost three years now.  I'm throwing in the towel, hope you are able to make up your mind.", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "172": {"Subreddit": "PhD", "Author": "cmarvel09", "Date": 1494602777, "Score": 3, "Body": "First of all, I have no experience in doing PhD, I'm still at Master Degree, so I don't really know how it feels like. However, this is my thought.\n\nFirst thought : do whatever makes you happy. If quitting makes you happy, then just quit. I feel like if you don't want to do it (you're pissed off, etc), then why bother doing it everyday?\n\nSecond thought : well I wrote this second thought after re-reading your post. Especially at 90% sure that your project doesn't make sense. Hello, if you're still 90% sure, don't quit. 10% is a big number for a chance in science. Even 99.99% space of an atom is empty, but you know what, there is a nuclei in that 0.01%. I'm not trying to convince you about your decision though, but look at the positive things. \nYes I know that science projects are not easy. I experienced it myself and I'm confused as hell. But I think that's why people called it 'research'. That means you have to search all over again. So for me if it's 90%, don't just quit. At least finish what you've started. I know it hurts everyday and it's going to take maybe 2 or 3 years more, but once you quit, then you're throwing away your almost 2 years in PhD.\n\nFinal thought : It's all your decision. This is only my honest opinion from a student who will pursue a PhD degree.", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "173": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1494608923, "Score": 1, "Body": "Australian here. Here you will need to have a supervisor set up before you apply however there are no application fees. If you have a supervisor set up, you have the entry requirements (we normally require a masters or honours year after undergrad with a 70%+ average) then you're in. That's it really. Also our PhDs have no coursework and are 3-4 years long. You may choose to take free coursework if you don't know the subject though.\n\nEdit: I'm pretty sure New Zealand is the same.", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "174": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494609883, "Score": 1, "Body": "So it's similar to what I've encountered in the U.S. where I need to contact professors before officially applying? ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "175": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1494610014, "Score": 1, "Body": "Well there's a step in the application that asks if you've spoken to a faculty member. I'm not sure how good your chances are if you answer no to that. I do know a couple of international students who were \"set up\" with advisors after applying but they are all funded by their home governments so I think that's a different situation.", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "176": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494610616, "Score": 1, "Body": "Ah, okay, thank you. :) ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "177": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1494610801, "Score": 2, "Body": "I use mendeley. I have a feeling it'd suck if you don't use Latex and Bibtex though.", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "178": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1494611971, "Score": 1, "Body": "I write everything (grants, manuscripts, etc) in google docs these days and use Paperpile (paid, but relatively cheap) for citation management. Works slick.", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "179": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1494612695, "Score": 1, "Body": "Been using a pirated version of endnote for about 8 years now. Works well and it integrates well with word", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "180": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1494616105, "Score": 1, "Body": "I did my PhD in the Netherlands; I'm from Canada.  All PhD \"students\" are actually (relatively well-paid) research employees there, and as a result all funded PhD positions are listed up as jobs on the university's job vacancy website.  You certainly would never pay to apply for a PhD there as it is merely a job application, and you apply to the specific job rather than to the university or department in general.", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "181": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1494617237, "Score": 10, "Body": "I currently use Mendeley and it works a treat", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "182": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494618708, "Score": 1, "Body": "I did look into one uni in the Netherlands and I did get that impression. I emailed them a question and didn't get a very helpful response... maybe you could answer this: \nI assume then, that whatever the \"job description\" is would then be my dissertation work? Like I couldn't get a position at a uni in the Netherlands where my hired duties would be related to one field, but then do my dissertation on a completely different subject? They are one in the same? \nAlso, just asking this because of your username: is your career or degree in chemistry or plastics? ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "183": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1494619469, "Score": 2, "Body": "The job description is the project you will be working on for four years, and which you will write a thesis on.  You can't do your dissertation on a different subject because you're expected to be working 9-5 M-F on the project that funds you.  Fortunately, though, the descriptions are short and 4 years is a long time so there's usually a fair bit of room for side projects or some \"interpretation\" of the project like adding new bits or changing the emphasis depending on your interests.\n\nI would suggest looking into NL for a PhD, as the programs are generally very well-set-up.  You get paid well, expected to work normal adult hours, lots of vacation days, a decent pension, access to good healthcare, and no coursework.  You do have to have a masters degree first though, which I realize isn't a given as you're in the US. \n\nMy degree and career are in engineering (though I do spend a fair bit of time doing chemistry these days!); the username is a [music reference](https://en.wikipedia.org/wiki/Polyphony) to stuff like [this](https://www.youtube.com/watch?v=3s45XOnYOIw).", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "184": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1494624751, "Score": 2, "Body": "Zotero works great. Open source with a lot of add-ons... ", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "185": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494625275, "Score": 1, "Body": "Thank you for your advice, that was really helpful! I'm definitely going to look into the Netherlands for more PhD programs. \nAnd I learned about polyphony, which was nice.  :)\nThat music was beautiful. ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "186": {"Subreddit": "PhD", "Author": "normabatty", "Date": 1494626307, "Score": 2, "Body": "You can always try to search with \"quality\" AND \"life\". Also defining proximity, eg. You want the search terms to be 2 words away from each other: n/2 (will get more hits but it also means to extend the search results to areas you haven't thought of- might be beneficial). You will need to check the rules for the database, they use different ways of defining proximity (sometimes n/2, sometimes n(2), etc.). Also in the case of quality of life there are many acronyms used in the literature eg. QoL, QL. Another way it's to do with \"Joker\" characters eg. \"Quality*life\" or \"quality*of*life\". This will bring up the different results regardless of the way it's written in the paper. I'm only using PsycInfo through EBSCO, so I'm not sure it will work for you but maybe worth a try.", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "187": {"Subreddit": "PhD", "Author": "normabatty", "Date": 1494626600, "Score": 1, "Body": "Sorry just realised that some characters are missing from the text. So in the last section I meant: \"quality * of * life\" or \"quality * life\" The \" * \" usually replaces any character which could be unknown.", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "188": {"Subreddit": "PhD", "Author": "sethzard", "Date": 1494626844, "Score": 2, "Body": "It works just as well it you use word as there's a great plugin ", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "189": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1494627994, "Score": 1, "Body": "Fellow dyspraxic Brit here *waves*\n\nHave you learned Norwegian?", "Permalink": "https://www.reddit.com/by_id/t3_6at356.json"}, "190": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1494629690, "Score": 1, "Body": "I like qiqqa for annotating and organizing papers, it has a ton of useful features like automatically analysing the text and classifying papers by theme, and creating brainstorms of how papers are linked. But it doesn't work very well with word, so for formatting the bibliography I use endnote.", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "191": {"Subreddit": "PhD", "Author": "Saikoujikan", "Date": 1494635083, "Score": 1, "Body": "The vast majority of the Tech positions available require a minimum of 1 or 2 year's experience with the techniques they perform, for example, flow cytometry.\nAnything that didn't have this minimum requirement that was even tangentially related to Immunology or molecular biology I applied for, but if I did manage to get to the Interview, it was usually the same story. There were other candidates who had more experience.\n\nIf you're telling me that not having at least three published papers by now is the main reason I'm out of luck, then I guess there's no real way out of this. I've wasted my chance.", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "192": {"Subreddit": "PhD", "Author": "narcolepticscientist", "Date": 1494643235, "Score": 1, "Body": "Another vote for Paperpile. Totally cloud based (via Google Drive), fast search, easy to customize with color coded tags &amp; folders, intuitive navigation that shares a lot of keyboard shortcuts with Google products.\nIt's best as a reference management system, less useful for cite as you write unless you're already doing that in Google docs. ", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "193": {"Subreddit": "PhD", "Author": "mtb_addict", "Date": 1494643242, "Score": 1, "Body": "I've used endnote, Sente, and now zotero. If you are using something for a reference manager AND a place to store and organize pdf's I'd say zotero out of those. 20 bucks a year seems to be plenty of space for me (PhD candidate), but I'll be happy to pay more because the tags sort pdf's well, and I can easily modify reference styles to fit certain journals. Hope that helps. I think mendaley is very similar ", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "194": {"Subreddit": "PhD", "Author": "acmoraes", "Date": 1494647381, "Score": 2, "Body": "I liked Umberto Eco's little book on \"How to Write a Thesis\". It's deeply outdated but there are many messages from the wise man that translate well into current times. ", "Permalink": "https://www.reddit.com/by_id/t3_6as5a7.json"}, "195": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1494651516, "Score": 1, "Body": "I take quick notes and annotate in Mendeley and it becomes like my own personal annotated bibliography. Plus, defining a ref style for copying refs was easy. I like it. Some quirks for synching between computers, e.g. you need to go into options and tell it to copy new files into a certain folder - the default is off.", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "196": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1494651663, "Score": 1, "Body": "What do you plan to study? I can give you an overview of universities in the EU", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "197": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1494651973, "Score": 2, "Body": "To answer your question - \"dissertation hours\" is where you pay the school for credit hours with no grade attached so that they can extract the full 3 or 5 years' tuition from you.\n\nIt seems like a legitimate program from a legitimate school, so the \"online\" part might not be as bad. Honestly in a regular Systems PhD program on campus you would probably end up going to campus only once per week to meet your advisor anyway, so at that point it might as well be online.", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "198": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1494657907, "Score": 1, "Body": "I think it depends on what you'e done with your time. If you've been full time studying the whole time then it's probably okay. But if you can get some casual work as a tutor I'd definitely recommend it. Aside from the obvious advantages to your work experience history, it's helped me a lot with talking to groups, explaining things to others, and other useful skills for a PhD/the real world. The money is a nice perk too ;)", "Permalink": "https://www.reddit.com/by_id/t3_6986k3.json"}, "199": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1494658409, "Score": 2, "Body": "Hi! I'm doing a PhD in engineering in Australia. There's no coursework subjects, but there are a few major milestones along the way that come with certain tasks you need to complete:\n\n* Confirmation of Candidature - done between 6-12 months into your PhD, usually involves submitting a project proposal and some of your literature review, as well as presenting a seminar about your proposal.\n* Mid-Candidature Review - not sure if this is at all universities, but at mine it's done between 1.5-2 years and is basically just some paperwork. Also need to have done 80 hours of professional development.\n* Pre-Completion - done up to 6 months before submitting your thesis. You present a seminar summarizing your work and do some more paperwork.\n\nEvery six months we also do \"progress reports\" that are basically a piece of paper asking us how we're going.\n\nIn terms of publishing, it varies between types of PhD. For engineering, you're expected to publish at least one paper per research chapter of your dissertation - so the chapters where you actually DO stuff. \n\nIn terms of money, there are LOTS of scholarships available for students (even international students). Usually these are paid as a fortnightly stipend to help you focus on your studies, and are enough to cover the essentials like rent, food, etc. With some good budgeting, I still manage to put a fair bit into savings from this.\n\nYou don't have to teach, but I'd 100% recommend it. It gives you work experience and so many new skills, and it's a really enjoyable way to get away from your own work from time to time. It's also extra money for not that much work. I'd hate to not be teaching.", "Permalink": "https://www.reddit.com/by_id/t3_6an8mu.json"}, "200": {"Subreddit": "PhD", "Author": "floodedbard", "Date": 1494658951, "Score": 1, "Body": "**Enthusiastic Wave Back!**\n\nI'm learning, but I'm dreadful with languages. In almost every respect there is no excuse for my not to be fluent at this point, but a combination of laziness and the crippling boredom I experiences in lessons has held me back.\n\nI have learnt much more Norwegian in my working life, but I am 3 years or so from being a good commander of the language.\n\nI am rather embarrassed by it to be honest, it's the one bit of this move I have messed up. Easily fixed though :)", "Permalink": "https://www.reddit.com/by_id/t3_6at356.json"}, "201": {"Subreddit": "PhD", "Author": "Mouspikpis", "Date": 1494670098, "Score": 2, "Body": "You mentioned that your mind went blank and could answer simple questions. Do you think that their decision was unfair? It sounds like you just did not do well this time and they are giving you a chance.", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "202": {"Subreddit": "PhD", "Author": "ShadowRex", "Date": 1494675550, "Score": 2, "Body": "Thanks so much for your insight! If that's the case it seems very doable to continue to balance school and work.", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "203": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1494675783, "Score": 1, "Body": "I'm the same - shit at learning other languages. But I do think if I lived somewhere it'd be a bit easier. Good luck with your Norwegian quest!", "Permalink": "https://www.reddit.com/by_id/t3_6at356.json"}, "204": {"Subreddit": "PhD", "Author": "Saikoujikan", "Date": 1494682008, "Score": 1, "Body": "I tried asking my contacts for referrals, but the only thing I was able to get was the voluntary experience provided above. Everyone else is struggling to keep their labs open. For example, one person at Bristol's immunology department was keen to have me send my details for an upcoming tech position in their lab, but no less than a month later had to withdraw the offer, stating they couldn't possibly afford to hire any more staff as funding was drying up. Going blind has been my only choice.\n\nI did try sending e-mails directly to the academics running the labs, though would only get a reply informing me to refer to their website and apply through the normal channels. The one time I did get a informational interview, they concluded that they simply didn't have the funding for an extra person.\n\nIt's lead me to believe the only real way I can get anywhere is by going through these normal channels. So I've been scouring  jobs.ac.uk for things that would be relevant, but the vast majority of stuff there is either Postdoc or requires a year's experience as a prerequisite.", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "205": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494683449, "Score": 1, "Body": "That would be great, thank you! \nI would like to study plastic waste in the ocean - specifically, analyzing the biofilm of the waste for marine fungi and bacteria species that may be degrading the plastic. I would also like to culture these found species and do bioremediation trials on the same plastic waste.\nI've been looking into environmental science, ecology and evolutionary biology, and microbiology programs. ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "206": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1494683742, "Score": 4, "Body": "Zotero 100%", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "207": {"Subreddit": "PhD", "Author": "turnipforwut", "Date": 1494685849, "Score": 2, "Body": " Oh, absolutely! It's definitely a second chance. It still leaves me feeling defeated and questioning my abilities, though. My logical side 100% sees it as an opportunity, but that doesn't stop my emotional side from feeling a little down, ya know? I have to find the balanced mentality that uses my logical side while being patient with my emotional side, which is the tricky part moving forward. ", "Permalink": "https://www.reddit.com/by_id/t3_692b2h.json"}, "208": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1494688708, "Score": 2, "Body": "Number of ways to convey significance.\n  Can be significant because of the number of people it affects, amount of money it costs, its overall effect on the \"real world\", aka substantive significance.  \n  \nCan also be significant because of its contribution to theory, you are helping to shed light on constructs which are relevant to your discipline. Here you have theoretical significance.\n  \nIf you google scholar articles in your field, there will likely be some nice papers about how to make a contribution to your field.", "Permalink": "https://www.reddit.com/by_id/t3_6aiut2.json"}, "209": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1494690843, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6as5a7.json"}, "210": {"Subreddit": "PhD", "Author": "acmoraes", "Date": 1494691001, "Score": 1, "Body": "Of course it's not very useful on the practical side of things, that I understand you are looking for. ", "Permalink": "https://www.reddit.com/by_id/t3_6as5a7.json"}, "211": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1494691380, "Score": 3, "Body": "To be honest OP, I agree with your advisor. I am a PhD student in EE (Signal Processing) so we have some overlap.\n\nI never use a routine in a library that I didnt implement at least a rudimentary version of beforehand. My feeling is, if I cant implement it and design unit tests for the associated routine, I dont really know what it is doing and therefore I shouldnt use it because I cant explain it. If I cant explain it, I cant understand the implications of its use, and if I ever created a product that uses said technique, I better darn well know the ins and outs when it hits the fan (because it inevitably will -- there are always corner cases and the world always designs a bigger idiot).\n\nSo my response would be, \"Yea I dont know exactly, but it seems like it is giving me the exact same results on my unit tests with respect to the version I built myself.\"\n\nGo implement Newtons method, and Conjugate gradient. Those are really simple methods honestly OP. The hardest part there is constructing the appropriate model, imho at least.\n\nEdit: Only aftet building my own version, and realizing the librarys version is much better optimized will I consider switching, and only then if it absolutely needed for timely research results. For a product, I would just bunker down and improve it if it really needed it.", "Permalink": "https://www.reddit.com/by_id/t3_6awkxk.json"}, "212": {"Subreddit": "PhD", "Author": "floodedbard", "Date": 1494691755, "Score": 2, "Body": "Thank you for your encouragement :) It means a lot!", "Permalink": "https://www.reddit.com/by_id/t3_6at356.json"}, "213": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494691924, "Score": 1, "Body": "I'm looking into environmental science, microbiology, or ecology/evolutionary biology. I want to study micro-organisms within the biomass of plastic waste extracted from the ocean; specifically marine fungi because I hope to further develop mycoremediation techniques for marine plastic waste. \nDo you believe I may be missing a discipline or type of department I could be looking into? \nEdit: I've also been looking into botany and plant biology; sometimes those dept.'s have mycology. ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "214": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1494692790, "Score": 1, "Body": "Have you talked to anyone at your institution about all of this? I don't know if your supervisor seems like an approachable person but if you feel like you can't talk to them, try getting in touch with a tutor you trust (I'm assuming when you were doing MA level work you had classes) or even the person who runs the PhD programme. Or if your university has a research students welfare person or careers consultant, I recommend that too. It depends on the environment at your institution (of course), but most want their students to be successful and are capable of having pretty objective conversations with you about what's best for you in terms of staying / dropping out. \n\nOtherwise (1) don't quit for a specific job / plan until you're 100% certain you'll get and (2) is it completely impossible for you to live with your partner and commute in a couple of times a month? I know people who do that at my university. ", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "215": {"Subreddit": "PhD", "Author": "twicefromspace", "Date": 1494692880, "Score": 1, "Body": "I think there *might* be good reasons for you to stay, but the way you have it framed here it really seems like you've made up your mind. The only thing mentioned as holding you back from quitting is your partner's hesitation at the idea. It can be really, really hard to assure someone that it won't be held against them later on, so I could see her having hesitation based on that alone. I think she's the one you should talk to, but it does sound like leaving makes a lot a sense for you based on what you've said.", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "216": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1494704028, "Score": 2, "Body": "I think the best thing you can do is to talk with potential advisors in the program about your research project and their expectations of you. Your situation is delicate and your advisor can make or break whether you actually finish. Problem is most professors don't want to talk to you because its likely a waste of their time because you have not yet been accepted and have not yet passed quals, but if you can arrange your advisor relationship and outline research directions before starting school you will be in a much better place. There is a chance you don't actually want to work with any professor in that program, and should apply somewhere else. I think the way to go about it is to send an email with a CV and if you have a high M.S. gpa and any sort of independent project work, or better a publication, then the interaction will go more your way and you're more likely to get a response. You can also call after sending the letter, call the department secretary and ask them to arrange something for you. If you're extra crazy, visit campus and knock on doors. Basically I'm saying get your foot in the door before you are even accepted into the program. Fortunately for you Systems people are close to business and usually not so stodgy and focused on hierarchy like many academics. I mean they're more likely to be flexible with you.\n\nMy perspective is that I'm near the very end of my program in engineering.", "Permalink": "https://www.reddit.com/by_id/t3_6ajq2x.json"}, "217": {"Subreddit": "PhD", "Author": "jandlers", "Date": 1494706738, "Score": 1, "Body": "True, thanks for the honest answer, I appreciate it!\nEdit: I thought I should add some detail, and acknowledge that it took me longer to rant and rave than it would have to just implement these methods...but I needed a second opinion, so thanks again!", "Permalink": "https://www.reddit.com/by_id/t3_6awkxk.json"}, "218": {"Subreddit": "PhD", "Author": "Saikoujikan", "Date": 1494712500, "Score": 1, "Body": "Thing is, I already have the MRes position. Giving that up a whole year of guaranteed research experience for the possibility of maybe getting a tech position doesn't seem like a sensible move. The MRes will be in London, and may be a really good opportunity to meet people who could give referrals.\n\nThe entire UK has been like this since Conservative Austerity measures have been in place for the last 8 years, and Brexit has compounded the problem since a large amount of EU sourced funding has been frozen. Already EU scientists have started to leave the UK causing a great deal of labs and positions to go with them.\n\nI've tried applying outside of the UK, though the competition is even greater, as you can imagine.\nFor a PhD I would be willing to relocate anywhere in the world that did the kind of Immunology I was interested in. For a tech position, it would be harder to relocate. I'm somewhat limited to around London.", "Permalink": "https://www.reddit.com/by_id/t3_69li71.json"}, "219": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1494743122, "Score": 3, "Body": "&gt; I'm 90% sure the science underpinning my project simply doesn't work.\n\n \nNo result is still a result.  Showing that the science is bullshit is a thesis I'd be proud of.  Kind of like a last \"fuck you\" to academia.\n\nAs for me, I'm four years balls deep into my PhD program and I've done too much to turn around now.  I don't enjoy the science (think it is also bullshit) and have seen enough behind the curtain to know that academia is not the place I would be happy in the rest of my life ( probably wouldn't make it anyway, considering how stupid competitive it's become).\n\nIt's all about the end game.  If you aren't happy, don't think you'll benefit from your PhD financially or even mentally, then leave.  If you're planning to use it to your advantage down the road then it might be worth staying.  \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "220": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1494756518, "Score": 2, "Body": "&gt; That music was beautiful. \n\nGlad you liked it. :)  If you want to hear a bit more in a sort of similar style from over the centuries, I'd suggest [this](https://www.youtube.com/watch?v=lSc02pHmyC8), [this](https://youtu.be/pjf4i-WU7jE?t=63), and [this](https://www.youtube.com/watch?v=XNVuJjpH8R0).", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "221": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1494757029, "Score": 2, "Body": "In this case, you might want to look specifically at universities with ties to oceanography institutes, or at oceanography institutes themselves.  In the EU, this would include NIOZ or WETSUS in the Netherlands, AWI or GEOMAR in Germany, NOCS/NOCL in the UK, IFREMER or LEGOS in France, ICM in Spain, and many others.  Wikipedia has a helpful [list](https://en.wikipedia.org/wiki/List_of_oceanographic_institutions_and_programs).", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "222": {"Subreddit": "PhD", "Author": "DonFrulli", "Date": 1494779212, "Score": 2, "Body": "Thank you for your comment!", "Permalink": "https://www.reddit.com/by_id/t3_6an8mu.json"}, "223": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1494797349, "Score": 3, "Body": "Just FYI, r/samplesize is the best place for survey requests, you'll get a bigger response there!", "Permalink": "https://www.reddit.com/by_id/t3_6b4bm8.json"}, "224": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1494800144, "Score": 4, "Body": "You can use something like mturk.  \n  \n\nThis isn't the right subreddit for these kinds of requests.", "Permalink": "https://www.reddit.com/by_id/t3_6b4bm8.json"}, "225": {"Subreddit": "PhD", "Author": "BolognaSmamaches", "Date": 1494801843, "Score": 1, "Body": "I have not come across those oceanographic institutes in my research yet, thank you! \nAnd I really liked the chior + modern piano from that second link. It really added an extra emotional element to it and he was getting pretty jazzy there at the end of the song. \nI've had this CD since I was very young of a modern Georgian women's chior called Archaica: directed by Shalva Mosidze. I found a [link](https://m.youtube.com/watch?v=86g67FfStaU) of one of my favorite tracks from it. It blew my mind the first time I heard it. ", "Permalink": "https://www.reddit.com/by_id/t3_6ashsj.json"}, "226": {"Subreddit": "PhD", "Author": "DelayedNeutron", "Date": 1494817614, "Score": 1, "Body": "/r/nopes ", "Permalink": "https://www.reddit.com/by_id/t3_6b4bm8.json"}, "227": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1494820316, "Score": 5, "Body": "www.coursera.org", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "228": {"Subreddit": "PhD", "Author": "Mark_of_Nayru", "Date": 1494822776, "Score": 2, "Body": "I had been working as an RN for 4 years when I decided to go back for my PhD.  I took a huge pay cut (I made about 1/3 of what I made as a nurse) when I started working as a research assistant.  The loss in pay was rough, but will be worth it in the long run.\n\nFor me, I knew I wasn't going to be happy working clinically for the rest of my life.  There are lots of opportunities for nurses to advance their careers, but I felt a PhD was most in line with the work I wanted to dedicate myself to.  I chose to leave my 'stable middle class job that a lot of people would be happy to have\" because it wasn't the right fit for me.  I love being a nurse, but I got to the point where I dreaded going to work each day.  I was my mid-20s too, and thinking about spending the next 40 years hating my job was terrifying.\n\nI actually decided to get my MPH while in the PhD program as well, since it made sense with my long term goal.  I work as a surveillance epidemiologist part time now and really enjoy what I do at the DOH :) \n\nI'm not thoroughly familiar with everything you can do with an epi PhD, but maybe spending some time reflecting on where you really want to end up may help.  There are lots of opportunities, it just depends on where your research interests are.  In my state, our regional epidemiologists sometimes have PhDs.  I know many of our supervisors and directors at the state level have PhDs as well.  You mention being interested in federal position, and my understanding is that you would need a PhD to be competitive for these - especially at CDC.  Same with academia.  Have you looked at the EIS fellowship at all?\n\nI find the most helpful thing for me is to ask myself \"in 20 years, am I going to regret not doing this?\"  My answer is always a resounding yes.   \n ", "Permalink": "https://www.reddit.com/by_id/t3_69glhb.json"}, "229": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1494834139, "Score": 7, "Body": "Please forgive the shameless plug, but I am a statistician and am setting up a website that hopes to give a plain language introduction to a lot of ideas you'll come across. It is [here](http://www.survivestatistics.com)", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "230": {"Subreddit": "PhD", "Author": "FutureDrHou", "Date": 1494841980, "Score": 3, "Body": "That's a seriously good project you've got there. I love it. Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "231": {"Subreddit": "PhD", "Author": "solo1001", "Date": 1494854032, "Score": 2, "Body": "Great site.  Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "232": {"Subreddit": "PhD", "Author": "solo1001", "Date": 1494854060, "Score": 3, "Body": "I love shameless plugs.  I'll take any type of resource for help.  Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "233": {"Subreddit": "PhD", "Author": "normabatty", "Date": 1494876623, "Score": 2, "Body": "Anything by Andy Field... It's not really a course but I found it a very good source: https://www.discoveringstatistics.com/.", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "234": {"Subreddit": "PhD", "Author": "solo1001", "Date": 1494884621, "Score": 2, "Body": "&gt; https://www.discoveringstatistics.com/\n\nThanks.  I actually rented one of his books from Amazon so we'll see how it goes.", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "235": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1494887493, "Score": 4, "Body": "many congratulations :D all the best for the next few years !", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "236": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1494891586, "Score": 2, "Body": "thank you! same to you!", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "237": {"Subreddit": "PhD", "Author": "31mak", "Date": 1494905589, "Score": 1, "Body": "I've known several people who quit after debating it (and wasting time) and they're all much much happier now. If you're not happy, don't waste any more time. You can always just take a leave of absence and then opt not to go back. \n\nA PhD is miserable, even if you really want it, so if you don't have much of a reason for it, it's that much harder to finish. It's hard to understand why it's so hard to just finish from those who haven't been there but the lack of structure and sheer amount of work to dissertate can just bog you down and it's not uncommon for people to take much longer to finish. ", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "238": {"Subreddit": "PhD", "Author": "31mak", "Date": 1494905632, "Score": 1, "Body": "Yup!", "Permalink": "https://www.reddit.com/by_id/t3_69m2rg.json"}, "239": {"Subreddit": "PhD", "Author": "basetheory", "Date": 1494919250, "Score": 1, "Body": "I'm definitely not happy in it and I feel like I'm only delaying starting a proper career. I've decided I'm going to throw in the towel. I feel like I don't have much reason for it at all, it wont really improve my career prospects. Especially when U can just leave and get an MSc.\n\n\nI like your absence idea. I'll apply to jobs and keep the stipend coming in, then take some absence in amongst that too.", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "240": {"Subreddit": "PhD", "Author": "alli_golightly", "Date": 1494922221, "Score": 11, "Body": "Yes you are (doing a great job) and should be proud of yourself. Also, IDK if that applies to your family, but many people who did not try to pursue a higher degree (Ph.D. Level) have no idea what the work is like. They compare it to high school/uni, when it's a completely different game. \n\nPat yourself on the shoulder for a job well done. :)", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "241": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1494934227, "Score": -4, "Body": "No offence but your family sound like cunts... ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "242": {"Subreddit": "PhD", "Author": "readaholic713", "Date": 1494939509, "Score": 2, "Body": "I wouldn't be too hard on the family. Most families simply don't understand the type and amount of work. They don't have the frame of reference to appreciate what all goes into it. ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "243": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1494943077, "Score": 2, "Body": "I'm in Australia and we have none of that in our applications so I can't help you much. I would suggest x-posting to r/gradadmissions though. They should be able to help.", "Permalink": "https://www.reddit.com/by_id/t3_6bcwzo.json"}, "244": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1494947365, "Score": 3, "Body": "Perfect example of people actually describing themselves when insulting others. ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "245": {"Subreddit": "PhD", "Author": "Embers93", "Date": 1494949418, "Score": 2, "Body": "Thanks!! Didn't realise you could define proximity! I'll give it a go. ", "Permalink": "https://www.reddit.com/by_id/t3_69y0z0.json"}, "246": {"Subreddit": "PhD", "Author": "mohataher", "Date": 1494959336, "Score": 3, "Body": "Hey, I feel honesty is a key. You should be stating that the general environment in your current university makes it really difficult to graduate in time and with strong research knowledge. Your main motivation to join the new one is 1) learn more about research in you field because of xx, 2) work with xx who is/ are great at their field and you feel you can learn a lot from them, 3) enjoy the xx at the new university, 4) I don't have enough support at my current uni (don't mention names of people or talk badly about your supervisors)\n\nI feel mentioning money will hurt you a lot. Stay away from that and resist the urge to mention it. They may assume that's your only reason. ", "Permalink": "https://www.reddit.com/by_id/t3_6bi39n.json"}, "247": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1494963879, "Score": 2, "Body": "Definitely Zotero. It integrates great with Word and Bibtex, and it's lightweight and easy to use.\n\nRegarding the storage limitation, I just don't save PDFs on it. I save them separately.", "Permalink": "https://www.reddit.com/by_id/t3_6asogk.json"}, "248": {"Subreddit": "PhD", "Author": "Plavixo", "Date": 1494965153, "Score": 1, "Body": "Congrats! : )", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "249": {"Subreddit": "PhD", "Author": "alexashin", "Date": 1494966551, "Score": 2, "Body": "If she is a nice person but a bad scientist try to leverage her other skills or resources , does she have any?", "Permalink": "https://www.reddit.com/by_id/t3_6bhvnx.json"}, "250": {"Subreddit": "PhD", "Author": "DMass777", "Date": 1494968506, "Score": 1, "Body": "Honestly the reasons you mentioned  are straight forward and l would mention them all except the Monetary  part, do not and l mean  do not bad mouth your  advisors etc it looks classless. M", "Permalink": "https://www.reddit.com/by_id/t3_6bi39n.json"}, "251": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1494971453, "Score": 3, "Body": "Side question: do grades really matter in graduate school? I thought you are supposed to focus on research or whatever? ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "252": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1494978868, "Score": 1, "Body": "The difference is I have the balls to say what you are all thinking. This poor person is trying their best and the family are shooting them down and degrading their efforts. That to me is a cunt move and I think it's wrong.", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "253": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1494984672, "Score": 2, "Body": "Are you looking to do PhD by publication or by thesis or a hybrid?", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "254": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1494988642, "Score": 10, "Body": "Sound like nonsense to me. Your PhD degree reflects the value of the research work you have done, it is not necessarily original. In fact, nowadays there is no single topic in science with only one single research group working on it, therefore, a lot of work is \"similar\" and done on the \"same topic\". You will receive your PhD after you pass all the coursework, convince your committee that the research you propose is worth doing in the beginning, and that you have done a proper job in the end. ", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "255": {"Subreddit": "PhD", "Author": "31mak", "Date": 1494990448, "Score": 1, "Body": "My friend left a year post her MA and she got a job while on leave, then once it was formal, officially quit. She's much happier now. I remember right after she made the decision she said that she felt a weight was lifted off her shoulders and I was like, that suggests it's the right move.\n\nGood luck!!", "Permalink": "https://www.reddit.com/by_id/t3_6ar6sg.json"}, "256": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1494994597, "Score": 4, "Body": "Doing my PhD in Neuroscience in America and I have never heard of anything like that. You defend your dissertation, and if you happened to get interesting results from it then you can publish them, but it's not a requirement. ", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "257": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1495008199, "Score": 1, "Body": "At either place, the best approach is to publish along the way (hopefully ~2-3 papers within 5-6 years for microbio) and then just stitch them together with some unifying introduction and conclusion and hand it in as your thesis. If you published it in a reputable journal, then it grandfathers you in as having published something novel.\n\nI've never heard of a U.S. university not allowing someone to do this.", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "258": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1495014518, "Score": 2, "Body": "My thoughts exactly. If forced with a tradeoff, I'd sacrifice grades for more paper writing. My GPA is only 3.6, but I had 6 pubs last year.", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "259": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1495027672, "Score": 4, "Body": "[ahem](https://xkcd.com/757/)", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "260": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1495027762, "Score": 2, "Body": "This sounds really like a gossip in an Irish pub to me. \n\nIf that's the case, I expect the number of PhD graduants from  USA to drop by at least 10-15%. ~~ok I pull that number out of my ass~~", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "261": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495043127, "Score": 9, "Body": "I assume this is a troll thread. No god damn way anyone should spend 150k of their own money on a PhD. lol", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "262": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1495043239, "Score": 0, "Body": "No troll thread. Not *on* a PHD, on 5 years of extra spending out-of-work. While I do a PHD presumably with a stipend or RA or some other funding.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "263": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495043318, "Score": 3, "Body": "&gt; $150k to spend on a PHD\n\nYour words bro. ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "264": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1495043370, "Score": 0, "Body": "Your quote mining bro. Read the post before you comment.\n\n&gt;So basically, in 10 years, if I still feel like I need a PHD, I will have around $30k/year extra to live off of.\n\n&gt; I think it would be great to take some time in my 40's to take several years off work to do something I'm passionate about. A kind of early-temporary retirement. ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "265": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495043501, "Score": 3, "Body": "*You're*\n\nI read the post. You're ill suited for a PhD with that kind of logic. ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "266": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1495043733, "Score": -1, "Body": "Actually it's not \"you're\" I'm not saying \"you are quote mining\" I'm saying \"you mined this quote\" and copying your slang. You can keep your judgements to yourself if you feel that way.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "267": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495044711, "Score": 2, "Body": ";) \n\nI take back everything. Your (sic) definitely on the right track. I'd recommend spending the next 10 years saving 150k to spend on a PhD. I also believe you have the logic, foresight, and obvious intelligence to be a wonderful scientist. Best of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "268": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1495051668, "Score": 2, "Body": "Typically a PhD program will cover not only tuition, but also a salary to live on during your time in the PhD program as well. I mean, saving is a good idea in any case, but there's no real target number that you need to save in order to start a PhD. I do see what you mean about having the extra money to increase your quality of life during a PhD.\n\nIt might also be worth considering if a PhD will increase your salary afterwards -- in which case, getting it earlier might be an advantage. That's case-by-case though, of course.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "269": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1495054174, "Score": 0, "Body": "Agreed, I just had a real bad time applying this year even where I found funding. I hear horror stories of funding being dropped, if you go to a school in an urban area you might be living in a studio paying over $1k/month, etc. I'm already in a situation in life where I make a lot, and getting my MS that will already go well past what I want in life for salary. I want the challenge and learning of a PHD, but I don't need it for my job, and honestly as I've been asking around for jobs, my ambition has turned off a lot of employers (at least 2 \"no-chance\" responses in interviews). Career comes first, and I'm getting to the point I don't want to be a popper living on bread crumbs in school anymore. And I probably won't *need* a PhD for my prefered jobs until I hit a career ceiling (But it does seem I'm competing against them).\n\nFor context, I'm an electrical engineer, getting a cs masters, hoping one day to get a PHD in Machine Learning. I'm hoping I can get an entry ML job between now and my PhD, likely a computer vision or robotics job as that's what my MS is preparing me for. Then maybe one of those companies will want me to push for a PHD later, or else I can use this money for the time. ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "270": {"Subreddit": "PhD", "Author": "tergiversator", "Date": 1495060498, "Score": 3, "Body": "Actually this is a legitimate thread. Most of the programs willing to take on old candidates who also don't seem to understand how academia works will likely be pay-to-play/\"professional doctorate\" diploma mills anyway.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "271": {"Subreddit": "PhD", "Author": "FreudianSlip12", "Date": 1495063281, "Score": 1, "Body": "Congratulations on getting and nailing the interview! I had a similar experience recently, and I was so happy that I actually got through the process without messing it up completely - inadequacy and fear of not being taken seriously were my main worries. I subsequently didn't get the PhD but then no one who was interviewed did and I've been selected for a few others! \n\nWhat was the studentship on, just out of interest?", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "272": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495065129, "Score": 2, "Body": "It's a troll thread. ", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "273": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495089461, "Score": 2, "Body": "It's on the impact of being obese on the health care use and educational outcomes in British White and  South Asian UK school children.\n\nWell done to you for getting as far as you did. It does wonders for the confidence levels!", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "274": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495089876, "Score": 1, "Body": "What was yours on and are you in the UK?", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "275": {"Subreddit": "PhD", "Author": "FreudianSlip12", "Date": 1495100702, "Score": 1, "Body": "Niice that sounds really interesting. Do you have a psychology background?\n\nMine was engagement in health and safety practice in Bridgend Ford engine plant. Yeah I'm studying an MSc in Health Psychology in Cardiff Met at the moment. ", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "276": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495119576, "Score": 1, "Body": "My background is in Social Sciences so Sociology and Psychology were incorporated in my BA in equal measures and then my masters was in Racism and Ethnicity Studies. \n\nWas yours a studentship or have you proposed the PhD topic? Are you still looking for PhD opportunities or is that it now?", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "277": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495120953, "Score": 1, "Body": "Also a bummer when your partner is also a PhD student...then you're both just too busy for each other...\n\nDoing a PhD is a bummer :(\n\nEDIT: But I definitely feel you 0RPHAN_GRAB, just know you still have support networks :)", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "278": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495122498, "Score": 1, "Body": "Why have I just seen this now grrrr. Thanks for the very thorough and informative reply! Luckily, they didn't ask anything that I found too difficult to answer! ", "Permalink": "https://www.reddit.com/by_id/t3_69k6g2.json"}, "279": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1495123552, "Score": 1, "Body": "Me right now. \n\nI'm not finished with data collection yet  but I'm at the half way mark. For my main population I have 10 interviews, and my secondary population I have 12. \n\nSomeone who's doing a quant heavy study with a tiny qual component has done 30 (15 minute) interviews. To be fair, it was a telephone interview to chase up her quant data so it's nowhere near the same as mine with recruitment issues etc. \n\nStill. My mostly qual project is so slow, and I have almost all my quant stuff done and I am just about to start hitting the panic button. \n\nBut! 15 interviews, if they are rich in information, are plenty! As people keep reminding me, I'm going to end up with heaps more data than I'll ever use.\n\nChin up! It happens to all of us. ", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "280": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495124729, "Score": 1, "Body": "Thanks for the support! Your study sounds like it's on the right track too. My main problem with the number of studies isn't that I won't have enough data really (I could probably write two books with the amount of info I'm getting - although on the other hand my 30min-1hr interviews are nothing compared to my friend's 4hr~ interviews, but I digress) but that people will criticise me for a small sample size. But I don't think I need to particularly worry about that in a qual study?", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "281": {"Subreddit": "PhD", "Author": "FreudianSlip12", "Date": 1495131757, "Score": 1, "Body": "Nice! Where did you study?\n\nIt was a funded studentship - I've got a few other interviews lined up but I've been told of a studentship being advertised in my current Uni in the coming weeks which is right up my straight so really banking on  getting that one!\n\nWhen do you find out about the result of your interview?", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "282": {"Subreddit": "PhD", "Author": "FreudianSlip12", "Date": 1495131777, "Score": 1, "Body": "Have just re-read the title of this post, ignore the last question, hah.", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "283": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1495139628, "Score": 2, "Body": "thank you! that's a good point. ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "284": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1495139653, "Score": 1, "Body": "hahahaha they can be. i think it's like what everyone here is saying--they just don't understand.", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "285": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1495139683, "Score": 1, "Body": "this is a good point. ", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "286": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1495139690, "Score": 1, "Body": "thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "287": {"Subreddit": "PhD", "Author": "babisaurusREX", "Date": 1495139920, "Score": 1, "Body": "You do, eventually. In my program I have to take 63 credits of coursework in total. I also do research but it isn't graded, it's just approved of (or not) by my committee. Eventually you get to a point where you are done with coursework and your research/dissertation is what you focus on. SO in the long run, no one will really care if I graduate with a 4.0 as long as my dissertation is approved by my committee and I of course do have the grades, which in my program you must receive a B+ or higher to satisfy that requirement. But I thought it was kinda neat that I pulled it off this first year. :)", "Permalink": "https://www.reddit.com/by_id/t3_6bd5dm.json"}, "288": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495141733, "Score": 1, "Body": "At the university of Leeds. \nOoooh...rooting for you..really hope you get it! Studentships are understandably competitive 😩", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "289": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1495143111, "Score": 4, "Body": "You might want to ask a sub specific to your school or administration at your school. None of us know the requirements of your internal scholarship. ", "Permalink": "https://www.reddit.com/by_id/t3_6byavr.json"}, "290": {"Subreddit": "PhD", "Author": "FreudianSlip12", "Date": 1495143602, "Score": 1, "Body": "Thanks dude! One of the ones I'm interviewing for is at the University of Leeds - recommend the uni and the city?", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "291": {"Subreddit": "PhD", "Author": "buttfacedmiscreant11", "Date": 1495146701, "Score": 1, "Body": "I'll second the Andy field material - I don't know if you will be using SPSS at all but the discovering statistics using SPSS book has saved my life many times. Even if you aren't using SPSS it gives really good overviews and explanations of all the statistical tests. The book is pretty cringe to read as he tries very hard to be \"down with the kids\" but once I got past that it really helped me understand stats and research methods!", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "292": {"Subreddit": "PhD", "Author": "solo1001", "Date": 1495151157, "Score": 1, "Body": "I got it in the mail yesterday.  It's ratty as hell and all marked up but it's a start.  I can see the value in it already as even a reference guide for future use so I'll probably buy my own copy.  Do you still use it as a guide?", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "293": {"Subreddit": "PhD", "Author": "buttfacedmiscreant11", "Date": 1495153302, "Score": 1, "Body": "Yeah! I got it in my first year of undergraduate and it saw me through all three years of that degree, my masters and now two years of my PhD. I'm a lot more confident with stats now but often need refreshing as to what statistical tests to use in what situation and also what the analysis means! Definitely worth investing in tbh as it's really helped me (even tho I find some of it so cringe!)", "Permalink": "https://www.reddit.com/by_id/t3_6b84fq.json"}, "294": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1495157579, "Score": 1, "Body": "Yes, in qual, it's not a matter of your sample size at all. \nIf your study is underpinned by grounded theory, you would just collect data until you hit saturation. The point isn't to generalise, so the 'number' of people interviewed (or for how long) isn't as important as what their responses are. \n\nGood luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "295": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1495158032, "Score": 1, "Body": "Not OP and/or necessarily relevant to the original question, but how would the hybrid model work? We've only been given a papers or thesis option and neither of them have appealed much, and I'd be curious about another way forward. Thanks. ", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "296": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1495158722, "Score": 1, "Body": "Normally the hybrid version is where a couple of chapters are papers and a couple of chapters are written and then the intro and conclusion are also written. I know it's big in climate science where things are changing pretty quickly so you're publishing right away anyway but it's not changing so quickly that you need to publish everything right away. I believe astronomy is one of the ones where everything is changing so quickly that you publish everything and those guys tend to go by publication instead of hybrid.", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "297": {"Subreddit": "PhD", "Author": "enpaix", "Date": 1495159216, "Score": 1, "Body": "Hint's in the methodology: quality not quantity. As long as you have what you need\n\n* unless you're an anthropologist and you're judged almost entirely on how long you spent in the field", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "298": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1495174485, "Score": 1, "Body": "All the best for finding the result out today. Let us know what happens!", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "299": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495175090, "Score": 1, "Body": "Oh excellent! Such a good university. It's one of the Russel Group universities so it's quite prestigious. The uni has an excellent reputation for its research centres and general teaching. It has such a good vibe about it and people are very friendly there.  You will love it. There's a strong work ethic kind of atmosphere at that particular university which I haven't really experienced in the universities surrounding the city.\n\nLeeds is general has a pretty wild nightlife if that's your thing. I'm originally from Leeds, having lived there most my life.  It's a very culturally diverse population so anyone fits in and people are generally friendly. With there being two universities in the city, there are students galore! I have yet to meet anyone that hasn't enjoyed their stay in Leeds. \n\n I sound like I'm trying to flog you a holiday 😂", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "300": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495175143, "Score": 1, "Body": "I will do - thanks! *nervously checking my email for the fourth time today and it's not even 8am yet*", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "301": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1495179179, "Score": 1, "Body": "I was probably on my hundredth time by then :P I know the feeling.\n\nIt sounds like it went really well. If for some reason you were unsuccessful, just remember; that result is far better than being accepted onto four years of something you won't get on with.\n\nGood luck! I am nervously checking my reddit for your result ha.", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "302": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495182214, "Score": 1, "Body": "I will potentially be doing some participant observation which I'm a bit worried about too!", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "303": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495182223, "Score": 1, "Body": "Thanks for that! You too", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "304": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1495190760, "Score": 3, "Body": "I was lucky to have an excellent primary supervisor, never really interacted too much with the secondary. I would suggest that you take whatever comments you get from the secondary as a useful revision. Supervisors in the UK are not really well trained, imo, to supervise, so you rely on their innate talent/empathy to line manage. This isn't a typical skill that academics have, so I wouldn't take their apparent view of you too personally. I have known supervisors who did the bare minimum with their students. ", "Permalink": "https://www.reddit.com/by_id/t3_6c21tf.json"}, "305": {"Subreddit": "PhD", "Author": "offbeat_", "Date": 1495191326, "Score": 1, "Body": "yes, that's true. I will ask them but I also wanted to have general information about PhD students' working conditions and requirements.", "Permalink": "https://www.reddit.com/by_id/t3_6byavr.json"}, "306": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1495192749, "Score": 1, "Body": "Again, we don't go to your school. There is no general info we can give you about an internal scholarship. ", "Permalink": "https://www.reddit.com/by_id/t3_6byavr.json"}, "307": {"Subreddit": "PhD", "Author": "riley0510", "Date": 1495204245, "Score": 1, "Body": "Thanks, I appreciate your insight!", "Permalink": "https://www.reddit.com/by_id/t3_6c21tf.json"}, "308": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495205697, "Score": 3, "Body": "I want a short but sufficiently detailed and carefully crafted letter discussing the person's credentials, research plan (a few sentences), and knowledge of my work (in the sense that I'm a good choice for you and our research interests are aligned). After that, I'll either respond asking for a CV and detailed research statement (plan for the PhD) or give a generic rejection. \n\nDon't just send out vague 'feelers'. Have a concrete plan ready to go, a nicely formatted and error-free academic CV (not a resume - I don't give a shit what your \"objectives\" are), and make sure the professors interests are closely aligned with your proposed research.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6c2jem.json"}, "309": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495208120, "Score": 4, "Body": "I didn't get it 😔 I'm ok with that though. I have 2 children under 5 and it would have definitely been a struggle time wise and to have a good work/life balance so I'm focusing on that aspect of it lol\n\nThanks for all the nice words and encouragement! ", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "310": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1495212198, "Score": 7, "Body": "In, US, first name. \n  \nAn exception might be if they're a full professor and insist on honorifics, but those are rare cases and the other students will let you know.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "311": {"Subreddit": "PhD", "Author": "blufox", "Date": 1495213686, "Score": 7, "Body": "Have they corresponded to you? If they have, check how they have signed off. I start with calling them Prof. &lt;Last name&gt;, and switch to &lt;First name&gt; once they have replied back signing off \"Thanks, &lt;First name&gt;\".\n\nThe reason I don't start off with \"&lt;First name&gt;\" immediately is that, I have noticed (in U.S.) some of the professors and postdocs prefer to be addressed as Prof. or Dr. by those who do not hold a Doctorate degree, and they usually indicate their preference in their correspondence to you.\n\nYou will also get a hint when you talk to them. Do they/others introduce them as Dr./Prof. So&amp;So or just &lt;First name&gt;?", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "312": {"Subreddit": "PhD", "Author": "fasterthanthou_2", "Date": 1495218426, "Score": 3, "Body": "There are many imposters, trolls and harassers here, please keep that in mind and weigh all advice accordingly. ", "Permalink": "https://www.reddit.com/by_id/t3_6c3hlr.json"}, "313": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1495225254, "Score": 4, "Body": "Probably not.", "Permalink": "https://www.reddit.com/by_id/t3_6c3hlr.json"}, "314": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1495229747, "Score": 1, "Body": "Thank you for replying. This is exactly the kind of guideline I was looking for. Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6c2jem.json"}, "315": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1495235156, "Score": 6, "Body": "In UK, first name. Really it would just be super weird if I called him doctor.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "316": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1495238690, "Score": 1, "Body": "First. If any professor makes people call them Dr all the time, drop it and move on. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "317": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1495243556, "Score": 1, "Body": "Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_6blfx2.json"}, "318": {"Subreddit": "PhD", "Author": "girlunderh2o", "Date": 1495244766, "Score": 3, "Body": "Also, some switch based on whether you're in the classroom or conversing with them anywhere else. I had one young prof specifically tell the graduate students that we were free to call him by his first name in private/out of class but requested we use Dr. LastName around the undergrads.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "319": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1495246234, "Score": 4, "Body": "I default on addressing them as Dr. XYZ until they say otherwise. Surprised to see my preference is not very common. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "320": {"Subreddit": "PhD", "Author": "blufox", "Date": 1495248120, "Score": 2, "Body": "Indeed, I have seen this too. Some profs consider grad students close enough to be peers, but require the honorifics with undergrads. So if we are taking a slash class (grad + undergrad), then they become Dr. or Prof. So&amp;So. Else it is first name.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "321": {"Subreddit": "PhD", "Author": "readaholic713", "Date": 1495250238, "Score": 2, "Body": "First name. It's a small part of making that transition from student to scholar. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "322": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1495260918, "Score": 3, "Body": "Came here to say the exact same thing.\n\nI've met one person who became offended when I used their first name. But they weren't actually all that great in general.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "323": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1495268375, "Score": 2, "Body": "In first few correspondence/ before you know them in person- I'd go with title out of politeness. Then swap to first name basis. I call my supervisor and everyone in my dept by their first name, but when I was originally e-mailing them before arriving, I was more formal- as I am with some more professional e-mails I'll send to people outside the uni", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "324": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1495268986, "Score": 3, "Body": "You've gotta be careful with getting Dr or Professor right though.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "325": {"Subreddit": "PhD", "Author": "rws247", "Date": 1495296026, "Score": 9, "Body": "If your supervisor is not acting rationally, get someone from HR involved. Talk things over calmly, and see where that brings you.", "Permalink": "https://www.reddit.com/by_id/t3_6cab0a.json"}, "326": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1495304412, "Score": 1, "Body": "Agreed. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "327": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1495305082, "Score": 3, "Body": "I could've sworn that I replied yesterday...I didn't get it 😩 was pretty disappointed but hey-ho! Life goes on..", "Permalink": "https://www.reddit.com/by_id/t3_6br9vn.json"}, "328": {"Subreddit": "PhD", "Author": "folame", "Date": 1495315777, "Score": 2, "Body": "I think this is standard and probably the norm. Professional/private environments differ. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "329": {"Subreddit": "PhD", "Author": "folame", "Date": 1495316112, "Score": 1, "Body": "1. That you know who they are. And by know, I mean that you know their research area, specific focus, and are aware of the current projects and associated publications. \n\n2. Know how 1 pertains to your experience and interests.\n\n3. Keep it as brief and to the point as possible. No one really has time to read fluff. \n\nAknowledgement (not praise or anything over the top) works wonders especially in research/academia) ", "Permalink": "https://www.reddit.com/by_id/t3_6c2jem.json"}, "330": {"Subreddit": "PhD", "Author": "folame", "Date": 1495316617, "Score": 1, "Body": "On what field? Depending on the school, I'd say most STEM fields offer financial support in some form (TA/RA or some other fellowship). \nWhat are you planning on studying.", "Permalink": "https://www.reddit.com/by_id/t3_6c3hlr.json"}, "331": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1495320173, "Score": 1, "Body": "Thank you for this.\n\nThis might be a stupid question, but how do you know from readings potential supervisor's published work what their specific research interest is (presumably they'll be an author on their supervisees' work too which may vary a bit?)? \n\nWhilst I can sometimes tell from the repetition of various areas, sometimes it seems like they're juggling lots of different areas at once and I'm unsure.", "Permalink": "https://www.reddit.com/by_id/t3_6c2jem.json"}, "332": {"Subreddit": "PhD", "Author": "folame", "Date": 1495322234, "Score": 1, "Body": "Look on their home page. Most people tell you right there what their current interests are.\n\nYou can really dig in here by finding out what the profs thesis topic was and what type of research they've engaged in since then. \n\nUsually, the publications will have a theme, which is evidence of their interest and expertise.", "Permalink": "https://www.reddit.com/by_id/t3_6c2jem.json"}, "333": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1495366871, "Score": 3, "Body": "Although you don't have much confidence in your notes, can you still prove the data is your own? Your supervisor likely won't want to risk their 'reputation' if they know they can be proven wrong.\n\nIdeally it shouldn't have come to this, wish you the best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_6cab0a.json"}, "334": {"Subreddit": "PhD", "Author": "Alpacatastic", "Date": 1495434375, "Score": 2, "Body": "If you can get a GA position that gives you a tuition waiver and a small stipend to live on it might be a good idea to give it a try. At least in America it seems to be getting more difficult to get funding at the graduate school level. I do not know your field though, in general for computer science related stuff you don't really need a graduate degree to still make a good living but if it's \"free\" and you enjoy the subject why not? Also don't trouble yourself too much over whether your are qualified or not for it, if you get a GA position covering your education then someone must think you are qualified enough even if that person isn't yourself. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "335": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1495440366, "Score": 3, "Body": "I was in the exact same position as you 18 months ago. I did very well in undergrad and was asked to apply for a studentship by my tutor.\n\n1. It is a huge gap and undergraduate  (in my university) doesn't prepare you for it. It took me at least 6 months to get to the point where I felt like I could read, understand and critique literature and I have only just got to grips with data analysis. That said, your application reviewer/interview panel and DoS  will know that you are coming from undergrad and provide the support and training you need. (Including taking masters classes if you want them). If you have the opportunity to skip masters your essentially saving yourself a years worth of time/money - but be prepared to work hard and feel out of your depth for at least a year.\n\n2. The PhD I applied for was product packaging focused.  I had 0 expertise in the area but read up on the (broad) subject area for 2 weeks before the application (and almost every day since!). It helps to have some background knowledge to help you decide your focus but this can be done prior to starting the PhD. It's also worth noting that what I am doing now is completely different to my propsal. \n\nThe absolute first thing I would do (and was instrumental in my decision to start the PhD) is to have an informal in person meeting with the DoS. You will be working with him/her for at least 3 years. Profs are usually very happy to take some time out of their busy schedule for a potential PhD candidate. In this meeting bring up all your concerns (the same ones I had!). You can then make an informed decision.\n\nIf you need anything else shoot me a PM.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "336": {"Subreddit": "PhD", "Author": "BecB21", "Date": 1495464261, "Score": 2, "Body": "Busted my supervisor alleging I was using smoke and mirrors today. He also accused myself of fudging and falsifying data last year. It sux. Try and work with ppl up the food chain to create the change you desire. Also remove emotion, and stay objective. Best of luck. \n\nUPDATE: Said supervisor has removed themselves from the panel 🎉🎉🎉", "Permalink": "https://www.reddit.com/by_id/t3_6cab0a.json"}, "337": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1495497622, "Score": 2, "Body": "There are no universal rules preventing this, unless explicitly stated by the admissions guidelines. At the same time, keep in mind your own limitations in picking out an adequate topic to write about. Share the idea with 2-3+ peers/qualified individuals before following through with it to get some feedback/second opinions.\n\nSource: I had some 'neat ideas' in my early-mid 20s that I'm really glad I never followed through with.", "Permalink": "https://www.reddit.com/by_id/t3_6cpyjw.json"}, "338": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1495516045, "Score": 3, "Body": "Go to their most recent papers and pull up their author bios. You don't need to ask them for everything.\n\nAlternatively, give a date when you ask for something. \"I will be submitting this paper on the 25/5, please ensure that any notes or edits are sent to me by 23/5 so that I can apply them\"", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "339": {"Subreddit": "PhD", "Author": "alexashin", "Date": 1495516335, "Score": 6, "Body": "In order to send an additional reminder you can give them a weekly update on the project progress like: things done: this and that; thing planned next week: this; resources required: X circuits. The last point can be in red text to grab attention ", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "340": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495517320, "Score": 1, "Body": "One of my supervisors was happy for me to do that, the other wanted to update it before including it. I think I'd rather keep the peace than go find an old bio and have them annoyed with me.\n\nI'll try setting a deadline in my next reminder email and see if that helps, thanks.", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "341": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495517392, "Score": 1, "Body": "I'll definitely try this! I think it'll be effective with my primary supervisor, because he likes to have structured meetings and hear about my progress. My secondary though is a bit prone to totally ignore emails if he's busy... any ideas for catching his attention a bit more?", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "342": {"Subreddit": "PhD", "Author": "TurningRhyme467", "Date": 1495529841, "Score": 1, "Body": "I emailed my concerns to the tutor a couple of days ago and I'll be discussing them when I meet up with them today. The tutor did also say he would support and help me out with the research proposal etc... The only thing is that if I was going to apply, I would have to start writing my research proposal either tonight or tomorrow morning, with the application deadline coming up fast. Again, I think the tutor will help support me with gaining the required knowledge. I think it's that I'm going from an undergraduate degree in Web to considering applying for a PhD position in the area of computer vision. I'll see what happens today anyway. Thank you for the detailed reply. Very helpful.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "343": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1495530916, "Score": 1, "Body": "It all comes down to how well you justify why you did 15 interviews in the thesis, drawing on both theory and methodology. \n\nI am also in social science, and without knowing what your topic is, I'd be including a sub-section in my methodology/research design of the thesis justifying in detail why you have a small sample and why it's enough to underpin your findings. I thought I would end up with a small sample due to fieldwork logistics and started reading up on the qual sample size literature, of which there is a fair amount out there, to construct an argument for a small sample size. I ended up doubling my interviews however by just spending more time in the field. \n", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "344": {"Subreddit": "PhD", "Author": "TurningRhyme467", "Date": 1495531069, "Score": 2, "Body": "The thing is that I don't know if I will enjoy the subject though, as I haven't been taught in the area of computer vision. I mean I looked at a couple of papers or so regarding computer vision, but that was for a homework assignment for literature. I think this person does, as when I applied for a job at the university, I made it to the interview stage and that person was one of the panel members. I guess there would be no harm in applying, but I'll also be having an informal discussion with the person today so hopefully I can make a decision there and then. I'm currently applying for jobs in industry and as of now, I'm having little success, but at the same time, I don't necessarily want to apply for a PhD in an area that I have no knowledge in just because of the little success in job applications I am having. I mean I wouldn't state that in the PhD application or interview if I got one, but I can mention about it in the informal discussion today.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "345": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1495531234, "Score": 2, "Body": "I am glad you found it helpful and good luck with the meeting. \n\nThe tutor will point you to a few key peices of literature in computer vision. These will probably highlight gaps in the literature. (If he/she doesnt then make sure to ask!) - you can then base your proposal on one of those gaps. Might also be worth discussing philosophy/methodology with them.\n\nAs I said earlier, what I am doing now is only very loosely related to my proposal. And when I have reread it I am frankly amazed that I was offered the PhD. I think tutors are looking for potential more than anything else. Your prof will be a leading expert in the area and will give you all the support/training you need.\n\nUnfortunately Web and computer vision are areas for which I have no knowledge so I'm unsure how big the gap is. \n\nYour meeting today will make everything clear I'm sure.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "346": {"Subreddit": "PhD", "Author": "TurningRhyme467", "Date": 1495535121, "Score": 1, "Body": "Thanks. I'll mention about philosophy/methodology, but regarding the key pieces of literature, what exactly do you mean sorry? As for the gap between web and computer vision, I'll also bring that up in the meeting today, as I would like to get a job in the user experience industry. Particularly in the research side of things.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "347": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1495535866, "Score": 1, "Body": "Key pieces of literature refers to important journal articles/research in your area of study. If you can find a recent article in a top rated journal in your field on the subject take a look at their references. \n\nI am sure that your tutor will point in the right direction as to where to look for your specific field.\n\nif you intend to go into a research profession then a PhD is a good option, even if you intend to leave academia upon completion (but its certainly not required). ", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "348": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1495536040, "Score": 8, "Body": "I'd grab the old bio, put it in the paper, and send it to the supervisors for revision as the final version, and include a note saying that you've used the old bio and you can update it if he provides one.", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "349": {"Subreddit": "PhD", "Author": "TurningRhyme467", "Date": 1495536637, "Score": 1, "Body": "I'll definitely ask about that then. The type of work that I am interested in involves user data gathering and applying methodologies etc.., but I'd have to find out whether I can apply the PhD to the type of work I am interested in.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "350": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1495541284, "Score": 1, "Body": "You can definitely do a practical PhD. I know a few people looking into big data and how to apply it in consumer/city planning contexts.\n", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "351": {"Subreddit": "PhD", "Author": "TurningRhyme467", "Date": 1495543430, "Score": 2, "Body": "Sounds good. I think the PhD that is being advertised is practical. Will find out more anyway.", "Permalink": "https://www.reddit.com/by_id/t3_6cj83z.json"}, "352": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495548476, "Score": 1, "Body": "I am thinking of justifying it by saying I'm doing a mixed-methodology analysis (which is true). But it's really because of time constraints on how long I can spend out in the field which I'm sure won't really fly.", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "353": {"Subreddit": "PhD", "Author": "pampathere", "Date": 1495550622, "Score": 3, "Body": "My advisor is bad at responding to emails and he knows it. I do a couple of things to manage him. I keep emails very short, and try to arrange them so I need short answers, maybe even yes/no. I put the entire email in the subject line (for your situation, I'd put \"need author bio by 5/31\"). I also text him reminders close to the deadline, although you may not have the kind of relationship where you can do that. For other professors, I've shown up at their offices multiple times, with or without an appointment, bringing printed copies of whatever I need comments on.\n\nDon't be afraid to nag. It's not fun, but your supervisors are probably juggling many students, classes, grant applications, and research projects. They need to be reminded of things. In my experience, no one has been irritated by my persistence. On the contrary, most are grateful that I kept them on track.", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "354": {"Subreddit": "PhD", "Author": "alexashin", "Date": 1495554869, "Score": 2, "Body": "I guess your supervisor might be an absent-minded \"real\" scientist, so you have zero chance to make him do emails. But as a general rule people are more responsive to the things that are a priority for them. Try to link your research to publications or funding or something that is valuable for your prof and communicate it this way ", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "355": {"Subreddit": "PhD", "Author": "thecoolnerd", "Date": 1495561107, "Score": 2, "Body": "On the contrary, I think most people write something \"new\" for their writing sample. I did. Mine was something of a lit review and was 14 pages. But I know others that use excerpts of their thesis. \n\nMost PhD programs will have specific guidelines of what they're looking for, in regards to their writing sample. So create a spreadsheet of all the schools you're interested in applying to, with their requirements. \n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_6cpyjw.json"}, "356": {"Subreddit": "PhD", "Author": "thecoolnerd", "Date": 1495561236, "Score": 2, "Body": "I try to ask them upon first meeting them \"What do you want me to call you?\" They generally reply with their first name.\n\nI tend to call them by their first name to them, and refer to them by their last name to others. ", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "357": {"Subreddit": "PhD", "Author": "thecoolnerd", "Date": 1495561546, "Score": 1, "Body": "Have you considered other programs? A PhD is like a full time job. You should be paid for your time/work within the program. If they're NOT investing in you, then maybe this isn't the place you want to be. If they're not investing in you, will they be putting your needs first? Will they be supporting you in other non-financial matters, like getting through the program, advisement, etc? \n\nReally.  Maybe this isn't the program for you.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "358": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1495564653, "Score": 1, "Body": "Oh, I'm not in a program, this is about *supplementing* my income in a future program. You're right I expect some income while I do it, so maybe I could do with less like $70k.", "Permalink": "https://www.reddit.com/by_id/t3_6bppj7.json"}, "359": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1495573839, "Score": 1, "Body": "Is there any chance you can spend longer in the field to get more interviews? Do phone interviews? It may really be worth it in the long run, particularly if you are seriously questioning now that your data might not be enough, meaning that everyone else will question it to. The job of examiners is to critique, so I reckon they'll definitely critique your sample size, and then question why you only spent a small amount of time in the field or why you had fieldwork constraints (which should've been eliminated where possible through good research design). So you really need to have a strong justification at defense and within the thesis. Start reading the small sample size literature now and see if your justification/s are rigorous enough based on the literature. I apologise if I am sounding harsh, but I am just thinking how an examiner would read this. \n\nAnyway, best seek and act on the advice of your supervisors. It's what they are there for, to help with situations such as these. \n", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "360": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1495584019, "Score": 2, "Body": "Do you have to go so far? I know people who go on writing retreats that are within 30-150 miles. Consider what kind of writing context you need to be productive and if that's possible closer.", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "361": {"Subreddit": "PhD", "Author": "0RPHAN_GRAB", "Date": 1495585354, "Score": 1, "Body": "I don't have to go that far I guess, but I really want to get out of Australia, and once you do that, flights are roughly the same prices wherever you go. But it's true - I could look for somewhere a bit closer. I just really had my heart set on England. ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "362": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1495585874, "Score": 5, "Body": "If it were me, I'd be too excited about traveling in a new place, I wouldn't write. I'd need to strike a balance.", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "363": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1495587886, "Score": 1, "Body": "The only issue here is that it will be much harder to get your supervisors help and if you come across sections that need more data then you won't be near your lab. You didn't say what area youre in though so maybe all of that is digital for you.", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "364": {"Subreddit": "PhD", "Author": "0RPHAN_GRAB", "Date": 1495588693, "Score": 1, "Body": "My supervisors are never around anyway and are of VERY little help, which is why I don't see this as such a big deal. I've currently been writing for two months and neither of them have been in the country for more than a week of that whole time, and when they were back, neither had time for a meeting with me. If I needed more data, the whole process of getting animals would take more than three weeks anyway so I could do that from afar and then come back to research. But you're right - I should've thought about those things before making a snap decision. It's just by chance that neither of those things are really a factor for me at the moment. ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "365": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1495591541, "Score": 1, "Body": "For me it was the age difference. My advisor was older than my dad and I would call him professor, but my second advisor was in his mid thirties and I would calll him by his first name.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "366": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1495599361, "Score": 2, "Body": "As a fellow Australian I would really suggest just going somewhere else in Australia or maybe to NZ depending on what side of the country you're on. It would just be a lot quicker to get back home if you needed to. I'm in Perth so I have previously gone to Rottnest and Busselton to write but if you were over east you could go up into the mountains or something.", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "367": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495606089, "Score": 1, "Body": "It's good to know that people have generally appreciated your persistence. Gives me a bit more confidence to keep at 'em! Today I sent an email that required two yes/no's, and got a response to one of them - so, progress! Thanks for you advice, I'll try to worry less about being persistent :)", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "368": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495606262, "Score": 2, "Body": "I think that making it relevant to him is one of my biggest struggles! He's actually a pretty practical guy - his role is definitely research based, but he never focuses on publications much. He's more involved with the \"real world\" and does a lot of work for companies, I think he actually sees papers as a waste of time to be honest. Maybe if I try to push the possible applications of my stuff in the real world, he'll keep being interested. Thanks for your advice :)", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "369": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495606437, "Score": 2, "Body": "I did this and said I'd submit it on Friday unless he wanted to make changes. And... success! Thanks for this advice, can't believe I didn't think of it myself :)", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "370": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1495606633, "Score": 2, "Body": "You'll learn :) you need to make sure that your supervisors are never your bottleneck (which is difficult). The best way is to make sure that you can always move forward by yourself, and just give them updates on your progress where they can interject where needed. You turn their lack of replies into approval.\n\nAlso well done and good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "371": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495606698, "Score": 1, "Body": "Also a fellow Australian, I think flying to England might be a little excessive and you'd likely be better off saving your money for after your PhD. Not sure if you've been before, but it's not really that different to Aus and the time zone difference is definitely problematic for keeping in touch with home (i.e. supervisors). \n\nDepends on exactly where you're from, but I agree with antihero790's idea about NZ. I also find getting out to the country is a good change for me. I'm not from an overly big city or anything, but my boyfriend's family has a farm and it's a great escape when I really need to focus on writing. There's minimal other distractions and it's kind of nice to stop and help out with the farm when I'm tired of looking at my screen. ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "372": {"Subreddit": "PhD", "Author": "alexashin", "Date": 1495607739, "Score": 2, "Body": "good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6cse9i.json"}, "373": {"Subreddit": "PhD", "Author": "manning021", "Date": 1495608475, "Score": 1, "Body": "What is the attraction of England?", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "374": {"Subreddit": "PhD", "Author": "sethzard", "Date": 1495610854, "Score": 1, "Body": "I'd say go to another city to do writing, save England for when you're free. ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "375": {"Subreddit": "PhD", "Author": "mensgarb", "Date": 1495643474, "Score": 2, "Body": "Look into Kathy Charmaz' work. Here's a book on the topic: \n[Constructing Grounded Theory](https://books.google.com/books?id=y0ooAwAAQBAJ&amp;printsec=frontcover&amp;source=gbs_ge_summary_r&amp;cad=0#v=onepage&amp;q&amp;f=false)", "Permalink": "https://www.reddit.com/by_id/t3_6d1ei5.json"}, "376": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": 1495646537, "Score": 2, "Body": "If you're not a purist you might be interested in Clarke, A.E. (2005). Situational Analysis: Grounded Theory After the Postmodern Turn. Thousand Oaks: SAGE.\n\nThere's also a short paper (2003) with a similar title that could serve as a brief introduction to see if it fits your needs. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6d1ei5.json"}, "377": {"Subreddit": "PhD", "Author": "BensBrotherJoe", "Date": 1495654167, "Score": 1, "Body": "I usually find a new environment gives me new ideas. If your the same it might help with your writing, give you a different perspective on it. That said travelling half way around the world and then having to spend most of the time working on your PhD might make you resent it.", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "378": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1495681877, "Score": 1, "Body": "Every researcher I know at various institutions goes by first names with grad students... except for my advisor who insists on being called professor in some weird ego thing.", "Permalink": "https://www.reddit.com/by_id/t3_6c4one.json"}, "379": {"Subreddit": "PhD", "Author": "I_am_the_liquor69", "Date": 1495682300, "Score": -2, "Body": "remind yourself of all the hot co-ed poon you will get as a post-doc", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "380": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1495690021, "Score": 5, "Body": "I have found that regular exercise is crucial for me. Maybe start a routine while the weather is good and hopefully it will last through the crummy part.\n", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "381": {"Subreddit": "PhD", "Author": "fitshifu", "Date": 1495696504, "Score": 2, "Body": "Have her book already, still find it somewhat confusing. Thanks though!", "Permalink": "https://www.reddit.com/by_id/t3_6d1ei5.json"}, "382": {"Subreddit": "PhD", "Author": "fitshifu", "Date": 1495696522, "Score": 2, "Body": "Will definitely do, thank you for your input!", "Permalink": "https://www.reddit.com/by_id/t3_6d1ei5.json"}, "383": {"Subreddit": "PhD", "Author": "neuronhunter", "Date": 1495701081, "Score": 3, "Body": "I'm stuck with a $90,000 eye tracking machine. No one knows how to run it and even worse is the fact that no one knows how to analyse the data!! Ugh", "Permalink": "https://www.reddit.com/by_id/t3_6d5m3o.json"}, "384": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1495705484, "Score": 3, "Body": "What does this mean?", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "385": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1495708903, "Score": 2, "Body": "They're talking about using your position as a post-doc to sleep with undergraduates.", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "386": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1495711516, "Score": 1, "Body": "What kind of a loser would dream of that lol. People do Phd to increase human knowledge and become scientist and this guy wants to get laid", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "387": {"Subreddit": "PhD", "Author": "I_am_the_liquor69", "Date": 1495720443, "Score": 0, "Body": "what's the name of your waifu pillow", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "388": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1495724328, "Score": 4, "Body": "My entire first year was consumed by generating a set of cell lines that over-express genes from a particular family. I busted my ass on the project - worked 7 days a week and repeated the experiments over and over. I was able to make lines for 5 of the 7 genes, but two of them just never worked. It looked like the overexpression of these two was lethal. My mentor kept chewing me out, telling me I was incompetent and maybe I wasn't cut out for science, etc. \nAt the end of that year, I migrated desks in the lab (window seat!) and came across a stack of lab notebooks that belonged to a PhD student who had graduated the year before I joined (I'd never met her). I skimmed them, and to my amazement, she had already done the *exact same experiments* I was currently attempting and she'd come to the same conclusion. Over-expression of 2 of the genes in the family were lethal.  \nWhen I confronted my mentor with the notebooks, he shrugged and said, \"I didn't think she was right, so I had you repeat it.\" Of course, he never mentioned that I was repeating something someone else had already tried and failed to do.  \nI dropped that project immediately and moved on.", "Permalink": "https://www.reddit.com/by_id/t3_6d5m3o.json"}, "389": {"Subreddit": "PhD", "Author": "Larianna", "Date": 1495726464, "Score": 2, "Body": "Here is what helped me. \n\nGo outdoors, join your school's adventure club, hike, canoe, camp with friends. It's like rediscovering childhood. \n\nMeditate. See if your school offers classes, better even biofeedback. I got into secular Buddhism during grad school, even if you're an atheist you can be spiritual in the sense that you take care of your body and mind. \n\nEat healthy, make sure you sleep. Learn to say no. Find a good counselor, even if you don't need one now you might at one point, PhDs are super stressful. \n\nEdit: punctuation\n", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "390": {"Subreddit": "PhD", "Author": "qingkonglingling", "Date": 1495742291, "Score": 2, "Body": "Nothing exists there for me to carry on.", "Permalink": "https://www.reddit.com/by_id/t3_6d5m3o.json"}, "391": {"Subreddit": "PhD", "Author": "Macncheesecatcoffee", "Date": 1495746157, "Score": 2, "Body": "Had my viva on Monday. Had the same sort of thing (small error in the method). \n\nEither: \nremove one.\ncorrect it.\ndeclare that you used different spatial scales to capture the same result.\nignore it for now but tell them early on in the viva that it's a weakness.\nremove one and stick it in an appendix.\n\nIt is not a problem :)", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "392": {"Subreddit": "PhD", "Author": "samesesame", "Date": 1495746725, "Score": 2, "Body": "I can't rerun the experiment unfortunately. I think maybe it is best to put it in the discussion. \n\nI'd be too scared to ignore it then declare it during the viva as maybe they'd think \"what else is he hiding?\"  \n\nI presume just being honest is the best policy in this case. I'd much rather be forthcoming about experiment limitations/errors than pretend they don't exist. ", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "393": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1495746749, "Score": 1, "Body": "Woohoo!", "Permalink": "https://www.reddit.com/by_id/t3_6dchum.json"}, "394": {"Subreddit": "PhD", "Author": "Macncheesecatcoffee", "Date": 1495747312, "Score": 2, "Body": "They won't think you're hiding stuff.  They'll appreciate the honesty and self-critical reflection on the accuracy/redundancy of aspects of the work.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "395": {"Subreddit": "PhD", "Author": "samesesame", "Date": 1495748440, "Score": 1, "Body": "Ok thanks a lot - makes sense!\n\nI'm probably overreacting a bit.", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "396": {"Subreddit": "PhD", "Author": "Macncheesecatcoffee", "Date": 1495749118, "Score": 2, "Body": ":) Don't worry.  It'll all be cool.\n\nYou made everything else cool right?  'Tis but a mere bagatelle :)", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "397": {"Subreddit": "PhD", "Author": "samesesame", "Date": 1495749538, "Score": 1, "Body": "Everything else is fine :)\n\nJust this chapter, which is raising my blood pressure hah", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "398": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1495762322, "Score": 1, "Body": "I do literally all of the tricks you mentioned, and I too struggle to stay upbeat and motivated... usually at least one day a week is difficult in that regard. It's not always easy to be happy when working on my PhD, so I try to focus on lifting myself up at the end of the day. Even on a day where I don't feel like I've worked enough, I make myself stop by 7pm and spend some time doing things that make me happy. For me that's playing video games, reading a book, or watching TV with my boyfriend.\n\nA few of the other tips here are definitely really good - exercise is super important, and even a short walk can make a world of difference to your mood. As for meditation, I'd also recommend this but sometimes I find my brain's too \"full\" for it to be relaxing. In that case, two things I find meditative are cooking/baking and drawing/colouring because they require your focus but none of your academic abilities.", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "399": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1495794612, "Score": 1, "Body": "From my experience, it's always been completely dependent on the individual professor. My current dissertation chair responded to me within a day (in person). I had one committee member agree the moment I asked him to be on my committee (in person). However, another one of my committee members took over TWO MONTHS to respond (through multiple emails). I finally got so tired of waiting for his response that I looked up his class schedule and waited for him outside of his class, then asked in person. Some professors ignore or procrastinate and some are much more receptive to requests from students. Do you have any kind of previous contact with the professor? If so, it should be easier to gauge how lax/aggressive you should be with emails and whatnot. If not, maybe ask other Ph.D. students who know him about advice on how to approach him. \n\nFor me, in person discussion about my topic and project has always been more effective. But, some professors might feel ambushed if they perceive you as being overly persistent with requests, which just makes for a bad start to a long-term working relationship. Basically, I think it really just comes down to the individual professor's attitude. As I mentioned, maybe ask other people who know him how they think you should proceed. I realize this response is rather long and vague; sorry it's like 4am here and I'm a little book-drunk.", "Permalink": "https://www.reddit.com/by_id/t3_6dds1q.json"}, "400": {"Subreddit": "WitchPhD", "Author": "sethy04", "Date": 1495798824, "Score": 1, "Body": "I love you jew mama", "Permalink": "https://www.reddit.com/by_id/t3_5k6b7a.json"}, "401": {"Subreddit": "WitchPhD", "Author": "Rimefang", "Date": 1495799916, "Score": 8, "Body": "Welcome back.  We missed you. ", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "402": {"Subreddit": "WitchPhD", "Author": "Oilers_Fandago", "Date": 1495800562, "Score": 2, "Body": "Holy no NSFW flag Batman", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "403": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1495800576, "Score": 3, "Body": "Good morning!", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "404": {"Subreddit": "PhD", "Author": "humblebragman", "Date": 1495801169, "Score": 4, "Body": "I have some advice for you, but you may not want to hear it! \n\nI was in a similar position (defended 3 months ago) and I had a small error in one of the first chapters (maths PhD). The examiners pointed it out straight away, and I got grilled for ages about it. I accidentally said that I had spotted it and ignored it, and my external examiner was furious... She said that to leave such a mistake in was intellectually dishonest. Although I got through the thesis, she made me personally submit further proofs for every bit of work in my thesis. \n\nMy advice would be to own up to it immediately - it's cost me a LOT of time. ", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "405": {"Subreddit": "PhD", "Author": "samesesame", "Date": 1495801730, "Score": 2, "Body": "Thank you for the reply.\n\nThat does sound tough. Thankfully my error isn't theoretical.\n\nI e-mailed my supervisor this morning, and owned up to the mistake and mentioned my doubts and worries. He told me to mention to report what I did and raise the issue in the discussion/conclusion. He told me it is key to make it clear how it led to much more thorough work in the later pieces of work. That having some self-criticism pointing to new work in this particular chapter as part of the discussion is fine, but that I should not overdo the criticism!\n\nI feel better about things now having owned up to my supervisor and that he knows.  ", "Permalink": "https://www.reddit.com/by_id/t3_6dc88g.json"}, "406": {"Subreddit": "WitchPhD", "Author": "Dash_2", "Date": 1495805612, "Score": 2, "Body": "Yeahhh misses you ❤️❤️❤️", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "407": {"Subreddit": "WitchPhD", "Author": "Whatifisaid-", "Date": 1495806032, "Score": 6, "Body": "It's on her personal sub... wouldn't that be expected?", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "408": {"Subreddit": "WitchPhD", "Author": "Whatifisaid-", "Date": 1495806083, "Score": 2, "Body": "Welcome back, it's been too long. And what a lovely greeting this is. :)", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "409": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1495809551, "Score": 6, "Body": "Phd economics forum on Urch.com will be able to answer your questions \n\nGRE you need a top score on quant to get in the best programs (168)\n\nAus/NZ aren't really that strong. Also my understanding is Aus has recently changed immigration rules so finding work there after will be difficult.\n\nMainland Europe has some decent schools: Bonn, UPF, Toulouse. In UK LSE is good. \n\nAll phd programs will have stipends. Range depends on program and country. It'll be enough to get by but not much more.\n\nAsking if it's worth the time: you have to ask if you really want to go into academia?\n\nEconomics is a broad field so you have to narrow down what specific field you're interested in and from there you can figure out which schools are best for you ", "Permalink": "https://www.reddit.com/by_id/t3_6dh4cr.json"}, "410": {"Subreddit": "PhD", "Author": "lochazalare", "Date": 1495810229, "Score": 1, "Body": "Thank you :)", "Permalink": "https://www.reddit.com/by_id/t3_6dh4cr.json"}, "411": {"Subreddit": "PhD", "Author": "severok007", "Date": 1495822690, "Score": 2, "Body": "Thank you for your reply!\nI took his class once, so he knows me. Unfortunately, he is from another departments, so it is not easy just to catch him in the office.", "Permalink": "https://www.reddit.com/by_id/t3_6dds1q.json"}, "412": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1495838165, "Score": 1, "Body": "Generally, they should respond back to the email within a week. If they don't that's not a good sign (for wanting to work with them). You don't want to run some analysis, send it to them, and wait super long for them to get back for your email.\n\n  \nThat being said, some professors just aren't good with email, so if they have open door policy, and are good when you show up, then that could work too. In which case, you should probably approach them in person to gauge how good they would be.", "Permalink": "https://www.reddit.com/by_id/t3_6dds1q.json"}, "413": {"Subreddit": "WitchPhD", "Author": "Nachtjunge", "Date": 1495848992, "Score": 2, "Body": "Welcome back! =)", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "414": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1495874768, "Score": 0, "Body": "1. Not sure what GRE&amp;TOEFL is. I assume English language certification? If so, we can't answer that question for you. It depends how confident you are with your English skills.\n2. Depends on why you are pursuing a PhD in the first place and what your career goals are. Do you want to work in academia? If so, yes, doing a PhD is worth it.\n3. It's tedious to list every 'renowned' university in NZ, AU, UK and the US. Best you google this.\n4. There are a few pathways for scholarships. Most universities offer scholarships for international PhD students, but are very, very competitive and you'll probably need publications already. There are also Government scholarships (host and home countries). Again, best you google this.\n5. We can't advise on potential cost of living and cost of tuition when you don't even known which country you are going to. If this is going to be a factor in deciding which country to do your PhD in, google it.\n6. No idea. Google it.\n7. No idea. Google it.\n8. Depends on your PhD topic.\n9. Depends on your PhD topic. If you don't like calculus, don't pursue a PhD topic that requires calculus or whatever.\n10. No idea. Ask one of your friends who have travelled overseas before.", "Permalink": "https://www.reddit.com/by_id/t3_6dh4cr.json"}, "415": {"Subreddit": "WitchPhD", "Author": "sleightofhand68", "Date": 1495879689, "Score": 2, "Body": "Beautiful and are you really a phd?", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "416": {"Subreddit": "WitchPhD", "Author": "imembarrassedwithme", "Date": 1495887351, "Score": 2, "Body": "You've been missed so badly!", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "417": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1495905174, "Score": 1, "Body": "Just a word of warning, the majority of UK PhD programs don't offer scholarship for international (non-EU) students and in the rare cases they do it only covers fees. Most funding in humanities and social sciences comes from govt funding agencies which specifically ban people who don't have residency in the UK when they apply from getting funds. ", "Permalink": "https://www.reddit.com/by_id/t3_6dh4cr.json"}, "418": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1495912144, "Score": 1, "Body": "Thanks for clarifying. OP should consider b schools which spoil their students (relatively) :)", "Permalink": "https://www.reddit.com/by_id/t3_6dh4cr.json"}, "419": {"Subreddit": "PhD", "Author": "LimeShower", "Date": 1495926384, "Score": 1, "Body": "My PhD Supervisor sometimes would insta-reply, and other times months. I agree with DougFunny &amp; coindepth about tracking the person down as often in person things can get sorted quicker. \n\nIf you are not happy with the reply time let it be known before it becomes habitual. ", "Permalink": "https://www.reddit.com/by_id/t3_6dds1q.json"}, "420": {"Subreddit": "PhD", "Author": "greenwhiskers", "Date": 1495965731, "Score": 1, "Body": "Definitely a good idea, I do it often - both my honour's and master's theses were written on the Sunshine Coast (I live in Melbourne). I recommend staying in Australia though - keeping the same time zones with your supervisors / libraries / colleagues / friends etc will take a lot of stress away. \nAnd just head north, find a self contained airbnb in a small, not super touristy beach town (Coolum, Yeppoon etc) and get into a nice early morning beach walk, write all day rhythm. Good luck!! ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "421": {"Subreddit": "PhD", "Author": "gilwendeg", "Date": 1495970492, "Score": 6, "Body": "It may seem obvious but I think the main thing to bear I mind is that it's a defence.  Your examiners will pose questions designed to test the strength of your arguments and to expose possible weaknesses.  In my experience I hadn't really heard my work criticised before (I suppose my supervisors were being supportive) and I found it very hard going, particularly given that the viva was entirely critical.  I left feeling they hated it.  It wasn't until I read the written report that I read their enormous praise for large sections of my thesis. \n\nIf I could go back I would have had my supervisor in there with me. He wouldn't have been able to say anything, but a friendly presence would have helped.  In my case departmental problems meant that I had two external examiners and department head I didn't know, so three new faces.  \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "422": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1495979732, "Score": 1, "Body": "No, not harsh, very helpful! I can try to spend longer in the field but I don't have that much time. PhDs in my country are quite short. I will try and expand my number of interviews but at a certain point I think I'm going to exhaust all my possibilities.", "Permalink": "https://www.reddit.com/by_id/t3_6bwufc.json"}, "423": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1496002198, "Score": 2, "Body": "A colleague of mine gave me a tip that I thought was useful (though full disclosure I was too high on adrenaline to remember to do it, so I have not tested it!) He said to bring a pen and notepad in with you. Take notes as you go. Then if you get a question that throws you, you can take a minute to write it down, and it will give you the time to think of an answer, and also prevents you just immediately answering and potentially babbling or not making sense. Also helps you focus on the question clearly, too. But no need to worry, I'm sure you will be fine! Just re read your thesis and remember that nobody knows your work better than you. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "424": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1496013821, "Score": 2, "Body": "As simple and cliche as this sounds, it really is the best advice. Regular exercise (3-4 days a week) really instills a certain blend of day-to-day motivation+confidence. Top on some good music and the work will take care of itself, negative lab environment or not.", "Permalink": "https://www.reddit.com/by_id/t3_6d731v.json"}, "425": {"Subreddit": "PhD", "Author": "BecB21", "Date": 1496029738, "Score": 3, "Body": "All you need is a pass :) Chookas! ", "Permalink": "https://www.reddit.com/by_id/t3_6dxuez.json"}, "426": {"Subreddit": "PhD", "Author": "BecB21", "Date": 1496030333, "Score": 1, "Body": "Our university offers writing bootcamps. It's an online community- very motivating. Wherever one ends up make sure there's decent facilities etc. Personally in a similar situation and decided to be persistent and reward later. A weekend away might also be a good recharge. I've something planned every fortnight until the scholarship ends. Ultimately you know yourself best. ", "Permalink": "https://www.reddit.com/by_id/t3_6cyh3v.json"}, "427": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1496030905, "Score": 2, "Body": "All you gotta do is ask them.", "Permalink": "https://www.reddit.com/by_id/t3_6dxxae.json"}, "428": {"Subreddit": "PhD", "Author": "neridarius", "Date": 1496031594, "Score": 1, "Body": "I plan on doing that during the interview tomorrow; I just wanted to calm my nerves tonight haha! Thanks for being a voice of reason.", "Permalink": "https://www.reddit.com/by_id/t3_6dxxae.json"}, "429": {"Subreddit": "PhD", "Author": "sinaiticus", "Date": 1496038018, "Score": 5, "Body": "As different as each PhD experience is for all of us, one thing that we all share is the kind of self-doubt and isolated loneliness you describe in your reflections.\n\nIt's quite simply a brutal part of the process that we all have to endure, and even our family and friends often lack categories to sympathize with just how difficult and lonely it all is. This cannot be news to you. It is axiomatic of the experience of every person I've talked to who is either in or has gone through the process.  \n\nI don't really have any advice beyond what is evident from what you've posted. It is evident that you are not \"dumb\" since you're published and you are already this far in your graduate level studies. \n\nAdmittedly, social graces are a key component in hiring and advancement, but so is simply good work. There are plenty of paths to making your distinct contribution to your field, and the most important aspect in reaching that goal lies in the results of your studies and your ability to demonstrate that you are very, very good at what you do. \n\nI don't know your discipline, but I have always felt that what we need in academics is professional, functional work product, not more Ted Talk experts. I wouldn't feel so bad about what kind of scholar you are not, and cultivate the kind of scholar you can naturally become with your talents and proclivities.\n\nIf overcoming certain social anxieties is a priority for you, it does take hard practice and work. I have several colleagues who have overcome severe autism (not suggesting that you are) and they have gone on to become highly capable, even publically personable and engaging scholars (although they keep strict limits so that they can maintain a certain level of sociality before they have to withdraw -- it is very taxing for them). When they share their experiences, they liken the process to learning a foreign language - which does not sound ideal, but it makes sense for them. \n\nJust hope you hang in there. We all need encouragement - even if it is from random strangers on the internet. I hope you stick with it and that you can find your place to thrive in it.  \n\nCheers\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "430": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1496038366, "Score": 0, "Body": "You can do it, we believe in you. I know it's hard being the youngest PhD around (I'm like you 25 in a group of married people all i coming in their thirties), but you have friends so you're a step a head of the game already. They don't have to understand how hard your course is, only how hard it feels for you, chances are you're much more interesting to them than research so just make it about you. We all wonder if we can really do it at least once, many of us once a day, but I bet you already know you can do it or you wouldn't have made it to second year. \nI wish I had three publications, so jealous.", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "431": {"Subreddit": "PhD", "Author": "kroberry", "Date": 1496054454, "Score": 3, "Body": "I agree with what has already been said. I think EVERYONE experiences the imposter syndrome where they get a semester or two deep and think \"did they accept me by mistake.\" \n\nThe best advice I ever received was when in doubt just focus on putting one foot in front of the other and somehow everything gets done.\n\nAlso, my colleague MaK was only 21 when she started out program. She's never had a break from school. But she's gotten over her insecurities about age and managed to prove herself otherwise. I am the next youngest (I was 25 when I started). And sure, I definitely envy others with life outside of school who can relate to one another but I have noticed that the self pity that comes with being a Phd program (or rather, the preoccupation with self loathing) is only abated by spending time with others who don't get it and give me an opportunity to distract and remember that there IS life outside of academia.\n\nGood luck. Keep your head up and before you know it you'll be a candidate and in your way to getting the hell out of here!", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "432": {"Subreddit": "PhD", "Author": "Bth-root", "Date": 1496056091, "Score": 1, "Body": "Is your PhD scientific/lab-based or in an arts field?", "Permalink": "https://www.reddit.com/by_id/t3_6byavr.json"}, "433": {"Subreddit": "PhD", "Author": "keebz11690", "Date": 1496063465, "Score": 2, "Body": "I'm not in a Marketing/Business PhD but I think in most fields you are not expected to be published before entering a PhD program. From what you write I do not see any negatives to hurt your chances. You could always ask the faculty at your prospective programs what qualifications are most important for their incoming students. ", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "434": {"Subreddit": "PhD", "Author": "rainbowreally", "Date": 1496063994, "Score": 2, "Body": "At my university they actually warned us about imposter syndrome in the introduction sessions at the beginning of PhD. Almost every PhD I've talked to has experienced it at some point, even my supervisor I remember talking about it. \n\n3 publications is good going in my book! You know what your strengths and what you perceive your weaknesses to be (however, you don't know how much of that perception is insecurity and how much is actually how other people see you).\n\nMy advice is ask your friends for some honest feedback, get a handle on how you come across socially (might not be as bad as you think!) and if you still feel you need to balance out your skillset maybe take some presentation skills classes (at my uni they have a researcher development programme where they offer generic skills development such as this, so perhaps they have something similar where you are?). Also going to conferences, practicing networking are good for developing those skills you feel less confident in. Even if you have a lunchtime journal club just to do a bit of academically focussed socialising that could be helpful to build your skills and confidence up. Or maybe seek out a mentor/coach who could give you some support to help you feel more confident to try these things, and to help build yourself up.\n\nFor me, I had two years working in healthcare that really developed my work communication skills. Without this I think I would probably feel insecure as a PhD student too. What it took for me was just accepting that I had a skills deficit and then putting my energy and resources into developing that side of myself. We all have strengths and weaknesses, and even though being socially awkward is a pretty stigmatised weakness to have, it isn't any worse than any other. In fact I can think of other weaknesses that are worse than being socially awkward, such as weaknesses that hurt other people (being selfish etc). At least being socially awkward never hurt anyone, except maybe yourself.\n\nIt sounds like from your post that you have a fundamental lack of belief in yourself both academically and socially. My career has really only been able to start thriving when I started believing in myself. By this I mean all those moments when a belief came into my head that I couldn't do something well or that I was just a bit rubbish compared to others I had to consciously shut that belief down using evidence from my life. It sounds like you're doing that a little already because you've given plenty of evidence that you're actually good academically, so the trick is really focussing on the good and not letting the doubts stand in your way. Hope that makes sense!\n\nTL/DR: You might not be as bad as you think socially, but even if you have weakness in this area you can develop it. Social awkwardness is not the worst thing ever, and it doesn't define you as a person. It's only a skill or lack of, start believing in yourself and from there, you can start building your skills!", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "435": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1496064337, "Score": 4, "Body": "Sooooo... did you dieded ?", "Permalink": "https://www.reddit.com/by_id/t3_6dxuez.json"}, "436": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1496064700, "Score": 11, "Body": "Magna cum laude!!!!!! Means dope thesis!! :) :) \n\nMy supervisor thanked me for choosing his lab and my little scientist heart melted :) :)", "Permalink": "https://www.reddit.com/by_id/t3_6dxuez.json"}, "437": {"Subreddit": "PhD", "Author": "rainbowreally", "Date": 1496065009, "Score": 1, "Body": "I can't speak for your field as it's not mine but I would agree being published is not necessarily a requirement.\n\nI have spoken to a PhD on my program who interviewed at another institution when he was finishing his masters and they were like \"why haven't you published anything yet?\" He didn't get that program but he got on the one we are both on currently.\n\nWhile I was finishing my masters I was in touch with a few prospective supervisors who were super critical and mean, and others who were amazingly supportive and helpful. For me, success in getting a PhD place was down to networking, finding a good supervisor and then generally doing my best to build my reputation as an academic/researcher and my work relationships. Does your current institution offer the program you want? Because it sounds like you have already managed to do most of that groundwork with your current professors.\n\nAlso, just so you know I am halfway into my first year and I still don't have a publication. I hope to publish at some point but my priority is getting my PhD done. I'm not sure at the moment that I want a career in research/academia so for me it is probably different than to most here. But publication is not the be all and end all - rather more important in my experience is meeting the right people and demonstrating your potential as an academic/researcher.", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "438": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1496066048, "Score": 1, "Body": "What's your GMAT? 700 is generally the minimum for top schools \n\n\nRegarding your MBA: in Europe this can be tricky. Most PhD programs are 3-4 years because they require a 2-year research master before admission. An MBA usually isn't considered that, but some schools will consider it on a case by case basis. \n\n\nThere are lots of good schools for marketing - best way to determine is to use the UT Dallas rankings and filter by journal (for marketing journals only): http://jindal.utdallas.edu/the-utd-top-100-business-school-research-rankings/search#rankingsByJournal\n\n\nDo you have research interests or a specific field of marketing you're considering?", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "439": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1496072534, "Score": 3, "Body": "Loughborough Uni put is compiling a list of questions former PhDs were asked in their viva. Might be a useful resource to prepare for potential lines of questioning.\n\nhttp://www.lboro-phd-network.org.uk/links/the-viva", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "440": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1496074700, "Score": 1, "Body": "the folks at http://www.urch.com/forums/phd-business/ are all business PhD students and aspiring students, so they can give you the most relevant advice.\n  \nVery few applicants in marketing will have publications, however, if you're aiming for top schools, a significant portion of them will have research experience (RAships, lab experience, or working on actual projects with professors). So if you don't have any research experience, then you should look into ways of getting it.", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "441": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1496075688, "Score": 1, "Body": "Like the others have said, impostor syndrome seems to be par for the course. In my case, I am not the youngest in my cohort, but I am probably the least experienced. I worked in media for about seven years before deciding I wanted to do something deeper than the daily news cycle and got into research.\n\nI'm the only one without any publications. I've gone to just one conference ever, and that was back when I was doing my master's. I'm also struggling to cope with poor self-regulation and an internet+gaming dependence (extremely ironic given that my field is game studies; I'm spending too much time playing and messing around online to study the other people playing and messing around online). I'm also separated from my loved ones (significant other, family); I moved to a different country for my studies and still feel guilty about leaving them behind, especially now that my country is experiencing a lot of conflict. (This is a tough thing when it comes to the internet; one of the reasons I feel compelled to keep checking my feeds is to see my friends and loved ones just living normally.)\n\nAfter some panic attacks in my first semester, I decided to go see a school counselor to help me deal with my anxiety, guilt, and control issues. She really helped me to reset my perspective. That and a bit of mindfulness training on my own is helping me to be less anxious. I am hoping to also lessen my dependence on the internet and games. But I'm also learning that I can't expect instant results from therapy and training, and it will take time for me to find the right balance. I've just completed my first year, and I still have a long way to go, academically and psychologically. I am hoping to learn to be kind to myself (but also not too easy on myself). \n\nIf your school offers counseling services and you feel you need someone to talk to face-to-face, I encourage you to give them a try. A good counselor will help you recalibrate without making you feel ashamed about asking for help.\n\nAs for learning presentation skills, don't be too hard on yourself. I am mostly introverted but have come to enjoy giving presentations. Classmates even say I'm good at it. But it took practice and time to build my confidence. Best wishes, OP. Give yourself time.", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "442": {"Subreddit": "PhD", "Author": "luvingood", "Date": 1496076315, "Score": 1, "Body": "Thanks for replying. Sadly my college doesn't have a Phd program. I have been actively reaching out to current and former Phd students at my top choices. Surprisingly they are eager to talk. I will start focusing on reaching out to faculty as well. Thanks again. ", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "443": {"Subreddit": "PhD", "Author": "luvingood", "Date": 1496076763, "Score": 1, "Body": "My GMAT score is 730. I forgot the exact distribution though. That sucks about Europe as there are some great schools I really liked. Thanks for the info. I will take a peek at it ASAP. \nDuring my MBA coursework I got really interested in customer decision making and how to influence it. This will be something I would like to research in depth. ", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "444": {"Subreddit": "PhD", "Author": "luvingood", "Date": 1496076862, "Score": 1, "Body": "Thanks for the advice. That website looks promising. ", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "445": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1496081655, "Score": 1, "Body": "No. Having publications is always a plus, especially when applying for fellowships, but I attend a top 5 program and I did not have any pubs. I also know a lot of people that got into top 10 programs in science and engineering that didn't have any pubs either going in. And I'm sure science and engineering candidates are more likely to have those when applying than business majors.", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "446": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1496083391, "Score": 1, "Body": "It helped me land into the best possible program based on my profile. Once you've familiarized yourself with the site, feel free to request a profile evaluation.", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "447": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1496083526, "Score": 1, "Body": "In Marketing, if you're going for consumer behavior, vast majority of applicants to Top 20 programs are coming from psych and have lab experience and maybe more than that (working on actual projects). So they might not be published but they have professors who can speak to their research ability.  \n  \nVery little expectation for that on the quant side, but then you're expected to have a lot of math, and top scores on GMAT/GRE.", "Permalink": "https://www.reddit.com/by_id/t3_6dzmbi.json"}, "448": {"Subreddit": "PhD", "Author": "yonyonson69", "Date": 1496085436, "Score": 2, "Body": "What is your area of study?", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "449": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1496085857, "Score": 1, "Body": "Sociology/political theory", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "450": {"Subreddit": "PhD", "Author": "p10_user", "Date": 1496096251, "Score": 6, "Body": "I'd say it gets easier just because you are now focusing on 1 thing (though perhaps with some side projects and components) as opposed to juggling multiple classes and exams. This transition felt great for me once I finished my classes.", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "451": {"Subreddit": "PhD", "Author": "Luke-S-Robinson", "Date": 1496104705, "Score": 2, "Body": "Firstly, congratulations for starting your PhD. It is a massive achievement in itself to commence such a beast. \nSecondly, congratulations on having three publications under your belt. That is a massive achievement early on in your research career. \nThirdly, do not be discouraged! \n\nI think it is a rite of passage to feel lonely in the PhD process at times. I think when you face these troughs in the rollercoaster ride that is a PhD that you make good use of your supervisers (tell then your thoughts / feelings as they may be able to direct you to suitable resources); find like minded individuals (either face to face or online); give yourself permission to feel completely out of your comfort zone, overwhelmed or discouraged as these are all feelings that will occur for everyone at some point in time in most things they do in life; read books on communication (e.g make it stick) or the PhD process as if you are feeling these things chances are someone has written about it somewhere; lastly make sure you have fun outside your studies. Keep your hobbies. Keep your smile. Keep your integrity. Keep your passion and drive. Keep on going!! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "452": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1496107918, "Score": 3, "Body": "I think it highly depends on A) the quality of the student going into the program and B) the degree of competency attained during the process of graduate school.\n\nFor simplicity, let's throw students into three categories\n\n1) A student that wasn't well prepared for their program, still barely understands essential concepts 2-3 years in, is always missing deadlines, and is consistently performing below expectations - They will struggle to put something meaningful together for their dissertation. For them, the difficulty just increases year after year until they either leave, get dismissed, or slide through somehow.\n\n2) A student that perhaps wasn't as prepared as some other candidates, but makes considerable effort to gain knowledge and meet expectations - this student might struggle quite a bit until year 2-3, until they 'get over the learning curve' or 'hit their stride'.\n\n3) The student that was well prepared and already has a great work ethic that will tell you he/she only works 40 hours a week on their PhD, and speaks nonchelantly about the difficulty they've experienced in their program. You know, the rare student we are somewhat amazed by/jealous of.\n\nSo if you were a 'type 1' student, it will only get harder year after year and the experience can become mentally crushing. If you are more of a 'type 2' student, there is still a lot to learn/do outside of coursework and comprehensive exams, but hopefully you can achieve a comfortable tempo one-half to two-thirds of the way in.\n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "453": {"Subreddit": "PhD", "Author": "Mouspikpis", "Date": 1496108632, "Score": 1, "Body": "It just gets easier to deal with difficulty IMO. Same applies to life in general.", "Permalink": "https://www.reddit.com/by_id/t3_6e1zme.json"}, "454": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1496111056, "Score": 1, "Body": "Got nothing really to add to what others have said, but I'd say May the force be with you. We all need it! ", "Permalink": "https://www.reddit.com/by_id/t3_6dybn5.json"}, "455": {"Subreddit": "PhD", "Author": "LimeShower", "Date": 1496142081, "Score": 1, "Body": "Hey Gilwendeg, I have two externals and one internal so I can understand two external nerves to some extent, I keep trying to critically read my work! Thank you for the advice :) ", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "456": {"Subreddit": "PhD", "Author": "LimeShower", "Date": 1496142128, "Score": 2, "Body": "This is an amazing idea!! Thankyou so much I tend to fumble over words so will defiantly use it :) ", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "457": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1496142401, "Score": 1, "Body": "No worries, glad it was useful! Good luck :)", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "458": {"Subreddit": "WitchPhD", "Author": "Chugachoo", "Date": 1496155325, "Score": 1, "Body": "It's been too long, happy to see you're still out there.", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "459": {"Subreddit": "PhD", "Author": "SatanakanataS", "Date": 1496161070, "Score": 1, "Body": "Perhaps focus on the efficacy of therapies like ABA, and the resulting impact on the lives of those involved. ", "Permalink": "https://www.reddit.com/by_id/t3_6e7wui.json"}, "460": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1496161128, "Score": 2, "Body": "Aren't you better off asking your supervisor? I'm clearly not an expert on the subject, but what you write here seems pretty vague...", "Permalink": "https://www.reddit.com/by_id/t3_6e7wui.json"}, "461": {"Subreddit": "PhD", "Author": "TheBlondeWithTheTats", "Date": 1496162548, "Score": -2, "Body": "Why can't I do both just to get potential ideas? It's not like I'm forced to use whatever input someone gives me. I'm not banking on someone on reddit to come up with some magical question. I'm simply just asking for thoughts in order to brain storm. Part of higher education is networking with other scholars outside of your school to get input. Since social science is mainly theory based, it's important to try and see people's perspectives outside of your immediate networking circle.", "Permalink": "https://www.reddit.com/by_id/t3_6e7wui.json"}, "462": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1496162863, "Score": 2, "Body": "&gt;  I'm not banking on someone on reddit to come up with some magical question.\n\nPerhaps you're not, but that's how I took it when I first saw your thread :-)", "Permalink": "https://www.reddit.com/by_id/t3_6e7wui.json"}, "463": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1496203747, "Score": 1, "Body": "Worth a compelling application and story you could look to go the Masters route and get a shot to prove your undergrad was a reflection of some condition that no longer exists.  If you're able to wipe the slate clean there, I'm not sure your undergrad has to be the defining milestone in your career. \n\nThat said, if you don't deeply understand the why's of your undergrad and feel confident you're in a better place to succeed, I'm not sure it's the right move to make. ", "Permalink": "https://www.reddit.com/by_id/t3_6c3hlr.json"}, "464": {"Subreddit": "WitchPhD", "Author": "eligiussantos", "Date": 1496210042, "Score": 1, "Body": "Aphroditi tis Milou!", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "465": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1496240849, "Score": 2, "Body": "It's more a formality, just relax and be a stud!", "Permalink": "https://www.reddit.com/by_id/t3_6dt725.json"}, "466": {"Subreddit": "PhD", "Author": "clydefrogsmom", "Date": 1496251614, "Score": 4, "Body": "You can publish under whatever name you want or feel comfortable with- just be consistent. I have many friends that publish under their maiden name because it's either more unique or because they already started publishing before they got married or a shortened version of their name (e.g., Jon for Jonathan). Why not your nickname plus last name if that's how you introduce yourself in academic environments? ", "Permalink": "https://www.reddit.com/by_id/t3_6eg3pv.json"}, "467": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1496256783, "Score": 5, "Body": "This was me, I did manage to submit albeit a few months late. I think I should have simply written a smaller amount everyday. Maybe a page or two is enough, or a paragraph. Then go play video games or whatever else. Small amounts of writing will build momentum to get through the trough your are in.", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "468": {"Subreddit": "PhD", "Author": "rutnatuM_ainmO", "Date": 1496266057, "Score": 2, "Body": "You're not alone. I'm on exactly the same position as you. ", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "469": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1496269915, "Score": 1, "Body": "It depends on the journal, some say to type out your whole name etc. I've seen all versions, but becuase you use a version of your middle name that may not be on your passport/academic transcript (registration) I would not use that. It is a professional paper, and thus requires your true, professional name.", "Permalink": "https://www.reddit.com/by_id/t3_6eg3pv.json"}, "470": {"Subreddit": "PhD", "Author": "AtonalTimpanist", "Date": 1496269933, "Score": 1, "Body": "I'm also in my late 20s. I took a few years off between undergrad and this opportunity to work full time. ", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "471": {"Subreddit": "PhD", "Author": "prettyleafart", "Date": 1496269948, "Score": 5, "Body": "Don't do it. ", "Permalink": "https://www.reddit.com/by_id/t3_6eihw1.json"}, "472": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1496270081, "Score": 3, "Body": "I set a target of 500 words a day. Some days were easier than others, but it adds up, and for the most part you get quite a bit of free time. \n\nAlso focus on your structure by making out a chapter plan, with your section headings prepared. I found it a lot easier to just fill in the blanks that way. ", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}, "473": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1496270096, "Score": 1, "Body": "Likewise, the only time I've seen someone use a nickname was in presentations (not on posters because again that is a professional, printed document). But in presentations I've seen examples like XiaJia (Cindy) Lu and this is often done with those who have difficult foreign names and use a Western name for ease. But, on their related poster, they only use their true name without nicknames.", "Permalink": "https://www.reddit.com/by_id/t3_6eg3pv.json"}, "474": {"Subreddit": "PhD", "Author": "Arfusman", "Date": 1496274149, "Score": 2, "Body": "Take a break for a week or two. I usually get the best ideas when Im on vacation or doing something relaxing. ", "Permalink": "https://www.reddit.com/by_id/t3_6eh0uf.json"}}