{"0": {"Subreddit": "PhD", "Author": "a000h", "Date": 1491033088, "Score": 1, "Body": "Hi all, I hope this isn't too offtopic. I just released this site into beta and thought that you guys were probably the best people to give me feedback.\n\nI was looking for a site where I could subscribe to very specific topics and discuss papers as they appeared, but couldn't find anything, so I built this.", "Permalink": "https://www.reddit.com/by_id/t3_62rer8.json"}, "1": {"Subreddit": "PhD", "Author": "a000h", "Date": 1491034749, "Score": 1, "Body": "Hi all, I hope this isn't too offtopic. I'd been looking for something like this but couldn't find it, so I built it. I thought that of all the people on the internet, the Reddit PhD crowd would be best placed to give feedback.", "Permalink": "https://www.reddit.com/by_id/t3_62ri6u.json"}, "2": {"Subreddit": "PhD", "Author": "Howulikeit", "Date": 1491075847, "Score": 2, "Body": "I believe that you would be able to find a job with a PhD in OB, but you aren't going to get any specific training in pursuing industry options. You are trained exclusively to become an academic. I applied to OB programs and I/O psychology programs and ended up accepting an offer from an I/O program because there are industry options within the field. I/O might be more micro-level than what you are looking for though.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "3": {"Subreddit": "PhD", "Author": "i_am_square", "Date": 1491117902, "Score": 1, "Body": "Hey just filled the questionnaire. I guess I went for the \"safe\" option each time. It took me &lt; 5min to fill, the hard part was trying to figure out what changed between the current question and the one before. Maybe highlight the changes so it's easier to figure out?\n\nBest of luck for your research!", "Permalink": "https://www.reddit.com/by_id/t3_61skrd.json"}, "4": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491143830, "Score": 2, "Body": "I'm funded. Couldn't do it otherwise. \n\nI do know people who are not funded, but it's because they're doing it part-time and work a full time job, usually as a course instructor/teacher/consultant. In Canada, there are restrictions that if you work more than 38 hours per week (I think), then you are thought to have enough income to sustain yourself and pay tuition. There might be other qualifications, but I'm not sure of them.", "Permalink": "https://www.reddit.com/by_id/t3_629ue1.json"}, "5": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491143994, "Score": 1, "Body": "No publications when I applied. But I did have peer-viewed conference presentations. It's expected that you'll have a few in my field (STEM) to be competitive for jobs by the time you graduate. I'm (hopefully) in my final year, and I hope to have 4 by the time I'm done, so like one a year? The number does not include conference presentations. However, I'm not a top-tier PhD student. I know people who had a bunch. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "6": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491144207, "Score": 3, "Body": "In my opinion, change your supervisor. Are there structures in place that can help you lodge a complaint without it jeopardizing your candidacy in your university? ", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "7": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491144662, "Score": 1, "Body": "It's a big commitment. But there are many ways to be an academic. You can choose the more research-oriented route or you can choose to be more in the practitioner/teacher field. But as a student especially with a fellowship, you are not going to avoid doing/writing research. And the ways of institutional research are quite pedantic and require a certain set of skills (that you CAN cultivate).\n\nI teach Masters students, and a lot of them found out that they hate writing their theses, and thus research, because we're very picky with their methods and writing before allowing them to deposit. \n\nThis is not a great comment, but I know a lot of students who piggy back off their supervisor's bigger project to write their dissertations, so they didn't have many problems with ethics and methods, as would a person who's publishing completely original research. I mean, if ultimately you're stuck without a research question, you could possibly do that. But that said, don't worry. You haven't even started yet. Your research focus will change multiple times as you take classes, do research with other people, and are exposed to different ideas. ", "Permalink": "https://www.reddit.com/by_id/t3_61pu5n.json"}, "8": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491144784, "Score": 1, "Body": "Yikes. I'm sorry you're going through this. You aren't alone.\n\nApply for a leave of absence so you can take care of yourself and your mental health. There is no shame in it.", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "9": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491145459, "Score": 2, "Body": "First, what you're feeling is natural and there is no shame in it. \n\nNext, I would say start a journal about the things that you are grateful for, e.g. your family loves you, you have people who care about you, you are in a top PhD program, you are almost done, etc. Utilize your university health resources to find a mental health professional - both psychologist and psychiatrist/doctor. See if there's a reason for your physical symptoms or if you need anti-depressants. \n\nAlso have an honest conversation with yourself. Do you need a break? Do you need a leave of absence? What would make you happy? Nothing is worth your mental health.\n\nAs other people here have suggested, do something that takes you outside of yourself and gets you out of your mind. I would recommend exercise (for the endorphins), but do something fun and perhaps more social, that is, not in the gym. I have academic friends who do rock climbing, combat, Zumba, canoeing, etc. I personally do ballet, burlesque and pole dancing. HOWEVER, I understand that sometimes when you're in it, you just feel too tired to do any of those things. I would suggest possibly getting a pet, reconnecting with family, SCHEDULING (as in putting in your calendar) things to do for yourself that are not related to your PhD, etc. ", "Permalink": "https://www.reddit.com/by_id/t3_610uu8.json"}, "10": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491145522, "Score": 1, "Body": "Lol. This looks great. \n\nI started one at my uni too. It's really helpful sometimes.\n\nBut whiskey and silent sobbing works too.", "Permalink": "https://www.reddit.com/by_id/t3_61yu3n.json"}, "11": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491146585, "Score": 2, "Body": "Great idea!!!\n\nI would love that.", "Permalink": "https://www.reddit.com/by_id/t3_61n1y8.json"}, "12": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491146976, "Score": 2, "Body": "Print QUALITY business cards.\n\nStart a professional Twitter account to follow the conference.\n\nPractice a bit of small talk beforehand so you can handle sustaining a 2-5 min convo without making it awkward to exchange info (I need to follow my own advice, haha).\n\nDon't overload your schedule with presentations. Leave time to network. This may actually involve leaving the centre/hotel for lunch/dinner in favour of networking. GASP. When I was a noob, I never wanted to leave the convention centre, but you can burn yourself out.", "Permalink": "https://www.reddit.com/by_id/t3_6140yg.json"}, "13": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491151204, "Score": 1, "Body": "I agree. Unless you can't find the source then say, (Y as cited in X, 2009). ", "Permalink": "https://www.reddit.com/by_id/t3_61ktle.json"}, "14": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491151295, "Score": 1, "Body": "That's such an arrogant presumption. No wonder you're a PhD student. ;)\n\nThat said, I didn't give my participants anything for their interviews. ", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "15": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1491151438, "Score": 1, "Body": "In every university I have been I took part in each study there was and in turn people took part in mine.\n\nBut that is not only with other people doing research, but students or people outside of the university are interested to take part in studies in order to help science and also learn more about the topic.", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "16": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491151838, "Score": 1, "Body": "Yes it was a joke, hence the emoji. I thought I established it with my own anecdote of not paying people to participate in my own study. Did your studies drain you from taking a little gentle ribbing too?", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "17": {"Subreddit": "PhD", "Author": "CleverDan520", "Date": 1491164354, "Score": 8, "Body": "I agree with your advisor. Don't be concerned with being a \"quitter.\" Do what's best for yourself and your future whether that be the job or the phd. ", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "18": {"Subreddit": "PhD", "Author": "averageginge", "Date": 1491164959, "Score": 9, "Body": "You can always turn down a job offer. Taking the  interview is a no brainer in any situation. Beyond that, do what is best for your future. You can always finish your PhD another time if now doesn't feel right.", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "19": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1491171285, "Score": 7, "Body": "What are the employment and career opportunities like for PhD grads in your field? If you're going to end up completing the PhD just to wind up in the same kinds of jobs that you've been headhunted for then is it worth the investment? Similarly, in your industry, is there a glass ceiling for those without a PhD?\n\n", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "20": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1491181302, "Score": 2, "Body": "Maybe the part about publishing here is useful to you:\n\nhttps://www.youtube.com/watch?v=T8ugPibs5Us\n", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "21": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1491182718, "Score": 2, "Body": "That job sounds too good to be true so make sure you interview them as much as they interview you. Training plus a sig figs pay doesn't add up. It seems like if they will pay you that well, they would expect you to hit the ground running. \n\nAsk about the vacancy and try to feel out if there was a predecessor who was unsuccessful. Try to gauge the stress level and your responsibility. Make sure they aren't setting you up to fail. ", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "22": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1491185023, "Score": 1, "Body": "How far are you into your PhD? If you are 70 percent done or so, I'd say finish. If you are 20 percent done and like the offer, and you don't want to finish the PhD, then take it. Either way, it never hurts to take a meeting.", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "23": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1491185077, "Score": 2, "Body": "Good point about the glass ceiling. Definitely something to consider. ", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "24": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1491189942, "Score": 3, "Body": "You should leave. It's insane to tie yourself to someone who doesn't support you.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "25": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1491190540, "Score": 2, "Body": "I'll echo researchedit's great responses and add this. Getting a PhD hurts you in industry. If you want to go into industry get an MBA (or a master's in HR). The coursework will be easier, more industry focused, have better networking, and better career placement. As getting a PhD is utterly unnecessary for corporate jobs it just comes as a signal you were unsure if you wanted the corporate world (you're uncommitted). You'd also get egg head stereotypes. Jobs as a business professor are actually far easier to come by than in most other academic fields. Those unable to land good ones typically go to bad schools or become consultants, it's rare to see someone in a typical HR job with a PhD. Only go this route if you know you want to do and love research.", "Permalink": "https://www.reddit.com/by_id/t3_61l0ln.json"}, "26": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491195431, "Score": 3, "Body": "Make sure you get independent advocates on your side who can vouch for you as a person and as a scientist/other worker. This is independent of if you switch main mentors or not.\n\nMy advice is don't get caught with your future resting only in his hands.  I've seen this kind of behavior and it's usually done by bosses who are micromanagers and/or insecure about their own futures, and thus trying to use trainees as their personal indentured servants, attempting to trap them.  This is worse when the trainee is international and visa issues are at stake.  Makes my blood boil.\n\nAbsolutely look for someone more reasonable if you can.  Do this before it's too late.  There might also be some issues in terms of your research and credit, given many people can be protective of work that was done using their grant money (I don't know what field you're in, so this may or may not be a serious issue).  \n\nRemember that depending on what kind of job you're looking to get after this experience, if it has anything remotely to do with research, you may need to provide a research mentor recommendation to the employer (this isn't always the case, but can be.  My company always checks references, though we're small).  This is where a supervisor can royally screw people over who they do not want to leave their research group, by giving a poor recommendation.  Hence my opening statement.\n\nIt's horrible you were blocked from attending conferences.  It's time to find your own way, if you can, because this is your future, not his. Protect it.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "27": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1491200509, "Score": 28, "Body": "Don't worry it's a bummer doing one with a partner too, they'll never truly get it, and at times they'll be upset with your dedication to your craft. The grass is always greener on the other side but the truth is that doing a PhD is almost always a bummer. \n\nSeriously though find a friend or two you can out with once or twice a week to decompress, it makes a world of difference. ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "28": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1491204529, "Score": 2, "Body": "This was really interesting and helpful, thanks :)", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "29": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1491216010, "Score": 8, "Body": "It's not inappropriate at all.\n\nWhy not invite a friend or 3 over, cook them dinner. Ban any talk on PhD life, talk about anything but that bloody thesis. If they have any shred of humanity - which they should as PhD students - they will return the honour. Boom, you've got at least 3 meals you don't have to worry about.\n\nAlternatively, cook all your meals the week before then bung them into the freezer. \n\nHonestly though, if this PhD shizz was easy, everyone would be doing it. ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "30": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1491216110, "Score": 1, "Body": "Amazing tip. Noted", "Permalink": "https://www.reddit.com/by_id/t3_6140yg.json"}, "31": {"Subreddit": "PhD", "Author": "2xw", "Date": 1491218546, "Score": 1, "Body": "I'm moving to York to start a PhD in October. I already live in Sheffield on 9k a year quite easily", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "32": {"Subreddit": "PhD", "Author": "piglet33", "Date": 1491219433, "Score": 4, "Body": "Ugh I feel that. My ex broke up with me just before starting my PhD and I often think how helpful it would be to have someone to split the chores with, alternate cooking, etc. My friends here are amazing and give me an incredible level of emotional support, and because they're going thru it they get it.\n\nI guess, what I'm trying to say is friends can help and you can do it! And you're definitely not alone in feeling this way!", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "33": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1491225900, "Score": 2, "Body": "I'd see if you can invite those friends over for some wine (BYOB for cost), some cheese, and just camaraderie. ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "34": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1491226516, "Score": 1, "Body": "Possibly nothing. Keep in mind that offering incentives makes it into a financial transaction instead of relying on norms of helpfulness and them wanting to be good. Plus nothing is cheap.", "Permalink": "https://www.reddit.com/by_id/t3_60hvc8.json"}, "35": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1491243034, "Score": 5, "Body": "Would definitely second this point. As a PhD student, you dedicate a huge chunk of your time to your work, and your SO can start to feel neglected. So, they try to make use of YOUR minimal free time as much as they can and will sometimes detract you from your work/obligations. It's a huge struggle when you are with someone that's got a very different work-life balance.\n\nAdmittedly, I often cherish the odd instances I get the weekend to myself to unwind and just do whatever the hell I want.", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "36": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1491245828, "Score": 3, "Body": "I got my PhD 2 years ago and now work as a data scientist at a teaching hospital. The salary depends on thee industry and location. Where I work, there are very few places that do datascience so the salaries are quite low. Like $70,000-90,000. In thebig cities like NY, or Silicon valley similar jobs can get you about $120,000 if you have the same experience.", "Permalink": "https://www.reddit.com/by_id/t3_6351f8.json"}, "37": {"Subreddit": "PhD", "Author": "nadalvettel", "Date": 1491258318, "Score": 1, "Body": "I feel your pain sucks cause my friends boyfriends are doing their phd's also or finished so they always end up helping their partners with experiments or give advice ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "38": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1491259247, "Score": 3, "Body": "Agreed. I was single throughout my entire PhD process...and I'm still single now. Im not sure I would have been a good partner throughout the process, but I will agree, it can be very lonely.", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "39": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491260604, "Score": 2, "Body": "I was single for half my PhD experience and part of the reason that I went out and started dating was because I wanted something in my life where I felt like the time I put in would get me something in return! Even if that was awkwardness and self doubt :P\n\nI did do social things outside the research world, though. I did martial arts (trying to meet guys but that didn't really work out as planned), joined my grad student council, which is great for your resume in more ways than one, BTW, and hosted board game nights in my tiny studio. I did cultural events and volunteering and freelance writing, too. \n\nWhen you're lonely, sometimes you just need to organize something and you'll provide a reason for other lonely people to get out of the lab or office, and then hopefully no one is lonely anymore. \n\nAlso, relationships are hard, even good ones. They can make you doubt yourself and your assumptions as deeply as your thesis research, so it's not always a horrible thing to not have to deal with that during grad school. But if you find a keeper, they can definitely help provide the bigger picture perspective that life exists outside research. \n\nAt least try to socialize with friends a few times a week, and make efforts to meet new ones. I wouldn't have survived grad school intact without awesome people around.", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "40": {"Subreddit": "PhD", "Author": "jukate", "Date": 1491260869, "Score": 2, "Body": "I've been in a relationship for 10 years and been doing my PhD for the last 2.5. I still feel lonely all the time and find my relationship sometimes as more of a burden than a blessing. I worry I am not giving my SO enough time, helping enough with chores, or am limiting his life in some way since we are restricted to a specific town for my education and he is working a job he hates while I am in school. \n\nThis period of life is hard no matter what. The grass is always kinda dying on either side :( ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "41": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491261065, "Score": 5, "Body": "First of all, ALWAYS interview when you have the chance. Always. At best it's a new door opening. At worst it's practice for the real deal. No matter what, you win. \n\nSecond, if your boss is a reasonable human being and said try it, that's even better. You have a supportive mentor, and those are to be listened to. \n\nTypically for data jobs, if you're willing to relocate to a place there big data exists, you're going to be popular. Check out the place carefully.\n\nThe glass ceiling kind of exists, but PhDs are still considered a weird degree in certain fields. At a certain point in your career path, having a terminal degree can be helpful, but until you get to that point, you'll always have to explain why you, a PhD, is applying for_____ job. Not a deal breaker, just something to keep in mind. Having a PhD can be helpful for advancing quickly in any kind of research or science position, as well as health or management level position, but certainly isn't necessary. ", "Permalink": "https://www.reddit.com/by_id/t3_630vg8.json"}, "42": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491263761, "Score": 2, "Body": "If your program sucks, it's not your fault if you feel stressed out. Don't hurt yourself because a program is not taking care of its trainees. \n\nWhat stresses you out the most right now? Failing experiments? Problems with people in the lab or on your committee? \n\nThe world is A LOT bigger than the academic research world. If you need or want to talk to someone, just to vent, or get a bigger perspective on things, PM me. ", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "43": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491277764, "Score": 2, "Body": "Sadly, it's almost impossible to hold a conversation &gt; 3 mins with him. And when we do speak, he'd refused to look me in the eye and constantly angling his body away like he doesn't want to be here, and actually does inch away at every sentence. He speaks rudely, and almost always ends it with \"do you want to graduate or not!?\" or something along the line. He doesn't reply to e-mails as well. It's impossible to have a civil discussion these days.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "44": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491277900, "Score": 2, "Body": "I'll be talking to a thesis committee advisor soon, actually. Made an appointment with her right after I submitted this post on Reddit. I'll listen with an open mind, map out options, etc. Wish me luck :)", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "45": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491277946, "Score": 1, "Body": "Thank you. This is a difficult thing to do, but I'm seriously considering it. ", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "46": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491278047, "Score": 3, "Body": "Good! \n\nLuck!", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "47": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491278982, "Score": 3, "Body": "Thank you so much for this. Upon reading your 2nd paragraph my jaw dropped because my supervisor is exactly like that. Every Western Blot that we've to run, every experiment (down to the dose-dependent assays to optimise for toxicity, for example) had to go through him. A senior grad student (she's since graduated, also without a rec letter and suffered just as much) was scolded in public for doing \"secret experiments\" - quoting my supervisor verbatim. She was just running one gel to look at one phospho-protein.  \n\nI'm an international student, and I've to graduate by 2018 (that's how long my student pass lasts). The good thing about the conference is, I just found out I've been granted a traveling grant by the conference itself. It's enough to cover my 14-hour roundtrip flight, so... I'm going ^^\n\nPrior to posting this on Reddit, I was gonna give up. Try to graduate on time, etc. But after reading this, and talking to another PI (the independent advocate you mentioned, I think he's been really helpful, and he was visibly disturbed when I finally told him what'd happened), I think, you guys are right, I should fight for this. I'd given too much to not reap the results in the final lap of the PhD.\n\nI'd lost all my respect for my supervisor since a couple of years ago. I found out that he keeps a dossier of my senior and my \"wrongdoings\" (they're harmless stuff like going to seminars without apparently notifying him in advance, or questioning his science), uses them to threaten us with disciplinary actions, blackmailing us with \"do you want to graduate with a Master instead?!\" so we'd shut up and do what he asked, and more recently, slamming tables, shouting, staring down at me from the other end of the corridor, etc. \n\nIt's a nuthouse down here.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "48": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491279218, "Score": 1, "Body": "I've been both single and in a relationship during my PhD process, and it can suck on either ends of the spectrum. \n\nI'm sorry that you're going through this, but there's light at the end of the tunnel.", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "49": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491279487, "Score": 1, "Body": "If you are in a funded program, in my experience, you are assigned a supervisor and given a research/teaching assistant job. In other words, you don't find funding, funding finds you. Lol. They match you up according to what your research interests are, usually. \n\nMost PhD students I know get about poverty line funding. They supplement with tutoring, scholarships, other part-time jobs.", "Permalink": "https://www.reddit.com/by_id/t3_5xlpws.json"}, "50": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491301116, "Score": 3, "Body": "Damn. Looks like you got one of the bad apples. No reasonable mentor will care about running gels and all should welcome their trainees questioning and brainstorming with them. And attending seminars without \"permission\"? He doesn't own you. He's supposed to mentor you to become a great scientist, not treat you like a slave. \n\nIn general this is true for all managers: only the insecure ones care about the petty things, because that's all they think they can control. True leaders raise their team up, help their mentees grow. Fake leaders push their team down to make themselves look good in comparison, because they can. Remember that; it's useful knowledge for life. \n\nDo your best to network like crazy at the conference. Bring business cards. Visit vendor booths and talk to people doing interesting science. Introduce yourself to strangers. Really work the network and remember that everyone in science really loves to talk about science, so engage with people in your field. Remember that your next steps is yours to take. \n\nNot every mentor sucks, so remember that what's going on in your lab is NOT NORMAL. Find advocates and open doors on your own. But don't openly complain about your mentor to strangers, except obviously to people you trust. Projecting a professional attitude will help you in the end, and you'll be able to leave this insecure person in the dust of your future career. ", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "51": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491388852, "Score": 2, "Body": "Hokay, had a talk with said Prof this morning. And... the advice was basically just submit the thesis and graduate on time. Publications, recommendation letters are all secondary (I absolutely disagree with this). I was given the option to escalate it to the faculty level, but that would mean having my supervisor on board as well, and THAT would mean I won't be able to graduate at all. \n\nI'll be meeting up with the university's graduate counselor. See how to map out my options after this.\n\nWish me luck (again ^^)", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "52": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491390364, "Score": 3, "Body": "I'd just spoken to another PI, and the advice is basically submit the thesis on time and defend it. The rest (publications, recommendation letters) are secondary. \n\nI've 4 months left before my scholarship end, so I'm writing up my thesis. I sincerely appreciate all your advice and comments, and have given them serious consideration. After speaking to this PI (who holds admin position at the Dean's Office) it feels like escalating this issue will be futile since they're likely to side with my supervisor. \n\nI hear you, I'll take full advantage of the conference, cast my net, hopefully something will catch. I've been presenting my work at various local symposiums and conferences the past couple of years when I realise my supervisor isn't invested in this anymore. I believe it's one of the few ways to take back control and make the most of this horrible PhD journey.\n\nI'll be meeting up with the university's career counselor soon to map out options given current circumstances. I do want to stay in research. I find academia really strange, to be honest. Back in the clinic, there's just no time and energy left for putting-people-down, back-stabbing and BS-politicking. First and foremost is always the patients, and there's no hierarchy (as in, a lab tech or a nurse can point out mistakes to the Dr/specialist, and there's no hard feelings 'cause a mistake *can*, at worst, kill - and then there's the lawsuits). I got a culture shock when I came back to academia, as pointing out mistakes (be it the science or technique) often results in - and I quote verbatim - \"this is my lab, my grant, there are things you cannot say to your PI\". \n\nIt is disheartening that such people are given so much discretionary power over young and highly spirited postgraduate students.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "53": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1491400362, "Score": 1, "Body": "Nice. This seems like the ideal way! What did you do? ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "54": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1491404145, "Score": 3, "Body": "I had an idea that was close and interesting to me. I didn't have to join a lab or another project - thank god. I received a strong funding package to support my studies. I'm now publishing off those findings. ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "55": {"Subreddit": "PhD", "Author": "abighazard", "Date": 1491404526, "Score": 1, "Body": "I'm funded less than half of that per year - I have to work part time but even then it's still less than 14k all together, and I considered myself to be living comfortably. 14k is ample!", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "56": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491404590, "Score": 1, "Body": "Is there no in between, so it won't waste your time? Like changing supervisors without lodging a complaint? Say like you're in the process of writing and need minimal supervision, but you need someone who's in your field, write rec letters, and will just look at your dissertation? Or create a thesis committee that is very supportive? ", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "57": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1491408227, "Score": 3, "Body": "I was told that my original idea was too controversial for a dissertation, and thus had to change to something loosely related. ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "58": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491414546, "Score": 6, "Body": "As many people have said, a PhD is a marathon, not a sprint. Do you have the energy to deal with bureaucracy, lots of paper work, people differences, delays in research due to ethics, personal issues, etc? A doctoral degree isn't something you really \"flirt with.\" There is a reason why there is such a high attrition rate. It can be immensely rewarding but also very soul-sucking. \n\nYou say that you've been disillusioned with the traditional academic system. A PhD is not likely going to help you with that image. It still adheres to antiquated ideas of knowledge and processes. You will have to jump through hoops, expected to network with people you don't like, pay for conferences (yes you'll get supplemented or stipends but not always), apply to scholarships and write in ways that might not be to your style, do university service for free, etc. Even with the application, you're going to have to demonstrate your fit with the institution in very traditional ways, e.g. GPA, lab experience, conferences, publications, references.\n\nNext, you say you're excited to be in your field. That's a great start. No, you don't have to narrow your questions when you first apply. No one expects you to know what you're going to do when you first enter the program. The first year or two is about you taking courses, opening your mind to different theoretical frameworks and methodologies, etc. Almost all the PhDs I know have changed their initial ideas of their research projects. In terms of merging a few fields, do your research about your university. Make sure there are faculty there who can support that kind of work, and if there are collaborative programs about the fields you're interested in. Programs vary widely. Reach out to certain professors before applying. (READ THEIR WORK!) Say you're interested in working with them. Find out if they're taking on new students, if they're going on sabbatical, if they're willing to meet for an informal meeting (some are, some aren't - not an indication of the program or actually who they are as researchers/supervisors), etc.\n\nIf you've still interested, onto the more practical aspects. You want the PhD, but does the PhD want you?\n\nNow the next part is, what's your GPA? Do you have research experience? Do you have at least 3 references you can readily call on - two academic, one professional? Can you write academically? Can you take those ideas in your post and write a coherent academic plan of study? Do you have publications? Have you ever presented at conferences? What are your academic skills? Do you have an idea of who you want to work with? How will you fit in with the department? Do you have an idea of the university you want to attend? Do you know the program? Do you have financial support? If not, are you aware of the scholarships that you will have to also apply for on top of your applications? They require references too. Do you have interpersonal supports? Are you willing to move? \n\nA PhD can be a huge lifestyle adjustment. I'm not trying to deter you from going for it, but there needs to be a lot more consideration and research into it other than a good GPA and reading a lot.\n\n\n\nEdit: For grammar and content.", "Permalink": "https://www.reddit.com/by_id/t3_63l5hd.json"}, "59": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1491424404, "Score": 5, "Body": "Never do a PhD if you know going in that you don't need to. It's very hard and not in the ways that most people think. It is taxing on all fronts and the only thing that gets most people through the process is having a defined reason for why they are completing the process. For me, that was teaching at the college level.\n\nDoing a mater's to pick up skills isn't a bad idea, but doing a MS in Psych to get skills in stats and programming seems like an odd choice. I would do some research into online programs (prioritizing free or cheap software based programs) before looking towards grad school. ", "Permalink": "https://www.reddit.com/by_id/t3_63nica.json"}, "60": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1491424867, "Score": 9, "Body": "I had a desire to to a PhD on a specific topic. I looked for a supervisor who would be a good fit and sent him a draft proposal. He replied that he had a funded place for work exactly like this and how said could I start. Perfect. \n\n5 years later, the dissertation that I wrote had nothing to do with the proposal that I wrote. It was in the same basic area, but what happened during the dissertation was that one idea led to another and another and then I found myself in a different place to where I started.  \n\nThe moral: don't get too hung up on the proposal. It's a guide for the area in which you will work, not the final say on what you will do. ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "61": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1491425004, "Score": 7, "Body": "PS. As a rule academics are experts at twisting work to look like it was doing what the funding asked for and vice-versa. ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "62": {"Subreddit": "PhD", "Author": "LMJ_H", "Date": 1491425914, "Score": 2, "Body": "God I'm feeling your pain right now. Just the process of having to invest in both your professional AND your dating life is exhausting. And people will always brush over how your PhD is going but go straight to 'how's your love life?'. My friends are amazing in their support, but they are not a partner. Maybe this post (and the replies) will help in letting you know you're not alone?", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "63": {"Subreddit": "PhD", "Author": "JHarbinger", "Date": 1491430190, "Score": 2, "Body": "nah just grab the podcast.", "Permalink": "https://www.reddit.com/by_id/t3_5dy7hy.json"}, "64": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1491436655, "Score": 4, "Body": "I guess I'd have to ask what your goal is with the project. It seems like your kids are into the idea but want to do it in a way that they're familiar with and you're trying to make them do it in a traditional way. Why not meet them half way and let them do it their way but with some specific guidelines? Forcing kids to learn new software just to make a poster that you like isn't going to teach them anything. They'll just follow your rules to get the grade. Letting them be creative while conveying the information in a reasonable way is going to help them a lot more in the long run. ", "Permalink": "https://www.reddit.com/by_id/t3_63mx6r.json"}, "65": {"Subreddit": "PhD", "Author": "dnthrowaway112", "Date": 1491445101, "Score": 1, "Body": "Thanks for the sobering reply, much appreciated.\n\nI think the biggest barrier for me might be the hoops. I'm high on trait openness and often have to bite my teeth with certain conventions, but I am fairly flexible and understand some structure has to be accepted.\n\nI have no research/publications, though this is something I want to pursue. I am writing to formulate my ideas and post on a blog, soon to start Toastmasters and practice presenting seminars; and I'm confident in my ability to learn and adapt to whatever is required. \n\nHonestly I'm obsessed with certain ideas and I love filling my time around them. I'd love to develop new and more effective methods/ideas under proper guidance, test them with scientific research and ultimately progress human knowledge. I want to leave a mark.\n\nPerhaps I need to spend some time volunteering or working at universities. Is Phd my best choice or can I get into research and publishing without it? The title would be nice, but the main motivator is providing evidence for my ideas beyond mere anecdotal evidence. Am I wasting my time if I spend most of this year on self guided study and research? Could that be done in first year?\n\nThanks again for the response. I know I need to spend more time looking into the process, just ignore those questions if a simple google search will do. Or if you can recommend any resources would be much appreciated.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_63l5hd.json"}, "66": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491454902, "Score": 1, "Body": "This is x-posted from something I posted in /r/GradSchool:\n\nYou should take a year to try to do these things: \n\n&gt;https://www.reddit.com/r/GradSchool/comments/25gj24/a_somewhat_notgentle_guide_to_getting_into_grad/\nIf you're set on going to grad school, I would recommend you (as others have said) get a research position to get experience, keep in touch with your references and profs, and try to publish a couple of more things during your year or two off. Also, see if you can volunteer or do something of service at the university, so the admins/profs know you. Yes, taking an extra course or two to boost your GPA won't hurt.\n\n\nYou don't need a PhD to publish, but getting on a research team and publishing in a top-tiered journal would help. If you hate the words \"ranking,\" \"impact factor,\" etc., then you might bristle against what a lot of PhD'ing is about. Unless you're part of an institution, it's going to be hard for you to conduct and publish research, which means you'll have to go through ethics and get it signed off by your PI/supervisor. \n\nHowever, you don't need publications to get in the program in my experience. Obviously it's a boost. I was on the admissions team this year, and it's more about GPA (nothing lower than a B), research experience, references, following application instructions (this seems simple but you'd be surprised), fitting in with the program, finding a supervisor that will take you on. \n\nThink about what you want to do. If you want to be recognized in academia, medicine, and certain business areas, then a PhD might be worth it. \n", "Permalink": "https://www.reddit.com/by_id/t3_63l5hd.json"}, "67": {"Subreddit": "PhD", "Author": "dnthrowaway112", "Date": 1491466053, "Score": 1, "Body": "Thanks again. If you are representative of the people in academia it will be a nice community to be in! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_63l5hd.json"}, "68": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1491468214, "Score": 3, "Body": "I see that you assumed a PhD student can only be friends with other PhD students. Well played.", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "69": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1491470306, "Score": 3, "Body": "I did. My bad. ", "Permalink": "https://www.reddit.com/by_id/t3_634vg3.json"}, "70": {"Subreddit": "PhD", "Author": "comfort-noise", "Date": 1491475662, "Score": 3, "Body": "I had no idea what I wanted to study. I found a university in findaphd.com which was advertising for a few PhD students in the area of motion capture, virtual reality and augmented reality. I send an email to the supervisor, saying that I wasn't sure what I wanted to study, but was interested in the new studio they were setting up. I had a Skype interview, and got the place. When I started that September, my supervisor had a few projects in mind, one immediately jumped out at me, and that's the path I've been on ever since! I never even looked up what my supervisor had worked on (in hindsight, I should have), but I've been really lucky and everything has just worked out for me.", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "71": {"Subreddit": "PhD", "Author": "comfort-noise", "Date": 1491475963, "Score": 1, "Body": "I'm in Bath, getting £14K. One way to cut down on expenses is to live with other people, but that's just not for me. So with rent and bills, I probably spend £850 a month just on them. Still leaves about £300 a month to live on which I can easily do. Meal prep means I don't spend a lot on food, I walk/cycle everywhere, so don't have to pay for public transport.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "72": {"Subreddit": "PhD", "Author": "nixtamal", "Date": 1491482177, "Score": 3, "Body": "Due to work I was limited to only possibly being able to go to one 4-year university in the area.  My Masters degree I had obtained (from a different school) 8 years previously and I had a good topic picked out before I ever applied.  Nobody at the school was working in the area, but the advisor I ended up with was very relaxed and let me do what I want.  Successfully defended yesterday :)", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "73": {"Subreddit": "PhD", "Author": "e11eme", "Date": 1491482624, "Score": 2, "Body": "Congrats! :) ", "Permalink": "https://www.reddit.com/by_id/t3_63lhh3.json"}, "74": {"Subreddit": "PhD", "Author": "rgoodwi3", "Date": 1491516201, "Score": 1, "Body": "Accounting instructor here. \nGenerally you will need a CPA or other professional designation and 3-5 years of practical experience to teach without a PhD. \n", "Permalink": "https://www.reddit.com/by_id/t3_63pu49.json"}, "75": {"Subreddit": "PhD", "Author": "BillyMumfrey", "Date": 1491516295, "Score": 1, "Body": "Sorry I wasn't clear. I want to get my PhD in accounting, despite the fact I have no work experience in the field. ", "Permalink": "https://www.reddit.com/by_id/t3_63pu49.json"}, "76": {"Subreddit": "PhD", "Author": "llllamapajamas", "Date": 1491530308, "Score": 2, "Body": "Oh god ", "Permalink": "https://www.reddit.com/by_id/t3_63tiyz.json"}, "77": {"Subreddit": "PhD", "Author": "jinqianhan", "Date": 1491535227, "Score": 1, "Body": "There's no point doing a PhD in Psychology with those career goals. It's an unneccessarily long path to learning those skills which can be obtained in a much shorter time span (within a year or 2 depending on your dedication. Consider a masters program and instead of just doing the classwork, try some exploratory research yourself in the meanwhile so that you have something to show.", "Permalink": "https://www.reddit.com/by_id/t3_63nica.json"}, "78": {"Subreddit": "PhD", "Author": "wunderbares_platypus", "Date": 1491545891, "Score": 1, "Body": "\"Ask any 5 of your own classmates, at least 3 of them shall tell you the answer.\"\n\nGave me a good chuckle. Stupid people trying to sound smarter I assume. If that is their level of ability I'm not sure I'd want my thesis anywhere near them. Also, moderators should probably delete this.", "Permalink": "https://www.reddit.com/by_id/t3_63tiyz.json"}, "79": {"Subreddit": "PhD", "Author": "Seawallrunner", "Date": 1491547559, "Score": 1, "Body": "Spam", "Permalink": "https://www.reddit.com/by_id/t3_63tiyz.json"}, "80": {"Subreddit": "PhD", "Author": "petergriffin10", "Date": 1491576333, "Score": 3, "Body": "Which field do you want to do your PhD?", "Permalink": "https://www.reddit.com/by_id/t3_63zq7p.json"}, "81": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1491588162, "Score": 2, "Body": "Definitely.  You still have 4 months, and if you're this close, go for the most that you can.  At least if you make the best effort, you will have at least done all that you could in these tough circumstances.\n\nMay I PM you?  I have a few things I'd love to ask, especially after you have a chance to visit your institution's career counselor.", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "82": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1491588736, "Score": 2, "Body": "No idea about Germany or Nordics, but here in the Netherlands, which I consider similar to Germany and Nordics in many aspects, taught master degrees are definitely fine to get accepted to a PhD program, as long as the master degree is from a respected university (let's say, a top 200 worldwide university). ", "Permalink": "https://www.reddit.com/by_id/t3_63zq7p.json"}, "83": {"Subreddit": "PhD", "Author": "unpossibleirish", "Date": 1491595178, "Score": 1, "Body": "I'm in educational technology, but leaning more on the education. She is in nursing.", "Permalink": "https://www.reddit.com/by_id/t3_63zq7p.json"}, "84": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1491635977, "Score": 2, "Body": "At least in Denmark, it's university dependent. Mine required that you've completed a master thesis, and it's one of the primary considerations when getting academic approval after you've been interviewed/selected for the position. But I'm in a technical discipline, and it doesn't seem that this requirement exists at the humanities focused universities.  \n\nDPU (danmarks pædagogiske universitet) at Aarhus University is the best programme for education in Denmark. They have campuses in Aarhus and Copenhagen. You should contact them here and ask about your situation: http://edu.au.dk/en/education/phd-education/  \n\nI'm really not sure about nursing. All health occupations here require fluent Danish, but all PhD studies are in English. I've only ever seen max. kandidat programmes (MSc) in nursing. Metropol is the largest nursing study programme in Denmark. Contacting them is a good place to start: https://www.phmetropol.dk/english/study+programmes/nursing/contact  ", "Permalink": "https://www.reddit.com/by_id/t3_63zq7p.json"}, "85": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1491636483, "Score": 1, "Body": "Depends entirely on country, city, company size, etc. Have a look on glassdoor", "Permalink": "https://www.reddit.com/by_id/t3_6351f8.json"}, "86": {"Subreddit": "PhD", "Author": "grofte", "Date": 1491642304, "Score": 1, "Body": "&gt; Forcing kids to learn new software just to make a poster that you like isn't going to teach them anything.\n\nI'm not going to force them to use any specific software at all. I really just wanted to hear if anyone had examples of good *scientific* posters made in the software that they prefer. Specifically to guide the students. I think a good example is the way to go - I also give them instructions but it's much easier to guide someone with a visual example. If there were examples then they could simply use them as templates. \n\nAnd yes, they have done posters before. It's a process of inching closer to a more rigorous product. ", "Permalink": "https://www.reddit.com/by_id/t3_63mx6r.json"}, "87": {"Subreddit": "PhD", "Author": "learningsomethings", "Date": 1491657945, "Score": 3, "Body": "I started working full time during the last two years of my PhD because there was a job opening to teach at a local college (which is what I wanted to do after finishing my degree) that I didn't want to pass up. It was pretty intense and obviously delayed my graduation. But it was the right decision for me because it's not everyday that an academic position opens up. I also have two small children though, so without kids I imagine it would be a lot more manageable. Your boss will probably/hopefully be supportive if your degree is going to make you more of an asset to the company, right?", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "88": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1491661114, "Score": 1, "Body": "Hi learningsomethings, thanks so much for sharing your experience. I've been eagerly waiting to see if people would reply. :) Hats off to you with working and raising small children! :)\n\nYes, I think you're right about my employer potentially being supportive. They have been throughout my MSc -- it's directly related to the work of the NGO. If my aspirations are realised, my PhD will be an extension of my MSc, therefore directly adding value to the cause. Perhaps what's causing me some pause is I'm relatively new to the directorship, and I think it's reasonable to expect they may baulk at my intentions if it appears I'm being foolhardy or naive. \n\nOf course, no one can possibly predict how that might pan out...but I thought hearing others' stories might be doing due diligence with decision making.\n\nMay I ask, when you applied and were ultimately successful gaining your teaching position, was there any hesitation on the part of your employer? Perhaps it's a non-issue in academia?\n\nMM  ", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "89": {"Subreddit": "PhD", "Author": "learningsomethings", "Date": 1491662001, "Score": 2, "Body": "Hmm, my employer was fine with it, wasn't really an issue. I guess they assume you're going to get your work done and then whatever you're doing on your own time is up to you. \n\nDo you know exactly what program/school you'd be applying to? Maybe you could talk to them about how students usually manage their various responsibilities. For example what happens if you're in the middle of the program and realize it's getting too intense balancing work and school? Can you take a reduced course load? Can you take a leave for one semester if there is a big work project that requires extra attention and then return to your program when work has calmed down?\n\nI think if you have all the information and a plan for all scenarios before telling your employer the conversation will be better (but I feel like it will be fine regardless as lots of people work while attending grad school). ", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "90": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1491680552, "Score": 6, "Body": "Hey i'll try my best. I'm just starting my final year, and I study addictions/epidemiology. \n\nEveryday for me is so different for alot of reasons, particularly lately as alot of my work depends of getting data access to some large cohorts, and variable requesting, which in turn.. after I've done so, can take ages to receive them. So I've been getting frustrated lately feeling like I've been doing nothing... but, I tend to try to do as much as I possibly can to pass the time, so when I have the variables, my analysis will be quick\n\nI go into the office 9-5, on days I work from home, I still stick with 9-5 working vibe. I always listen to music, take extended lunch breaks where I browse reddit/news/facebook and such, but generally always stay ''in work mode'' till 5. I often try to map out a schedule for the month ahead of something to do each day 'write introduction' 'write x' 'find papers on y' So each day I know what task needs to be done, lately its been writing the intro and methods section to a study i've not yet run, but as soon as I get my variables it'll already be half written. I write up everything I do, so i'll have it in time for thesis write up, whether they're publishable or not. On days I dont have writing on, i'll do lit searches and read alot of background work/ keep on top of the field. \n\nI don't know what year you're in but I worked insanely hard my first 2 years and it took a toll on my mental health, my supervisor repeatedly told me i was going to burn myself out, and I nearly did. Now when I meet with him I'm honest with what i've done and if i havent had much on, he tells me to enjoy the periods when its a bit dull-- and I recommend you do to. I find, i get lots of lulls in my Phd, but then all the work pours in at once... papers come back from reviewers, variables come in, code breaks, participants drop out, you get ill.... so on.  \n\nIm not sure if that helped or not- but yes, i spend loads of time fucking about and some days I even leave the office entirely if things arent going well and i need to step away from my work and just come back tomorrow with a clear head. ", "Permalink": "https://www.reddit.com/by_id/t3_6484mr.json"}, "91": {"Subreddit": "PhD", "Author": "LostEuroInTheMidwest", "Date": 1491681556, "Score": 2, "Body": "Same in Scandinavia. I don't even think there is a distinction between research and `taught' masters' in my home country.\n\nEDIT: I think as long as you have an M.S. or M.Phil it should be fine.", "Permalink": "https://www.reddit.com/by_id/t3_63zq7p.json"}, "92": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1491700468, "Score": 3, "Body": "Have worked full time while pursuing a PhD full time for the past four years. Now working on my dissertation. First important factor: I've no kids or dependents aside from a dog and cat (do have romantic partner). Second factor: I live very close to work, so little time lost commuting. Third factor: understanding employer who lets me take flex time around deadlines (finals, quals, etc). Fourth: PhD in religion, so no lab time involved. I do qualitative research (interviews), but mostly work independently. \n\nThat said, here's what I do. I create a clear task list at the beginning of every week including what I need to read, write, and edit. I write on my PhD one hour every morning before work. I read one resource every night before bed by skimming and making notes by hand on a ruled post-it. On weekends, I spend 4-6 hours on my PhD work. I adhere to strict time limits on reading, writing, and editing. I never go for perfection, just the best I can do in the time I've got, then I move on. Anything that needs more attention, I return to during editing, at which time I usually realize I did better than I thought I had when I was first writing it. This keeps me making progress, one steady step at a time. \n\nThe next thing I do is prioritize self care. I need my brain to be sharp. Chronic stress inhibits performance. I always sleep 8 hours, limit caffeine, walk the dog everyday, etc. I don't view this as indulgent. It's a necessary part of my work process. If I skip it, my work quality degrades. I also take Saturday off. Totally off, no work, no schoolwork, just me and my partner. Otherwise I would have burned out by now. \n\nFinally, meditation has improved my concentration and focus immensely. After a few weekend training retreats to learn to meditate, it only takes ten minutes a day. Helps me focus on this boring book or that essay section. I recommend it for all academics. \n\nA full time job and full time PhD is possible. It takes diligence. And some psychology audio books on habit formation, the science of learning, and productivity were helpful. Good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "93": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1491716147, "Score": 1, "Body": "Solid advice. Thanks so much, learningsomethings, for taking the time to reply, it really is appreciated! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "94": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1491716755, "Score": 2, "Body": "Hi monnostly, it's really helpful to read your experience. You and I are in remarkably similar set-ups (bar companion animals, sadly...I'm a catless crazy cat lady) so it's helpful to see how it works in the real world. I too would be engaged in qualitative, non-lab research.\n\nI love the structured weekly set-up you follow. Also, your Saturdays off and meditation. It all sounds really smart. How has your partner felt during your PhD? I left the love of my life back in my home country (I relocated for this role), and while he's planning on eventually relocating here, for now we muddle along with Skype. It works ok, but I'm conscious of the enormous time investment that comes with a PhD and how that might impact things. \n\nSimilar to my question for learningsomethings, may I ask how you approached your employer when you embarked on doctoral research? \n\n:) MM", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "95": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1491718877, "Score": 3, "Body": "The PhD does put stress on our relationship. I just try to be really clear about expectations, needs, availability, etc. Having a set routine helps. We live together, so doing little things for each other and not taking him for granted is important. It's also helped me learn how and when to ask for help. I sometimes think it might be easier if we were long distance, but then I also worry it would be easier to take him for granted (just speaking for myself). \n\nI work for a university, so they get it. They knew when they boosted me to full time that I was going to a PhD. Again, really clear expectations are key, both about meeting the deadlines I say I will and asking for time when I need it as early as I know I'll need it. Don't know if it'd be the same with a non-academic employer. I also have really great faculty and academic advisors, supportive, not competitive (though I've experienced those kind of programs too).\n\nKudos to you for embarking on this challenge. Just keep putting one foot in front of the other. You'll do fine. ", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "96": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1491720296, "Score": 2, "Body": "Thanks so much! What a nice community of people on this subreddit. :) \n\nIf I ever remember too, I'll try and remember to let folk know how I get on in case it helps others. :)\n\nMM", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "97": {"Subreddit": "PhD", "Author": "Prawldrowland", "Date": 1491722176, "Score": 1, "Body": "I'm doing a part time PhD whilst teaching full time. My final year (year 5) starts in October. I always feel like I'm not doing enough, to be honest. I think it's just the nature of being committed to such an elongated and amorphous research project. As i get closer to the end, I've gained more of an understanding of what I need to do/write to finish it, which helps a lot in trying to estimate how much time I need to spend on it. \n\nI tend to work all day Monday and Friday and a couple of morning's or afternoons during the week depending on teaching commitments. I read on the train into work most days. I also work though most of my annual leave each year just to fit it all in. The uninterrupted periods of writing in the summer are the most productive. \n\nI find that i have a couple of hours of high level thinking in the morning and then have to get on with lower order editing, organisation kind of activities. The trick for me is to make the most of the times where my brain is really firing and to actually rest and get away from the computer when im not in the mood. \n\nDown time is really useful. It helps you maintain some semblance of mental health and your brain will often be thinking about thesis problems without you being aware.\n\nGood luck!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6484mr.json"}, "98": {"Subreddit": "PhD", "Author": "reddit_joanna", "Date": 1491736590, "Score": 1, "Body": "If I've got lab work to do, I will usually come in to work at 7.30 am, work in the lab the whole day (sometimes without a lunch break) in order to finish at a reasonable time: 5 or 6 pm.\n\nIf I've got an office day, I will usually come in around 8.30 am, check my emails, reddit, research recruitment website and new training/skills development opportunities. Around 9.10 am I would start writing/reading/planning or whatever else I need to do that day. But the truth is that office days are rarely as productive as lab days because the office is noisy and I am not able to sustain focus for few hours straight when writing or reading papers. So I take more breaks whether it's grabbing a cup of tea, having a 30 min lunch break, browsing the Internet or going for a walk. Usually I leave at 5 pm.\n\nI also work on the weekends and sometimes evenings during the week. I try to have time for myself so I only do that if I know it is going to make me feel less stressed and more organised.", "Permalink": "https://www.reddit.com/by_id/t3_6484mr.json"}, "99": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1491743449, "Score": 4, "Body": "Honestly, If its a STEM PhD and you want to go into academia, probably not. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "100": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1491745525, "Score": 6, "Body": "7 hours a day is enough if you don't procrastinate and stay organised. PhD students tend to faff about all day and then complain they aren't getting anywhere - whereas I've noticed those with kids or studying part time and holding down a job as well just get on with it. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "101": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1491746778, "Score": 11, "Body": "Not really. I'm sure there are variations from field to field, but I've never heard of a PhD that didn't involve regular evening and weekend work/study. \n\nAlso, your spouse sounds like a big baby (and you can tell them I said so). I'm sorry that you don't have more support.", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "102": {"Subreddit": "PhD", "Author": "YouHadItComing", "Date": 1491746834, "Score": 1, "Body": "I think it is fairly realistic if you really buckle down during those seven hours, but only if you tend to work fairly quickly.", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "103": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1491747481, "Score": 15, "Body": "Not really, tbh. If you could work some evenings and parts of weekends you could make it work. Why won't your husband take on some more responsibility? That's the main issue imo.\n\nMy wife and I had two kids during our PhDs - concurrent in separate programs at the same university. There were periods of time one of us couldn't get much work done and the other had to work 50-60 hours a week. Then we'd rotate. \n\nAnother challenge with your plan is the limited amount of workable hours in yr. 1. Can your youngest go to full time pre-k / daycare? If so, and your husband can put in extra hours 2-3 days a week, you could manage with a reduced course load. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "104": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1491750387, "Score": 3, "Body": "Could you see if your husband is willing to negotiate some of that time or work out what the issue is (eg. Does he not want to cook, clean, feels overwhelmed by looking after both kids at once)? If you can identify the issue there might be a solution (bulk cooking in advance, getting up super early before everyone else is awake). I would also highly recommend reading the Cal Newport book Deep Work. It looks at tactics for spending quality hours in a state of deep concentration instead of lots of hours in a shallow state. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "105": {"Subreddit": "PhD", "Author": "kaswing", "Date": 1491751284, "Score": 1, "Body": "From my point of view, it really depends on your field of study. Are you going to be required to go into a lab to deal with experiments at regular intervals? Are you going to be required to read a huge amount (ie history?) my program is like neither of those things, *but* we do have evening classes in the first few years to accommodate part-time students. Worth looking in to :) ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "106": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1491752990, "Score": 2, "Body": "Check out the wholesomememes subreddit if you're ever feeling down. It helps. :-)", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "107": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1491754736, "Score": 12, "Body": "I thought about this too at one point, broke up with my SO and then got back together within a month. \n\nMy advice: Don't do it. It'll make you feel worse. Yes, you'll have a lot of time for research but it'll be lonelier, isolating, etc. If you need more space/extra time, talk to your SO. If he/she is understanding, they'll be okay. No one said it'd be easy. If they care, they can cope with you needing that time. \n\nGetting a PhD is already an isolating experience, don't isolate yourself even more. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "108": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1491755176, "Score": 9, "Body": "&gt; Honestly, If its a STEM PhD and you want to ~~go into academia~~ *graduate*, probably not.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "109": {"Subreddit": "PhD", "Author": "fattyacyd", "Date": 1491755568, "Score": 3, "Body": "I totally agree. I don't believe there exist a lot of people that can productively work for more than 8 hours. Most people that claim to work more usually spend a lot of their time on facebook etc.", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "110": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491758143, "Score": 2, "Body": "I think your spouse needs to be more flexible with your schedule and be more understanding.\n\nI'm certainly not trying to deter you from your PhD, but be realistic too. When you say 9-4, please factor in that life and a PhD are not a linear process. You need to cook and eat. Will you be tempted to do housework? Children get sick. Sometimes they'll want to stay home or come home. \n\nDo you have to travel to school? Are you factoring in travel time both ways? What about your graduate assistantship/TA? Those usually require at least some time from your own work, and being at the university.\n\nYou will have to take classes at least for the first year. Where will that be happening? ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "111": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491760665, "Score": 3, "Body": "Lol.\n\nSeriously though, you're imagining a relationship and its breakup to be a linear path - that you won't experience any depression right after it happens, that the breakup will be quick and painless, that the person will be there waiting, etc. LBR, all those things will affect your productivity. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "112": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1491762512, "Score": 1, "Body": "Truth", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "113": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1491763081, "Score": 7, "Body": "I interpreted the lack of support as, \"I want you to always help with the kids so that I don't have any extra work to do in the evening and weekends\" and not necessarily, \"let's enjoy these precious moments together.\"  \nThis is because everytime I've seen this it's been the accurate interpretation. I am open to being wrong, though the only one who will be able to determine this is OP.  \nRegardless, you are correct - the PhD will take away time from family for a few years. It's up to OP to weigh how much it's worth over the long term. Will having a PhD open up new avenues for the kids in the future economically or socially? Will they be a better parent because they aren't spending the next 17 years at home bitter about the kids holding them back? There are sacrifices either way.", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "114": {"Subreddit": "PhD", "Author": "FutureDrHou", "Date": 1491765828, "Score": 11, "Body": "I have caught myself twice entertaining the idea of committing a crime so that I would be sent to jail and finally have time to focus on nothing but my dissertation. You're not alone on team bonkers.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "115": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1491768023, "Score": 1, "Body": "I think my situation is a little unique because I'm not particularly doing the PhD so I can secure a job in academia at the end..it's more for personal satisfaction as a challenge. I absolutely love studying and the PhD topic is one that I feel very strongly about (obesity and children).\n\nThere is no expectation from him for me to contribute financially at any point and he has a very stressful job as it is and spends a large amount of time after work to up-skill.  It'll be difficult for him to tend to the children while I'm studying when he already has a lot on his plate trying to increase his chances of getting a better job and provide for the family, while I'm planning of doing a PhD for 'fun'\n\nI have to submit a research proposal soon but have no idea whether I'm expected to contribute to teaching at the university. There is no lab work involved either.  I have lots of questions to ask the supervisor but am not sure whether to ask now, or after submitting the proposal, once (and if!) I am called for an interview.\n\nDo you think I should contact him and discuss all my concerns with him before submitting my proposal? I'm just concerned that it'll put me in a negative light by making me look like I come with too many issues and it may be off-putting to supervise me for 3 years. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "116": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1491768932, "Score": 1, "Body": "Start the PhD in 2 years? ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "117": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1491770339, "Score": 1, "Body": "That would be ideal but it's a studentship and is to start this year. I didn't approach a supervisor and a topic, i saw the PhD advertised online", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "118": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1491770427, "Score": 2, "Body": "Perhaps try taking to him/her about spending more time on research? \n\nI want to succeed for the future that I'd share with her, so personally no.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "119": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1491771446, "Score": 1, "Body": "Okay, I see... Well then it is a hard situation.\nAnd please use the reply function :3 ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "120": {"Subreddit": "PhD", "Author": "RL_TR", "Date": 1491771908, "Score": 2, "Body": "You can have a life outside of a PhD you know......... ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "121": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1491773531, "Score": 2, "Body": "This is what I have been thinking: as depressing as PhDs are, if we are given the right tools and money human extinction will not be a far stretch future. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "122": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1491776491, "Score": 1, "Body": "Sorry, I'm new to Reddit and overlooked the reply button 😬", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "123": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1491783236, "Score": 4, "Body": "&gt; (and I say that as a PhD student). \n\nBut not as a PhD student AND a parent. Just because we have kids doesn't mean we have to sacrifice personal and professional goals. It just means there needs to be clear communication and agreement between partners and a coordinated effort. Families don't have to spend every fucking minute together to be good families, and working evenings and weekends (at certain times of the year) is par for the course. If you don't have a partner who will support those efforts, then reconsider the relationship or the PhD. \n", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "124": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1491783868, "Score": 1, "Body": "I'd find a question that was a little less vague, a little less black and white, and with a little more effort put into it more interesting to be honest. ", "Permalink": "https://www.reddit.com/by_id/t3_64gcnu.json"}, "125": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1491790578, "Score": 2, "Body": "Apply for the PhD. If you get it discuss everything with your supervisor. \n\nAfter that get a serious discussion with your husband and decide from there. \n\nBut first see if you get the studentship and decide from there don't create problems that don't exist yet. \n\nAll the best and keep us updated. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "126": {"Subreddit": "PhD", "Author": "bwc6", "Date": 1491794632, "Score": 1, "Body": "Obviously don't break up, but I think it's cool that you're so into your research. There are many candidates out there slogging through a project they don't care about anymore, fantasizing about quitting to get a job at McDonald's. At least you still care about your project!", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "127": {"Subreddit": "PhD", "Author": "bananajoker", "Date": 1491806623, "Score": 1, "Body": "Evoldir\n", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "128": {"Subreddit": "PhD", "Author": "greyfriar", "Date": 1491808872, "Score": 2, "Body": "findaphd.com", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "129": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1491810851, "Score": 10, "Body": "My $0.02: You're doing it wrong.\n\nRead the latest literature in your field.  When you find a paper you like, check the authors' locations, and if the PI is in your location of interest (Europe), reach out to the author and get a conversation going about the publication.  Ask interested questions, etc.  After you get the conversation you like, mention that you'd like to pursue research in this area at the doctoral level and see what they have to say: maybe they've just landed a grant that could fund you, or maybe their colleague has, or maybe you need more preparation first and you've just saved yourself the trouble of a formal application.\n\nBy the time a PhD position makes it into a job ad, the PI has already exhausted their local students, colleagues' local students, and interested network, so you're getting last pickings.", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "130": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1491811581, "Score": 1, "Body": ":(\n\nSo, I've spoken to the counselor. Since graduating on time is a priority and with only 3 to 4 months left to thesis submission, changing supervisor is quite unrealistic. The procedure is arduous and long, faculty has to interview my supervisor, interview me, and since admin are likely to take his side, if I pursue this I probably won't be able to grad on time, either. Looks like it's back to square one. \n\nI'm not dependent on the lab anymore - in the sense that yes, all that's left is writing up the thesis. Haven't been doing real benchwork in a couple of months. Apparently bringing someone new on board, or to have a co-PI isn't allowed. The next best thing would be to change supervisor altogether, which brings us back to the above issues.\n\nMy thesis committee is kind of strange, too. I have 3 on the committee: one of them is my supervisor, the other is the Prof I spoke to, and the third one is leaving the university this June (non-tenured, and contract is not renewed). But the Prof said that should my supervisor refuse to approve my submission of thesis, I could forward the thesis to the committee and let them have a look. I hope they don't hold the same bias my supervisor has. ", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "131": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1491812745, "Score": 1, "Body": "I thought so, that is why I reminded you^^ ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "132": {"Subreddit": "PhD", "Author": "alli_golightly", "Date": 1491817182, "Score": 1, "Body": "Second this. Also academic newsletters and your own supervisors circle of colleagues, that they'll (hopefully, if they are doing their job right) get you to meet. And conferences, summer schools etc....\r\rPoint being: most jobs don't get to be advertised publicly, but in a more \"private\" way, inside a circle of fellow-scholars. ", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "133": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1491829429, "Score": 2, "Body": "This may be irrelevant food for thought - I only know of the regulations for my university in Australia - but there are strict criteria for allowing a PhD candidate to be part-time, and having a full-time job is not one of them (they specifically address that). I am allowed to be part-time as I have two small children, I believe illness is another circumstance where it's allowed, but double check that you can elect to go part-time before you get your heart set on it.", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "134": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1491832059, "Score": 1, "Body": "Thank you so much, franklin_river, you make an excellent suggestion! I did see online that some Aussie universities appear to have stricter entry requirements than those in the EU. I looked and could not see any stipulations regarding employment with the university I'm interested in.\n\nWhich uni are you based out of? Many moons ago I did my undergrad at ANU.\n\nMM", "Permalink": "https://www.reddit.com/by_id/t3_646dfk.json"}, "135": {"Subreddit": "PhD", "Author": "limnoski", "Date": 1491834320, "Score": 1, "Body": "I second this. Also a good forum to get in contact with these researchers is ResearchGate. ", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "136": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491840127, "Score": 2, "Body": "People return to higher education all the time after some time in the work force/having families/etc. \n\nYes, you'll probably be rusty, because academic language is a specific one. But as you said, do your homework. Read up on the literature, write drafts, practice, get someone in your field to look the proposal over, y'know do the school thing.", "Permalink": "https://www.reddit.com/by_id/t3_64ff9n.json"}, "137": {"Subreddit": "PhD", "Author": "Redditmis", "Date": 1491840399, "Score": 1, "Body": "anything like this but for onenote?", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "138": {"Subreddit": "PhD", "Author": "haffi112", "Date": 1491843525, "Score": 1, "Body": "There are already good answers. However, in some fields such as neuroscience there are very many email lists that advertise PhD positions quite aggressively.", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "139": {"Subreddit": "PhD", "Author": "Zero_Fucks_", "Date": 1491844106, "Score": 0, "Body": "jobs.ac.uk", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "140": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1491844826, "Score": 1, "Body": "Social science, 3rd year, full-time status.\n\nI work a pretty standard 9-5, Monday to Friday. I spend at least one day a week (but more often 2, sometimes 3 if I'm lucky) working solely on my own research-related work from home. Right now this involves a lot of reading and writing as I am preparing for my candidacy examination. I often break from this for short periods of time to email, check social media, etc (like right now!). I take about 30 minutes for lunch, and sometimes work while eating. I spend 2 additional late afternoons a week at home doing the same thing. The rest of my time is spent working as an RA or on another contract government job, most commonly on campus. I spend little time on publishing as my RA work helps in this regard, but also because I can't be bothered to work longer hours.\n\nI am married, have a home and hobbies, two doggos, friends and family nearby that I spend time with, and hope to have a kid in the next year. I mention these things because, depending on one's outlook, they might be viewed as impediments to productivity or career-building, and/or might cause folks anxiety for wanting to devote time to them. I see them as essential to living a healthy and happy life. I'm grateful that they keep me from my desk at nights and on the weekends (unless I have a hard deadline, maybe 3-5 times a year), as without them I would have probably cut and run a year ago.\n", "Permalink": "https://www.reddit.com/by_id/t3_6484mr.json"}, "141": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1491846318, "Score": 1, "Body": "A lot of universities still want a formal application process so they will still advertise for the position.\n\nFor example my current MPhil supervisor wants me to continue working with him but I still have to apply for the position and compete with others.\n\nAlso for a lot of bigger grants like Marie Curie you can't recruit people from your own university/country because of mobility regulations.\n\nI attended a conference last year when I published but it will take a while until I publish again and I can't afford to go to one just to network without having a poster or oral presentation.", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "142": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1491846404, "Score": 1, "Body": "The big issue is that having a BSc and now an MPhil in the UK all my connections and professors are in the UK and I very much want to do a PhD in Europe-UK.", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "143": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1491847303, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_64h25e.json"}, "144": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1491848220, "Score": 0, "Body": "Take care and good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_64ctzd.json"}, "145": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491867571, "Score": 2, "Body": "Publish more. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "146": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1491867953, "Score": 2, "Body": "Commenting because I want to know, too.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "147": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1491867963, "Score": 3, "Body": "What steps would you have taken in order to publish more?", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "148": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1491868177, "Score": -10, "Body": "Submit more manuscripts.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "149": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1491871414, "Score": 4, "Body": "Driven it more. Spent too much time commissioning a huge test plant without really planning/completing really useful experiments. Feel like I have no time left and nothing to show for it. Also didn't publish :/", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "150": {"Subreddit": "PhD", "Author": "gracefulchoices", "Date": 1491873434, "Score": 14, "Body": "Publish earlier. I do have a decent amount of pubs, but I started publishing in my third year second semester. It takes a while to get over rejections and get pubs rolling. \n\nHave a life. My four years were spent studying, writing, and teaching. The end. \n\nGet an unofficial advisor. You might click with other professor who can give you more refreshing feedback than your advisor.\n\nGood luck!\n", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "151": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1491876365, "Score": 11, "Body": "Not do it.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "152": {"Subreddit": "PhD", "Author": "Invyz", "Date": 1491878751, "Score": 2, "Body": "Any reason why?", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "153": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1491878794, "Score": 6, "Body": "I wasn't aware of how draining it would be.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "154": {"Subreddit": "PhD", "Author": "NotRexManningDay", "Date": 1491879751, "Score": 10, "Body": "Limit what I said I would do in my dissertation proposal. I took on too much to make it a cool dissertation. Just get it done! ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "155": {"Subreddit": "PhD", "Author": "Invyz", "Date": 1491880556, "Score": 2, "Body": "I'm just starting so that's a ways out, but thanks for the tip :)", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "156": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1491883410, "Score": 18, "Body": "Kill myself from the start to save time. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "157": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1491885998, "Score": -2, "Body": "nobody wanna share the secret sauce???", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "158": {"Subreddit": "PhD", "Author": "Powerpoppet", "Date": 1491889811, "Score": 8, "Body": "I would have started writing my thesis earlier\n\nEDIT: good luck with it!", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "159": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": 1491893046, "Score": 5, "Body": "Plan experiments better and be smarter about which splits to not try. Those took too much time and I ended up doing experiments that I knew wouldn't work just for the sake of completeness. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "160": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1491896734, "Score": 1, "Body": "This", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "161": {"Subreddit": "PhD", "Author": "haffi112", "Date": 1491898131, "Score": 20, "Body": "I think that some of the advice here is already good. However, to publish earlier and to write your thesis you have to be organized. This is really important, a bad organization has extremely draining effects on your morale. In this regard, I'll give you advice that I wish I would have received myself at the start of my PhD and be forced to follow (some might think this is obvious but I disagree).\n\n*Make the effort of organizing your research and build up a searchable knowledge base such that it requires minimal effort to do research*. This helps a lot with encouraging writing. I don't recommend printing stacks of papers that you highlight by hand. Searching through such a stack can be a nightmare if it extends to the ceiling of your office. In the beginning, it obviously won't be so hard but you're creating a future debt by adopting that solution. However, your milage may vary.\n\nInstead, keep track of what you read from the start using software like Zotero (you must not underestimate how quickly one forgets the details of what one read). It is an indispensable resource because the effort to save papers is basically 0 with their browser plugins.\n\nThen use the Zotfile add-on to rename the pdfs into a file on your dropbox (or some alternative backup solution). If you have a tablet you can find good pdf software that syncs with your dropbox where you can highlight the text (alternatively just read and highlight on your laptop). Zotero automatically extracts all your highlighting and creates notes. I use such notes to quickly recall what important bits I found in the paper. I further write on these notes some paragraphs I can copy/paste and adapt into my thesis. Finally, Zotero automatically builds your bibliography so there is less time wasted on such things (although you might want to be careful regarding consistency of journal name spelling or abbreviations, weird author names etc.).\n\nAlso, write, rewrite, rewrite, rewrite...", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "162": {"Subreddit": "PhD", "Author": "atypic", "Date": 1491900375, "Score": 6, "Body": "Got this question during my defence! My answer was \"read more\". ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "163": {"Subreddit": "PhD", "Author": "louuegan", "Date": 1491902639, "Score": 2, "Body": "I'm in the Arts and Humanities field in the UK. I published one paper before getting onto a funded PhD programme - but I think that's pretty unusual. Hoping to publish at least one paper a year during the PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_629wzu.json"}, "164": {"Subreddit": "PhD", "Author": "girlunderh2o", "Date": 1491914341, "Score": 5, "Body": "I'm not sure what sort of answer you're looking for. I applied. That's about it. I only took the GRE once and didn't have time to study for it. Got decent scores (great in two areas, third was just high enough my masters PI said I shouldn't bother retaking). I had pretty good grades coming out of undergrad and had finished my masters by the time I applied for PhD programs. I did put time and effort into writing my personal statement and had someone proofread and give advice. I also made sure my CV was tailored for each program I sent it to. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "165": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1491916294, "Score": 2, "Body": "How early did you start writing, and how early should you have started?", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "166": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1491918516, "Score": 1, "Body": "I dont know what exactly i should be talking about in my personal statement. Should i read a research report from a leofessor and highlight areas that can be improved or should i propse new research projects? I'm trying to go to ucla anderso for the phd in strategy specifically decision cience. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "167": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1491920754, "Score": 2, "Body": "Really think through my paper ideas first semester. They're unfortunately poor, and I'll likely never publish from them. I think in my second semester I'm smarter, only doing work that's potentially publishable.\n\nOne thing I did well at the beginning was setting up an organisation system.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "168": {"Subreddit": "PhD", "Author": "girlunderh2o", "Date": 1491920851, "Score": 1, "Body": "The school generally gives some sort of prompt for what they'd like to see in your personal statement. Start there. For example (specifics that I recall), one school asked to identify a specific professor that I was interested in working with and why. Another asked a broader question about why I was interested in their PhD program. For the first, I talked about why that particular lab was of interest to me. For the second, I identified a professor that had gotten me interested in the school initially but also spoke about how their program design and support had attracted me. What personal statements all had in common was a brief story about how I became interested in pursuing research and a summary of past work. I also added details about why I wanted to pursue a PhD (career goals) and briefly how their specific program might help me achieve those goals.", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "169": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1491930643, "Score": 6, "Body": "1. Negotiate with advisor project/experiment work/amount specific items to do. Not just do a vast amount of work because advisor wants it done.\n2. if industry oriented, spent evening/weekends on career- related skills, networking, instead of overtime in the lab doing that extra work or analyze that extra set of data.\n3. Talk to and maintain relationships with people outside academia, or even just outside your own department. Sooner or later you'll develop graduate student mentality from working with genius around you, and you are the dumbest, in the overall context of being paid poorly, so you feel worthless and not contributing to society. This mentality will stop you from even applying to opportunities that sound so good from a large corporation or amazing startup, or prevent you from going to activities on campus because you want to curl up in a corner in the lab.\n4. Periodically discuss with advisor degree progression and how what you do now aligns with your career interest.\n5. internship if at all possible. For people in life sciences like me, an internship almost means delay graduation by a year. But for people in comp sci, they usually do summer internships at large companies and their advisors want them to. \n6. Ask for raise consistent with your seniority and department/school pay line. I'm a 5th year student paid at 25K, a couple years ago, my school raised the first year students doing TA to 27K, when they come off from TA to Research assistant (RA) and get picked up by research grant, typically PIs maintained the same level so 27K for younger students. Next year's new student's TA stipend will raise to 29K. I'm still at 25K...don't get caught in my situation.\n", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "170": {"Subreddit": "PhD", "Author": "Powerpoppet", "Date": 1491934848, "Score": 3, "Body": "I didn't start writing until my third year. What I should have done was at least started taking down structured notes in second year to cut down on the work later on. Thankfully, my design didn't change much over the course of the project so I was able to reuse a lot of stuff that I wrote in my proposal. This saved me some effort further down the line.", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "171": {"Subreddit": "PhD", "Author": "thelectrician", "Date": 1491936258, "Score": 2, "Body": "Depends on your major, but I think read &amp; write a lot. Writing is indispensable for a researcher regardless of level.\n\nI have many regrets from choosing a school to not choosing my own research topic but leaving it to my advisor. If you are an engineering student I suggest you to read http://www.pgbovine.net/PhD-memoir/pguo-PhD-grind.pdf and other publications of http://www.pgbovine.net/\n\nThere are also some other guides you can create for yourself. But PhD is about persistence, so be ready for the great challenge :-)\n\nCongratulations by the way :-)", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "172": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1491946491, "Score": 1, "Body": "Same tbh. But as /u/johnsnothere says, it would feel more lonely, and the extra time wouldn't necessarily be *productive* time.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "173": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1491947969, "Score": 4, "Body": "(1) Experience in long form writing can't hurt.\n\n(2) Almost certainly not.", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "174": {"Subreddit": "PhD", "Author": "seeellayewhy", "Date": 1491949032, "Score": 1, "Body": "I had this problem as the student a few weeks ago. Did the assignment on time just completely forgot to submit it to blackboard, and saw a few weeks later that I had a zero somewhere along. \n\nSent the TA a frantic email which included a screenshot of my file explorer showing the edited date as well as the version control page for the file in my Dropbox. When she replied she told me I was the only person she'd ever given full credit to for a late assignment because no one ever bothers to submit *convincing* evidence they actually did complete it on time. ", "Permalink": "https://www.reddit.com/by_id/t3_6126j8.json"}, "175": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1491956133, "Score": 5, "Body": "1. What you're doing is great and I'm pretty sure you'll have no problem getting into some great programs.\n\n2. Stop sending random emails to profs who have no idea who you are. They get a million emails a day and they're either not going to read it or not be interested until you're admitted. If you have a connection to them through someone, take advantage of it but your time is probably best spent on other things.\n\n3. Look at programs and research that you're interested in, not ranking. Plenty of heavy hitters are at \"mid-tier\" schools and once you're admitted, you'll quickly realize how little ranking means. Apply to places where you can learn the things you want to do instead of applying to places you think you can gain some sort of prestige from. Your publications determine your reputation, not the name on your degree.\n\n4. Keep your GPA up, make sure you get the best LoR's you can, and try to get those papers published but it's perfectly fine to say you have a manuscript in progress with an anticipated submission date. Plenty of people get admitted to top programs with nothing published. Also, you mentioned wanting to go into industry but then teach at a university. It's pretty difficult to go from industry to academia, at least for tenure track. You should be aware of that unless you just want to teach and if that's the case, my point is moot.\n\nGood luck. ", "Permalink": "https://www.reddit.com/by_id/t3_64tzrt.json"}, "176": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1491962464, "Score": 3, "Body": "1) You can turn it into another (or a few) publications, depending on the focus of your articles.\n\nIf you plan on being a professor and supervising students (which it doesn't look you are), you can relay your experiences to them.\n\n2) Probably not. unless you do above.", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "177": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1491983190, "Score": 6, "Body": "You wanna get in for strategy and are asking us for.. strategies of getting in? Oh-oh.", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "178": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1491986282, "Score": 1, "Body": "&gt; would this change the structure of graduate programs in the UK\n\nWhat do you mean by this? Change the traditional 3 year/4 with a master's year research-focussed degree style to something more taught, like the US version? Because I can't see that happening.", "Permalink": "https://www.reddit.com/by_id/t3_627fp7.json"}, "179": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1491995514, "Score": 1, "Body": "I've worked part-time through my undergrad and two masters degrees here (one at Edinburgh), and certainly would through a PhD too (applying for next year). It's not that hard to do a five-day full time gig at university followed by Friday and Saturday night behind a bar, or a full day on a shop floor on a Saturday, and it significantly helps the income problem.\n\n8 hours a day five days a week is easy to fit a part-time job around, although if you aren't British watch that your visa allows you to work and what hours.\n\nIn terms of income, I currently live on £8k a year in an expensive Scottish city - I have an RA position in halls, giving me very cheap rent including all utilities, and work part time (only 8 hours a week) on top, plus my grant money. I don't have savings by any means, but I have plenty money for the necessities, plus pay sports club fees and a New Scientist subscription and a student bus pass and the odd night out. So it's definitely do-able.", "Permalink": "https://www.reddit.com/by_id/t3_626crj.json"}, "180": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1491999016, "Score": -1, "Body": "So ur equating business strategy with admission strategy. U look like some who has strong skills in logic. Oh oh", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "181": {"Subreddit": "PhD", "Author": "bwc6", "Date": 1491999139, "Score": 2, "Body": "I think you could easily find a compromise. Even if you don't \"copy and paste\" the dissertation is going to have the same data as your papers, right? You shouldn't have to come up with much new material, just reformat the ideas and data from your papers into one cohesive whole.\n\nTo answer your questions, \n\n1. You might find some new interpretation of your data when you look at it from a new perspective. You will share this experience with other Ph.D.s. you can include interesting data that didn't get published. \n\n2. When I was a grad student, I frequently read the dissertations of previous students in my lab and a close collaborator's. I didn't read them cover to cover, but they were extremely helpful in my research. ", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "182": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492006153, "Score": 8, "Body": "The joke just missed you. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "183": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1492007622, "Score": -1, "Body": "Not really. I just destroyed ur bullshit joke and now ur salty.", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "184": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492008070, "Score": 0, "Body": "How about submitting your names so we professors can publicly rank students.  ", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "185": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1492010900, "Score": 6, "Body": "This is going to vary so much between people and a good chunk of how your PI acts towards you, is how you act towards them and carry yourself in the lab. This would simply be another rate my professor where only the people with complaints would post and the happy ones would see no reason to contribute. ", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "186": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492032583, "Score": 5, "Body": "Salty? I don't think that's salty, but okay.\nYou seemed to be salty, anyway :) \n", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "187": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1492036321, "Score": -2, "Body": "Good comeback bro, your're so smart. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "188": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1492038814, "Score": 4, "Body": "I so commonly see this sort of derision towards students from professors. I can only assume people with this attitude are lucky enough to have never experienced an unhealthy lab environment, or a bad supervisor. One bad supervisor can ruin a person's entire career (seen it happen, was very nearly me, too). The same can't be said the other way around. Supervisors hold all of the power in the relatonship and should be sensitive to that fact.", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "189": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1492043601, "Score": 1, "Body": "Well, definitely proofread your application for typos. :) ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "190": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1492045465, "Score": 0, "Body": "You already do (somewhat privately), they're called grades.", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "191": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1492046941, "Score": 2, "Body": "Great advice. I am so thankful for that insight. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "192": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492047578, "Score": 1, "Body": "Sure let's make them public then, with hotness rankings as well. ", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "193": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492048304, "Score": 1, "Body": "Except it's disproportionately a minority of aggrieved  students who post on these types of sites - students who are often poor performers, under achievers, and who lack reflexivity and accountability, and yet believe they've been mistreated and unfairly assessed. \n\nHaving just been a student myself for a very long time, I get what you're saying. And maybe a grad specific site that can forewarn students might be useful. But I also see how these anonymous review sites can be problematic and unfair for many professors. ", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "194": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1492052162, "Score": 2, "Body": "Rate my professor is never used for evaluation and isn't sanctioned through official channels. Student surveys are, and are a small component of most people's job evaluations (at least at research universities). The process is by and large fair. Students are our customers (kinda) they should rate us.", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "195": {"Subreddit": "PhD", "Author": "pavanblazze", "Date": 1492052337, "Score": 1, "Body": "It is only a fantasy.. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "196": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492052474, "Score": 1, "Body": "I'm mostly fine with evals; my comment was about OPs mining for data to start another public evaluation site for professors/supervisors. ", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "197": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1492055601, "Score": 3, "Body": "Fair. Supervisor data is lacking, but a public site isn't realistic. Sample sizes are too small so there's be no annanominity, and therefore little incentive for honest evaluation. Have to find out through interviewing chops and networking who's good.", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "198": {"Subreddit": "PhD", "Author": "margaritamonkey", "Date": 1492061687, "Score": 1, "Body": "Your're welcome. It'll impress the leofessors. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "199": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492073403, "Score": 3, "Body": "Dude what is your problem? :D I didn't intend to write a smart comeback... ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "200": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1492094328, "Score": 14, "Body": "One third sounds a tad more optimistic than other estimates I've heard.", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "201": {"Subreddit": "PhD", "Author": "LawOfExcludedMiddle", "Date": 1492096221, "Score": 3, "Body": "I bet that \"professors\" includes \"associate professors\" and \"lecturers\".", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "202": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492112854, "Score": 1, "Body": "&gt; The biggest reason being it would bother me to have my PhD diploma signed by someone without a PhD.\n\nI don't understand why you care about this.  Odds are your diploma will be signed by someone with a PhD in a completely and utterly unrelated discipline anyways, so it's not like it lends any professional credibility to your work.  Your university president doesn't know or care who you are or what you do; your future employers care about what you learned and achieved, who your advisor is, and maybe what uni you went to but certainly not who signed some piece of paper.  Your actual diploma is the last thing anyone is ever going to look at to evaluate your work as a PhD student, so who cares?", "Permalink": "https://www.reddit.com/by_id/t3_657kwh.json"}, "203": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1492113409, "Score": 1, "Body": "I care. It might be because in the past I actually did have a close relationship with my university president before we got a new one. ", "Permalink": "https://www.reddit.com/by_id/t3_657kwh.json"}, "204": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1492117905, "Score": 1, "Body": "&gt; Secondary data can be defined as 'Data originally collected for a different purpose and reused for another research question'\n\n\n\n&gt;My argument is that the creation of a dataset through webscraping for the purpose of research fits exactly the primary data definition. Though I can definitely see why it can be considered secondary.\n\nI'm confused at your interpretation, as the data you're scraping was literally collected for one purpose, with you now reusing it for a separate purpose. You selectively combing datasets to answer a specific question does not negate the fact that if was initially collected for a purpose unrelated to your own.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_64xoal.json"}, "205": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1492121833, "Score": 2, "Body": "Damn. Reddit is really doing good with the article links today - I've just saved like 3 posts in 3 swipes! Excellent. Thanks OP. ", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "206": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1492134883, "Score": 4, "Body": "I also wanted to do thesis by publication but my secondary supervisor was very against it. He said that if he was hiring someone (he's head of department) and they had done PhD by publication then the committee would question their writing ability over someone who had publications and a dissertation. \n\nThe only people likely to read your dissertations are other grad students and never in full.", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "207": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1492135528, "Score": 12, "Body": "Well, all I can say is life deals you a hand, and all you can hope for is to make the best decision you can. \n\nA mistake isn't irrecoverable, but a true mistake would be to not pick yourself up, dust off, and keep learning. After all, aren't we all on a journey? ", "Permalink": "https://www.reddit.com/by_id/t3_659sc6.json"}, "208": {"Subreddit": "PhD", "Author": "RhymeSpit", "Date": 1492143403, "Score": 6, "Body": "associate professors *are* tenured professors", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "209": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1492156302, "Score": 1, "Body": "It's hard to tell without absolute numbers. Maybe there are very few humanities PhD, as opposed to science/engineering PhDs, so getting academic work is easier.", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "210": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492162461, "Score": 6, "Body": "It's one third of UBC's grads, not one third of all PhD grads.  UBC is within the top 3 universities in Canada, so I'd expect their PhDs are, on average, more likely to be hired in academia than those from mid-ranked universities.", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "211": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492162543, "Score": 3, "Body": "The article says it's people with a \"tenure-track, research-intensive academic job\".", "Permalink": "https://www.reddit.com/by_id/t3_655nap.json"}, "212": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1492167852, "Score": 2, "Body": "I've dropped you a PM in advance ^^", "Permalink": "https://www.reddit.com/by_id/t3_62e54u.json"}, "213": {"Subreddit": "PhD", "Author": "aending", "Date": 1492175561, "Score": 1, "Body": "Try Zotero https://www.zotero.org/ or another bibliography /citation manager", "Permalink": "https://www.reddit.com/by_id/t3_65cbgu.json"}, "214": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1492176489, "Score": 1, "Body": "Yes I talked to my supervisors about that possibility as well, and they were against it. One of them said, as much as the academy is about publications, they want to see that you are able to do the work of a dissertation. ", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "215": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1492177043, "Score": 1, "Body": "Whilst this is true. I would argue the original data was not collected in the same way. I don't know if I consider Twitter data on Twitter servers to be labelled as a dataset. Only in correctly structuring the data for the purpose of analysis does it become a valid dataset. I feel that pre-scraped data is 'raw' and unprocessed. And only through processing it becomes something valid for research.\n\nThat being said, you're probably right. I think I focus on the primary definition 'Original data collected for a specific research goal'. Which, because twitter data is not collected for research I consider the scraping to be the actual collection.\n\nThanks for the response. I think I'm probably going to agree with you and change what we have. \n", "Permalink": "https://www.reddit.com/by_id/t3_64xoal.json"}, "216": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1492177564, "Score": 1, "Body": "Maybe they just want to know that you can do the added work of publishing and writing a dissertation. I guess they know what the workload of that is and what workload they expect our future positions to be.", "Permalink": "https://www.reddit.com/by_id/t3_64tdod.json"}, "217": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1492182291, "Score": 5, "Body": "I believe that setbacks are all blessings in disguise. What you can, and will, do now is use your time to apply again to more schools and keep learning important trade skills.\nWhile you wait for new offers, you will learn skills that may help you in your specific field for academia/industry.\n\nFor example, in my spare time I try to learn and practice French (I live in Canada so bilingualism is great), and I learn coding skills because my field uses a lot of bioinformatics. This is ONLY a fail if you do not stay productive. And I know you will be productive.", "Permalink": "https://www.reddit.com/by_id/t3_659sc6.json"}, "218": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492185667, "Score": 1, "Body": "Every country has its own education system, and different fields can have their own norms and standards within that system.  You'll need to be more specific about what you want to study and where, since it's unlikely that anyone here can give you a list of the norms for every field in every country in the entire world outside Australia.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "219": {"Subreddit": "PhD", "Author": "AberrantOctopus", "Date": 1492189973, "Score": 3, "Body": "Just some random thoughts. \n\nHave you tried using Tags and the Search function in Evernote? Many people do this instead of using many notebooks as a part of David Allen's Getting Things Done approach. \n\nTo organize projects, I use a single note in Evernote and make journal entry style notes on progress and thoughts. (I know many people that do this with Google Docs). I use tags to keep all other files for a particular project associated with each other. For example, notes from a meeting about a particular project can be tagged and then easily recalled.\n\nI summarize and track papers for literature reviews in an Excel spreadsheet (others use Google Sheets). Otherwise, I use Mendeley to keep track of literature. \n\nI mostly code in R, so I use RStudio with GitHub and [this](https://nicercode.github.io/blog/2013-04-05-projects/) system for organizing files.", "Permalink": "https://www.reddit.com/by_id/t3_65cbgu.json"}, "220": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1492190234, "Score": 9, "Body": "In the UK people often go from BSc to Phd, but it's more common to go BSc-&gt;Masters-&gt;PhD I think. I went Integrated masters-&gt;PhD", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "221": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1492190308, "Score": 4, "Body": "However I will say doing a masters first will set you up much better for a PhD. Going straight from BSc might be a shock", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "222": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1492190702, "Score": 2, "Body": "I willing to put money that with your strategic skills UCLA won't be hiring you based on your strategic skills", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "223": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1492190825, "Score": 1, "Body": "Work hard. Have good GPA. Be enthusiastic and intelligent. Show initiative, problem solving skills. Be original. Have a personality. There are no tricks or strategies except just being a good student", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "224": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1492195650, "Score": 2, "Body": "True, I already got an interview for a job surprisingly... That happened fast, first one I applied to in a while.\n\nWhen you are in high demand, you have to say \"no\" a lot. I turn down job offers every single day by ignoring recruiter emails. Sometimes, one of them is good enough you feel bad about it.\n\nSucks when it's so easy to get a job, but not so easy to get college funding.", "Permalink": "https://www.reddit.com/by_id/t3_659sc6.json"}, "225": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1492203465, "Score": 2, "Body": "It really depends on the system, and isn't even uniform within the same country (at least in the US, where I am). Some programs will require that you have a master's, some will not. Then each advisor has their own requirements as well. Some will require you to complete a master's with them first before committing to your PhD, others will not. So, basically you just need to learn about every program.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "226": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1492203510, "Score": 1, "Body": "vim", "Permalink": "https://www.reddit.com/by_id/t3_65cbgu.json"}, "227": {"Subreddit": "PhD", "Author": "alphaaldoushuxley", "Date": 1492206646, "Score": 6, "Body": "Most universities in the US let you go in with a bachelors and good GPA. In my experience, getting a masters first is for people that 1) don't have the grades to get into a PhD program from bachelors, or 2) didn't know they wanted to pursue a PhD until they began a masters. Contact the program managers of the schools you're interested in. My PhD is in biochem/medicine.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "228": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1492207046, "Score": 1, "Body": "You have great argument skills with those great argument skills you just used. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "229": {"Subreddit": "PhD", "Author": "johnnyboyfart", "Date": 1492207103, "Score": 1, "Body": "What if you have average gpa like a 3.5. ", "Permalink": "https://www.reddit.com/by_id/t3_64nu59.json"}, "230": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1492211816, "Score": 7, "Body": "Recently went to an interview and subsequently got the studentship. My best tips are to sit down and think of possible questions they could ask you i.e what are your strengths/weaknesses, why this uni, why this PhD, how would you approach this PhD etc. Also have questions you wish to ask about the topic you'll be researching or questions about the workings of the PhD and any additional opportunities i.e demonstration, teaching, public engagement.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_65fwg7.json"}, "231": {"Subreddit": "PhD", "Author": "historicalline", "Date": 1492213379, "Score": 1, "Body": "It depends on the school and the program. Yes, there are programs that allow a straight transition from a Bachelors to a PhD. So you have to do your research on the university and its specific Biology department to see if they offer that option. \n\nNext, make sure you want to do a PhD. Ask around. Utilize your resources. It's a very different experience than an undergrad, and requires a lot of independence and a different set of skills. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "232": {"Subreddit": "PhD", "Author": "ZeMeest", "Date": 1492214097, "Score": 1, "Body": "I got my bachelors in bio in the U.S. and went straight into a PhD program in the U.S.  Having undergraduate research experience really helps in these situations.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "233": {"Subreddit": "PhD", "Author": "girlunderh2o", "Date": 1492229907, "Score": 4, "Body": "Just to counter that generalization about those of us with an MS prior to PhD: I knew I'd want a PhD and I probably had grades to go straight to PhD (\"probably\" because this wasn't tested, obviously). But I also really liked my school's masters program from what I'd seen of it and I felt it would give me a strong transition between undergrad and graduate work without plunging headlong into the long stretch of a PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "234": {"Subreddit": "PhD", "Author": "sunae712", "Date": 1492232934, "Score": 6, "Body": "I just got rejected because I did poorly on my interview at ucla for a PhD. My biggest advice (given to me from the director of the program) show that you really have an interest in the program. Research what your interviewers are doing research in, memorize it, and spit it back to them to show interest. Ask questions that aren't generic. Think of it as these professors are thinking about whether or not they are going to invite you into their labs (or research group, etc.). Know their stuff. well. That being said, best of luck to you. Prepare and be excited about the prospect of grad school.", "Permalink": "https://www.reddit.com/by_id/t3_65fwg7.json"}, "235": {"Subreddit": "PhD", "Author": "Ezibenroc", "Date": 1492251288, "Score": 3, "Body": "You could use a laboratory notebook, similarly to what are doing researchers in other fields like biology.\n\nThe basic principle is that you write all the things you are doing : any experiment, thought, algorithm, data analysis, etc. You organize it by day and add some tags, to browse it more easily.\nThen, if a few months/years after you are wondering how you did a particular thing, it is very easy to find the information you need.\n\nA good tool combination for this is Org mode (http://orgmode.org/) in Emacs.\nOf course there are alternatives, like Jupyter notebook (http://jupyter.org/). Jupyter is more user friendly (org-mode and emacs have a steep learning curve), but has much less features.\nIn all cases, use a version control system such as Git.\n\nThis video about org-mode is nice: https://www.youtube.com/watch?v=fgizHHd7nOo\n\nA discussion on Stackexchange, still about org-mode: https://academia.stackexchange.com/questions/1273/use-cases-of-org-mode-as-a-scientific-productivity-tool-for-academics-without-pr\n\nAn interesting paper about a git+org-mode workflow: https://hal.inria.fr/hal-01112795/document\n\nAlso this webinar might be useful : https://github.com/alegrand/RR_webinars/blob/master/1_replicable_article_laboratory_notebook/index.org", "Permalink": "https://www.reddit.com/by_id/t3_65cbgu.json"}, "236": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492258865, "Score": 5, "Body": "That, and go there in a good mood. ", "Permalink": "https://www.reddit.com/by_id/t3_65fwg7.json"}, "237": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1492263502, "Score": 2, "Body": "Life sciences in the UK almost always state they require an MSc/MRes these days.  I'm doing my PhD in Germany and it's absolutely essential to have a Masters, perhaps the same for other European countries.  Masters are an excellent way to get a 'step' up for when you start.  Plus as I mentioned, you're then mobilised and could apply in other countries.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "238": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1492263726, "Score": 2, "Body": "That's pathetic.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "239": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1492267163, "Score": 4, "Body": "i went straight from BSc to PhD and my uni has a compulsory postgrad research skills module those who don't have a masters for this exact reason ", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "240": {"Subreddit": "PhD", "Author": "TheMinimalistMapper", "Date": 1492275509, "Score": 7, "Body": "The best thing to do if you are worried about writing too much is contact the admissions department at your university and enquire about the maximum number of pages for submission.", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "241": {"Subreddit": "PhD", "Author": "FreeFromIvoryTower", "Date": 1492276840, "Score": 1, "Body": "This for sure. I would have started working after undergrad and entered the work force 7 years earlier. PhDs don't get paid well enough to warrant being in school until the early 30s. You will fall behind everyone you know and there is no amazing reward at the end....like a stable high paying career. Generally, your reward is going back to school to a postdoc, but now your 30 and want a real life. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "242": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492277325, "Score": 9, "Body": "If you can't write what you want to study in 3-4 pages then that's a reflection of your inability to produce sufficiently dense academic texts - or your idea is insufficiently refined. Either way, as a reviewer I'd be annoyed. ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "243": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492278904, "Score": 1, "Body": "Yeah, I am thinking about something like that. But also I guess, if they wanted 3-4 pages, they would have written '3-4 pages', and not 'minimum 3-4 pages'. I could very well formulate what I want in half a page, a page, 2 pages, 3. I am just trying to 'show off' how much I know and how well I understand the field, since there is a big competition for funded places. ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "244": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492279099, "Score": 1, "Body": "\" or your idea is insufficiently refined.\" - yeah, this might be closer to it. There is so much to research, so many places to do fieldwork at, and one can't be sure which work out, where you get permissions, so I just list all options..\nOf course, I could say, that I will look at A, B and C, instead of A-G, but that would also kind of feel like I am taking away some opportunities from myself. (This sounds badly phrased in English again, but the \"English\" version just doesn't come to my mind.)", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "245": {"Subreddit": "PhD", "Author": "Srx_Gryphon", "Date": 1492285607, "Score": 3, "Body": "Congratulations.\n\nNow, a yet another challenge awaits you, the PhD.", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "246": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1492286306, "Score": 2, "Body": "Thanks!  It's humbling to think I'm only at the phase where I get to -start- down the road, but I at least am getting the opportunity to do so.", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "247": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1492306319, "Score": 1, "Body": "Ask this guy, he got a PhD in some kinda Psychology, I think Organizational or something:\n\nhttps://youtu.be/T8ugPibs5Us\n\n", "Permalink": "https://www.reddit.com/by_id/t3_63l5hd.json"}, "248": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1492306507, "Score": 0, "Body": "https://www.youtube.com/results?search_query=PhD+interview", "Permalink": "https://www.reddit.com/by_id/t3_65fwg7.json"}, "249": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492325343, "Score": 3, "Body": "Let the stats inform you but don't be dissuaded if you're passionate, driven, smart, and strategic - emphasis on the latter. There are academic jobs out there, but you need to be planning for them from day one. Congrats and have an amazing time! ", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "250": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492331123, "Score": 2, "Body": "That is weird, in Hungary it is a prerequisite for the PhD application to have a master's degree. Going from BA to PhD seems like skipping a step on the ladder, like learning basic calculus, addition of numbers under 100, and then jumping to derivating... ", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "251": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492331191, "Score": 1, "Body": "Why would anyone downvote this? Upvoted.", "Permalink": "https://www.reddit.com/by_id/t3_65d3oh.json"}, "252": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1492363703, "Score": 3, "Body": "Congrats. It will be a life changing experience. Try to maintain your enthusiasm throughout the journey. There will good times and bad time but never forget the end goal. All the best, ", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "253": {"Subreddit": "PhD", "Author": "jldevezas", "Date": 1492372749, "Score": 1, "Body": "I personally use DokuWiki with (many) extensions to manage everything, including bibliography I need to read and comment on or any other ongoing work. It works quite well and you can keep it private or share specific pages with teachers or colleagues as required.", "Permalink": "https://www.reddit.com/by_id/t3_65cbgu.json"}, "254": {"Subreddit": "PhD", "Author": "jldevezas", "Date": 1492373049, "Score": 2, "Body": "What you did is perfectly fine. Just try to get a research job at the University where you want to do your PhD and take that chance to work on your thesis topic and find a supervisor and funding. Ultimately, you might have hated going to the other place, so it's really OK to make that choice. A PhD requires a stable ecosystem to support your work. Patience and hard work as well! ", "Permalink": "https://www.reddit.com/by_id/t3_659sc6.json"}, "255": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492386807, "Score": 1, "Body": "Are you writing it in LaTeX?", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "256": {"Subreddit": "PhD", "Author": "GettingRedducated", "Date": 1492390646, "Score": 1, "Body": "Word. \n\nI stick to Office products since everything I make gets edited by a few people who also only have Office.", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "257": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492391142, "Score": 2, "Body": "Latex is free and you can also edit it and share and collaborate. \n\nIt is a bit of a learning curve but after you use it you can see the difference between the documents and the quality is much better. \n\nSorry can't help you as I am not using word, if you want to have a look at latex overleaf.com is a great online editor. \n\nEdit: there is also a big community around it to get answers. ", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "258": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1492397246, "Score": -1, "Body": "Who uses LaTex???  You can import an apa template on word. ", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "259": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492397493, "Score": 3, "Body": "The majority of people in STEM research uses it. I understand that for some people it might be difficult to start as it involves tags and so on. \n\n[Relevant xkcd](https://xkcd.com/1301) ", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "260": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1492398214, "Score": 1, "Body": "You're probably right. I have LaTex on my computer but the learning curve was just too much. I'm in education, so... And no quantitative data. ", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "261": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492398752, "Score": 2, "Body": "I don't know about Word but in LaTeX you can very easily do things like:\n\nSee \"Figure 5\" for more details. And you click on \"5\" and sends you to the page where the figure is. Same with equations, chapters, tables or references. \n\nMakes the whole reading flow easier and enjoyable.\n\nAlso, math equations in Word are horrible.\n\nI guess that everyone uses the tools that suit best their work.", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "262": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1492423914, "Score": 1, "Body": "Probably you'll never see this now as this post is very old! But yes I see where you are coming from, but that's the same problem that any anonymous review site has (e.g. restaurants, hotels). I think for grad students the system is stacked against them in the case that they get a bad supervisor. And I've seen so many bright young people broken by it in my old lab, who had no way to be forewarned. If it did exist though, it would certainly not be appropriate for the university to use it to assess a professor's performance, for the reasons you posted.", "Permalink": "https://www.reddit.com/by_id/t3_64y0o0.json"}, "263": {"Subreddit": "PhD", "Author": "veggiemedley", "Date": 1492428132, "Score": 1, "Body": "Not to defend word, but just as FYI, what you just mentioned can easily be done in word as well. I thought that equations were pretty straightforward, too, but maybe because it's my only option right now.\n\nI'm interested in latex. Do I really need to learn another program (and abandon the one I've been using for 20 years)? What are the other perks?", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "264": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1492433909, "Score": 2, "Body": "To answer the question.\n\nHave a page break, then format so the page is flipped horizontally then have another page break and change the format to the default horizontal. On page numbers there should be a tickbox to continue numbering through the page breaks. ", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "265": {"Subreddit": "PhD", "Author": "GettingRedducated", "Date": 1492435278, "Score": 1, "Body": "I successfully used section breaks to flip the pages horizontal, and have page numbers, but the page numbers are on the bottom (which is the long side). They have to be oriented such that if you flip all the pages vertical all page numbers are at the bottom of the short side. Any tips?", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "266": {"Subreddit": "PhD", "Author": "Proudlove1996", "Date": 1492435458, "Score": 1, "Body": "https://uknowit.uwgb.edu/page.php?id=26346\n\nA quick search brought this result. Any use?", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "267": {"Subreddit": "PhD", "Author": "GettingRedducated", "Date": 1492435919, "Score": 1, "Body": "I've heard it's pretty great but unfortunately I deal with a bunch of industry guys who are forced to use office.. I even had to switch from Origin to Excel for dozens of spreadsheets each with a few million data points. 0/10, would not recommend (my computer fan agrees with this rating)\n\nThe learning curve rules it out since I'm trying to submit it tomorrow! I'll keep it mind for my real job though.", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "268": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1492448357, "Score": 2, "Body": " Very accurate about documenting your sources. Zotero was a godsend for my undergrad thesis.  I'll definitely be using it for my PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "269": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1492448922, "Score": 2, "Body": " Many grad students I've talked to gripe about not having a life,  yet many others say that having a work life balance is a choice and a matter of time management. How would you recommend maintaining that balance while not slacking off?  Or is it really so impossible to do anything but work,  eat,  and sleep? ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "270": {"Subreddit": "PhD", "Author": "p10_user", "Date": 1492450993, "Score": 1, "Body": "There are IDEs (I've used [texstudio](http://www.texstudio.org/) in the past) that can help. \n\nI find LaTeX a more enjoyable experience than Word when making documents I don't have to worry about formatting / fight Word over what it thinks I want.", "Permalink": "https://www.reddit.com/by_id/t3_65re8p.json"}, "271": {"Subreddit": "PhD", "Author": "gracefulchoices", "Date": 1492452272, "Score": 4, "Body": "It's not impossible. It's actually your choice. I know a plenty of PhD students who actually had fun (e.g., dating, vacations, outdoor activities, clubs). I chose to do work. I also made sure my Saturdays are my free days where I sleep or watch TV all day. It also depends on your institution and goals. If you are at an ivy league school and want to work there... Well, you will have a lot of work to do and will have to face a lot of competitions.\n\nGet a planner. Schedule your week - that helped a lot. Don't say yes to everything. Service has its ups and downs. Set a goal for each year with your advisor. ", "Permalink": "https://www.reddit.com/by_id/t3_64lqpa.json"}, "272": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492492882, "Score": 5, "Body": "If you are publishing to a conference there is a deadline and you can use that as an excuse to send the paper. \n\nAnother point could be that there are always revisions to be done suggested by the reviewers and say it's better to get somebody else's opinion as soon as possible. ", "Permalink": "https://www.reddit.com/by_id/t3_660ly5.json"}, "273": {"Subreddit": "PhD", "Author": "BecB21", "Date": 1492493517, "Score": 2, "Body": "This is a journal publication. Your later point really helps. Thanks. ", "Permalink": "https://www.reddit.com/by_id/t3_660ly5.json"}, "274": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492493559, "Score": 3, "Body": "Best of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_660ly5.json"}, "275": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492510226, "Score": 8, "Body": "You might want to look at how many math &amp; stats courses you'll need as prerequisites to a psych PhD before deciding on that as your \"low math\" option.  I'm pretty sure the pre-reqs will involve more complicated math than you're looking at for an HR job.\n\nAnyways, you should probably take a step back and accept that, like the vast majority of freshman students, you're probably not in a position to make an informed decision about grad school and long-term research goals.  You (presumably) haven't even done any upper-level psych courses or research, so how could you possibly expect yourself to know if you're \"fit\" for something that's totally unlike what you've done so far?  \n\nFor now: relax, and recognize that this is a chance for you to critically evaluate and improve your own work and study habits.  Grad school is a long, tough slog and your undergraduate degree is a chance for you to develop and demonstrate your skills in time management and independent learning.  In the mean time, make a game plan for how you can get more informed about your future options over the next few years.  Find a part-time or summer job in a psych research group if you can.  Try reading some books or review papers to get a feel for what kind of questions people ask and how much math is involved.  Talk to current grad students and find out what they do, what their days are like, what they anticipate doing in the future, and what they wish they had done in the past.  ", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "276": {"Subreddit": "PhD", "Author": "shakaman_", "Date": 1492513244, "Score": 2, "Body": "Great idea. My lab books are very chronological, but they would be far bettre if they were split into different Experimental setups and a completely seperate one for reviewing literature ", "Permalink": "https://www.reddit.com/by_id/t3_6603x6.json"}, "277": {"Subreddit": "PhD", "Author": "Verdanaveo", "Date": 1492520418, "Score": 1, "Body": "It would be easier for someone if I have left the lab as well, then they could easily find the protocol for that experiment. My lab has had many PhD students and postdocs come and go, and it's a waste having so many chronological lab books when I just want to find one protocol from one paper they did", "Permalink": "https://www.reddit.com/by_id/t3_6603x6.json"}, "278": {"Subreddit": "PhD", "Author": "JimmyRat", "Date": 1492523618, "Score": 2, "Body": "Graduate level statistics in the Master's portion of grad school will be very difficult. The Bachelor's intro to stay in psych departments is difficult too. ", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "279": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1492555482, "Score": 2, "Body": "Hmm, I never of doing that. I'm really uptight about having incomplete notebooks because (from a young age) I hated the idea of wasting paper, or leaving unused paper.\nBut now I makeshift notebooks and just use scrap paper so that saves me the anxiety of leaving untouched pages in a notebook...", "Permalink": "https://www.reddit.com/by_id/t3_6603x6.json"}, "280": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1492562973, "Score": 2, "Body": "Use a digital notebook like Findings. It's amazing. ", "Permalink": "https://www.reddit.com/by_id/t3_6603x6.json"}, "281": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1492564561, "Score": 3, "Body": "&gt;I have no idea what I want to do.\n\nDon't get a PhD", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "282": {"Subreddit": "PhD", "Author": "hungthickuncut", "Date": 1492564954, "Score": 3, "Body": "I work as a research scientist and face this dilemma frequently. Many journals require a statement that all authors agree to submission as part of the manuscript submission process. It's important, then, that you truly have your coauthors' support (beyond the power differential and trust aspects inherent in the relationship you described).\n\nWhen I have difficult coauthors that put me in similar situations, I try to go back to the basics. If you are meeting in person or on the phone, try to maintain communication: repeat back to the individual what they are are asking of you to ensure understanding. For example, \"So you would like me to use variable x in this model. Is that correct?\" Don't be afraid to ask for clarification.\n\nIf that does not help, do you have other coauthors? The power differential puts you at a disadvantage when working with a mentor or supervisor in some cases. If you have two professors working on the manuscript with you, sometimes it takes Professor A to convince Professor B (no power differential) that the paper is ready and good enough.\n\nIf all else fails, there's the nuclear option... Walk away from the paper. It's a horrible feeling but sometimes the battle is not worth fighting. I would argue that is an absolute last resort, but you have more control of the situation than you may recognize. Even realizing it is an option can relieve a lot of anxiety and help you get to the finish line.\n\nBest of luck!", "Permalink": "https://www.reddit.com/by_id/t3_660ly5.json"}, "283": {"Subreddit": "PhD", "Author": "throwaway932932", "Date": 1492573998, "Score": 1, "Body": "I can always become friends with my TA, but I'd feel weird and like I am wasting their time if I email them saying \"I'm considering to go to grad school for psychology...\"\n\n\nThe thing is if I declare psychology as an official major and I'm in the spring semester of my junior year with a 3.0 (if I'm lucky) and have no luck getting into grad school, I'll have to start all over and find a new major (or be a lab tech / work for a nonprofit)\n\n\nHow do I ask a professor to write me a letter of recommendation (how do I get close enough for one to know me that well)? Do I worry about experiments and being published in undergrad or grad?", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "284": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1492578703, "Score": 3, "Body": "I wouldn't ignore sources - especially if they're relevant and sound. You can make an NB note on the page, or make mention of it in the foreword if it makes you feel better.\n\nA person's character or bad deeds do not alter the good or knowledge they may have provided before. I come from a science background, though. It'd make very little sense to ignore a source, especially one that was very relevant, purely because they did something unethical and non-impacting on their work.", "Permalink": "https://www.reddit.com/by_id/t3_6683ue.json"}, "285": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492587273, "Score": 2, "Body": "Your TAs likely won't mind if you ask them about grad school; most people are flattered to be asked for advice.  You don't have to pretend to become their friend just to email them and ask for a quick chat.  You can also go to their office hours, or the office hours of your professors.  \n\nI'm not sure I understand why you feel you have no other options if you declare psych as an official major.  Don't most people who work in HR have a degree in something like psych?  Plus, there are plenty of other kinds of jobs out there that the vast number of psych grads end up in.  Go find out what they are.  Google it; ask the older students; ask the department admin people; look people up on linkedin with a psych degree.  You should be doing this before declaring *any* major, since the odds of you getting into grad school are never 100% and grad school only delays this problem for a few years anyways.\n\nThe ideal route for letters of recommendation is to ask a professor who you worked for.  If you haven't worked for one by then, then go to someone who interacted with you in a more direct setting than just you sitting in a lecture.  Some kind of upper-level project course or intensive seminar or self-directed research course.  ", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "286": {"Subreddit": "PhD", "Author": "Akropop", "Date": 1492602499, "Score": 1, "Body": "If school #1 wasnt your vibe, and school #2 has no funding, it will be ok. There are more options than just those two. Better to develop a plan this year to find your optimal school next year than waste 4-7 years in a bad situation.", "Permalink": "https://www.reddit.com/by_id/t3_659sc6.json"}, "287": {"Subreddit": "PhD", "Author": "Gophurkey", "Date": 1492610150, "Score": 1, "Body": "That's what I was hoping to hear. It's hard to toe the line in a field like Theology, where you never quite know where the reader will draw their ethical lines. Thanks for your feedback!", "Permalink": "https://www.reddit.com/by_id/t3_6683ue.json"}, "288": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1492616174, "Score": 2, "Body": "Definitely a good idea. I know we like to use fancy, expensive notebooks for lab experiments, but for daily notes, goal outlining, etc, I use 11 x 9 notebooks that can frequently be found at Walmart for &lt;$1 each. I'm 4.5 years into my PhD and I have gone through a stack of ~12-15 of them so far, and they are divided by course notes, conferences, projects, etc. Much easier to keep track of if these things are all separated.", "Permalink": "https://www.reddit.com/by_id/t3_6603x6.json"}, "289": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1492631070, "Score": 3, "Body": "My fantasy is my wife will travel for a month or two and I'll be able to sleep in the lab and stay here for 18 hours at a time. :/", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "290": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492639063, "Score": 1, "Body": "I'm married and think about how much more successful I'd be if I were single. Then I get home and fantasize about quitting school because I could have more time with my wife. THEN I pretend my wife and my PI are sitting in front of me and I have to choose one and I run that thought experiment. Invariably I go with option \"C\", which is that my dog runs in and we play together forever. \n\nYou're a special kind of sociopath.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "291": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492639156, "Score": 1, "Body": "I'm not sure if I feel less crazy about myself or more worried for academia. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "292": {"Subreddit": "PhD", "Author": "FutureDrHou", "Date": 1492639995, "Score": 1, "Body": "That's actually the beauty (?) of it: there are no certainties.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "293": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492650784, "Score": 2, "Body": "Weird question. What do you sleep on in your lab? I've put together multiple office chairs into a makeshift bed, was awful. I've slept with my face on my desk while sitting- tough on the back. Finally, I slept on a 40 year old couch in the hallway - caught and reprimanded.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "294": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1492655168, "Score": 2, "Body": "Sadly this is just a fantasy. However, in the extreme versions of my fantasy, I've purchased a cot with a sleeping bag, use a hot plate to cook my food in the fume hood, and shower in the rec. [I'd never have to leave.](https://media0.giphy.com/media/wz8OwIImMOaOc/giphy.gif)\n\nWhen I've actually slept at school I've just put my head on my desk and passed out for an hour.", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "295": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1492660980, "Score": 2, "Body": "Sounds exactly like my experience, when I started I had to present ever 6 weeks or so for 2-3 years. I got a little better over time, but I've learnt that if I really want to make a good talk I have to put in a lot of time. Practice and try and come up with a formula for your talks that works for you, it gets better, but only very slowly.", "Permalink": "https://www.reddit.com/by_id/t3_66cnws.json"}, "296": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1492696957, "Score": 1, "Body": "Thanks for the feedback. You're of course right, I do need to put more time in. What formula did you find works for you?", "Permalink": "https://www.reddit.com/by_id/t3_66cnws.json"}, "297": {"Subreddit": "PhD", "Author": "shakaman_", "Date": 1492699706, "Score": 2, "Body": "Good luck friend ", "Permalink": "https://www.reddit.com/by_id/t3_66fn2n.json"}, "298": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492705587, "Score": 2, "Body": "That gif is wildly appropriate. ", "Permalink": "https://www.reddit.com/by_id/t3_64dgxu.json"}, "299": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1492723651, "Score": 1, "Body": "Thank you, I've actually spoken to a few more professors who agree that, if I publish well and do good work, they can't imagine it being a barrier, which was very refreshing (Though still a bit uphill, but cart before the horse).", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "300": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1492723749, "Score": 1, "Body": "It's a bit belated, but thank you - I have a good support structure that I'm hoping will keep me focused on the prize when times get tough.", "Permalink": "https://www.reddit.com/by_id/t3_65kusw.json"}, "301": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1492725194, "Score": 2, "Body": "I really, really hope you will be ok. I know this should be a place of support, so I don't mean to be negative, but this sounds like a recipe for burn out. Yes, you need to worry about getting through in a timely manner, but if you're crazy at the end, is it worth it? After this semester you are describing, can you reassess, and if it's too much, do one less thing? \n\nI've been where you are. Full time professor, run a giant conference each semester, took on a curriculum renovation, all while trying to work on the doctorate. \n\nI broke down, hard--had to go to therapy, and ended up having to ask for an extension in my program due to the time off to recoup my sanity. \n\nUp until then I had been a very stable person who could handle a lot. But I took on too much. Be careful with yourself! ", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "302": {"Subreddit": "PhD", "Author": "booffy", "Date": 1492730418, "Score": 3, "Body": "Don't do it!", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "303": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1492732671, "Score": 7, "Body": "Best advice I can give is don't let someone else's misery ruin your peace. You got this, a few more months and you'll have your degree! Hang in there!", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "304": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1492736768, "Score": 2, "Body": "Start by writing an outline it should contain all the headings for the topics you want to cover and the data that you want to present. Then build out from here, for each section make an introduction, combine and separate out different sections as you find you need to and try to  explain all your work in a logical sequence. For each topic I like to think of it as a game of 'and thens'. I did this, and then this is why, and then this what happened, and then this what I think is happening, and then this is what I did/want to do next. ", "Permalink": "https://www.reddit.com/by_id/t3_66cnws.json"}, "305": {"Subreddit": "PhD", "Author": "yoshidrivesacar", "Date": 1492738999, "Score": 6, "Body": "Are you me??? My plan is to keep my head down and interact as little as possible!", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "306": {"Subreddit": "PhD", "Author": "fitshifu", "Date": 1492746203, "Score": 3, "Body": "Namaste. You can do it! You haven't come this far to let someone elses crappy character jeopardize your work :)", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "307": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1492746363, "Score": 4, "Body": "We started of good. But this damm thing has stretched out so long now I think we are just sick of even looking at each other. I think she won't admit she doesn't know enough to help me through methodology. I won't admit how often I fantasize about printing out my 130 pages and setting it on fire in her office. ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "308": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1492746441, "Score": 3, "Body": "👊🏼 fistbump of solitary. Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "309": {"Subreddit": "PhD", "Author": "sharkbeagle", "Date": 1492746474, "Score": 1, "Body": "Trying super hard to hold back. ", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "310": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492752312, "Score": 3, "Body": "I actually think talking about the problems so that you can get input is a great idea, but wording it to highlight the things that you have done is also important. So tell them about the things that you have achieved and how those things have then lead you to hit a roadblock - \"I did this and this and this, and then I got stuck on this little problem...\" \n\nThe other thing I do is send my advisors semi-regular updates on anything I'm writing, so they can physically see how much work I've put in. I know this isn't really \"presenting yourself\" but it's a good way to show what you've actually been doing so that they realize how hard you're working. It doesn't hurt to pop a couple of questions about problems into emails either, my advisor comes up with much more helpful responses when he's seen my latest work and has time to think about solutions. ", "Permalink": "https://www.reddit.com/by_id/t3_66cnws.json"}, "311": {"Subreddit": "PhD", "Author": "laupro", "Date": 1492762498, "Score": 7, "Body": "From my experience there is no real answer to this as everyones PhD is different. Obviously working solid 9 - 5 would be ideal but not realistic. The best way to answer it is if you are happy with your progress and your supervisors are then there shouldn't be a problem. \n\nI have found I have ups and downs with my motivation and productivity, sometimes working well over 9 - 5 and sometimes well under. So not doing much now doesn't mean you won't in the future make up for it. \n\nIn the first year (which it sounds like you are in) i found I got distracted a lot but I also did not have a lot to do. In that I was only working on one main thing at a time and so if I wasn't doing that I was not doing stuff for my PhD. As I've progressed I have more things to do and so can procrastinate on things that maybe aren't my top priority but are at least my PhD, you just have to get to that stage first. \n", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "312": {"Subreddit": "PhD", "Author": "louuegan", "Date": 1492762897, "Score": 2, "Body": "If you're in touch with a potential supervisor I'd ask for their advice on this. My field is humanities (so, perhaps we're similar? no footnotes here). If I was you I'd perhaps add a qualifying statement when discussing his work. One good sentence could be all you need. I think it is a rational fear, it would be in my field where rigorous ethical concerns should always be addressed or at the very least alluded to and acknowledged. ", "Permalink": "https://www.reddit.com/by_id/t3_6683ue.json"}, "313": {"Subreddit": "PhD", "Author": "louuegan", "Date": 1492763207, "Score": 2, "Body": "That outline sounds good. I just got awarded highly competitive funding and a PhD for English Research. It's a really brutal process where I am from and I've had 5 rejections beforehand. The difference in this one was that I had a dedicated supervisor. I could not have done it without three months of back and forth with my now supervisor. He knows a lot about the proposal process and helped to refine the proposal. So find your potential supervisor and use them. Doing so will also give you a good idea of how well you both work together, plus, if they are not interested in your idea and not willing to help you refine your proposal. That's a good indication that they are not a good fit for you. Good luck and don't be disheartened if you don't get it straight away! \n\nAlso yes it is a problem if it is too long! Ask the admissions team about word counts. ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "314": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492763526, "Score": 1, "Body": "It works a bit different here, the first step was to talk to the person who has a similar research topic and who I chose as my supervisor. I think the chemistry worked on apersonal level too, and she is super excited about my research itself. She actually emailed me that she thinks my thesis proposal is 'unbeatable'. :D \n\nThanks for sharing this and commenting my outline! ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "315": {"Subreddit": "PhD", "Author": "louuegan", "Date": 1492768282, "Score": 2, "Body": "Sounds like you're onto a winner! Yeah, definitely just ask admissions and your supervisor if 7 is okay - if not, refine.\n\nAlso are clearly defined research questions part of your proposal?  ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "316": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1492770559, "Score": 1, "Body": "I already gave them all the documents :) \n\nYes, I have several questions. ", "Permalink": "https://www.reddit.com/by_id/t3_65jtfz.json"}, "317": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1492775660, "Score": 5, "Body": "I had some major issues with motivation the first few months of my PhD and I realized it was because I just wasn't very good / knowledgeable at/about the project I was working on. I started trying to plan my days BEFORE I got in so I had a game plan and after putting in a couple months of reading (I tried to read a paper every other day or so, nothing crazy) I got more familiar with the subject which made me more excited about the project and my productivity shot up.  There are still good weeks and slow weeks but that's just life. Do your best, keep communication open with your advisor and go from there. ", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "318": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492783048, "Score": 5, "Body": "The easiest way to tell is to ask your advisor. Don't ask if you're working enough hours, though. Ask if your projects are coming along at a satisfactory pace.  ", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "319": {"Subreddit": "PhD", "Author": "Gophurkey", "Date": 1492789735, "Score": 1, "Body": "Thanks, I'll reach out and try to explain - that's helpful!", "Permalink": "https://www.reddit.com/by_id/t3_6683ue.json"}, "320": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1492796095, "Score": 4, "Body": "I agree with laupro on this 100% there is no real magic number.  Depends what you are working on at the time.  I'm in the process of launching my research - I started my PhD program in July 2013...so after many years of classes and many qualifying paper rounds, I've had my dissertation proposal hearing and am now on the road to sending out my survey.\nDuring my coursework years really it wasn't all that bad.  more just hours reading and writing papers...but for my actual research...this week along I am at at least 30...just depends where you are in the process and what your other obligations and pace are.  \n\nEDIT: (for tips)\n- Make a to do list of what you want to get accomplished each week (I use my syllabus as a guide) and check tasks off as they are completed...I find that helps me feel accomplished and chunk my work out into more time manageable pieces.\n- Set aside specific times for work (meaning schedule them like you would a job or other activity)\n- Talk to others people in your co-hort, classes...find out what they do to keep focused.  \n- I like to walk at least 30 mins a day...keeps my mind clear - so get some physical activity too!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "321": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1492796267, "Score": 3, "Body": ":) Hang in there on this!  As soon as you are done, you walk away with your degree and your committee chair will live to advise someone else!\n\nYou can do it!!", "Permalink": "https://www.reddit.com/by_id/t3_66kxpz.json"}, "322": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1492796912, "Score": 1, "Body": "I'm not doing the exact same PhD, but I am where you are for sure.\nI started my program in July 2013.  I'm through coursework and now solely in the research phase.  I'm in fact launching my survey next week.  I finally left my cheating and emotionally abusive husband with my 2 kids (5 and 2 in tow) the month before I interviewed for this program (leaving was the best thing I've EVER done) - during the program I got divorced, moved in with my parents, sold my home, met my now second husband, bought a condo and now live with him and our 4 kids (2 8 yo's and a 6 and 5 yo) plus I work full time in Special Education at a high school.  \n\nThe best advice I got from a professor was this: \"Find the balance.  Some days you give more focus to your school work, others to your house work...some days it's family day...just know that it's not necessary to do it all everyday.\"\n\nSo yes - it's SUPER hard but you will NOT lose your mind!  Please PM me if you want to talk further about how I balance it all...cause it's hard...but you can do it!!!  Don't be worried!!\n\nHere are a few tips I use:\n- budget my time (scheduling and organization is key!)\n- leave work at work, home at home and school at school\n- walk each day even for 20 minutes during lunch\n- talk to others in your program for support and friendship\n- be clear with family and friends about what you need to do (so they don't feel neglected)\n\n", "Permalink": "https://www.reddit.com/by_id/t3_66k037.json"}, "323": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1492797604, "Score": 1, "Body": "go for it!  good luck!", "Permalink": "https://www.reddit.com/by_id/t3_66fn2n.json"}, "324": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1492800091, "Score": 3, "Body": "&gt; just depends where you are in the process and what your other obligations and pace are.\n\nthis this this!\nif you advisor is happy with progress so far, use other time on developing soft skills, or networking, or something else that makes you happy", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "325": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492816828, "Score": 1, "Body": "Yeah the lack of things to do has definitely been something I've found too! During my undergrad degree I could always do switch between subjects so I was being productive even if not working on the top-priority stuff. Now I sometimes have massive days, and other days I don't really have more than a couple of hours worth of work to do, and then feel bad for not doing anything. Hopefully it will work out like you said, with the ability to procrastinate productively with a few PhD tasks on the go :)", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "326": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492817082, "Score": 3, "Body": "My advisor has told me a few times that he's really happy with how quickly things are coming along, I guess I'm just finding it hard to shake the feeling that I could be doing more faster? But you're probably right and I'm probably just overthinking it. I'm sure that once I have 3 design components on the go that I'll have a lot more on my plate to fill my days up!", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "327": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492817211, "Score": 2, "Body": "Having a game plan is definitely a great idea. I did that too in my first month or so but have been a bit lazy with it since then, so I'll try get back into that :) ", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "328": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492817403, "Score": 1, "Body": "Thank you for all the great tips! I've been keeping a weekly planner with tasks most of the time, but I do get a bit lazy with it occasionally. I'll have to try stick to it a bit better. I've also found that it's really hard to get into study after work (I tutor a few subjects), so maybe I should try and work on my work schedule too. Exercise is something I have DEFINITELY been bad at lately. I used to have to walk to classes every day whereas now I don't really have anywhere to be other than at my computer, reading literature, or writing about it. Maybe adding \"GO FOR A WALK!!\" as a task in my day I'll actually achieve it. Good luck with the rest of your PhD :)", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "329": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492817614, "Score": 2, "Body": "Definitely great advice! I started a machine learning course a few weeks ago because I'll need that skill at the end of my research project, and it has done wonders for my motivation. It gives me something to look forward to each week when I get tired of my literature review haha", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "330": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1492818540, "Score": 3, "Body": "Good problems! Haha. Yeah you'll likely look back in a year and think \"those were the days . . . \". It depends on your PI, though. If he's got a lot going on and isn't relying on you heavily to publish, he probably won't try to suck more labor out of you. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_66n8sk.json"}, "331": {"Subreddit": "PhD", "Author": "PM_ME_YOUR_MACnCHEEZ", "Date": 1492829734, "Score": 1, "Body": "Maybe look into I/O Psychology? It is sort of a middle ground between the two areas and there are job options available to those with just a Master's rather than Ph.D. ", "Permalink": "https://www.reddit.com/by_id/t3_661osm.json"}, "332": {"Subreddit": "PhD", "Author": "communitycirclejerk", "Date": 1492857460, "Score": 2, "Body": "&gt;Whether they think I will be a good candidate \n\nHow are they supposed to know from an email if you are a good candidate? \n\nUnless you write a super long novel in the email at which point your email will be deleted. \n\nThat's what interviews are for. \n\nJust email them stating that you are interested in their research and if they are looking for PhD students for fall next year. \n\nDear prof x, \n\nI am currently studying x and working on this research. \nCould you please tell me if you looking for PhD students for next year? \n\nYours sincerely, \n\nAlso, make sure that on their page they don't have anything mentioned about vacancies etc. It would be frustrating for them to get emailed about information that they already made available. ", "Permalink": "https://www.reddit.com/by_id/t3_66ts5i.json"}, "333": {"Subreddit": "PhD", "Author": "Sunhillvalley", "Date": 1492863483, "Score": 5, "Body": "If there is nothing keeping you rewarded like friends at work, genuine interest in your research topic or a professional goal linked to your PhD, maybe its better to quit. A lot of what you say sounds very familiar, but I had friends, family and actually liked the things I was doing. Finally, look for the new before quitting. Always better to head somewhere, than to only run from. Good luck.", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "334": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1492863842, "Score": 2, "Body": "I can empathise with some of what you say, but i had an involved supervisor which helps with motivation. I think your problem is largely that you don't know what lies at the end of your PhD. Are you planning to remain in academia or enter industry? It's probably worth establishing your goals at this time so that you create light at the end of the tunnel. I always discourage people from careers in academic and industrial science in the UK because it's inappropriate for the economic model adopted by the UK. There are other careers out there for PhDs so take the time to explore the careers service at your institution. I was fortunate that my university was a focal point for many employers so accessing a range of experiences was easy. Figure out what you want to do, and target that aggressively.", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "335": {"Subreddit": "PhD", "Author": "Garbageaccount1338", "Date": 1492863857, "Score": 1, "Body": "I have colleagues that I would consider friends 'at work' but I only meet these people at work and they have their own projects. I also have a supporting family and friends that I spend time with in my spare-time, but at the end of the day I spend most days working alone in my office. ", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "336": {"Subreddit": "PhD", "Author": "Scientist34again", "Date": 1492863875, "Score": 1, "Body": "I have a few questions for you:\n\n1.) How far along in the PhD are you? Could you tough it out for six more months and finish or are you still years away from finishing? If you are close to finishing, I'd recommend just toughing it out.\n\n2.) I'm from the US and know the system here better, but if you want to teach at many universities here, you would still need a PhD. Some colleges you can teach at with only a MA, but the pay is often rather abysmal. Or you could teach at a high school level. Be sure to understand the teaching requirements/salary where you are located to be sure you wouldn't need a PhD to do what you want to do.\n\n3. Is there any way to get involved with people who share your general interests in either science or teaching. I'm thinking clubs or organizations? I don't know why, but it seems the people in your lab and/or department are not helping with the loneliness you're feeling. But maybe you can find people elsewhere who could serve as a support and encouragement for you?", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "337": {"Subreddit": "PhD", "Author": "Garbageaccount1338", "Date": 1492864798, "Score": 1, "Body": "1) I have 1½ years left. No way i can tough it out.\n2) I would need a PhD to each at any university but there are interesting job opportunities at other institutions.\n2.1) I am involved as a volunteer at a \"lesson cafè\" (according to google translate). The people at my department are not really helping with the loneliness as they are not part of the project I am doing (except my supervisor).", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "338": {"Subreddit": "PhD", "Author": "Scientist34again", "Date": 1492865344, "Score": 1, "Body": "OK, I understand your situation a bit better. I think you have two options:\n\nOption 1: Quit the PhD and go do something you're really interested in. But perhaps spend a month or two exploring other options, so you know where you're going and hopefully have a job lined up.\n\nOption 2: Continue the PhD, but don't spend as much time alone by yourself in your office. Tell your advisor you're feeling stressed and need a bit of a break. Then go take a relaxing vacation. When you get back, make a conscious effort not to spend more than 4 hours alone most days. This may mean working in the morning and then taking a long lunch break, where you make a decided effort to meet other people. They don't have to be scientists, just friends. Or go do some volunteer work where you can interact with people you don't know, but that you can help. After you've had some time socializing, get back to work for another 4 hours. I don't know if this will help or even if it will fit with your experimental schedules, but it will break up long periods of time alone in your office.\n\nYou'll have to decide whether it is better for you to just quit now or to change your schedule and see if that makes you happier.", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "339": {"Subreddit": "PhD", "Author": "Garbageaccount1338", "Date": 1492865941, "Score": 1, "Body": "Option 2) I should have been clearer. I am actually not sitting alone in my office - we are three people. The problem is that loneliness does not imply that you are alone and the other way around.\n\nI will definitely tell my supervisor.\n\nI think a break from everything would be good but it would not solve the core problem - it simply removes me from it physically. \n\nChanging my working hours is complicated. Here, pretty much everyone have working hours 8am-4pm. You would be surprised to see that almost all offices are empty at 4:15. People just work at home or on weekends if needed.  So changing my schedule to have a long lunch break would mean that I would be one of the only ones to be working at the department in the evening.\n", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "340": {"Subreddit": "PhD", "Author": "Scientist34again", "Date": 1492867033, "Score": 1, "Body": "Hmm, that is complicated. You should think about things for a bit to be sure, but perhaps your best option is going to be to quit the PhD. Still make sure that's really what you want before doing it, since it is quite likely you would have trouble going back to it later on if you decide you made a mistake.", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "341": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1492879252, "Score": 1, "Body": "&gt; At the beginning of my PhD, I began to discover the harsh truth of research: no one cares how much you work if you do not produce any results, most of the work is not only done alone, but other people generally do not care about your project - they just want to focus on their own work. I also discovered that even though a significant amount of my time was used for teaching and doing coursework, my supervisor was only interested in the research and teaching/coursework was just something that had to be done for reason. You can argue if the above is actually true, but it is certainly how I felt/feel. \n\n\nI don't think anyone would disagree with you on this.  Getting a PhD does depend directly on research results, not on hours spent or teaching quality or coursework skills.  It's a research degree, and research is what gets you there.  I guess this is what you're supposed to have learned through your undergraduate research experience or especially through your masters research.  Obviously it would have helped to have more interested colleagues or friends but ultimately it's still just your work that gets you through.\n\nGiven the information at hand, my conclusion would be that you signed up for a PhD without knowing what would actually earn you the PhD.  Now that you have that knowledge, you can make an informed decision about whether it's worth wasting another year and a half of your life being miserable in order to get a degree that you probably don't really want anyways.  \n\nGetting better information, engaging in critical self-evaluation, and re-evaluating your previous choices is a sign of maturity and not something to be ashamed about.  If you want to quit, just quit.  Call it a life lesson about what you want and need in a job, and move on.", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "342": {"Subreddit": "PhD", "Author": "Only-Me-Here", "Date": 1492879313, "Score": 2, "Body": "Quick Question: how do you think you'll feel in 5mins? 5 days? 5 weeks? 5 months? 5 years? \n\nFor me, someone who is struggling and hating every last moment of my PhD (8 months left and counting), my answer is different for each of those options. This is why I am still here, fighting each day. I am so lonely too (even though I have a supportive partner), no one seems to understand or see the pain and struggling. But for me the bigger picture of getting it in the end makes me keep fighting, but it is so so hard. \n\nFind someone to talk through your options with. I spoke to supervisors and a counsellor to help me decide this was worth a fight. They can also help with the loneliness by offering suggestions. \n\nIf you want to rant/talk more pm me. I am in the same headspace (and also in the UK!)", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "343": {"Subreddit": "PhD", "Author": "drarch", "Date": 1492879732, "Score": 1, "Body": "I have 1.5-2 years left as well, but still feel good about my process. From my own experience, what I think is different is that:\n    \n\n1. I have a spouse, home, and puppy, all of which help me not become overly stressed. I also have small hobbies which, in moderation, help to keep me happy (photography, travel, video games, etc.). Finding time for yourself and having a healthy work/life balance is important, be it in a job, academia, or anywhere else. Take care of your own health as best you can first. \n    \n2. I try to relate what I do in terms of [Ikigai](https://en.m.wikipedia.org/wiki/Ikigai). My Ph.D. is funded by a public health non-profit that needs my assistance on a federal grant. Rather than taking up my time teaching, I'm out doing fieldwork on important issues connected to the real world. Rarely do I feel like my research doesn't have value, because every week I meet someone who would benefit from it. \n    \n3. My advisor once told me, \"The most important thing about your Ph.D. is that you finish it\". Whether you use that as motivation to see it out, or as a reminder to focus on what's important, I think it's good advice. So few papers are read outside academia anyways, that the real value in the degree is that it demonstrates an individual's ability to think critically and see it through.  ", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "344": {"Subreddit": "PhD", "Author": "HelperBot_", "Date": 1492879735, "Score": 1, "Body": "Non-Mobile link: https://en.wikipedia.org/wiki/Ikigai\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^59389", "Permalink": "https://www.reddit.com/by_id/t3_66vm35.json"}, "345": {"Subreddit": "PhD", "Author": "nemesis18082", "Date": 1492898837, "Score": 4, "Body": "Some PIs think that most of your learning will happen throughout the course of your research. My PI is of this opinion. He left me with a lot of freedom in selecting my courses. He encouraged me to talk with other students in our group, as they're the ones who've actually take the courses from this faculty and may offer better insight. That being said, he has encouraged me to take a special topics course every so often if they're particularly relevant.", "Permalink": "https://www.reddit.com/by_id/t3_66wvv0.json"}, "346": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1492912027, "Score": 6, "Body": "If someone won't fund you to do research then either you're not up to scratch or your research isn't worth doing. If you can self fund many places will be happy to take you as the problem with research is funding. The cost of a phd even without overheads is still $80,000+. Get funding, if your idea is good someone will fund it", "Permalink": "https://www.reddit.com/by_id/t3_66z96e.json"}, "347": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1492914293, "Score": 5, "Body": "I'm not sure what the policies on self-funding are at the universities you're looking at, but at my university we're basically not allowed to use our own money for anything besides publishing &amp; conference attendance because it creates a conflict of interest - if someone's invested in their own research, then of course they want the results to look good, so there's a higher risk that they'll be tempted to alter bad results. \n\nEven if that's not an issue where you are, I would still look for funding. Justifying the use of someone else's money for your research is actually a great way to ensure that your research is relevant and meaningful, pretty important things for a career afterwards. If you're happy to use your money to further your MD/PhD, then use it for things like getting published. ", "Permalink": "https://www.reddit.com/by_id/t3_66z96e.json"}, "348": {"Subreddit": "PhD", "Author": "solo1001", "Date": 1492926745, "Score": 1, "Body": "Thanks.  I was just a little confused as I thought I'd get a little guidance in the beginning and really figure things out once school started.  I'll get there.", "Permalink": "https://www.reddit.com/by_id/t3_66wvv0.json"}, "349": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1492934042, "Score": 1, "Body": "One of the glaring issues is that when you graduate and move onto a job, you will not have experience in applying for and handling funding and will not know the major funding bodies in your field. Candidates in this position do not get hired.", "Permalink": "https://www.reddit.com/by_id/t3_66z96e.json"}, "350": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1492954422, "Score": 2, "Body": "\"Future\" MD/PhD is the key phrase here. You may want to look into these programs a bit more, assuming you can get accepted, because I don't think you fully understand how they function yet. Funding yourself is not an option and writing grants is part of being a PhD. Even with the MD, if you're doing the PhD, you won't be doing a residency... meaning you can't just work as a doctor if things don't work out. There's also a good chance that you won't make boatloads of money in research and you certainly won't if you lack the basic skills of getting funding. \n\nThis post honestly reads like someone who hasn't accomplished anything trying to brag about what they \"plan\" on accomplishing and the asking a question about how to handle their future fortune. \n\nTL;DR get accepted first, worry about what you're asking second. ", "Permalink": "https://www.reddit.com/by_id/t3_66z96e.json"}, "351": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1492965137, "Score": 11, "Body": "Good: free trip and fantastic experience in Germany (this is big from Australia). Bad: anxiety and lots of doubting myself.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "352": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1492971546, "Score": 7, "Body": "Good - experience of living in the UK and my kid learning English, bad - it took my mental health and put me on anti-depressants.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "353": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1492974231, "Score": 11, "Body": "Good - meeting fellow PhD students, who have become v.good friends. A trip to Brazil for three months. Reassessing my understanding of a subject i love. \n\nBad - loss of confidence in my knowledge of said subject, loss of confidence in my hypothesis, loss of faith in academia.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "354": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1492975889, "Score": 8, "Body": "Good: world travel for conferences, became a better writer and public speaker, sense of pride and achievement, got a TT professorship. \n\nBad: spend less time with my kids at points of the year than I'd like, I see my true friends once a year, having to navigate departmental politics and bullshit, periods of high stress for certain deadlines. ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "355": {"Subreddit": "PhD", "Author": "cerys2005", "Date": 1492981462, "Score": 7, "Body": "Good: Got to travel to America, Nice and Glasgow for conferences.\n\nBad: Mental health and finances are in worse shape. Also I realised scientific research and academia, in general, is not a good future career for me. ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "356": {"Subreddit": "PhD", "Author": "Criibon", "Date": 1492982185, "Score": 7, "Body": "Given: lots of knowledge, Insight into knowledge I (and others) lack, better at assessing research in general. New friends, I find that I enjoy the work and the scientific method (and I love to be more aware of it's strength and weaknesses). Also, more travelling, more freedom regarding when and where to work. \n\nTaken: my spare time (see above when and where to work. Everywhere, all the time!). Stress from work (combined with a though break-up) might have been the onset for an autoimmune disorder, so health. No time to date. Have to choose between social life and working out. More insecure about my capabilities (but also more secure about them in other ways). \n\nFor me, the PhD-process feels very bipolar. I love it one day and hate it the next. All in all, happy about my choice. ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "357": {"Subreddit": "PhD", "Author": "lilyflower32", "Date": 1492984600, "Score": 8, "Body": "Pro: I really enjoy my research and teaching. Teaching has been the fun part latley. \n\nCon: imposter syndrome. Sad to see so many people mentioning mental health. I think more needs to be done to recognize this. My first year of my masters I developed aniexty disorder and an autoimmune condition. Now in my 6th(!) yr of PhD I better manage those conditions. ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "358": {"Subreddit": "PhD", "Author": "tawmoose", "Date": 1492991975, "Score": 7, "Body": "Pro: I learn very fast.\n\nCon: I overthink EVERYTHING. \"I think therefore I am\" couldn't be more bittersweet; I've been practicing mindfulness daily, which helps a lot but lawd after five years doing my doc it's almost impossible to turn off the ole thinker. Made dating a bugger, too.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "359": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1492997939, "Score": 4, "Body": "Good - ...?\nBad - See above. ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "360": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1493042728, "Score": 2, "Body": "Thank you so much for this; seems so simple, I don't know why I'm freaking out about it, haha. ", "Permalink": "https://www.reddit.com/by_id/t3_66ts5i.json"}, "361": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1493061626, "Score": 6, "Body": "I notice the same thing. All my successes and failures feel amplified. Similarly, when I'm apathetic about my work, I REALLY couldn't give less of a shit. Two days later I'll be dead certain this is what I want to do with my life, everything else be damned.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "362": {"Subreddit": "PhD", "Author": "Scientist34again", "Date": 1493074757, "Score": 1, "Body": "It's OK to email professors, but many of them get so many emails that they just don't answer them all. Perhaps better is to try to find out who is in charge of the PhD program in the departments you're considering. Then email that specific person, who is more likely to answer your email. For example, [here](https://psychology.buffalo.edu/about-us/administration-staff/) is a list of faculty in the Psychology department at SUNY-Buffalo. You can see that Craig Colder is listed as the Director of Graduate Studies. He would be the person you'd want to contact at that university. Try to find similar information about the universities you are interested in.", "Permalink": "https://www.reddit.com/by_id/t3_66ts5i.json"}, "363": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1493074873, "Score": 2, "Body": "Given: cool work, cool travel, flexible hours. And interestingly, more professional confidence.\n\nTaken: Health. I've gained weight. Less time for other interests. No friends but I never really had any anyway.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "364": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1493099236, "Score": 3, "Body": "Good: finally doing something intellectually stimulating, somewhat confirms that research is my calling, travelling opportunities (Australia, Germany, Singapore), fantastic friends from different countries, emotional and mental growth spurt (having to deal with a toxic boss and a toxic lab, network, look for external, funding/resources for my projects/travel, etc.), opportunities to talk to superstar scientists and collaborate with other labs that resulted in a soft job offer in my 3rd year PhD\n\nCon: I've become a lot more cynical and jaded with academia (asking useless questions only for the sake of publishing, lax QC, politics BS). All the fun stuff that comes with years of abuse by the supervisor (no recommendation letters, no first-author papers due to deliberate withholding of manuscripts, no support for travel grant applications, loss of weight, loss of *hair*, etc.) ", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "365": {"Subreddit": "PhD", "Author": "Humfrie", "Date": 1493130192, "Score": 2, "Body": "Pro - discovered research isn't really my forte\n\nCon - I kind of dislike science now", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "366": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1493164968, "Score": 7, "Body": "When I started research, I planned every day with detail. Like, to the hour. Which resulted in me getting super frustrated almost every day when I didn't get everything done. I've found since then that it's better to start the month with a (flexible) goal for what I want to achieve, rather than a strict plan. Then at the start of each week I make a checklist of tasks that I want to get through and allocate the tasks to days. I tick each one off when it's done for that little bit of satisfaction.\n\nThe thing that took me the longest to learn was that it's not a \"fail\" to not stick to your plan perfectly. Things come up. Advisors want you to work on something different, or you have to work extra for your job, or you get really into doing something for your PhD that wasn't on your original plan. When that stuff happens, I open up my planner and add in what I worked on instead. I make a note to say that the tasks I originally planned are being moved to next week. It makes me feel a lot better to look at what I *did* do instead of dwelling on what I didn't, because that stuff still will get done if I keep it on my list. \n\nThe fact that you're nearly graduating means you've done great so far. Don't be too hard on yourself about keeping a strict plan. It works for some things, it doesn't for others. Maybe just try to work out what you want to get done in a week, and try to schedule some time off your PhD to do things you enjoy too. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_67kf49.json"}, "367": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1493180079, "Score": 1, "Body": "Asking the wrong questions from the very beginning (for example, nobody cares if you're feeding an arbitrary cell line with a large bolus of chemicals, if it doesn't happen in the body, nobody cares) and spend the next couple of years understanding the response (looks like a non-physiological stress response but PIs just won't listen, until your fears get confirmed at an international conference 4 years down the road). The publish-or-perish stress is forcing scientists to create problems and solve it, all for the sake of writing up a paper.", "Permalink": "https://www.reddit.com/by_id/t3_60dlee.json"}, "368": {"Subreddit": "PhD", "Author": "thinksomethingclever", "Date": 1493247226, "Score": 2, "Body": "The answer you are looking for is going to vary wildly between discipline, institute, and even lab. That being said, I would count on 55-60 hours a week. Some labs work less, but they are few and far between. A PhD can be intellectually stimulating, but research is often tedious and repetitive. Can I ask why you are interested in a PhD? What do you want to do with it? ", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "369": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1493256906, "Score": 2, "Body": "What field? ", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "370": {"Subreddit": "PhD", "Author": "LolaCampari", "Date": 1493257083, "Score": 3, "Body": "Agreeing with all of this. The time spent on your research will definitely depend on what field you are in. Wine science like myself for example might have a couple months in there with pretty intense hours (hello 6am to 8pm every day, bye bye weekends and sports training) during vintage / field work but at the moment I'm back to my 9 to 5 routine. ", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "371": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1493266365, "Score": 8, "Body": "You could just write the truth but framed as personal issues. You took too much one with research and work and didn't handle it and then you had a relationship breakdown and when you were dealing with that, everything you already had on became even more overwhelming.", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "372": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1493272585, "Score": 1, "Body": "Lol", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "373": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1493293583, "Score": 2, "Body": "I nearly started crying after reading 6am to 8pm, I'm currently in the 9-5/6 region with some days of staying late, (just a couple months into the phd) ", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "374": {"Subreddit": "PhD", "Author": "LolaCampari", "Date": 1493298556, "Score": 2, "Body": "Yeah... vintage is pretty full on though, not just in research but in the wine industry in general. You'll find your balance on it quick enough! ", "Permalink": "https://www.reddit.com/by_id/t3_67ra96.json"}, "375": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1493303733, "Score": 2, "Body": "Boo", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "376": {"Subreddit": "PhD", "Author": "mohataher", "Date": 1493303947, "Score": -3, "Body": "Well said. Ate you correct few grammatical errors, this article should be a masterpiece.", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "377": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1493304458, "Score": 2, "Body": "But can you count? ", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "378": {"Subreddit": "PhD", "Author": "SLGC", "Date": 1493307527, "Score": 1, "Body": "Ph.D.s can count to 7, at least. This guy's a phony!", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "379": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1493316013, "Score": 3, "Body": "&gt; Ate you correct few grammatical errors,\n\nHuh?", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "380": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1493317997, "Score": 3, "Body": "What is happening to this sub?!", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "381": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1493331914, "Score": 5, "Body": "Some schools (though not all) will look only at your last two years of GPA, or only at your GPA in 300/400 level courses, or some other combination.  If your GPA gets much better, you can focus on applying on schools where that will work to your advantage.\n\nHowever, GPA is usually just a minimum threshold which gets you considered; the main thing that you need is real, concrete, documented research experience.  You said you work for a physicist but don't \"get too involved\".  *Get involved*, or find another lab where you can and want to get involved.  Work in a lab part-time or in the summers for a year or two, get to know the grad students and professor, and try to get a publication (or even a conference presentation) with your name on it.  \n\nThe goal of this is threefold: one, you want to find out if you actually like research *before* you start a PhD.  Two, you need to show your future advisor that you understand what you're getting into and that you have the capacity to learn and develop new research-related skills; the easiest way to show this is to have already done it.  Third, you'll need strong reference letters to get in, and letters from someone who you worked for in a research capacity are more useful than letters from some random prof you took one course with.", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}, "382": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1493337126, "Score": 2, "Body": "The faculty is just trying to help you to manoeuvre through the often pointless bureaucracy of academia. Here's my advice: *Take their advice*.", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "383": {"Subreddit": "PhD", "Author": "cliffordbrown", "Date": 1493337705, "Score": 2, "Body": "So what happens when I tell them my grandma died and they ask for an obit? I don't want to set myself up to be burned later ", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "384": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1493340679, "Score": 2, "Body": "Did your grandma *actually* die? If not, for God's sake don't say that.\n\nJust frame the reason as some sort of serious personal issue and dramatise the situation. e.g. \"Your girlfriend left you,\" becomes, \"Your *fiancèe* left you.\"", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "385": {"Subreddit": "PhD", "Author": "cliffordbrown", "Date": 1493340984, "Score": 2, "Body": "Hell noo dude. My grandma is fine. My gf sucks though. I suppose that's what I'll do! thanks ", "Permalink": "https://www.reddit.com/by_id/t3_67t8pp.json"}, "386": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1493343418, "Score": 2, "Body": "**Good:**   \nTaking me around the world. Connections with experts. Working on cutting edge technological programmes.\n\n**Bad:**   \nTerrible anxiety, sleepless nights, long hours, frayed nerves.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "387": {"Subreddit": "PhD", "Author": "Caedus4182", "Date": 1493494384, "Score": 3, "Body": "I work as an advisor with high ability students applying to very competitive graduate programs. This is solid advice. As a follow-up, where are you at in your undergraduate program? (i.e. Are you a junior by credit hours? Are you finishing your the first or second semester of your junior year? Did you recently complete your sophomore year and are now a junior?) \n\nAs a follow-up, if you have the chance to stay in town over the summer and pick-up 10-20 hours a week in the lab, do it. The more research experience you pick up, the better it will be for your understanding of what a PhD program will be like and the experience will build your resume. Additionally, when you're in the lab, if you have a chance to earn a certification or training on software, machines, or procedures, take advantage of those offerings. Being able to list specific competencies can be attractive to labs if you apply to a SURF program in the future or when you're looking at graduate programs. ", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}, "388": {"Subreddit": "PhD", "Author": "Vortex271", "Date": 1493496276, "Score": 2, "Body": "Pro: Academic Success, Determination, overcoming challenges mental and physical \nCon: Anxiety, Physical ailments.", "Permalink": "https://www.reddit.com/by_id/t3_672rsz.json"}, "389": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1493504798, "Score": 1, "Body": "spam bots I assume", "Permalink": "https://www.reddit.com/by_id/t3_67tsie.json"}, "390": {"Subreddit": "PhD", "Author": "e2-718", "Date": 1493586097, "Score": 2, "Body": "I'm nearing the end of my second semester as a junior, so after this I only have senior year left. It makes me a little concerned that I might not be able to get enough real research in before I graduate. In which case I was considering going for a masters degree first, do you think that would help my odds?\n\nAdditionally I should have mentioned I'm considering going for a doctorate in mechanical engineering as opposed to my current major of environmental engineering. Do you think that would put me at a disadvantage?", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}, "391": {"Subreddit": "PhD", "Author": "Caedus4182", "Date": 1493595872, "Score": 3, "Body": "In your particular case, some research is better than no research. What you should be focusing on is making the most of the time you have left. It's also not about increasing your hours in the lab per say (though that would be helpful); you want to be gaining meaningful experience that can prepare you for a graduate program and also build your reputation as a great student in the lab; quality, supported by quantity, should be the focus. When you ask your professor for a letter of recommendation for your applications, that reputation will be important and may be the deciding factor makes a recruiter pull the trigger on your application. \n\nI do not know your extra curricular involvement, personal situation, financial circumstances, etc, so obviously if you have other things going on that require your attention like family, personal health, or financial duties, this is not a reason to disregard those. However, if you are serious about applying to a graduate program for fall 2018, that needs to become the priority over the next 18 months. Your focus should be GPA, lab experience / work, researching/applying to graduate programs (this includes taking the GRE or whatever test the programs you apply to require). Everything else is nice, but nothing will help your application more than focusing on those three core ideas. Do exceptional in your courses, get great experience in the lab, and do your diligence when selecting what programs to apply to.\n\nAs an aside, what do you want to do when you graduate from a doctorate program? Where do you see yourself? What's you're long term goal with going to get a PhD (or a Masters)? \n\nIf you know that you want to work in academia, then a PhD is a good option. However, if you plan to go into industry or the public sector, is a PhD necessary for the type of work you want to do? If you don't know or it's not necessary, you're adding a minimum of 4-5 years of schooling to obtain a degree that you don't necessarily need. If you have a good rapport with the physics professor you've been working with or other faculty members, have a converstation with them about your career path and what you need to be doing with the time you have left, especially if you're moving from environmental to mechanical. \n\nTo properly address the change to mechanical, what programs are you looking at? When you research the programs, speak with the graduate advisors and ask to speak with some of the faculty. You should be able to articulate academic and professional visions that detail why you want to add a mechanical engineering doctorate. You'll also want to see if the faculty have research interests that align with that vision. While you're having these conversations and researching graduate programs, look at sample advising plans to see what courses are being offered; most public universities will post syllabi which you can view to estimate whether or not you can complete the program.  ", "Permalink": "https://www.reddit.com/by_id/t3_67yniy.json"}}