{"0": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1472704987, "Score": 2, "Body": "What do you want to do? Right now you need to focus on your project, publish as much as you can, go to conferences, and make connections (specially for finding postdoc positions). If you want to go to industry after, just focus on publishing.", "Permalink": "https://www.reddit.com/by_id/t3_50k1cn.json"}, "1": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1472718554, "Score": 1, "Body": "Thank you for responding. I have a meeting next week so will do that. ", "Permalink": "https://www.reddit.com/by_id/t3_50gtd5.json"}, "2": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1472718984, "Score": 1, "Body": "Thank you scheduling digferent tasks is a great idea. I have been trying to schedule everything in blocks but breaking down the scheduling even further would really help me focus.", "Permalink": "https://www.reddit.com/by_id/t3_50gtd5.json"}, "3": {"Subreddit": "PhD", "Author": "hammerheadshark7", "Date": 1472722152, "Score": 1, "Body": "I know someone who received a phd in engineering and then got bored with it and changed to medicine and graduated from medical school.  A lot of us have idealistic views about what we will do in a phd program or after receiving it and then the real world hits us.  I work with ivy league phd researchers and it is as if they pursued a phd for $ and prestige rather than contributions to the world.  I am not impressed by them in the least bit.  It is as if they publish papers just to get something published rather than research and publish something influential and meaningful (my observations at least).  I feel that if you are not going to publish something influential with your phd, do something else.  what was the point of that phd?", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "4": {"Subreddit": "PhD", "Author": "ryanxmg", "Date": 1472746593, "Score": 1, "Body": "The best advice has already been given to you!\n\nAs someone who was offered a funded PhD position during the interview, I cannot stress how important it is to network. Employment decisions are more often than not based on safety, and the more you know someone, the safer they are as a choice.\n\nAlso, don't be disheartened if you don't get it (I've been here before, too, on a dream project). It is likely the PhD isn't right for you if it's a no. It'll feel soul-draining, but is a far better option than being accepted onto a project you aren't 100% capable of completing!\n\nDepending on the supervisor, or whether you're part of a Doctoral Training Program, they could be looking for a few different things. But the common advice for all seems to be\n\n1. Make sure you know why you are pursuing a PhD, and the specifics you'd like to get out of it. Is it for a career in academia, or for industry? Are you looking to get really good at teaching, programming, etc. Everyone likes someone who plans ahead in detail.\n2. Be honest. One of the most important skills you can have is to know your limitations. Always put a silver lining on any weakness you are asked about (e.g. I'm not great at teaching as I've had little experience of it and sometimes get nervous in front of large audiences, but I've done some presentations to boost my confidence over the past few years, and find the prospect of demonstrating in practical sessions exciting)\n3. Try and turn your interview into a conversation. Ask them about their research, about the parts you find most interesting.\n\nThose tips are helped me, so I hope they can at least be of a little use to yourself. Best of luck, prepare more than ever before, and you'll be fine :)", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "5": {"Subreddit": "PhD", "Author": "ryanxmg", "Date": 1472746775, "Score": 1, "Body": "Usually, when you procrastinate, it is out of boredom and when you aren't feeling 100%. Take the time out to do something you love, and you should find your energy levels rising again :) The beauty of a PhD is the flexibility!", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "6": {"Subreddit": "PhD", "Author": "Soggy_Biscuit_", "Date": 1472792361, "Score": 1, "Body": "Hey OP I am a masters student so can't give any of my own experience. I remembered reading an article about a majority of tenured track positions coming from a minority of schools a little while ago and [here it is](http://www.slate.com/articles/life/education/2015/02/university_hiring_if_you_didn_t_get_your_ph_d_at_an_elite_university_good.html) \n\nIt's a Slate article so... You know. ", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "7": {"Subreddit": "PhD", "Author": "zooks1", "Date": 1472794162, "Score": 3, "Body": "I did this with delta too both domestic and intercontinental, no problems at all, always see heaps of people do this too. They specifically told me not to check it in as those kinda tubes easily get lost. Try to be on board early so you can drop the tube in the overhead bin, it's easier when there's no bags.", "Permalink": "https://www.reddit.com/by_id/t3_50rl2k.json"}, "8": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1472805396, "Score": 2, "Body": "Yep, totally fine. and defo carry on incase it gets lost or something checking it!", "Permalink": "https://www.reddit.com/by_id/t3_50rl2k.json"}, "9": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1472807154, "Score": 4, "Body": "&gt;like my work/topic is not all that popular/exciting\n\nThe PhD can feel like a marathon that goes on for way too long, and if you are in the USA, I wouldn't expect to finish it in 3 years. In my STEM department, it takes ~5.5 years on average. The above quote of yours I see as particularly problematic. In order to carry a PhD to completion (and to be successful along the way via publications, conference proceedings, etc.) you really need to love or be interested in what you do - to the extent that you are willing to sacrifice a lot for it. But here you describe it as something that is not all that exciting. Is there a way you can transition into something you are more interested in; something that is more exciting? It's rather hard to push yourself day after day for several years for something you aren't really excited about, nor would I (and probably several others) encourage you to do so.", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "10": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1472808715, "Score": 5, "Body": "Honestly man, I've been where you are with the flagging commitment levels. It's important to realise why you want this, and that it is interesting enough to push on for. \n\nYou're clearly hard-working, but you need something to apply that drive to - I just feel like you need to want this, even in the crappy times like these. \n\nRegardless of what you do, know that you are a capable researcher - you didn't get here because you coasted along, or slacked off! Don't believe the lies your mind sometimes tells you!", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "11": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1472809055, "Score": 3, "Body": "Thanks for the reply. \n\nI think I worded that bit wrong. I am excited about my topic... I meant more in general sense. I've noticed that certain topics are exciting/sellable to the general public /broader audience and get attention. Mine is not. I feel that as interesting as it is to me, it's too obscure and not directly translatable, which makes me fear it wont attract more funding.", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "12": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1472809654, "Score": 3, "Body": "I hear you. I wouldn't worry about funding too much, unless it's something that arguably isn't needed or useful to mankind. I mean, look at how much went in to building the LHC, and does the general public know anything about why those experiments are performed or what those billions of dollars will result in? \n\nBut the sort of thing you are describing applies to almost all subjects and can be as simple as a personal dissatisfaction with the exposure of other people to your topic. For instance, when I go visit family on the holidays, no one really seems to care about or understand what I do. I'll try to dumb it down or make it interesting and they just space out anyways. Instead, I get to listen to all of the nurses share stories about their patients, and I never get to talk about my work that I essentially spend all my time doing. In that way, I feel disconnected with people over time and possibly even jaded about it. I've heard a lot of PhD individuals describe this issue, and I think that it's important for you to manage/modify your expectations along the way. Develop reasons to feel confident about your education/progress that don't involve/rely on others, and can't be destabilized easily, and just make them your foundation for what you do.", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "13": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1472809771, "Score": 2, "Body": "&gt;Don't believe the lies your mind sometimes tells you\n\nThis! \n\n&gt;I've been where you are\n\nDoes it ever get better?", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "14": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1472810157, "Score": 1, "Body": "Ahh. This is very much the story of my life! I think you're absolutely right, I need to learn to manage my own expectations and not be too affected by how others see my work. Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "15": {"Subreddit": "PhD", "Author": "Srapher", "Date": 1472812651, "Score": 2, "Body": "Never had any issues on multiple airlines. Definitely don't put it in the hold.", "Permalink": "https://www.reddit.com/by_id/t3_50rl2k.json"}, "16": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1472815921, "Score": 2, "Body": "Of course it has my friend, and if anything it's made my life better for it. I think you're in for a season after this, where your joy feels way better because of your current slump. Just coming out of my own slump myself so I'm speaking from experience! ", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "17": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1472820343, "Score": 4, "Body": "edit: just reread the title of the link, I'm an idiot\n\nAfter an intensive bout with my advisor, I felt the need of sharing this. Preface: \n\n*One of the most frequent laments of the postgraduate researcher is: ‘Why didn’t someone tell me that earlier?’ There are innumerable things which nobody bothered to tell you, or to write in the books, and which could have saved you from large amounts of confusion, depression, wasted effort and general tears and misery if only you had been told them earlier.\nThe authors have spent more than their fair share of time with desperate beginners, explaining the basic principles of research over cups of coffee.\nThis book is an attempt to cut down their caffeine overload. It explains the basic craft skills and ground rules of the academic world in general, and research in particular. Its focus is the vitally important things that the standard textbooks don’t bother to mention on the sweet assumption that they can be left to the readers’ lecturers and supervisors. \nIf you are doing a PhD or an MPhil then this book is intended to help you to do the best research possible with the minimum of wasted effort. It is also intended to help you use your research as part of your career development and self-development so that you don’t end up on graduation day, certificate in hand, wondering just what the hell to do next and realizing that you’ve just\nspent several years moving painfully in the wrong direction.\nThe authors’ backgrounds are varied. Their academic credentials include PhDs, publication of various journal papers and encyclopaedia articles, advanced research fellowships, a couple of journal editorships, refereeing for major journals and fund-giving bodies, and raising between them over a million pounds of research funding. Their students still talk to them, and\nsometimes say nice things about them.*", "Permalink": "https://www.reddit.com/by_id/t3_50t0uo.json"}, "18": {"Subreddit": "PhD", "Author": "schmoobacca", "Date": 1472827858, "Score": 1, "Body": "I dropped out because the university I thought was decent enough turned out to be terrible and completely unorganized. So if the lower ranking university is organized and the department can help you through the process, maybe it doesn't matter. Finishing is half the battle. \n\nAlso, I don't think ranking matters so much if you network a lot. If your advisor or the department doesn't have a good network then that's another red flag. ", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "19": {"Subreddit": "PhD", "Author": "schmoobacca", "Date": 1472828193, "Score": 1, "Body": "I came into a PhD in the same position as you. No background education on the fundamentals, but was reassured repeatedly that they would train me.\n\nHowever, (and I think you know this) a PhD program is a lot about self-learning. Start trying to learn the fundamentals now. Ask questions to your advisor (whom I assume you're meeting with?) to clarify things you don't get, and see how they respond. \n\nYes, it is sometimes good for both advisor and the student to have someone come in with a different set of skills and education, BUT discuss that at length with your advisor. Are they ACTUALLY going to utilize your previous skills and education? Or are they expecting you to forget all that and focus on what their research is, where you have no background in? Will they encourage you to take an undergraduate class and thus waste a huge amount of your time?\n\nThis very similar situation did not at all work out for me and I ended up dropping out. I moved to another state for this and found I was going to get no support and my advisor was not actually at all interested in allowing me to pursue the research interests I had and instead wanted me to focus on his projects, where I had no background knowledge. So basically I was going to waste ~3 years of my life doing his work.\n\nAsk a lot of questions. Talk to the other graduate students. This is so much more important than the questions you're asking right now. Make sure they are upfront with you. Ask them for email addresses and email them after you leave to see if they feel more comfortable being candid in emails instead. ", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "20": {"Subreddit": "PhD", "Author": "schmoobacca", "Date": 1472828264, "Score": 1, "Body": "Talk to the administrator. If you're a PhD student they'll fit you in. Talk to your advisor and see what they recommend. ", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}, "21": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1472828704, "Score": 1, "Body": "What many doc students don't want to hear is: unless you have considerable cache attached to your cv via your supervisor and university, it's damn tough to get considered for TT positions. There's a reason why a disproportionate amount of new hires come from a smallish amount of schools. \n\nThe status of your university and reputation of your supervisor absolutely matter. ", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "22": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1472834346, "Score": 1, "Body": "You only place at or lower tier. It is known.", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "23": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1472845325, "Score": 1, "Body": "I was thinking about buying this on Amazon, thanks for the free copy!", "Permalink": "https://www.reddit.com/by_id/t3_50t0uo.json"}, "24": {"Subreddit": "PhD", "Author": "Gantzz25", "Date": 1472857749, "Score": 1, "Body": "Thank you for sharing. ", "Permalink": "https://www.reddit.com/by_id/t3_50t0uo.json"}, "25": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1472892032, "Score": 1, "Body": "Thank you, downloaded. I'm sure I'll get a lot of mileage out of this one. ", "Permalink": "https://www.reddit.com/by_id/t3_50t0uo.json"}, "26": {"Subreddit": "PhD", "Author": "bellcrank", "Date": 1472906953, "Score": 2, "Body": "Never had anyone tell me I can't take it on the plane, but it's about 1000% easier to just mail the poster to your hotel.", "Permalink": "https://www.reddit.com/by_id/t3_50rl2k.json"}, "27": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1472933567, "Score": 1, "Body": "Nope, I'll be starting a condensed matter physics PhD, where i'll be using xrd and neutron diffraction heavily. I have had no hands on experience with either, however I did submit a crystal sample for xrd analysis. During the interview I explained how my masters went, the pitfall i had and how i learned from them. I demonstrated how despite my lack of exact experience in the field, I was a good researcher and capable of learning the techniques, and that I had a solid background to build on. I came from an solution based synthetic inorganic chemist background, and the people I was up against were a physicist and a materials science graduate but I'm enthusiastic and we got on well. Basically what I'm saying is, it's not all about grades/exact experience at all.", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "28": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1472933711, "Score": 1, "Body": "Get a vape, seriously. I haven't smoked since. A quality one (not one of those pen style ones) are as satisfying as a cigarette and tastier too, healthier and it'll give you that nicotine fix. Then once you've made the transition it'll be a lot easier to ween yourself off. Then one day you'll try a cigarette again and it'll be horrible", "Permalink": "https://www.reddit.com/by_id/t3_4zorzt.json"}, "29": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1472933818, "Score": 1, "Body": "How the hell are you meant to do a review of 100's of pieces of literature if it takes you 2 hours to read 1 paper?! For my masters I read maybe 5 times the papers I actually cited in the final print", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "30": {"Subreddit": "PhD", "Author": "RussianWhizKid", "Date": 1472951396, "Score": -4, "Body": "I wouldn't say Nature is prestigious, at every research meeting or group meeting I attend, it's always bashed upon horrendously ", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "31": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1472962205, "Score": 10, "Body": "I think a lot of that is just bitterness. Regardless of people's issues with what they publish or their process, they are a top journal in terms of impact factor and a good proportion of scientists read every issue.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "32": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1472966093, "Score": 6, "Body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.0958 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/05726)", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "33": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1472975169, "Score": 1, "Body": "Well for me the project was about magnetism, which I had done as part of my masters, although two completely different aspects. I did a lot of prep and went back over all the stuff I thought would be important, but in the end he didn't ask me anything probing. We had a long chat and from that I think he was able to gauge my expertise on the subject. I guess every interview will be different but to me it felt like he wanted to know more about pure knowledge of the narrow subject. I mean I'll be working with him for the next few years so we need to get along, so personality is a big part too", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "34": {"Subreddit": "PhD", "Author": "everythingfeelsblack", "Date": 1472989227, "Score": 1, "Body": "Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "35": {"Subreddit": "PhD", "Author": "Gondwanalandia", "Date": 1472993583, "Score": 1, "Body": "3 years in Australia", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "36": {"Subreddit": "PhD", "Author": "watchmakerfromfuture", "Date": 1472995843, "Score": 1, "Body": "I am from US and it took me 6 years. Average duration is around 5, but I have seen of my friends do it in 10 years. But 12 years is a lot.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "37": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1472999101, "Score": 1, "Body": "My PhD program had a 10 year cap limit on it.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "38": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472999304, "Score": 2, "Body": "Per my advisors, reviews are considered less as true publications and more as service work for the field. They definitely don't hurt, but just one traditional paper will have more of an impact in terms of tenure/the job market than several reviews. This is basically just advice about where you should be allocating your energies.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "39": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1473001215, "Score": 1, "Body": "Queen guitar player [Brian May](https://en.m.wikipedia.org/wiki/Brian_May) took 37 to finish his..\n\nWhile 12 years is long, it is not really shocking either. I don't suppose your partner intends to become a professor or to pursue an academic career? ", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "40": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1473006781, "Score": 0, "Body": "I'm about to be done and it took me about 2 years (nursing)", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "41": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1473016095, "Score": 2, "Body": "Generally review papers in those journals are written by prominent researchers, who probably have already published articles or letters in the journal already.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "42": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473025075, "Score": 2, "Body": "If this is true, it'll be the first time I've ever heard of someone finishing a PhD in 2 years.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "43": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1473031956, "Score": 1, "Body": "I did a Bachelor's to PhD program. 2 years for pre-reqs, 2 years to do my PhD courses during which time I wrote my General exam and prepped my dissertation proposal. I started data collecting in January of 2015 and I'm getting ready to defend in the next couple of weeks.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "44": {"Subreddit": "PhD", "Author": "urmomsredditaccount", "Date": 1473044278, "Score": 1, "Body": "I'm only 1.5 weeks asking the same question..", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "45": {"Subreddit": "PhD", "Author": "mowertier", "Date": 1473076821, "Score": 6, "Body": "A master's would be a really good opportunity to make your low undergrad GPA less of a concern to admissions committees.", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "46": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1473078119, "Score": 2, "Body": "Master's.  If you like it, your 30 credits or whatever can be applied to your PhD later.  ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "47": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1473079275, "Score": 2, "Body": "What field?", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "48": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473080918, "Score": 1, "Body": "Biological sciences! (Biochemistry/genetics)", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "49": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473080974, "Score": 3, "Body": "I'm starting to think a Master's is a good idea, thanks!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "50": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473081171, "Score": 1, "Body": "I did not know this was an option! Is it only certain types of Masters that can do this, like M.Phil?", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "51": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1473082294, "Score": 2, "Body": "That's my field too. It may be difficult to get into a PhD program with 2.1 GPA. At my school, they had a fast track year long masters program which students used to increase their GPA to get into MD and PhD programs. Try to find that program if you can't get into a PhD program. Nowadays people bypass Masters and go straight to PhD. Don't give up hope!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "52": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473083781, "Score": 1, "Body": "I'm so sorry, 2.1 by the UK grading system, not GPA, it's a second class uppers... Sorry for the confusion!!! I should have clarified  \n  \nPeople do go straight to PhD so I was hoping I could too, would rather not do a masters or other preparatory programs as that's a lot of money to pay, but it seems like I'll have to  \n  \nThank you for your help! Good luck with your research", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "53": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1473084594, "Score": 2, "Body": "I'm sorry for the confusion! In that case to straight to PhD. That's what I did BA -&gt; PhD. Good luck to you too!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "54": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473085464, "Score": 1, "Body": "Hahaha thank you!!!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "55": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1473086692, "Score": 2, "Body": "Almost no one here understands what you're saying... A 2.1 is fine - if you can get funding, I'd say to go for it! What's the point in spending when you could be earning? ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "56": {"Subreddit": "PhD", "Author": "LocusID", "Date": 1473087146, "Score": 3, "Body": "I am not sure how it works outside of Europe, but in your MSc you can get a lot of practical (lab) experience, that is especially useful for a PhD. A theoretical background is of course important, but working independently for several months on a project mimics a PhD better than following a course with lectures and practicals... ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "57": {"Subreddit": "PhD", "Author": "Bromeostasiss", "Date": 1473087214, "Score": 1, "Body": "The Asus Zenpand S 8.0 is a very nice 8\" Android tablet that is fast, has a high resolution, decent battery life (if you refrain from gaming and watching movies) and is reasonably priced at €230. It was the best price/quality tablet I could find in this price range.\n\nI gifted the zenpad after extensive research to my girlfriend who is a medical intern and she couldn't be happier with it.\n\nGood luck with finding the right tablet for you!", "Permalink": "https://www.reddit.com/by_id/t3_4tqv4x.json"}, "58": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473091673, "Score": 2, "Body": "Eheheh that was completely my fault!  \nThanks for your comment! I think I'll apply for both...", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "59": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473091740, "Score": 1, "Body": "Gotcha! Thanks for your comment, gives me some insight into this postgrad stuff", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "60": {"Subreddit": "PhD", "Author": "Simsimius", "Date": 1473098249, "Score": 2, "Body": "Do an MSc.\n\nIf possible do an MRes.\n\nMost people I know did a Master's before their Phd (I did) - it helps that many masters have a large research segment that let you get a taste of what a phd is like, without the commitment (and make it easier for you to actually get a funded phd). It's uncommon for people to get a funded phd straight from an undergrad, but not impossible. With your \"CV\" I would say it will be a bit more difficult - a first would make it a lot more likely. There are so many 2.1s that there is absolutely nothing to distinguish you over others to get to the interview stage.\nHowever, no harm in trying both.", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "61": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1473104034, "Score": 2, "Body": "As far as I'm aware we don't have a similar option like that here in the UK. PhD programmes that have an M.Phil exit point might be a good option as you suggest. \n\nI'll be starting my own Masters this month with the intention of moving on to a PhD but it's certainly not out of the norm to go straight from undergrad -&gt; doctorate. With SLC now offering loans of Masters it certainly wouldn't be the *worst* choice to be safe and do one but why not apply for both masters and doctorate if you're not sure?", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "62": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1473104469, "Score": 2, "Body": "No idea, but I went this route in engineering in the United States.  ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "63": {"Subreddit": "PhD", "Author": "codphd", "Date": 1473104956, "Score": 2, "Body": "Fellow UK student here so I understand you! My route was BA (2:1) -&gt; MA (Distinction) -&gt; PhD but mainly because a PhD wasn't really on my horizons seriously until I was a few months in to my Masters. My supervisor has stayed with me all the way through from 3rd year undergrad to PhD starting in October and he uttered the idea back during my BA but I took no notice. I think Bachelors straight to PhD, from my experience and what I have read, is a more 'American' way of doing it. My advice is to apply for Masters programmes, get some research experience and really think about what you;d want to study for a PhD. Good luck with whatever you decide!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "64": {"Subreddit": "PhD", "Author": "liss_jackson", "Date": 1473105881, "Score": 2, "Body": "Graduate with a 1:1 in Biomed from a Poly here - I did a MRes and every PhD I applied for I got an interview. My peers who went straight to PhD were lucky to get one interview....", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "65": {"Subreddit": "PhD", "Author": "RedPotato", "Date": 1473109345, "Score": 1, "Body": "Typically for AH, its one of the classic art history languages (German/French/Italian) plus the language that your research would be in depending on your specialty.  Do you know what you would be focusing on?  ", "Permalink": "https://www.reddit.com/by_id/t3_514kn9.json"}, "66": {"Subreddit": "PhD", "Author": "rollawaythestone", "Date": 1473113087, "Score": 3, "Body": "Yeah, no doubt its one of the best journals out there. I do think there is some legitimate criticism of those top-tier journals. They can encourage chasing prestige instead of doing good, well-reported and thorough science. It's a real travesty how short and under reported some of these papers are in top journals.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "67": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1473119714, "Score": 2, "Body": "There's always a way! I went straight from a 2.1 undergrad to a PhD at UCL in neuroscience but I did have a few extra months lab work on top of my undergrad project. I suggest you apply for both, it can't hurt and unless you apply for an Oxbridge PhD it doesn't cost anything except time preparing. ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "68": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1473150991, "Score": 2, "Body": "Not in the UK. ", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "69": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1473151251, "Score": 2, "Body": "People do, but it's very rare and they usually have extra stuff in their CV (e.g. extensive lab experience). I know someone who offered a PhD position in genetics last year. 12 people applied (and he was surprised that number was so low) and 10 of them had masters. He chose a candidate with a masters.", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "70": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1473163772, "Score": 10, "Body": "The reason you're encouraged to make friends is that it's far harder to do so now than during your undergraduate studies. Unless you're an active member of a society there are few opportunities to socialise with new people. \n\nThis is true of the real world too, but workplaces tend to have a broader range of people to befriend. Just having friends who have fluid interests will wear thin fairly quickly. And PhD's can be lonely without a good group of friends.\n\nUltimately, you should do what makes you happy. If you're not a very social person then you should socialise to the extent that you are comfortable with. Yes, friendships within your field of study breeds ideas and opportunities but you shouldn't be at any major disadvantage not mingling with this group.\n\nThat said, PhD's are far more lonely than working in industry. It's important to do a sanity check every now and then to make sure your mental health is OK. Friends are good because they either prevent deterioration, or notice that you're not doing so well.\n\nAll the best with your studies! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "71": {"Subreddit": "PhD", "Author": "nxor", "Date": 1473163981, "Score": 3, "Body": "Thank you for answering, I think I understand why they shower students with social events when you compare it to industry.", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "72": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473165924, "Score": 1, "Body": "Ahh thank you! That sounds great, staying with the same supervisor the whole way through!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "73": {"Subreddit": "PhD", "Author": "kalzodomo", "Date": 1473165966, "Score": 2, "Body": "Gotcha, this i think is the right approach, thanks!", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "74": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1473166537, "Score": 3, "Body": "I'm doing my PhD in an office of Computer Scientists. We've got a good group of friends here, but too often we find ourselves talking about work even during social time. \n\nThe best advice I can give you for your PhD is have fun!\nPeople complain saying it's hard or that it's stressful. And it can be those things at times. But make the most of the freedom it gives you, and the opportunities that it brings! ", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "75": {"Subreddit": "PhD", "Author": "codphd", "Date": 1473172364, "Score": 2, "Body": "We get on like a house on fire and his research expertise matches up almost perfectly with my PhD focus so it seems like it meant to be! A lot of the PhD horror stories I read seems to be a lot to do with shitty supervision, so I'm hoping my experience will be a lot better than most. EDIT: Spelling", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "76": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1473187792, "Score": 1, "Body": "5 years at my school, current record is 9.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "77": {"Subreddit": "PhD", "Author": "GraduatePigeon", "Date": 1473194995, "Score": 2, "Body": "I posted something related the other day and I got some interesting advice. I didn't mention it it my post, but I am sort of in the same boat as you with regard to being pretty averse to social situations.\nI don't really have any advise for you, but you have my sympathy and thanks for asking about other people's experiences. I'll be watching the comments :) \n\nAnyway, here is my post in case you are interested: \n\nhttps://www.reddit.com/r/GradSchool/comments/50dqpn/i_dont_have_a_research_group_what_do_i_do/", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "78": {"Subreddit": "PhD", "Author": "nxor", "Date": 1473199012, "Score": 1, "Body": "Thanks, I look forward to reading it! Good luck", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "79": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473210397, "Score": 1, "Body": "Sign me up lol. Since you are posting this in r/PhD - most PhD programs here are typically funded, so you get a living stipend. Id\\t depends on the area. What would you want your PhD in?", "Permalink": "https://www.reddit.com/by_id/t3_51ehwr.json"}, "80": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1473227640, "Score": 3, "Body": "This is not an answer for how to make it better, but I've realised recently that it's made me a much better student. I think I am regarded as a much better student than I am because I'm terrified of someone realised I'm a bad student so I put a lot of time into \"faking\" being a good student. Doing those things though has actually resulted in me being a very successful phd candidate. I think it's it's really getting you down, like making you think you want to quit, then you need to speak to a professional about it.", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "81": {"Subreddit": "PhD", "Author": "Reggicide", "Date": 1473244369, "Score": 2, "Body": "I don't know if I handle it very well at all. 2nd year PhD but I've given quite a few talks already. I still get super nervous before giving the talks, but then I think about my audience, just like when I do with my outreach. If I'm talking to a broad audience (like the bigger broader conferences), I feel a little better, because I'm certain I know something that others don't and I can teach someone something.\n\nNow with smaller more specialised audiences I start to feel even more nervous, but I don't try to fake anything. I've noticed some differences between Australia (when I'm studying) and America. I feel like in the US the Imposter Syndrome is much stronger because everyone is talking themselves up. In Australia, I feel like it's okay to admit you don't know something, especially if you're a student. I mean, you should always be trying to better yourself, but when I talk in Australia academics are usually very positive towards students.", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "82": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1473250729, "Score": 1, "Body": "Form appears to be broken.", "Permalink": "https://www.reddit.com/by_id/t3_51fs20.json"}, "83": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473278602, "Score": 3, "Body": "Hello Dear Bachelor. Why would you want to pursue a PhD in English? Are you independently rich? You can certainly do it with family.", "Permalink": "https://www.reddit.com/by_id/t3_51mhq7.json"}, "84": {"Subreddit": "PhD", "Author": "thqrun", "Date": 1473311745, "Score": 1, "Body": "Depends on field and what you want to do. I will probably never be faculty but my future in industry looks promising.", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "85": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1473355666, "Score": 2, "Body": "Yeah well that's why we fought a revolution.", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "86": {"Subreddit": "PhD", "Author": "codphd", "Date": 1473359681, "Score": 0, "Body": "To start with; I'm glad you're feeling better!\n\nTo answer your question, I wouldn't include the pharmaceutical company in your acknowledgements. However ridiculous it is, there can be a stigma attached to mental illness and you don't want this associated with your thesis. ", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "87": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1473371333, "Score": 5, "Body": "Pretty sure it was a joke...", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "88": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473380605, "Score": 1, "Body": "There are whole communities out there who supplement a lot. promethazine is not even related to \"brain\" drugs.", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "89": {"Subreddit": "PhD", "Author": "ai-chan00", "Date": 1473386851, "Score": 1, "Body": "I was just going to say, I thought it was a cough medicine. ", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "90": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1473400270, "Score": 2, "Body": "\nYeah I wasn't serious about it, but I am very thankful though. ", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "91": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1473400467, "Score": 1, "Body": "I know it's not a \"brain drug\". And I'm glad for that. I don't want to take anything narcotic or anything addictive. It's a antihistamine, but it works to lessen anxiety symptoms as a \"side effect\".", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "92": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1473400499, "Score": 1, "Body": "It's an allergy medicine, antihistamine", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "93": {"Subreddit": "PhD", "Author": "codphd", "Date": 1473409212, "Score": 2, "Body": "Joke is on me! In all seriousness though the stigma about mental illness is silly... ", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "94": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473447471, "Score": 2, "Body": "It matters a lot more than most people are willing to admit, especially for people that want to go into academia. There's been some statistics showing that a very disproportionate amount of tenure track positions are filled by PhD holders graduating from elite universities.\n\nEdit: here is a relevant article:\n\nhttp://www.sciencemag.org/careers/2016/03/how-prestige-shapes-professoriate", "Permalink": "https://www.reddit.com/by_id/t3_51yvdb.json"}, "95": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1473448408, "Score": 2, "Body": "What do you pay? ", "Permalink": "https://www.reddit.com/by_id/t3_51yz0c.json"}, "96": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473456329, "Score": -6, "Body": "learn how to fucking spell first.", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "97": {"Subreddit": "PhD", "Author": "obsidian421", "Date": 1473456789, "Score": 1, "Body": "No paymemt. Sorry. ", "Permalink": "https://www.reddit.com/by_id/t3_51yz0c.json"}, "98": {"Subreddit": "PhD", "Author": "obsidian421", "Date": 1473460918, "Score": 2, "Body": "What did I spell wrong? Please enlighten me. ", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "99": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1473472608, "Score": 1, "Body": "How do you intend to conduct said interview? Here?", "Permalink": "https://www.reddit.com/by_id/t3_51yz0c.json"}, "100": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1473472754, "Score": 1, "Body": "Replied to your other post not realizing you were specifically after those in the psych field. Sorry I don't fit your requirement, but good luck!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "101": {"Subreddit": "PhD", "Author": "vermalrat", "Date": 1473472920, "Score": 1, "Body": "Ha! Wish I started asking that early! Without sounding too pessimistic, welcome and get used to it :p", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "102": {"Subreddit": "PhD", "Author": "floriade99", "Date": 1473489308, "Score": 2, "Body": "Personally, I am finding it difficult to balance a PhD with my life. I am on a scholarship so i don't have to work, and i don't have children. I am passionate about what i study, but the constant stress takes away from day-to-day pleasures. It is demanding and time-consuming and I can not imagine trying to fit children in around it. While it is tough, i know i'll be glad i have done it as like you, i also want to teach and lecture at university. ", "Permalink": "https://www.reddit.com/by_id/t3_51mhq7.json"}, "103": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1473495831, "Score": 1, "Body": "Aside professional collaboration, the experience of a PhD is challenging for other reasons that can be mitigated by having a strong peer group. My cohort and I research very different subjects, but sharing our work to proofread prior to submission for publication, or exchanging tips on certain conferences, etc., was all very worthwhile. \n\nUltimately your professional development requires at least a little collaborative spirit, especially if you want to remain in academia. ", "Permalink": "https://www.reddit.com/by_id/t3_51ejtm.json"}, "104": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1473495939, "Score": 1, "Body": "I'd say the ratio of CV value for a review to article is 1:10.  A full article publication in a high-impact journal is worth 10 reviews, in my field.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "105": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1473496023, "Score": 1, "Body": "On this subject, remember that the job market is more competitive than the PhD programs. If you can't get into a strong program, it will be harder to get a job anyway. ", "Permalink": "https://www.reddit.com/by_id/t3_50rdfq.json"}, "106": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1473496097, "Score": 1, "Body": "Publishing in high impact journals and collaborative publishing to balance workload. You might look up the CVs of professionals whose careers you admire and see what they did near the date of their graduation.", "Permalink": "https://www.reddit.com/by_id/t3_50k1cn.json"}, "107": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1473499705, "Score": 1, "Body": "\"An assignment\" is a bit vauge. I'm a psych phd student and would be happy to help if you pm me but only with a bit more information. Where is this going? Is this a school assignment or work or what? ", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "108": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1473499847, "Score": 2, "Body": "Secondly should note most psych phds wont be treating disorders, those are dclins/ psychiatrists dependings where you are", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "109": {"Subreddit": "PhD", "Author": "realitychecker27", "Date": 1473501361, "Score": 1, "Body": "Having a supervisor who is entirely un-engaged and lacking in confidence in me, I would tbh just be pleased they had enough interest/faith in my research to want to present it. But I can see how it would feel like intellectual theft; sounds like a tricky one but I would just try and see the positives (that they see enough merit in your work to not only back it, but fully put their own reputation behind it)", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "110": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1473504661, "Score": 1, "Body": "I'm in Australia and have done undergrad, my honours and now phd at the same uni. I was advised to head overseas for my first post doc and then it'd be fine. Don't see what that would be different for Italy.", "Permalink": "https://www.reddit.com/by_id/t3_522jrk.json"}, "111": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1473504925, "Score": 3, "Body": "My only useful thoughts are on the networking. I would make an effort to get to the events and get to know other researchers in your department (not just your group). Networking is actually a huge part of your academic ability as very few projects require only one expertise and will need to be collaborated on. Collaborations get funding so your connections are a big part of getting a post doc later. Both because you'll know people and because the person hiring you wants you to have connections that they don't.", "Permalink": "https://www.reddit.com/by_id/t3_522gh5.json"}, "112": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1473505198, "Score": 2, "Body": "I feel for you. if I was in your case, I would sit down and try to come up with an analytic plan of all the things that need to be accomplished (learn subjects, talk with professors, literature review, data analysis) along with a timeline of when they will need to be done and try to accomplish my day-to-day goals for those milestones. Break down the big projects into tiny and manageable parts.", "Permalink": "https://www.reddit.com/by_id/t3_522gh5.json"}, "113": {"Subreddit": "PhD", "Author": "chrisgseaton", "Date": 1473506713, "Score": 3, "Body": "A colleague of mine did his PhD in 2 years. He had great results and several very good papers already so why not get on and graduate?", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "114": {"Subreddit": "PhD", "Author": "obsidian421", "Date": 1473514666, "Score": 1, "Body": "I can do it here, through email, or FB messenger. Thanks so much.", "Permalink": "https://www.reddit.com/by_id/t3_51yz0c.json"}, "115": {"Subreddit": "PhD", "Author": "obsidian421", "Date": 1473515268, "Score": 1, "Body": "Thanks. ", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "116": {"Subreddit": "PhD", "Author": "obsidian421", "Date": 1473515657, "Score": 1, "Body": "I'm new to Reddit and haven't quite figured out everything on this app yet. This assignment is for my Elements of Clinical Psychology course. It requires me to interview one non licensed individual working toward their PhD/PsyD and one licensed PhD/PsyD. I have completed the first interview and am trying to finish the second interview. I have called around the local places in my area, but everyone is too busy to help. My friend suggested that I try here. The interview can be conducted here, through email, or messenger. I have already posted then questions in the initial thread. Any help would be greatly appreciated. Thanks so much.", "Permalink": "https://www.reddit.com/by_id/t3_51z3bj.json"}, "117": {"Subreddit": "PhD", "Author": "FieldMarshalSaltykov", "Date": 1473526551, "Score": 1, "Body": "Agree. Networking is unfortunately a requirement in many fields. Unless youre a genius you will simply have to network to get a job. \n\n\nSorry about this. I'm also not good at it. If it's any consolation I work in an office not related to my PhD and networking is also required here. We all have to do it.", "Permalink": "https://www.reddit.com/by_id/t3_522gh5.json"}, "118": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1473534593, "Score": 1, "Body": "I don't know how my scholarship will support me, let alone a wife/gf and child", "Permalink": "https://www.reddit.com/by_id/t3_51mhq7.json"}, "119": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1473557244, "Score": 2, "Body": "It depends on what you want to study. If you are in the humanities, yes, you will most likely have to pay for yourself. If you are in STEM, universities will fund your phd. ", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "120": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473557940, "Score": 2, "Body": "Most PhDs are funded. It's more challenging humanities...", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "121": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1473570142, "Score": -3, "Body": "Yaaay! Another useless humanities PhD trying to make its way.\n\nPlease be productive and get a job instead.", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "122": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473574089, "Score": 1, "Body": "If I was looking at a resume with 3 original first author articles and another with 2 original first authors and a review, and all else was the same, I'd hire the former.", "Permalink": "https://www.reddit.com/by_id/t3_511f2x.json"}, "123": {"Subreddit": "PhD", "Author": "paleochiro", "Date": 1473615233, "Score": 3, "Body": "Jesus man, you went dark!", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "124": {"Subreddit": "PhD", "Author": "UltraRamen", "Date": 1473618968, "Score": 1, "Body": "On unpaid leave from my employer (government) to accompany my wife here who is on scholarship from my government. Since I am already here,just trying to hit two birds with one stone, you know, trying to snag a US PhD rather than chillin doing nothing.......yeah, my degree is useless here in the US, I don't work here....but I don't tap into your social security system, my groceries are paid with money given by my government. Menial jobs here are better set aside for your citizens who are really in need e.g. grads who are struggling to settle their student loans. My grudge is the universities here just can't see how I can be their potential cash cow. I had asked whether they could give me a conditional admission, and I will use the conditional admission to find sponsors from my country, maybe even my employer....but nope...they don't do that kind of thing....", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "125": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473619428, "Score": 1, "Body": "This is not required at all schools...many schools accept international students without this. It is university dependent. I would find some international students at the school you'd like to attend and find out what they did to get accepted. \n\nAlmost every uni has a \"Office of International Students\" or it could also be called \"Office of International Affairs,\" etc. You should go into the uni you'd like to attend and talk to those people. It is the job of people at these offices ot help international students. ", "Permalink": "https://www.reddit.com/by_id/t3_525zr4.json"}, "126": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1473629290, "Score": 2, "Body": "Get back to me in a year, I think I'm in the process of birthing a wicked case of RSI or carpal tunnel", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "127": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1473632445, "Score": 2, "Body": "Not good!  Have you had it looked at?  Is it in your wrist/fingers, or up in your shoulders?  I was in the middle of developing finger and thumb numbness in my hands, but the source of the problem was actually my shoulder muscles seizing up for days at a time, and causing a horrible chain reaction of muscle tension up my neck, down my upper back and into my arms.\n\nDo you think you know the physical cause of what you're dealing with (typing, pipetting, etc?)  If you can halt the progression early, it's worth it, in my experience.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "128": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1473634213, "Score": 1, "Body": "I haven't had it looked at, I'm still in the \"hope it goes away by itself\" stage. Mostly the pain is in my wrist and at the bottom of my thumb, especially on my right hand. I blame my inefficient typing style, too much mouse usage, and most of all (I think) operating my smartphone single-handedly.\n\n\nI know I should see a doctor to nip in the bud but it's always a bad time for having to take it easy on phone or computer usage, you know?", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "129": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1473638042, "Score": 1, "Body": "Yeah; the mobile phone has been pretty terrible for posture and ergonomics!  At least you could try getting a wacom tablet or one of those trackball mice for now, perhaps, and a wrist rest if your wrists aren't currently supported by something as you type.  Hope the pain does go away!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "130": {"Subreddit": "PhD", "Author": "ai-chan00", "Date": 1473642447, "Score": 1, "Body": "Oh I see. I had it prescribed to me when I had pneumonia. ", "Permalink": "https://www.reddit.com/by_id/t3_51rpei.json"}, "131": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473647031, "Score": 1, "Body": "I posted something like this here (the first 2 paragraphs are about my own condition):\n\nhttps://www.reddit.com/r/PhD/comments/4xlx85/phd_and_relationships/\n\nYou are free to quote anything I wrote in there and feel free to ask me for more details.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "132": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1473653802, "Score": 1, "Body": "I read through your thread; I'm sorry to hear of the situation, and it's definitely sad that he didn't feel like he could express or deal with his stress other than through video gaming.  It's such an easy distraction, but in the end doesn't really help solve the real world issues that are the root of the stress.  It sounds like he might have been giving himself way too much pressure both in his studies/research and in the relationship that he couldn't handle it anymore?\n\nI would be interested in chatting further with you, if you don't mind sharing your thoughts with me.  May I PM you?", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "133": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473660683, "Score": 1, "Body": "Yeah, it is fine if you PM me. However, just to clarify, I did not create that topic myself. I am the 2nd commenter down. Look for my username.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "134": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1473663057, "Score": 1, "Body": "Thank you for your concern, I appreciate it. It's spurred me to go book a doctor's appointment for myself so hopefully it'll be ok. Good luck with your study!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "135": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1473669517, "Score": 3, "Body": "Hi! Fellow STEM:er here. I don't have any physical injures, but I do suffer from depression and anxiety due to the stressful situation of being a PhD student (with a requirement to publish two papers in order to get permission to graduate). \n\nI don't know if it fits your study, but feel free to pm me with any questions. I'm not too shy to talk about mental illness in academia, I think it needs to be discussed.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "136": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1473714511, "Score": 4, "Body": "No. Looks like you're fishing for compliments. ", "Permalink": "https://www.reddit.com/by_id/t3_52g8n5.json"}, "137": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473714665, "Score": 3, "Body": "Someone who just graduated in may put her acknowledgements slide on Facebook and tagged everyone in it. I thought that was a neat way of doing it, but doesn't work if you aren't FB friends with your colleagues. Either way, I wouldn't go out of my way to do it. You just want to make sure you didn't miss anyone that is supposed to be on it.", "Permalink": "https://www.reddit.com/by_id/t3_52g8n5.json"}, "138": {"Subreddit": "PhD", "Author": "Bettygold", "Date": 1473728646, "Score": 1, "Body": "I'm a biology phd, took me 5.5 years.  generally 5-8 years", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "139": {"Subreddit": "PhD", "Author": "Bettygold", "Date": 1473728899, "Score": 1, "Body": "bio phd here,  I completely agree.  your boss gets full access and rights to your data.  need to start your own lab", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "140": {"Subreddit": "PhD", "Author": "chazgray", "Date": 1473767714, "Score": 1, "Body": "Thanks! I'm not FB friends with anyone mentioned there. Good idea though.", "Permalink": "https://www.reddit.com/by_id/t3_52g8n5.json"}, "141": {"Subreddit": "PhD", "Author": "chazgray", "Date": 1473767830, "Score": 2, "Body": "Thanks this is super helpful. It's funny how you can lose perspective about something so seemingly simple.", "Permalink": "https://www.reddit.com/by_id/t3_52g8n5.json"}, "142": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1473774695, "Score": 2, "Body": "It's really great to hear that you're trying to bring some awareness to these issues!\n\nThis may be institution-specific to me, but I went through a period of particularly bad anxiety and depression earlier this year. I had found an anti-depressant that worked really well for me some years ago, but I hadn't taken it in some time and wanted to get back on it. I tried everything to go through the university's student healthcare system, but to no avail. Even though the doctors at student health had prescribed one of my closest friends anti-depressants and anti-anxiety medication, so I had it on pretty good authority that this was a possibility, they told me definitively that that is NOT something they do, and that the only way I could get it is through counseling services. Welp, tried that, and after my intake interview they told me that it would be 6 to 8 weeks before I could get my first appointment. That's a devastatingly long time if getting through every day is a struggle. \n\nAfter a few weeks of trying to get an appointment with a local psychiatrist, I did eventually find a PCP who was willing to help. The office visits ended up costing me about $200 that I didn't have as a poor grad student on a barely-enough-to-live on stipend, but I was just so grateful that I could get any relief at all. \n\nNow that I've typed it all out, it sounds like a whole 'nother paper about institutional failures to come through on their promises when someone is trying like hell to get the help that they need, but maybe it'll still be of some use to you! (And if not, thank you for slogging through it anyway!)\n", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "143": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1473775988, "Score": 2, "Body": "First of all, I'm really sorry to hear that you're having such a frustrating time.\n\nWhat I'm NOT hearing, though, is that you're disillusioned by the actual work that you're doing. If you're really impassioned by this thing that you're sinking so many hours into, then it's possible to swallow a lot of other challenges and inconveniences for the sake of doing what you love. So maybe you're not quite at the quitting point yet?\n\nOne thing is that professors aren't necessarily experts on funding, but there may well be offices within the university (or even handy websites!) that can direct you toward scholarships and fellowships. Probably nothing that's going to pay your way by itself, but you may be able to cobble together a pretty decent financial cushion. \n\nAlso, I have advisors with whom I'm actually extremely happy, but while they always have a sense of what I'm working on, I have to fill them in again every time. I don't really mind, since I know how overworked they are themselves. At the end of the day, doctoral work really is very self-directed. I spend weeks and months doing my own thing before I pop up for air and check in with someone about my progress, but I try to be as specific as possible. I go to THEM with a sense of the kind of feedback that I want or feel I need and with some concrete questions. That might be something you can consider. They may not be with you at the big-picture level of your project, but if you're looking for more resources on some specific thing, they're likely to have something in mind. So basically, what I'm saying is that there are probably ways to take advantage of your advisors as resources by working around their limits. \n\nFinally--and most importantly!!--if you feel that you're in danger of slipping into a depressive episode, you want to make sure you have some support structures in place immediately, before you get locked in that quicksand. Having a professional to talk to can really help you sort through all of these concerns with more clarity than you can manage when you're down in it. ", "Permalink": "https://www.reddit.com/by_id/t3_522gh5.json"}, "144": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473781171, "Score": 2, "Body": "I would say an average/typical pace for Ph.D. students is a one 1st author paper every 2-3 years. In this way, the average Ph.D. student graduates with maybe ~2 papers. In exceptional cases, a Ph.D. student is able to put out a paper every year, and will have 4-5 by the time they graduate. I've personally never looked at an application where a Ph.D. student put out 2 papers every year (I guess ~8-10 1st author papers?) - but its not unusual for you to publish twice in one year because works-in-progress just happened to make it through the pipeline at the same time. So unless he has a lot of the work already done (for instance, maybe one of the papers is nearly completed?), It's very unlikely that he will be able to churn 2 of them out in the next 8 months. I know I'm not giving advice, I'm just putting the task into perspective.", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "145": {"Subreddit": "PhD", "Author": "watermelonpops", "Date": 1473781377, "Score": 3, "Body": "Wow, ok. Thanks for the perspective. He has a few papers published, but none where he's first author. As far as I know, he has no papers or research projects in the works. \n\nSounds like finishing in that time just isn't going to be possible, which I expected :/", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "146": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473781525, "Score": 2, "Body": "Yeah, I was referring to 1st author papers specifically. If you were to count my 1st author papers, I have 1 for 2016. If I included my coauthor papers, I already have 5 for 2016 already. Coauthor papers are good, but they complementary to work that the Ph.D. student/graduate has ownership of.", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "147": {"Subreddit": "PhD", "Author": "watermelonpops", "Date": 1473781554, "Score": 2, "Body": "He's been 2nd or 3rd author on a number of papers, but no first-author papers. I agree about putting the time in. I know some of his colleagues are working into the evenings/on weekends on a regular basis. He's definitely not.\n\nEdit: I'm realizing how much first author papers count. The fact that he has none right now seems like a pretty bad sign :(\n\n", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "148": {"Subreddit": "PhD", "Author": "watermelonpops", "Date": 1473781659, "Score": 3, "Body": "OK, gotcha. Gosh, I think he has maybe 5 coauthor papers *total.* I really had no idea what the norms are for PhD's so this is all very interesting. Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "149": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473782751, "Score": 2, "Body": "Yeah, it's actually changing a lot. Back in the day, few people would be listed as on author paper. Nowadays they just throw everyone and anyone on there that contributed in any way - research technicians, collaborators that helped you put together a grant, etc. All these big fancy Science and Nature papers have a ton of authors now. Coauthor papers are meaning less and less. I was reading one the other day that had 4 co-first-author papers - I won't even go into that...", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "150": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473786817, "Score": 1, "Body": "Would his advisor be willing to count conference proceedings? He could apply to a conference and submit a technical paper. These (depending a lot on your field!!!) are easier to get than a first author pub. Plus he could put that conference on his CV! \n\nI think this happens a lot once ppl get job offers. You should remind him though that even though his current job doesnt mind, this will likely bite him in the butt if he ever wants to switch jobs, fields, or get promoted. He will likely need a PhD then. ", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "151": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473786866, "Score": 1, "Body": "Also co-first-author if he has any labmates that he likes working with ", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "152": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1473789418, "Score": 4, "Body": "&gt;Most people have at least a publication or two per year.\n\nWow, so in your field, the average student has 4-8 1st author pubs by the time they graduate? How many do the exceptional students get?", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "153": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473790426, "Score": 6, "Body": "I think they mean just any paper (first,co-, or later) author. Still seems way high to me. ", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "154": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473790766, "Score": 1, "Body": "You should focus on trying to graduate! Keep that as your primary focus, everything else (publications/presentations) will present themselves. ", "Permalink": "https://www.reddit.com/by_id/t3_50k1cn.json"}, "155": {"Subreddit": "PhD", "Author": "watermelonpops", "Date": 1473792387, "Score": 1, "Body": "Yes, he will definitely count conference proceedings! \n\nI don't totally agree on the 2nd part - he's CS and the focus definitely seems to be on skills, not the degree. The vast majority of people who will be on his team do not have a PhD. They all tried to convince him to quit even! I imagine that's true for academia but my SO only plans to work in industry.", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "156": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473797813, "Score": 1, "Body": "Yeah -- he should definitely try some conference proceedings. You could try to make it into a fun vacation by finding a conference somewhere cool! That could be more motivating. \n\nI personally know people this has happened to in industry (former labmates), but we're not CS, so you are right, this may not be the same. But it surely will not hurt future job prospects to also have a PhD, especially after already putting in 6 years. ", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "157": {"Subreddit": "PhD", "Author": "Ambient-Cake", "Date": 1473812039, "Score": 3, "Body": "I've been in a similar situation to your SO and I've seen similar issues with my colleagues. It's very easy to fall into a 'slump' doing a PhD where you go in, sit on the computer and pretend to work, putting in minimal hours and only going in to show your face. This can last for years. PhDs are very self motivated and you need discipline, it's all too easy to become disenchanted and lose focus when experiments/research isn't fruitful, you have no direction, your supervisor is more of a friend than a boss who let's you do what you want or even after achieving something like a paper publication. From what you describe your SO may be feeling the same, I've been there and there is hope.\n\nI wrote my thesis from start to finish effectively in a ten week stint with a long procrastination period before hand and submitted it with only a few days before my deadline. The key is routine, I cannot emphasise this enough. Get up, go to work, have websites blocked that waste your time, work a long day, no or minimal weekends. After a week or so your SO may see there is hope that he can achieve what he needs in the time he has. To get him to do this may be difficult, I know when my partner tried to motivate me I would just become irritable and tell her she was clueless, when in reality I was going to bed every night in a panic about how far I'd let things slip. \n\nIf I found myself in his situation I would begin with a thesis plan, chapter outline etc. Write up all methods and results chapters first, leave any literature review to the end as it is easy to write about things that aren't related to your study results if you do this first. In writing up his results he will see that the studies he's done, methods he's used will have some publishable merit even if it's not obvious at the moment to him. I can almost guarantee this. Lots and lots of journal publications have papers that simply repeat results of other papers and any data that has a reasonable 'story' and is written well will be publishable. I'm sure many people on this sub reddit have come across papers that are actual nonsense and it's obvious to see data has been cherry picked or a fudge factor applied in some way or another. I'm not encouraging your SO to fabricate results but am trying to emphasise that getting a first author publication is easier than he may think when considering the lower impact factor journals. Also journals such as Nature Scientific Reports (which actually has a good and growing impact factor) will accept papers that hold water scientifically even if the impact of the data is negligible. I'm sure there are analogues journals for non science fields if he is not in science. If he really digs in and falls into a routine finishing in 8 months is very achievable using the the work he has done, he must have something from six years of work as he has conference papers and co-author publications. \n\nIn the worst case scenario that he gets no papers he can always make the case that his research did not bear fruit, this happens a lot and isn't anything to be ashamed of, as long as he has a thesis he has a case. I suggest he has a meeting and is very honest with his supervisor about his position, this can only help. \n\nHe has a job lined up which will act as a mental safety blanket. However not getting a PhD after six years will not be ideal. If he ever needs to use his CV for any other purpose there will be a big six year blotch and no matter how he explains why he didn't get his PhD the impression it gives is poor. \n\nI have my fingers crossed for you! ", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "158": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1473812155, "Score": 1, "Body": "if you're in the UK, have you looked into any MRes masters in your field?  I graduated with a 2:1 also and I applied to multiple PhDs without so much as an interview.  I decided to undergo an MRes in the field I was interested in as there was a much larger emphasis on the research elements of the masters rather than the taught side which was a huge boost and talking point in a number of PhD interviews I've had.  I have found the MRes to be extremely challenging though but the interviewers certainly were excited about the MRes over an MSc as they felt it demonstrated a commitment to research and therefore, a PhD.  Just something to consider but I think a Masters certainly makes you a more competitive candidate but bare in mind many are now pass/merit/distinction and for most of the PhDs I looked at, they wanted a min of merit.", "Permalink": "https://www.reddit.com/by_id/t3_518t18.json"}, "159": {"Subreddit": "PhD", "Author": "Ambient-Cake", "Date": 1473848744, "Score": 1, "Body": "He's a great man, but important to note Imperial College where he got his PhD has a 4 year deadline and he took an interruption of studies I believe, I think the 4 year completion period is similar for a lot of UK universities in science. Some of my friends do history in the UK and they also have a 4 year cap. ", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "160": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1473858066, "Score": 2, "Body": "Depends on your field. Most students in my field publish around 3-4 papers by the time they graduate. Highest I've seen is 6.", "Permalink": "https://www.reddit.com/by_id/t3_52l253.json"}, "161": {"Subreddit": "PhD", "Author": "phdco", "Date": 1473867127, "Score": 1, "Body": "I'm sorry that you had trouble. Have you been able to access it since?", "Permalink": "https://www.reddit.com/by_id/t3_51fs20.json"}, "162": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1473873341, "Score": 2, "Body": "Figured it out - you have to give everything one unique weight. ", "Permalink": "https://www.reddit.com/by_id/t3_51fs20.json"}, "163": {"Subreddit": "PhD", "Author": "illa_puella", "Date": 1473891812, "Score": 3, "Body": "It may just be your comment, but to me, it doesn't sound like you've tried very hard to make meetings. They have taken you on as a student, if you demand a meeting, they need to make room for you. If this isn't happening (and you have emails prove how hard you tried to make a meeting, and they haven't done so) then absolutely, take it to the department chair. \n\nBut I think you should have a good read of this article: [The care and maintenance of your adviser.](http://www.nature.com/naturejobs/science/articles/10.1038/nj7331-570a)\nFollow the advice in that article, because you're the only one who is really responsible for your PhD, and to me, it sounds like you do not have the time to be pussyfooting around anymore. Take action. Because if it doesn't work, then at least you can say is that you gave it your all.\n", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "164": {"Subreddit": "PhD", "Author": "shewhoruns", "Date": 1473894238, "Score": 1, "Body": "I'll participate. ", "Permalink": "https://www.reddit.com/by_id/t3_51yz0c.json"}, "165": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1473937026, "Score": 1, "Body": "In the UK it maximum 4, 5 if you push back your thesis writing, but 99% do it within 4. My PhD is 3", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "166": {"Subreddit": "PhD", "Author": "cramur", "Date": 1473944103, "Score": 1, "Body": "Just ask him for direct feedback and if he won't provide it, go ahead with the current draft you have.\nYou'll get more feedback this way", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "167": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473958613, "Score": 1, "Body": "Do you even have to disclose a DUI?", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "168": {"Subreddit": "PhD", "Author": "0inon", "Date": 1473959673, "Score": 1, "Body": "I'm not worried about disclosing it to my current institution, but for post-docs, etc. on applications, etc.", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "169": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1473962497, "Score": 3, "Body": "That is what I meant. Will it be considered criminal record? If it is, then you (your attorney) should try talking to the prosecutor to avoid having this record.", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "170": {"Subreddit": "PhD", "Author": "Llim", "Date": 1473963566, "Score": 1, "Body": "Hey, I was just wondering if you had an update? ", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "171": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1473965773, "Score": 1, "Body": "If this is your first offense, can't you get it expunge from your records?", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "172": {"Subreddit": "PhD", "Author": "0inon", "Date": 1473968402, "Score": 1, "Body": "Unfortunately, I can't get it expunged for a minimum of 18 months from when I am convicted... which means that when I am applying for post-docs, it'll be fresh on my record :(", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "173": {"Subreddit": "PhD", "Author": "FrearKA", "Date": 1473984301, "Score": 1, "Body": "I can kind of relate to what you're going through. I'm about to start my second year of my PhD, and my supervisor is head of the department, plus he's quite influential in the research area he specialises in so he's always out and about. I had to acknowledge that it's my responsibility to make sure he makes time for me, so I asked to book in a block of supervisions over a certain period of time.\n\nAs for the unhelpful comments, I guess you have to just ask for clarification. If you see nothing wrong with your work, but you're not getting constructive feed back, then it is well within your right to ask for something tangible to work with.\n\nBut if you're finding that your advisors are being very neglectful, it is also an option to talk to someone about it. Every university with departments that tutor post-graduates will have a designated person you can go to and explain your situation. This won't be your chair. As for confidentiality, it will be tricky, unless your supervisor had a lot of PhD students, it wouldn't necessarily be difficult to figure out who complained, even if you were kept anonymous. So it's probably best to try sorting things out with your supervisor by communicating with them first before you take it higher. At least then, they would have some kind of indication that you were having a problem, rather than finding out \"out of the blue\".\n\nHope it goes well :)", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "174": {"Subreddit": "PhD", "Author": "FrearKA", "Date": 1473985179, "Score": 1, "Body": "I think the most important thing is to make sure you pick a topic that you are genuinely interested in when planning your research and thesis. You will be thinking about it in detail for three years. I can't even explain the depths you will go. It will drive you mad. But you have to love the topic enough that when you hate it, you still return to your computer and continue to write.\n\nAs for teaching, if you are able to get opportunities to do some teaching while you are studying your PhD, go for it. Not only can you put it on your academic CV to be able to put you in a better stead for apply for research fellow grants or lecturer positions at universities; some universities pay their students to lecture, so that might be helpful regarding your concerns to being a contributing member to your family.\n\nAnother thought regarding contribution is going part-time, you could even do a master's part time, but it would take 2 years. A PhD would take 6 years, but the flexibility might be useful in terms of contributing to your family.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_51mhq7.json"}, "175": {"Subreddit": "PhD", "Author": "caz-", "Date": 1474022200, "Score": 7, "Body": "Be thankful you didn't kill anyone. That would really fuck your life up. You got off easy IMO.", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "176": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1474028848, "Score": 1, "Body": "My brother got a DUI 4 years ago at age 21. He just went to court for this this year. Maybe your lawyer could put the court day off until after you've applied for the post docs? We are in Ga. idk how things are handled in your city. But you may not even receive a DUI charge. Most first timers here get it reduced to a lesser offense. ", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "177": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1474038606, "Score": 2, "Body": "In some states, first offenders can automatically go through a program where you plead no contest, pay a fine, and go to a few alcohol classes. Then there's a probationary period: if you get another DUI during that time, your no contest turns into a conviction, but if you don't, it'll never show up as a conviction on your record. I don't know if this is an option where you are, but it's definitely something to look into/check with your lawyer about. If that is the case, then you shouldn't need a lawyer at all--they're just for when you attempt to plead not guilty and need someone to try to impeach the police work. ", "Permalink": "https://www.reddit.com/by_id/t3_52wvl8.json"}, "178": {"Subreddit": "PhD", "Author": "FieldMarshalSaltykov", "Date": 1474117368, "Score": 2, "Body": "&gt;publish the shit out of your PhD\n\n\nwise words indeed", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "179": {"Subreddit": "PhD", "Author": "whosparentingwhom", "Date": 1474132581, "Score": 1, "Body": "Mine took 9 years but I birthed two children during that time and took one year of leave for each. ", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "180": {"Subreddit": "PhD", "Author": "arbab01", "Date": 1474162649, "Score": 2, "Body": "don't compare yourself with others. Awesome words", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "181": {"Subreddit": "PhD", "Author": "NewPhDGuy", "Date": 1474215753, "Score": 2, "Body": "I really love this post.  You helped me answer a lot of question that I have about my experience. Thanks!!!!!", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "182": {"Subreddit": "PhD", "Author": "NewPhDGuy", "Date": 1474216375, "Score": 2, "Body": "I know exactly where you are coming from.  Sometimes I feel like my advisor wants me to fail. We will have a conversation about topic A and he will advise to do Y.  A month later, we will revisit the conversation and he will say that Y was a horrible idea, and deny having suggested it at all.  He is horrible at answering emails and then blames me for not emailing him enough.  I feel like no matter what I do, its never good enough.  I know I that I am talented in my field.  PhD research seemed like a natural progression in my career, now I'm not sure.   \n\nI am really interested in seeing what kind of advice you get from other Reddit members, in hopes that it motivates me. \n ", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "183": {"Subreddit": "PhD", "Author": "Crolle", "Date": 1474218683, "Score": 2, "Body": "Not my post though, I just pasted the title as it is. But the content is worth the read. As someone who just handed his manuscript, I couldn't formulate some of these points better. ", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "184": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1474233362, "Score": 1, "Body": "Depends on your country, school, and department. Each is unique. In my department, almost none of the classes transfered but the class load wasn't very high (6 classes). ", "Permalink": "https://www.reddit.com/by_id/t3_53e244.json"}, "185": {"Subreddit": "PhD", "Author": "The_Aesthete", "Date": 1474239500, "Score": 2, "Body": "I suffered from Imposter Syndrome very badly going into my graduate program. The first thing that helped me was reading about the syndrome itself. I was a textbook case, and *knowing* that the symptoms were common helped me understand that my intimidation could be attributed to this condition rather than to my own ineptitude. Once I started my program, talking with other students and getting to know the faculty helped a lot. I eventually became comfortable enough with other members of my cohort and admitted that I had been suffering from Imposter Syndrome.... they said they felt much the same!\n\nPhD programs are competitive. Likely your school got a lot of applicants. You didn't land there by mistake. You worked hard to be where you are and *they* *chose* *you.*", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "186": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1474260449, "Score": 0, "Body": "Why don't you get a PhD in your area? You can still use all the psychology literature. Psychology PhDs are a shit deal.", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "187": {"Subreddit": "PhD", "Author": "blufox", "Date": 1474261223, "Score": 1, "Body": "If you are in IT, you can look at a Ph.D. in Interdisciplinary studies such as HCI. For example, I was suggested \"The cognitive factors affecting software testing\" as my Ph.D. topic initially, and a few of the PhDs from my advisor looked at the impact of aging, and how software can help children. You can pick a co-advisor in Psychology, and have the majority of coursework in Psychology too.\n\nLook for schools that support such research. ", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "188": {"Subreddit": "PhD", "Author": "ardent74", "Date": 1474263877, "Score": 1, "Body": "Thanks for your thoughtful and practical suggestion. My concern is, my current research subject is not really related to computer or IT at all. To make it appealing to HCI, I may need to tweak my research subject and it is  something I can do. However, I'm concerned of possibly going in a different direction... \n\nI'll look for school as well as researches related to my research subject. Again, thanks for your advice!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "189": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1474265004, "Score": 1, "Body": "Agree that it depends on the country and area you study in. I have heard of very few times that people have been allowed to take less classes though. In most of the courses that require classes to be taken (US) I had heard that they put you in other courses if you have taken equivalent things. Most schools don't seem to think there is and equivalent thing though and make you retake the class as there may be small differences in what is taught.\n\nTo clarify why I say it is different in other countries, I'm in Australia and I am taking no classwork at all in my PhD. It's all research and only 3 years here.", "Permalink": "https://www.reddit.com/by_id/t3_53e244.json"}, "190": {"Subreddit": "PhD", "Author": "blufox", "Date": 1474270755, "Score": 1, "Body": "If you are applying to US universities, you do not have to worry about your current research. The current research will be just taken to show that you know how to research. So feel free to make radical changes.", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "191": {"Subreddit": "PhD", "Author": "ardent74", "Date": 1474271491, "Score": 1, "Body": "I appreciate your information. My problem is that I don't have any research experience at all. I've worked as a IT professional and my project deliverables are not related with any academic work. Sometimes I worked with the researcher in the user research but I don't think this is counted as research. I have a master degree though...", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "192": {"Subreddit": "PhD", "Author": "blufox", "Date": 1474272954, "Score": 1, "Body": "I worked for 10 years as an SE professional before starting with my Ph.D. I did not have any research experience either. So do not let that stop you. A Ph.D. in U.S, especially in SE, is considered a starting point and your advisor will not look for previous experience. In fact, it is harder to get a Ph.D. topic that is connected with your previous research if you have any.", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "193": {"Subreddit": "PhD", "Author": "ardent74", "Date": 1474286818, "Score": 1, "Body": "Thank you for letting me know. I truly appreciate it. Knowing that Ph.D without research experience is not impossible is a big difference to me. I'll work harder to find a way to do it. Again, thank you so much! ", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "194": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1474292153, "Score": 5, "Body": "It is very normal to finish your coursework in the 2nd year and qualifying exam in the 3rd, and then go on until the 6th or 7th year before completing a PhD (although 7 years is on the long end of the 'normal' range, but this also varies by subject). You don't really 'present theses' throughout your PhD - you propose one and then you defend it. Usually upon successfully defending a thesis, you finish your PhD and graduate. However, usually by this point (6th year), you have certainly picked a topic for your dissertation and have made very significant strides into getting the dissertation put together.\n\nIf your boyfriend doesn't have a topic for his dissertation, what exactly was he doing between year 3 and year 6?", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "195": {"Subreddit": "PhD", "Author": "blufox", "Date": 1474301587, "Score": 1, "Body": "Depending on his thesis advisor, and subject, that may not be a big problem, especially if he is published. I have seen Ph.D. students writing their thesis in a term from the papers they have published. This is in SE, so it may be different for other subjects.", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "196": {"Subreddit": "PhD", "Author": "el_matt", "Date": 1474306865, "Score": 1, "Body": "You're likely to get a lot of different answers here depending on where people come from and what system their university uses. In the UK for example, many (full-time) PhD titles are decided upon application to the program, the thesis is written and submitted by the end of the third year, you viva, graduate and you're done. \n\nOther places work differently and in any case it doesn't always go that smoothly- but the system is designed to absorb a certain amount of hiccups. Bottom line is probably this: does the supervisor/advisory team know the situation and are they ok with it? If so, there's probably nothing to worry about.", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "197": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1474307648, "Score": 0, "Body": "Unless he has an impressive publication record, that's certainly not great. What discipline (broadly) and country are you in?", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "198": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1474312239, "Score": 1, "Body": "I'm sorry you're going through this, too. What field are you in? What I really wish I could do was talk to my department about it, but I can't, because I know they all talk to each other and I wouldn't want word to get around that I was complaining.  ", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "199": {"Subreddit": "PhD", "Author": "kittykatherina", "Date": 1474312251, "Score": 1, "Body": "PS Best of luck for your current endeavors. ", "Permalink": "https://www.reddit.com/by_id/t3_52slbe.json"}, "200": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1474315311, "Score": 1, "Body": "Your M.S. credits will likely not transfer if you change disciplines/departments. They might not transfer at all, it depends on the school. I'd just ask yourself what you want to end up doing in life. Do you really need a PhD for that, or is a PhD something you want for yourself? If so, go for it. But if you're iffy about it, I wouldn't. ", "Permalink": "https://www.reddit.com/by_id/t3_53jev4.json"}, "201": {"Subreddit": "PhD", "Author": "ejc16", "Date": 1474320788, "Score": 3, "Body": "I use Mendeley to organize my readings. Not sure how great the export of bibliography is since I haven't actually used that feature yet, but I've heard it is good. And you make an account so you can log in on multiples devices and have your citations accessible anywhere", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "202": {"Subreddit": "PhD", "Author": "Bibliobop", "Date": 1474323788, "Score": 1, "Body": "That's the big question, isn't it?  In the last year and a half he taught a workshop and more recently is teaching two graduate courses.  He contributed to 1 publication but wasn't 1st author.  I guess I just assumed he was doing what he was supposed to be doing but at the end of the last academic year some friends finished their dissertations. They started a year after he did and had 4-5 publications, it started raising some red flags.", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "203": {"Subreddit": "PhD", "Author": "Bibliobop", "Date": 1474323893, "Score": 1, "Body": "One advisor has become increasingly more difficult to get ahold of and the other has become more critical in the last year of his inactivity which has created distance.", "Permalink": "https://www.reddit.com/by_id/t3_53h95p.json"}, "204": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1474373928, "Score": 2, "Body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.4220 \n &gt; [What is this?](https://pastebin.com/64GuVi2F/90973)", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "205": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1474381006, "Score": 3, "Body": "alcohol!!!! ", "Permalink": "https://www.reddit.com/by_id/t3_53nejg.json"}, "206": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1474407874, "Score": 3, "Body": "RStudio! With the right know-how it can take you from raw data to manuscript, PowerPoint slides or html output in a reproducible way. Scrivener for all other writing.", "Permalink": "https://www.reddit.com/by_id/t3_53lbeq.json"}, "207": {"Subreddit": "PhD", "Author": "rptrainor", "Date": 1474408011, "Score": 1, "Body": "Thanks sewballet. I'll take a look. ", "Permalink": "https://www.reddit.com/by_id/t3_53lbeq.json"}, "208": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474412263, "Score": 1, "Body": "I did the same - are you a psychology Phd by any chance?", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "209": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474412740, "Score": 1, "Body": "I switched to electric, still smoke occasionally but honestly it's great and so much cheaper, plus i can vape in my office ha ha. Just make sure the nicotine content is high enough. ", "Permalink": "https://www.reddit.com/by_id/t3_4zorzt.json"}, "210": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474412860, "Score": 1, "Body": "cite it - footnote the publication date and where you were with your own research, state what you agree and disagree with and why", "Permalink": "https://www.reddit.com/by_id/t3_4ymm7n.json"}, "211": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474413010, "Score": 1, "Body": "I find that I just can't stay on one thing for that long so I have divided all of my thesis chapters up and put them in different folders and when I need a break from one I switch to the other. I find that going through the actual research and lit review etc helps me to refine my original hypotheses and research questions ", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "212": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474413179, "Score": 1, "Body": "Depends what I'm looking for - I tend to divide up into the reason \n1)Background facts on the topic - Intro \n2)How someone else utilised and described a test/methodology - Methods \n3)What was the out come - Discussion \n4)How do I report these tests - results \n5)Oh this paper is similar to my research - Read the whole thing", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "213": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474413964, "Score": 1, "Body": "Is there any way that you could just say - look finish your Phd and then we'll talk? I am final year PhD and I started dating my OH just as I started going back to university for my undergrad. Literally every year at exams we would break up because as much as I loved him my tolerance for him just hit the floor. We should have taken breaks then. Its very much still like that now, we've lived together for 7 years but when I need some space I'll spend 6 weeks working from my parents house (different country) ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "214": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1474420068, "Score": 1, "Body": "I have thought about that. I love him so much. He broke up with me since I posted this, but I still feel like we were meant to be together. I know how cheesy that sounds. I've asked myself if waiting is something I'd be willing to do. It seems like a terrible idea, considering he has no idea what he wants. Today is the two month mark since his internal turmoil has been revealed. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "215": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1474420353, "Score": 1, "Body": "Yes, it makes me pretty happy to hear that I inadvertently helped someone with my sad sad relationship post. I hope you're feeling alright these days. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "216": {"Subreddit": "PhD", "Author": "Taken2121", "Date": 1474432975, "Score": 1, "Body": "I've never met anyone who had to pay for a PhD.  \n\nThen again, I'm a medical student, not a PhD candidate.  ", "Permalink": "https://www.reddit.com/by_id/t3_4qdgyb.json"}, "217": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1474469893, "Score": 1, "Body": "I hope to god English is not your first language. ", "Permalink": "https://www.reddit.com/by_id/t3_53oxa7.json"}, "218": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474482647, "Score": 1, "Body": "Doing a Phd is a bit like being mentally ill, and I say this with experience of both. It's the one thing that's important, the only thing you can expend any energy on, when it is going well, you go well, when it's not going well you fall apart. It's like this all encompassing monster and I suppose it stops you from making rational decisions or at least the only rational decision you can make is to work work, get through it, work work. I am incredibly lucky with my partner in that he is also very work focussed and he knows that when I need it, it's the only thing that will calm me down, as in to just let me power through and get out my way. I haven't eaten today, I haven't even washed, I got up 10 hours ago and hit my keyboard, this is the first proper break I've had. I'm lucky in that he gets it and I have somewhere to run too when it gets overly intense. As much as I love him and we've been together for a long time, I don't think I could be with him if he didn't.I guess maybe if you love him and understand him, get out his way but if you really want to give the relationship a shot leave the door open", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "219": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1474482997, "Score": 1, "Body": "Are you in the UK? If so http://www.researchersinschools.org/", "Permalink": "https://www.reddit.com/by_id/t3_53i4fi.json"}, "220": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1474496876, "Score": 1, "Body": "As a PhD student in a cognitive Science program - you should definitely email your prospective professors and ask them 1) if they are accepting new students for the next academic year, and 2) what kind of research they are currently working on. \n\nAlso, before you identify a professor you should narrow down your focus to one area and read up on some of their articles.\n\n Feel free to DM me is you have anymore questions. Cognitive Science is the best!", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "221": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1474496906, "Score": 1, "Body": "Cognitive Science =/= psychology ", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "222": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1474498404, "Score": 1, "Body": "Imposter syndrome ", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "223": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1474498988, "Score": 1, "Body": "My second year I decided to take my first round of qualifying exams early. For three months I had chronic insomnia. I literally did not sleep for more than 3 hours at a time for 3 solid months. I had the worst eye twitch and several random crying outbursts in my office. This was also my first semester working on a new interdisciplinary grant with a computer science team and my advisor was gone on medical leave. It was the worst semester ever!\n\nAlso, immediately after two straight days of qualifying testing I fell sick with the flu. I'm pretty sure I've never been sicker. I also had another exam the following week in one of my classes and made the worst grade I've ever made on an exam in my life (but I only needed a D to make a B in the course so I wasn't worried). I just didn't have the mental capacity to even think. I remember the first hour of that exam I spent putting my name on the document and formatting it correctly. \n\nI got through it, though, and became the first student to ever pass that qualifying exam on my first try - even though I took them early (yay!). ", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "224": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1474499334, "Score": 1, "Body": "This may sound silly but I set little bench marks for myself. If I fail this one class, then I'll quit. If not, then I'll keep going. I haven't failed anything yet, and now all I have left is dissertation.", "Permalink": "https://www.reddit.com/by_id/t3_50s56u.json"}, "225": {"Subreddit": "PhD", "Author": "ardent74", "Date": 1474511497, "Score": 2, "Body": "Thanks for the tips and offering for me to DM you! You are very kind! After some conversations with ppl in academia, and gathering feedback from those comments on web board, I realized that top priority to me at this point is narrowing down and clarifying the subject of my study for Ph.D. I'll work on this hard for some months and will shoot for Ph.D next year. Once I sort out and clarity my research goal, I'll definitely contact you for more specific help on how to approach the professor and select a school/program. Again, thank you soooo much for everything you offered on this tread! :D", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "226": {"Subreddit": "PhD", "Author": "ardent74", "Date": 1474511590, "Score": 1, "Body": "Plus, cognitive science rocks!!! ", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "227": {"Subreddit": "PhD", "Author": "hacker-l0maker", "Date": 1474514733, "Score": 2, "Body": "Mendeley also works for me. I do export the bibliography and use it within my LyX editor.", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "228": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1474526416, "Score": 1, "Body": "This is your advisors job. If you're looking for someone to talk to for a long period then you will probably find little help as your drive to do this research should be your own and not require long \"chats\" with anyone. This might sound a little harsh but it is just the nature of the course/degree.", "Permalink": "https://www.reddit.com/by_id/t3_53oxa7.json"}, "229": {"Subreddit": "PhD", "Author": "protohedgehog", "Date": 1474542120, "Score": 2, "Body": "Hey! Author of the post here - glad to have helped out a bit :) If there's anything I can ever help with more, lemme know!", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "230": {"Subreddit": "PhD", "Author": "protohedgehog", "Date": 1474542449, "Score": 1, "Body": "Cheers! :)", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "231": {"Subreddit": "PhD", "Author": "protohedgehog", "Date": 1474542462, "Score": 1, "Body": "Applies to all things in life. Just be the best you can be :)", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "232": {"Subreddit": "PhD", "Author": "The_Aesthete", "Date": 1474581996, "Score": 1, "Body": "No, philosophy!", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "233": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1474608048, "Score": 2, "Body": "What led to the realization?", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "234": {"Subreddit": "PhD", "Author": "euclinc", "Date": 1474609460, "Score": 2, "Body": "in econ hindsight is 20/100 and you use computational glasses to try and get some focus. maybe if a dozen other nearly-blind people look at the same thing as you you can figure out what you're looking at.", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "235": {"Subreddit": "PhD", "Author": "Houston83", "Date": 1474629520, "Score": -2, "Body": "Econ studies events after they occur.  Then econ tries to relate its findings from one scenario to explain a completely unrelated scenario, due to its inputs being different.  It's more along the lines of a pseudoscience.", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "236": {"Subreddit": "PhD", "Author": "Houston83", "Date": 1474629552, "Score": 0, "Body": "I have interest in both subjects", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "237": {"Subreddit": "PhD", "Author": "euclinc", "Date": 1474633235, "Score": 1, "Body": "I study economics, eat a dick", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "238": {"Subreddit": "PhD", "Author": "Houston83", "Date": 1474635496, "Score": -1, "Body": "I don't mean to offend you. I like economics,  it's kind of like \"finance history\"", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "239": {"Subreddit": "PhD", "Author": "euclinc", "Date": 1474637617, "Score": 2, "Body": "my feelings are ok, I'm more hurt on an intellectual level. Poor econ... I can't believe people like you have the loudest voices and spout inaccurate generalizations everywhere... and to top it off you're probably serious", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "240": {"Subreddit": "PhD", "Author": "Houston83", "Date": 1474637846, "Score": 0, "Body": "George Soros has a similar view of economics. He is one of the most successful people out there and he believes its a pseudoscience. I think it is just a difference in approach or view points, maybe backgrounds even", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "241": {"Subreddit": "PhD", "Author": "euclinc", "Date": 1474637911, "Score": 3, "Body": "George Soros doesn't speak for the entire field and neither do you", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "242": {"Subreddit": "PhD", "Author": "Houston83", "Date": 1474638354, "Score": 1, "Body": "Neither do you", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "243": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1474673929, "Score": 4, "Body": "I work in a somewhat isolated lab in our building so many of the faculty don't know me even though I did undergrad in the same department. I had a faculty member that we were meant to do some work for, come down to our lab, and then make some condescending comments along the lines of me running along to get my supervisor to talk to them. Later when my supervisor asked me about which one of us would do the work, I just flat out refused to work with this faculty member at all. My supervisor is great (male) and apparently spoke to the faculty member about it. At that point I didn't really care though, I was quite done dealing with it. I'm a Eurasian female in chemistry.", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "244": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1474690605, "Score": 2, "Body": "WTF are microagressions? examples?", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "245": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1474690903, "Score": 2, "Body": "so you want someone else to do all the legwork for you? what are you?", "Permalink": "https://www.reddit.com/by_id/t3_544myc.json"}, "246": {"Subreddit": "PhD", "Author": "gracefulchoices", "Date": 1474696024, "Score": 2, "Body": "To be honest, if you can't decide on your own on what PhD program to apply for... Not sure if you are ready for it yet. ", "Permalink": "https://www.reddit.com/by_id/t3_544myc.json"}, "247": {"Subreddit": "PhD", "Author": "gracefulchoices", "Date": 1474696072, "Score": 1, "Body": "So easy to say, so hard to do... ", "Permalink": "https://www.reddit.com/by_id/t3_536j3u.json"}, "248": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474727196, "Score": 1, "Body": "Honestly, I just had this conversation with a friend last night and we came to the same conclusion. Thanks. I'm on it!", "Permalink": "https://www.reddit.com/by_id/t3_544myc.json"}, "249": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474727228, "Score": 1, "Body": "Tough love. I got it.", "Permalink": "https://www.reddit.com/by_id/t3_544myc.json"}, "250": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474727254, "Score": 1, "Body": "I'm that guy. Ok, I'll take care of it. Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_544myc.json"}, "251": {"Subreddit": "PhD", "Author": "keebz11690", "Date": 1474736715, "Score": 2, "Body": "Depends on the field. What's your discipline? I'm in humanities and I did six.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "252": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1474737963, "Score": 1, "Body": "I applied to 12.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "253": {"Subreddit": "PhD", "Author": "mohataher", "Date": 1474739338, "Score": 2, "Body": "I applied to nearly 20, got accepted in one!", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "254": {"Subreddit": "PhD", "Author": "ejhops", "Date": 1474740006, "Score": 1, "Body": "I applied to four, which is fewer than most of my cohort (STEM). ", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "255": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1474740250, "Score": 3, "Body": "One. ", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "256": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474745335, "Score": 1, "Body": "Special Education or technology in education. I was aiming for five but I'll do as many as it takes. I'm applying to Carnegie Mellon, NYU, and some others. Honestly University of Oregon is my dream school.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "257": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1474747258, "Score": 1, "Body": "Applied to 4. Got into 3/4 (rejected from MIT). Apply to a gradient of schools - ones you don't quite think you can get into but are worth trying for, those you feel confident about, and a few safe schools. You don't want to delay yourself a year because you applied to 1-2 schools and got rejected. There is some randomness to the application process.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "258": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474758387, "Score": 2, "Body": "Two papers?  That's aggressive.  I was fortunate that my program didn't have any explicit requirements for graduation; only the tacit expectation that your work would be ready for publication by the time you defended.  My PhD work didn't actually get published until 2 years after I graduated and I started working outside academia.\n\nI would absolutely love to chat further if you're up for it.  And yes, as someone with a neuroscience background, I strongly believe that social stigma around mental health is extremely damaging and totally unnecessary; our brains are complex and it's totally unrealistic what we expect them to do sometimes.  I'll give you a PM.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "259": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474758831, "Score": 1, "Body": "I also found myself grinding more often, or rather, clenching during certain parts of grad school (I would have awful dreams of my teeth falling out, which I think reflected the clenching.)  Always meant to get a mouthguard for that, but I think it's stopped for me, anyway.\n\nDid not realize one can end up with actual bone growth from that though.  I suppose our jaw muscles are indeed quite strong...  \n\nCurious what your life plans are that require a PhD; professorship, I presume, or an industry or government admin position related to your field of study?  And yes, it's true that getting through the degree requirements quickly and efficiently to reach your ultimate goal is definitely a good mindset to have.  I do think too many people undervalue their own time and youth in grad school.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "260": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474759145, "Score": 2, "Body": "Awesome; any action is better than none!  Helping yourself with those ergonomic issues is definitely important...cuz let me tell you, having to live with pain for years after totally isn't worth it.  If I could go back in time to my mid-PhD years, I would absolutely have made myself ask my PI for a better lab stool, put supports under my elbows during intensive bench procedures, and started doing more back weight training exercises (I mean, anyone can do squats in between writing, while reading even, or while waiting for a procedure to finish, and do rows with a cheap band from Amazon tied to an office desk or lab table!).\n\nBest of luck with stopping the pain progression!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "261": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474759351, "Score": 1, "Body": "Got it; my bad for not paying attention.  Still, very relevant situation, and GI issues are no joke for quality of life.  I completely agree with your assessment of the OP's situation though; stress-gaming leads to lost time which leads to more stress-gaming, etc.  (And that this type of de-stressing has a very different effect on people compared to any kind of physical exercise.) \n\nWill PM you.", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "262": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474759712, "Score": 2, "Body": "That is intense.  I hope your insomnia has gotten better now that you've passed!  I'm useless without sleep; I can't imagine surviving what you did, let alone passing a challenging exam!\n\nNow that you're through that hurdle, are things better on the stress side of things as you dig into your project (or are you already done)?", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "263": {"Subreddit": "PhD", "Author": "keebz11690", "Date": 1474760872, "Score": 1, "Body": "From your comment I cant tell if you are applying to Oregon but if it's your dream school you definitely should. Philosophies on applying to grad programs vary. My strategy was for the first round to only apply to as many schools as I could have time to make really good applications for and schools that I would want to attend. I got accepted in my first go round but if not my plan would have been to expand my options to schools I found less desirable. Others may advise you to apply to as many schools as possible now if it's in your plans to start your degree next year. Just depends on your level of desperation to get accepted immediately. You can always decline if you are accepted to a school you don't particularly like but you won't have much chance of being accepted a second time around. Are there people who you'd like to work with at each school you apply to is also another good mechanism for determining how many to dedicate your time to. There is also the financial cost of applications to take into account.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "264": {"Subreddit": "PhD", "Author": "knees_of_nakamura", "Date": 1474768337, "Score": 1, "Body": "thank u for posting this", "Permalink": "https://www.reddit.com/by_id/t3_51o5wk.json"}, "265": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474769653, "Score": 1, "Body": "Thanks, Oregon is the only school I've applied to so far. They have some awesome Special Education professors and I've already been in contact with two of them. They were super receptive. The great thing about professors in special education is that they are usually nice. Usually. I'll be visiting in November.\n\nI'm pretty desperate to make this work so I'll just keep applying. The only hard part is the references. I'm about to submit a post asking what people consider tactful in regards to getting letters. I don't know if its appropriate to have someone submit letters several times.\n\nLuckily Oregon waived the application fee because I'm a veteran.\n\nThanks so much for your input.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "266": {"Subreddit": "PhD", "Author": "cetejada10", "Date": 1474771257, "Score": 1, "Body": "I just finished my application for a Computer Information Science PhD. My MO was to email the referee before I added to the application, just as a cordiality. So, I ended up emailing one referee about 4 times, instead of him receiving the automated email from the application. \n\nHope this helps.", "Permalink": "https://www.reddit.com/by_id/t3_54dagl.json"}, "267": {"Subreddit": "PhD", "Author": "djengel96", "Date": 1474775037, "Score": 1, "Body": "It does help. Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_54dagl.json"}, "268": {"Subreddit": "PhD", "Author": "cetejada10", "Date": 1474777978, "Score": 1, "Body": "Just the one. (Computer Information Science). ", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "269": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1474815194, "Score": 0, "Body": "Microaggressions?...more like control your emotions", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "270": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1474815546, "Score": 2, "Body": "Mendeley is THE one to use and it's free, endnote comes in close second except you have to pay for it", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "271": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1474815849, "Score": 1, "Body": "Applied to 3 last year, my application was rushed and awful and I regret even doing it, as a result I got no interviews or offers. This year I applied to 3, got 3 interviews. 2 of the places turned out not to be right for me, but one was perfect. I started last week", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "272": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1474820201, "Score": 2, "Body": "It's all copy paste anyway.", "Permalink": "https://www.reddit.com/by_id/t3_54dagl.json"}, "273": {"Subreddit": "PhD", "Author": "DomBrown2406", "Date": 1474825874, "Score": 1, "Body": "One. My now PhD supervisor was also my supervisor for my undergraduate dissertation and I discussed the possibility of doing a PhD under him once I'd achieved my masters in CS. After working with me for the year he decided that I was good enough for a funded PhD position once I'd graduated so he made me the offer, which I accepted.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "274": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1474854891, "Score": 1, "Body": "That's true; the PhD will definitely provide you research skillsets and the system platform for research publications like no other degree or experience can.  Hope things have improved, healthwise, and that your research is going well!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "275": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1474914585, "Score": 1, "Body": "For 8 universities? No. Maybe for like 20-30. I wouldn't worry about it. Once they put the letter together, it's a quick submission process on their end.", "Permalink": "https://www.reddit.com/by_id/t3_54dagl.json"}, "276": {"Subreddit": "PhD", "Author": "phdconfidential", "Date": 1474994367, "Score": 1, "Body": "I am sorry to hear that. Hope you don't have to work with that faculty. I have also experienced some condescending comments from male faculty in front of a group of people and also in person. I tend to almost always ignore them at the moment, but they eat me up inside. Hence, I am wondering what other people do to cope. ", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "277": {"Subreddit": "PhD", "Author": "EvermoreCR", "Date": 1475033853, "Score": 1, "Body": "one", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "278": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1475040075, "Score": 1, "Body": "Absolutely helpful.  And totally agree that sometimes the system is ridiculously slow or difficult when it comes to helping people who've already taken a pretty big step to seek help.\n\nMind if I PM you?", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "279": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1475151544, "Score": 1, "Body": "No they're not always backward-looking.  Large-scale studies generally are because it's a bit difficult to run an experiment on a whole big area let alone gather the data, hence using the data that is in the past and already available and building/improving models to explore what-if scenarios.  When people criticize macroeconomics I compare it to the people who criticize climate science.  Do you have any better ideas?  Should we just stop and stare at a blank wall instead?  I don't think so.\n\nExperimental economics does a lot of test theory, predict an outcome, report outcome, confirm or debunk a theory.  Of course, positive effect bias in publication means a lot of work that shows an effect of zero isn't documented, unfortunately.  This is a problem that I think exists in science as well, but to a much smaller degree.\n\nAs far as looking forward, there are many examples of how economists have helped designed systems/markets to make the world a better place.  One notable example is the work of Alvin Roth who worked to design the kidney exchange system in the United States.", "Permalink": "https://www.reddit.com/by_id/t3_541hax.json"}, "280": {"Subreddit": "PhD", "Author": "PhDConsultant", "Date": 1475153241, "Score": 1, "Body": "I keep a folder for each project I'm working on in dropbox.  This folder contains a \"To Read\" sub-folder for all the PDFs I haven't read yet, a word document (annotated bibliography) for the PDFs I have read, and the PDFs I have read.  Whether PDFs are in the folder or in the \"To Read\" sub-folder, I rename them by authors last name and year (e.g. Johnson2004.pdf).\n\nThe annotated bibliography is chronological by when I've read a paper.  I'll start by writing in bold: \"Last Name, First Name (year). Title.\"  This way it's easy to find the paper in the folder if I want to re-read it for any reason.  Then write a summary.  Then write why it's important for my work/for what reasons I will cite this paper.\n\nIf things start to get large/complicated, I use highlighting to visually tag whether papers are related to specific things (e.g. yellow for methods, blue for papers with alternative hypotheses, etc.), and create a key for these colors at the top of the document.\n\nIt's low-tech, but incredibly effective.  When you think to yourself about a paper you usually can remember when in time you read it first and for which project, which makes it easy enough to find the actual paper.  As far as syncing, it's on Dropbox, which is free and good enough for looking at on and even editing on the iPhone/iPad.\n\nI hate Mendeley and its competitors.  Also, get in the habit of deleting PDFs that aren't super interesting or extremely related to your work.  Don't read everything because you can't.", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "281": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1475157721, "Score": 1, "Body": "I'm on my dissertation now, and it is much better! There are lots of other stresses, but this kind of stress (one where I'm more independent) is much more manageable for me. Not to say that I don't have the occasional daydream about quitting though!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "282": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475166287, "Score": 3, "Body": "I would personally let that one go if they've so clearly said they cannot take you on at the moment. If find someone else you think would have the expertise, be more clear about the time input required when you email them. \n\nI am also in Australia and have a 10% supervisor at another university (just another state) and I email him about every four months and that's it haha. So it is useful and I wouldnt give up trying to find someone.", "Permalink": "https://www.reddit.com/by_id/t3_5527qt.json"}, "283": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1475179808, "Score": 1, "Body": "Take what the PS has to offer (which will be valuable input to say the least), don't let him/her off the hook, even if the PS has nothing to offer, you would still have built a contact, which in academia are valuable. Furthermore, get in touch with another PS who has no problems in fully committing to your project.  ", "Permalink": "https://www.reddit.com/by_id/t3_5527qt.json"}, "284": {"Subreddit": "PhD", "Author": "JTorgo", "Date": 1475198812, "Score": 1, "Body": "I am in geosciences and I only applied to 2. I knew that I was pretty much guaranteed to get into one of them though.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "285": {"Subreddit": "PhD", "Author": "JTorgo", "Date": 1475199318, "Score": 1, "Body": "I should add that the research they do is interesting to me, but it just isn't what I want to study the rest of my career. \nI should also add that I do not have a master's, I started a PhD immediately after getting my bachelor's.", "Permalink": "https://www.reddit.com/by_id/t3_555lb2.json"}, "286": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1475241197, "Score": 5, "Body": "Yes, the male students hate and resent you because you’re female…\nOr perhaps you have an unconscious bias and presume every attack on you because you are a female? You need realise that this is often normal behaviour in science, regardless of one’s sex, or the sex of the offender. Doing a PhD and being within a research institute / faculty is very competitive, at times down right aggressive, or subtly bitchy. It’s the worst environment I have ever worked in for general friendliness and cooperation, I document all interactions with other staff just so I can’t be stabbed in the back, because they will if it aids them in grant funding, more lab space, a nicer office. It shouldn’t be like this, but that’s the way it seems in every faculty I have seen from behind closed doors.\n\nHave you presented your confirmation or at any conferences yet? If other researches can, they will destroy your work, methodology, work ethic and anything else they can. If you’re going to stay in this environment, to put it bluntly you need thicker skin, if you’re going to take everything as an attack on your sex, you won’t last. I have taken the approach that I engage in no office politics or socialisation, I have a small group of like-minded peers that I can bounce ideas off or seek help / support from if need be, and most importantly I have people I collaborate with outside of my faculty so they are independent of any ‘inhouse’ drama. \n", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "287": {"Subreddit": "PhD", "Author": "ima767", "Date": 1475253600, "Score": 2, "Body": "Hello there! I know many examples of both. imo the the main thing is  the practical vs. theorical application of your thesis research. Anyway, as a first student maybe you'll discover a midway point between what you want and what they do. Good luck and keep on working hard (btw I'm ending my PhD in neuropsychology).", "Permalink": "https://www.reddit.com/by_id/t3_555lb2.json"}, "288": {"Subreddit": "PhD", "Author": "bananyanko", "Date": 1475278458, "Score": 1, "Body": "I wouldn't think of it as brown nosing since it's likely that those people you mention aren't going to be the ones who evaluate your essay. I would just mention what you're interested in researching and who you think at the university might be a good research match. It shows that you've done your research on the university. Especially since PhD is going to be a commitment to one particular advisor, admissions should know that YOU know who works there and that you can see yourself fitting in with what they have to offer.\n\nI'm just a first year though haha, what do I know. ", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}, "289": {"Subreddit": "PhD", "Author": "arcoftheark", "Date": 1475279928, "Score": 2, "Body": "You should contac the professors. Once they tell you that you are welcome in their lab, then there is probably less to worry about.", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}}