{"0": {"Subreddit": "PhD", "Author": "thqrun", "Date": "1441102256", "Score": 2, "Body": "I was told that the majority of students come to campus and then meet with professors to discuss potential research projects before deciding on an adviser. I got here and before the first day of classes it seems every experimental group was full and the only available positions are in theory. I can't afford to work for free so I will have to accept the theory position. \n\nI like the professor well enough but I'm not wholly interested in the research and I don't have the experience or talent in coding like I do in SPM. I just kind of get this feeling of dread and I feel like I'm stuck.", "Permalink": "https://www.reddit.com/by_id/t3_3j3isv.json"}, "1": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1441171846", "Score": 0, "Body": "avoid knowing what you are doing and have something obscure to say that no one knows much about and make certain not to have much good advice and be able to talk for long periods of time while being bored at the same time but know a lot about something obscure that most people will never understand the relevance of in such a way that your students from your example will be able to tell the difference between a con artist and someone that knows what they are doing with you being an example of someone that knows what they are doing \n\nnever strive to be competitive in writing and never plan on being published to a large market and focus on obscure whenever possible and become allergic to fame and not being noticed at the same time", "Permalink": "https://www.reddit.com/by_id/t3_3j7xhm.json"}, "2": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1441177997", "Score": 1, "Body": "wow. is this a joke?", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "3": {"Subreddit": "PhD", "Author": "mck87", "Date": "1441181166", "Score": 2, "Body": "Break it down into sections (eg- background, objectives, methods etc), and break those down even further into smaller chunks and focus on those...before you know it you will have your proposal!", "Permalink": "https://www.reddit.com/by_id/t3_3j0nj8.json"}, "4": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": "1441215062", "Score": 1, "Body": "Thank you! I will try subheadings.", "Permalink": "https://www.reddit.com/by_id/t3_3j0nj8.json"}, "5": {"Subreddit": "PhD", "Author": "R3D0053R", "Date": "1441282014", "Score": 1, "Body": "Nicely resembles what you sometimes have to do with your work so you can at least try to get it through.", "Permalink": "https://www.reddit.com/by_id/t3_3jh8d1.json"}, "6": {"Subreddit": "PhD", "Author": "nearlyhugh", "Date": "1441305841", "Score": 2, "Body": "I don't think there is any problem with contacting researchers directly to ask if they have any budget for extra students. You could also try asking your current advisor if anyone in their network is seeking students.", "Permalink": "https://www.reddit.com/by_id/t3_3jhckb.json"}, "7": {"Subreddit": "PhD", "Author": "nearlyhugh", "Date": "1441305995", "Score": 1, "Body": "Is it possible to change groups at a later date? At my university it was relatively common.\nI would definitely advise against embarking on a PhD in a topic you are not enthused about.", "Permalink": "https://www.reddit.com/by_id/t3_3j3isv.json"}, "8": {"Subreddit": "PhD", "Author": "nearlyhugh", "Date": "1441306144", "Score": 1, "Body": "Assuming you are in the U.S. it is extremely difficult to get a tenured professor position, especially in popular fields such as literature where there is an abundance of graduates and few available positions (not to mention the practice of hiring several adjuncts in place of a tenured professor). Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_3j7xhm.json"}, "9": {"Subreddit": "PhD", "Author": "nearlyhugh", "Date": "1441306497", "Score": 1, "Body": "Excellent advice on all points.", "Permalink": "https://www.reddit.com/by_id/t3_3gcptr.json"}, "10": {"Subreddit": "PhD", "Author": "divB_is_zero", "Date": "1441332304", "Score": 4, "Body": "I think you need to take a step back here and ask yourself what you would have wanted in that person's situation. This new labmate hasn't had the same experiences you've had, and is probably really excited to be working on a project you've successfully initiated. Its not fair for you to essentially set this person back because that's what happened to you. In the interest of seeing your own project continue to succeed, and in the interest of this other human being, I think it's important that you help train your new labmate. In the end it will be the best experience for both you and the new person. ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "11": {"Subreddit": "PhD", "Author": "idealgrind", "Date": "1441336163", "Score": 3, "Body": "I would completely relate to how you're currently feeling if I were in your situation.\n\nHOWEVER... perhaps try reframing it. Think of it as an opportunity for you to break the cycle in this unhelpful lab. They're new, they don't know the lab's history and are probably excited to work with you and help you to see your project through. Put yourself in their shoes and think about how you would feel if someone didn't purposely help you as some sort of \"revenge\" or \"payback\" to the lab. This may have, in fact, been what happened to you!\n\nAlso, you helping to train this person might actually teach you something as well. If you were to go ahead and help them, despite what crap you've been through, I would think that is a really dignified and mature thing to do. You're extremely valuable to them at this stage and I think you should allow yourself that opportunity for someone to really respect you and be appreciative of what you do.\n\nYou obviously don't need to go all out, let them figure out some things on your own but perhaps teach them enough to get started. Also, if they end up being an unappreciative ass then you can probably resort back to your initial decision and just stop helping them. ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "12": {"Subreddit": "PhD", "Author": "almostphd", "Date": "1441344889", "Score": 1, "Body": "Thank you both for sharing your thoughts! I guess I should be a better person like my mama always tells me and break the vicious cycle. Hopefully my new labmate will be inspired by my good deeds and turn this lab into a less hostile place. ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "13": {"Subreddit": "PhD", "Author": "pisses_on_kittens2", "Date": "1441404577", "Score": 1, "Body": "Holy crap, did I black out and write this?!  You sound just like me and you've struggled with similar challenges I've been met with.  I'm in a lab right now where everyone else is working on an easy, already R01 funded project and I'm doing a pretty damn good job establishing my own project from scratch and all by myself.  I know you're probably just venting right now and you just really want someone to empathize with you.  I'll be the one to tell you that you're not a dick and you're not insane for your perception.  But let me remind you of some important things:\n\nYou've persevered.  You went through all of the pains of establishing a good question and figuring it out yourself.  THIS is what is deserving of a PhD.  Not what those glorified lab-techs are doing working on simply completing the aims of an already funded project and getting their hand held along the way.   Pat yourself on the back for that.  The adversity you had to overcome is undoubtably going to help you out in the future and you will likely soon come to appreciate the struggle you went through, although I understand it was a painful process.  But now you have the neuronal tracks established in your mind on how to do research from beginning to end.  \n\nWith regards to training the new student, let me remind you that information is a commodity in our field.  Knowledge is the currency of us PhDs.  So don't just blab away all your thought processes to this new guy.  But help him out a little.  Nobody wants to hold the guilt of being perceived as a dick who doesn't help anybody out.  Share with him the scientific facts, but let him figure out the process of connecting the dots on his own.  Honestly, it will be more  worthwhile to him.  If he succeeds with your project when you're gone, it means he busted his ass and is deserving of a PhD/decent paper.  If not, well, then he just wasn't meant to be a researcher. \n\nBy keeping these afformentioned things in mind, I am now more willing to help my labmates out.  They will appreciate it, too, and it will likely lead to a coauthor paper in the future.  Research is a game; play your hand wisely and don't show your entire hand.  Be strategic, but maintain decency.  This will ensure that people will want to work with you in the future because ultimately this is a collaborative field and it's a necessity to succeed.  ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "14": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1441407699", "Score": 1, "Body": "make change one thing about your life and see if you notice a difference", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "15": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1441467920", "Score": 0, "Body": "BTW: I noticed in the conversation that the guy mentions he has an MA from Cambridge. Little known fact, MA's are granted automatically to people who did an undergrad degree who (basically) managed to stay out of prison for 3 years afterwards and is willing to pay some small amount of money. In other words, an MA from Cambridge is more or less meaningless. \n\nEDIT: This is different from an MPhil which requires actual work and study to be done. ", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "16": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1441468370", "Score": 1, "Body": "Be aware that in many parts of Europe, especially the Netherlands, Germany and (I expect Belgium) PhD's are treated as employees by the university, wereas in the UK, PhD's are treated as students. This has all sorts of flow on effects. For example, for inexplicable reasons, insurance companies will often refuse to offer contents insurance for a student. They instead want you to use their much more expensive \"student cover\", which is completely inappropriate for a fully functioning adult (as apposed to an undergraduate student). ", "Permalink": "https://www.reddit.com/by_id/t3_3bqe7i.json"}, "17": {"Subreddit": "PhD", "Author": "ddtotz", "Date": "1441483400", "Score": 2, "Body": "I was hoping to find some advice myself, but since I'm a little further along than you I'll share what I know:\n\n1. Make your intentions known. (Yes, some people will tell you it's a bad idea. Welcome to being a young person with career ambitions.) Talk to your professors and TAs (especially your favorite ones), and ask them for advice. Get involved with other people who are pursuing graduate school as well.\n\n2. Take your term papers seriously. One of these may serve as your writing sample.\n\n3. See if you can do research. Often times you can do an honor thesis, or your school might have an undergraduate research symposium or journal.\n\n4. Figure out what you might want to study in graduate school. This is the hardest part, and I'm still in this phase. If you have to take classes as a non-degree seeking students for a little while, so be it. This is what will really set you apart from other candidates, as a lot of people straight out of college don't know what they want to study and just apply. Lots of people want to study gender and lots of people want to study Jane Austen. If you just want to read lots of books consider getting an MA. Part of getting a PhD is contributing a new perspective, and that's tough work. But if you can show the faculty at the school of your dreams that you know what you want to do, and more specifically, you know how their research, expertise, and resources can aid you in this pursuit, you have a much better chance of getting in. \n\n5. Don't pay for your PhD. \n\n6. Don't let negativity get you down. A lot of people in academia are jaded (and pretentious). People in other disciplines will snub their noses at you. But lots of other people will help you develop your mind and spirit. Do what you love and be realistic about your career options. [This article might dispel a lot of those myths about employment.](http://www.psmag.com/books-and-culture/why-you-should-go-to-graduate-school-in-the-humanities-59821) I got my degree in creative writing and I am over-employed as a freelancer. How is that? How could someone with an interest in literature and writing make any money? News flash: if you are positive, determined, and reasonably intelligent, you will probably find a way to feed yourself. I know getting my PhD won't hurt my career options. It will open some doors and close some others. \n\nSo that’s all I got to say about that. If someone with a PhD in English (or an advance degree in any of the humanities) actually chimes in, ignore my two cents!", "Permalink": "https://www.reddit.com/by_id/t3_3j7xhm.json"}, "18": {"Subreddit": "PhD", "Author": "manhattanhs", "Date": "1441488630", "Score": 1, "Body": "Thank you so much for your response! I'll be thinking about what you've said in the coming year and try to figure out a more concrete plan for my academic career. You've certainly given me some hope. I don't often hear or read many positive responses to my intended career path. ", "Permalink": "https://www.reddit.com/by_id/t3_3j7xhm.json"}, "19": {"Subreddit": "PhD", "Author": "dvoted", "Date": "1441504430", "Score": 2, "Body": "Most likely. I was in the same situation as you. Although, I have a Masters Degree in Law. My PhD Thesis is on Legal Philosophy and because I don't have that research backgroun they want me to do a Masters of Philosophy (MPhil) then go into my PhD (either half way through my Thesis or after I graduate in which I will continue to write the Thesis written in my MPhil.) ", "Permalink": "https://www.reddit.com/by_id/t3_3jrj89.json"}, "20": {"Subreddit": "PhD", "Author": "chiefoverlord", "Date": "1441535697", "Score": 1, "Body": "not sure what you mean... it's not a joke, real conversation with a guy who works at an essay mill. the whole topic gets me angry which i guess is why i pursued the fellow so rabidly. but i thought others might like to know this type of stuff goes on at the phd level - people outright buying their degrees.", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "21": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1441543021", "Score": 2, "Body": "did some research. a lot of complaints from people paying this 'stratos' guy money and not getting anything in return", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "22": {"Subreddit": "PhD", "Author": "armorandsword", "Date": "1441545498", "Score": 1, "Body": "It sounds like you feel aggrieved at not receiving much support and help from your labmates and feel that you'd be justified in not helping a newcomer. You can probably make all the difference to the newbie and give them a god head start, perhaps the one you deserved but didn't get.\n\nAll in all, since you're nearly done with your PhD it's not worth getting sidetracked and wasting too much time helping others so that you end up finishing later. But it would be unfairly spiting the newcomer to withhold valuable support and advice. ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "23": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1441547357", "Score": 4, "Body": "Apply for a Masters (Research) and upgrade to a PhD at your confirmation.", "Permalink": "https://www.reddit.com/by_id/t3_3jrj89.json"}, "24": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1441551472", "Score": 5, "Body": "I'll try to spare you the gory details, but I have  a similar story to yours and am now at the end of the PhD process. Short version is, I did a 5 combined mechanical engineering / computer science degree which, for various reasons took 8 years to complete, but I finished with about 4 years of industrial experience.  5 + 4 = 8. Win. I then spent some time working in a good job in the finance sector, R&amp;D role, very technical, great company, good pay. Sounds perfect, but I got bored and wanted to move to greener pastures. Similar story. I always toyed with the idea of doing a PhD so I packed up life in Oz and moved the the UK. I'm now 3.75 years in to a 4 year PhD. Trying desperately to finish. Some things that occurred to me along the way that may or may not be helpful to you. \n\n1) Typically speaking, having a PhD limits your job prospects afterwards, it does not expand them. The vast majority of jobs (outside of academia) require a bachelors or masters degree.\n\n2) In then end, with a PhD, you'll end up being paid by advertising (google, facebook etc), big pharma/medicine, finance or military. Those are the places that have the money and care about really pushing boundaries. Everyone else will wait around for the new advances to come. \n\n3) Academia is a giant Pyramid Selling scheme. Proffs need a certain number of Snr Lecturers to get by, Snr Lecturers need a certain number of Lecturers to get by, Lecturers need a certain number of PostDocs to get by, PostDocs need a certain number of PhD's to get by and so on. Most lectureships are 20:1 over subscribed by PostDocs which are probably 10:1 oversubscribed by PhD students. That means you have 200:1 shot at a lectureship. Not good odds. \n\n4) Going directly into an industrial position will save you time and money. In my field, I could be earning $100-200K if I worked at any one of the big 4. This value really doesn't change much if you have a PhD or not and the 4+ years you spend on to get a slightly more senior role could have been done in ~= 2 years if you'd stuck around in industry. This means you'll waste 4x$150K - $0*+ 2 years on doing the PhD. Not much incentive. *$0 = approximate income of a PhD\n\n5) Before you start on the PhD path, you need to ask yourself, \"why?\". \"why should I do a PhD and what good will it bring me\". Perhaps read the book \"A PhD is not enough\" (http://sceomasincukraljevo.blog.com/files/2011/04/di-0356.pdf, http://www.amazon.com/PhD-Is-Not-Enough-Survival/dp/0465022227). So, the question is, what good will the PhD qualification give you that you wouldn't otherwise have. For me, I want to teach, at a university level. There's just no way to do that without a PhD. I feel that teaching and inspiring new students, moving the best knowledge that we have into the best minds that we have so that we can develop more good knowledge and maybe I can add a little bit to our pool of knowledge as I go is that best thing that I can do for us all humans everywhere for all time. You know, so that my short time on this planet isn't too wasted. I'm also delusional, so your priorities may vary. But for me, there just is no other pathway to what I want to do than having a PhD. \n\n6) Doing a PhD is a lot of fun. You get nearly complete freedom to pick and choose your direction and your research. To choose interesting paths and directions which you just can't do in industry. It's awesome. \n\n7) It's also a hell of a lot of work. You'll be \"paid\" less than minimum wage to work 40-90hrs a week and for the entirety of the PhD period you'll have a growing weight on your shoulders about finishing. \n\n8) One other thing that surprised me is that I spend about 50% of my time on marketing and advertising. Yes that right, I have to market myself and my research to the community so that they will accept my ideas/publications in the future. This means going to conferences at exotic locations (fun - I've traveled from Hong Kong to Helsinki, Bordeaux to San Francisco, all on other peoples money) but also gruelling (typical conference hours for me are 7:30am to 1:30am for 5-6 days) and preparing slide deck after slide deck, presentation after presentation and poster after poster (really boring). \n\n9) If you are headed for the BioTech industry you might want to look at/consider Cambridge. With Astrazeneca moving here there are tons of BioTech startups all around here hoping to get acquired. One of the great things about Cambridge is that (subject to your funding arrangement) you get to own any IP that you generate and if you play your cards right, doing a PhD can also be a good place to start the ideas that will form your company. Cambridge is also at an advantage in this regard because there is a lot of start-up funding around for that sort of thing. \n\n10) Finally, as a mature student with a bunch of industrial experience you will find the PhD experience very different to those coming straight out of a masters. On the one hand, you will be treated like a child again, and a lot of the things you take for granted (like having house contents insurance) become hard/impossible/really really annoying. On the other, you'll be faster, more efficient and more disciplined with more realistic goals and motivations. Lots of recent undergrads/master students find it hard to \"come to the office\" from 9-5 (ok realistically 10-8pm) whereas you will not. You will also be in a great position to win prizes and awards simply by having a little more experience in working and presenting your work, and you will do work that is more applicable to industry so it will be more \"relevant\" with more possible \"tech transfer\" which universities and funding grants like. \n\nSo yeah, think hard about if you want to do it and why and if you do, there are good things and bad things, things that will make your life/career better and things that will make it worse. \n\nTL;DR - it depends.  \n\n", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "25": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1441558304", "Score": 0, "Body": "(3) is a lie. A total lie. It's a lie sold by universities and professors to potential PhD students to keep the numbers up. In all but a select few fields (computing, biotech/pharma), having a PhD makes you over qualified. I'm lucky, I'm in computing with experience in finance, everyone wants that, my SO is in social sciences, so yeah, not so much. Virtually nobody wants to employ a PhD when they can employ an bachelors instead (even if you are willing to work for the same money!). \"You're overqualified for this job\" and everyone wants people with \"experience\". Having a PhD means that you have, you guessed it, 0 years experience, and you are 3-4 years older which means (if you're a woman) closer to child bearing age. Having a PhD is not rare, nor sought after outside of academia.\n", "Permalink": "https://www.reddit.com/by_id/t3_3hfny4.json"}, "26": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1441558565", "Score": 3, "Body": "Can report, not better in Europe.", "Permalink": "https://www.reddit.com/by_id/t3_3e4qcd.json"}, "27": {"Subreddit": "PhD", "Author": "island-boy", "Date": "1441561515", "Score": 2, "Body": "Whoa! Where do I begin. Thanks for a start!\n\nYou really managed to hit the nail on the head in a couple of your points. \n\nAt this point in time, right now, I just feel like raw research is my calling. I feel I owe it to myself(/the world?) just because I've still got so much inner passion for it.\n\n*Having said that*, I won't be pursuing a PhD if I come to the realisation that it would end up jeopardise my medium/long term career prospects. I definitely find the *idea* of sticking around in academia a romantic one, but the stats are what they are (as your rightly pointed out), and thus the need to think about an exit strategy. \n\nThe fact that I'd be locked away in an ivory tower away from the real world for a good 3-4 years, the fact that my earning power would take a serious hit, and the fact that I'd be in my early 30s when I'm done are all very real concerns of mine. I'd rather not do a PhD and have a sustainable career, than spend 3/4 years having the time of my life followed by a lifetime of hardship out in the real world. Granted, not every PhD who exits into industry is relegated to a lifetime of doom and gloom, god forbid.\n\nBottom line, I'm willing to put my career-progression outside academia on hold for 3/4 years in the name of science. But no longer than that. \n\nThe ideal scenario would be to complete my PhD and then leave academia to land some Cambridge startup/tech consultancy/finance/military position where my title could unlock the door to actually putting my raw science skills to use, work on something cutting edge/innovative, and not end up a paper-pusher (my current role in a nutshell). From your experience/network, is this wishful thinking?\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "28": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": "1441643510", "Score": 1, "Body": "Another factor is the ageism prevalent in hiring for tenure track. illegal and unethical but common. How old are you?", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "29": {"Subreddit": "PhD", "Author": "luis_nando", "Date": "1441662363", "Score": 1, "Body": "My 2 cents. I am a PhD student and I use lobreoffice occasionally. All my computers at home runs Linux. The problem is that both WPS and lobreoffice lack in some aspects. WPS cannot run Mendeley or any other reference manager, lobreoffice does not offer an outline view, which is central on my work flow.\n\nSo the problem is not that people you find you strange or a nerd, you might already be or look like one😊, but that this software really lack in function.", "Permalink": "https://www.reddit.com/by_id/t3_3harh6.json"}, "30": {"Subreddit": "PhD", "Author": "dt084", "Date": "1441818781", "Score": 1, "Body": "What types of PhDs do you recruit?", "Permalink": "https://www.reddit.com/by_id/t3_3k9fzt.json"}, "31": {"Subreddit": "PhD", "Author": "RBellani", "Date": "1441821635", "Score": 2, "Body": "Go to: \nhttps://www.reddit.com/r/consulting/comments/3k9ari/i_recruit_phds_and_mss_to_consulting_firms_ama/ \n\nfor the full discussion. Separately, every type - just needs to want a job outside of academia, be smart, quick, have great personal skills and like breaking down problems. That's just for consulting roles though. Oystir.com has a TON of different jobs - it's there to help PhDs find what job they would be competitive for!", "Permalink": "https://www.reddit.com/by_id/t3_3k9fzt.json"}, "32": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": "1441902917", "Score": 2, "Body": "I agree with nearly everything you say, but why do you say 0$ income during the PhD?  \n&gt; *$0 = approximate income of a PhD\n\nMy friends in the UK say the stipends are 15k GBP, untaxed. Not that it significantly affects the outcome, but it's certainly not 0!", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "33": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": "1441952076", "Score": 4, "Body": "Several solutions exist: Mendeley, Zotero, etc. They can also generate bib files if you use LaTeX, and have plugins for LibreOffice/Word if you go the hard way and don't use LaTeX. \n\nWhat these software do is actually automatically getting the metadata from the PDF articles and store them in your personal database. You can then see 'all papers by x', 'all papers on that topic', etc. Using the annotation system you can mark them as read or not + put your own notes/remarks/summary. And even share that with other users !", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "34": {"Subreddit": "PhD", "Author": "ithilmor", "Date": "1441955243", "Score": 2, "Body": "I use endnote", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "35": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": "1441973558", "Score": 0, "Body": "Am I doing something wrong or do you only post jobs in the US?\n\nEdit: feedback: the skill bubbles are very easy to use, and I found that the levels of skills mostly made sense. The filter returned me a ton of jobs, and the search results looked relevant to my interests, but I was disappointed to find that they were US only. You might want to make it more clear that this is an American site - it has an international look, and I think most PhD grads are used to thinking about their careers on a global scale. \n\nThe filter could be better managed as well. Instead of a vague list, it would be nice to have a click-type interface like the results section, with different job types broken down by category. \n\nThis is the beta, I guess, so I'm not disappointed that the \"Resources\" section is so sparse, but if I paid for this I would be pissed. \n\nThe \"Events\" section is huge, though, and full of what looks to be good info, but it's hidden under those other sections that are mostly links to powerpoints and AMAs. I would put those webinars somewhere a little more prominant. \n\nIn these AMAs you keep claiming that your motivation here is to get people into sweet jobs, or whatever, but this is just in no way credible. It would help adoption a lot if you were upfront about your business plan. Are you harvesting contacts of highly educated people? Will you have a long free beta to drive adoption and then charge for a premium account or something? Will you keep the site free, but try to sell advanced resume services? Are you charging companies to better their search rankings? I signed up with a fake name and a junk email becuase it's not clear to me what kind of business you're running here. I hope that most trained scientists are fairly skeptical of silicon valley types hyping their urgent need to help humanity. Let us know what's in it for you and we can then make an informed decision to use the site or not. ", "Permalink": "https://www.reddit.com/by_id/t3_3k9fzt.json"}, "36": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": "1441974481", "Score": 1, "Body": "Just becuase you're surrounded by dicks doesn't mean you should be one too. ", "Permalink": "https://www.reddit.com/by_id/t3_3jjvo0.json"}, "37": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": "1441974789", "Score": 3, "Body": "Menedeley for me, alot of my colleagues now use it too.\n\nLoads of brilliant features like auto watching folders, mark as read, DOI/PMID lookup (usually the best option, the auto feature can be a little sketchy), complete author list (not just first author), ability to add favourites, cloud sync options.\n\nThe word plugin is great and ability to export a .bib for use with LaTeX was a godsend during my write up.\n\nBest of all, it's free. ", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "38": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1441982241", "Score": 3, "Body": "EndNote", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "39": {"Subreddit": "PhD", "Author": "GP4LEU", "Date": "1441987862", "Score": 2, "Body": "Could you or /u/ithilmor elaborate on how to use endnote for this purpose? I have used it quite a bit, but my experience with endnote has been primarily with citations.", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "40": {"Subreddit": "PhD", "Author": "HAL9000000", "Date": "1441998783", "Score": 4, "Body": "I never left my PhD program and I eventually finished. The problems I had were not exclusively problems with the program but I wish I'd listened to my instincts which told me I was in the wrong place.\n\nMy advice: it is a long, hard struggle to finish. If you (or your \"friend\") or whoever...is having a hard time for whatever reason and you have a different option, just do it.  It's too much time and trouble to climb up a ladder that you don't want to be on.  Go back to the bottom of the new ladder and figure it out (or consider quitting grad school entirely).  There's no shame in leaving and/or quitting.  You've already accomplished a lot, as demonstrated by the decision someone made to accept you.  Just follow your heart where you want to go.\n\nYou could also consider asking for a bit of time off to do something else and think about it.  If it's a good program they should let you come back if you later decide you want to be there.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "41": {"Subreddit": "PhD", "Author": "pisses_on_kittens", "Date": "1442004106", "Score": 1, "Body": "This one is nice.  Thank you.  ", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "42": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": "1442011582", "Score": 2, "Body": "There is an attribute for research notes. I use smart groups to auto search terms in the citation (definitely wish it would search attached PDFs). You can then mark when they are read easily. It's easy to generate citations using their browser bookmark. I also created a Wikipedia extension that adds a link next to references on the Wikipedia page. When clicked, it'll generate an endnote file to import. \n\nMy school requires a docx and endnote's integration is pretty awesome. The bibliography is perfect for my needs. Yours may vary but it supports multiple styles. \n\nEdit: some words ", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "43": {"Subreddit": "PhD", "Author": "mzaber", "Date": "1442062758", "Score": 2, "Body": "There are (roughly) 3 components to a PhD--classes, research, and teaching. For me, I was not great at the classes, but luckily those only last the first couple of years. About half of my cohort dropped out which made those classes pretty lonely. I was able to get enough enjoyment out of teaching/TAing to make it through to research, my true love. If your friend is similar, \"it gets better.\" But if the struggles are research-based, it might be worth reconsidering. Transferring really means starting over so I wouldn't recommend it. Best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "44": {"Subreddit": "PhD", "Author": "Domenica187", "Date": "1442104111", "Score": 2, "Body": "Thanks for your insight.  I really appreciate it.  The thought to ask for some time is a really valuable one.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "45": {"Subreddit": "PhD", "Author": "Domenica187", "Date": "1442104276", "Score": 2, "Body": "Yeah--so as I'm sure it was apparently, \"my friend\" is me.  I love teaching and classes are manageable. The research is what has me feeling stuck and confused. I'm really riding the struggle bus--I want to figure out what I want without wasting too much time.  Thanks for your insight and sharing your experience.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "46": {"Subreddit": "PhD", "Author": "0rwcky", "Date": "1442209162", "Score": 3, "Body": "I started a PhD that seemed perfect for me, and left after one semester. It was immediately clear that it was NOT a good fit for me in terms of the institution--the match between me and faculty couldn't have been more perfect, but I just knew it wasn't going to make me better in my field, and I had some real issues with the way the institution approached the learning process. There were a lot of issues, but I won't bore you with the details. Decided that rather than waste the time of my supervisors (and my own time) and funding that could go to someone who would actually flourish there I would do the difficult thing and leave.\n\nIt was a good decision, and my supervisor actually wrote one of my letters of rec when I started applying to other programs 1.5 years later. I still keep in touch with them they have my utmost admiration, still. After that I never thought I'd get in anywhere else, but I was accepted to every program I applied to, all with full funding and more. I learned so much from that first experience that I'm now in the first semester of a program that I know is a really good fit for me. I'm only three-ish weeks in, and although it's stressful and hard, it's NOT the same feeling.\n\nIt's one thing to be overwhelmed or unsure about things in the process of adjustment, or to go through times of doubt and depression/anxiety, but if you just *know* in your bones that this isn't right for you--ahem, I mean your friend--please don't let fear make your decisions for you. Fear of not having another opportunity, or looking weak, or anything else. If you are certain it's not a good fit and that you won't be happy there for 4+ years, it's far better to get out now.\n\nJust my 2c", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "47": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": "1442238963", "Score": 1, "Body": "Satirical joke. But seriously:\n\na) you need to be lucky enough to get a funded position, this is not that easy in the sciences, but next to impossible in the arts/humanities. Otherwise your income is actually $0.  \n\nb) 15k is pretty high. The official rate at my university is ~11k. (15K might be the London salary?)\n\nc) The town that I live in is very nearly as expensive as London (because it's relatively close and now seen as a commuter belt)\n\nd) From the 11K that I get, I need to find about 3k each year to \"loan\" the department to pay for my travel expenses. This takes 3-9months for them to refund, which means by the time I'm refunded I have to find it again to pay for the next round of conferences/travel. \n\nSo, all told, 8k a year is only just barely enough to survive. Before you say it, the University explicitly forbids me from working to cover any shortfall. ", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "48": {"Subreddit": "PhD", "Author": "tiny_cheese_merchant", "Date": "1442241356", "Score": 1, "Body": "Are there examples in the literature of similar extraction methods used on other datasets?", "Permalink": "https://www.reddit.com/by_id/t3_3kvtmc.json"}, "49": {"Subreddit": "PhD", "Author": "spookyrufus", "Date": "1442256349", "Score": 1, "Body": "Eh not that I know about. Somehow I was hoping that I could be pointed to similar existing examples.\nThe problem is that my tool is not particularly appealing to an IT audience, as it doesn't contain any 'new' thing, but it may be of great appeal to oceanographers, which yet are not interested in the implementation details, so I don't know what kind of connotation to give to the whole extended abstract.", "Permalink": "https://www.reddit.com/by_id/t3_3kvtmc.json"}, "50": {"Subreddit": "PhD", "Author": "almostphd", "Date": "1442283924", "Score": 1, "Body": "I like Zotero because it's free and has a nice integration with Firefox  ", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "51": {"Subreddit": "PhD", "Author": "congruous_nz", "Date": "1442290505", "Score": 3, "Body": "I was never really interested in my PhD to begin with; I took it on because I was offered decent funding. The first year was fine, but I spent the next three rather depressed and wishing I could quit. I did not quit for the reasons you raise. I was not that courageous. \n\nMy feeling is that the sooner you quit or transfer, the easier it will be.  I found that one of the most difficult things for me was people constantly 'pressuring me' with questions about my PhD and asking when I was going to finish it. Those closest to you are the most annoying and it's a really horrible burden feeling you absolutely must finish it or you will everyone down, especially yourself. It can be really hard to keep your confidence up, even if your work is excellent, until you get that first publication accepted, which may not happen until a very late stage or even after your degree is awarded (of course, publication is not compulsory in many programs). \n\nI did fine and published far beyond my expectations. But now I'm on my second postdoc and am still miserable because I work in an area I am not at all passionate about. \n\nAnd I can't quit, because of those very issues you raise ... I'm too invested now and I'm stuck in an area that bores me to death and offers almost zero stimulation.\n\nGet out early if you're not feeling it. All the best with whatever you decide.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "52": {"Subreddit": "PhD", "Author": "Domenica187", "Date": "1442292213", "Score": 3, "Body": "Thanks.  Your insight and experience is worth more than 2c!", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "53": {"Subreddit": "PhD", "Author": "Domenica187", "Date": "1442292270", "Score": 3, "Body": "Thanks for your honesty.  Truly appreciate hearing about your experience.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "54": {"Subreddit": "PhD", "Author": "brimacki", "Date": "1442335105", "Score": 3, "Body": "Research is a *huge* struggle regardless of how good/smart you are because you're always attempting to push the boundary of knowledge. If you don't enjoy that, then a PhD probably isn't for you, but you should probably stick it out a little longer to see if you enjoy it. The learning curve is very steep at the beginning because you have to do literature reviews, familiarize yourself with the lab equipment, learn the code/software your group uses, whatever...\n\nIf you find it's not for you, then maybe get a Master's degree and go teach.", "Permalink": "https://www.reddit.com/by_id/t3_3kk6sl.json"}, "55": {"Subreddit": "PhD", "Author": "speedz1", "Date": "1442465300", "Score": 3, "Body": "Ive sat in as an observer at some of these meetings and i can tell you that some people are just very critical. Dont take it personally. IMO the proposal is jus to make sure you know what your doing at this level. I think the real work is still to come in actually doing the phd. Dont feel bad, it is an achievement getting past a bunch of these  people. Focus now  on completing the phd. Well done!", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "56": {"Subreddit": "PhD", "Author": "brimacki", "Date": "1442470192", "Score": 1, "Body": "Can you work at national science research labs in the UK (or Europe as a whole) with just a masters degree? In the states you can, although much of the work will be assigned by someone with a PhD. It will be more open-ended work though (sounds like your biggest complaint with your current work). Getting a PhD won't change how industry is run if you just go back to industry.", "Permalink": "https://www.reddit.com/by_id/t3_3jrkh5.json"}, "57": {"Subreddit": "PhD", "Author": "tiny_cheese_merchant", "Date": "1442479822", "Score": 5, "Body": "Firstly, congratulations on getting this far already, you must be very determined and have worked hard to be accepted into a PhD programme.\nA couple of observations I have from attending these proposal meetings as well as doing one myself;\n1) Some Professors/academics love the sound of their own voice so they will be critical no matter what.\n2) Don't ever take it personally, it is hard to do but you are going to receive a lot of criticism on your work, e.g. drafts from supervisors, journal reviewer comments, academics at conferences. The less you take personally and the more you look at it objectively the easier it is to not let it bother you.\n3) re your adviser, some go for the arm around the shoulder, others are distant and give virtually no feedback, at the end of the day the PhD is for you, noone else\nThere are many ups and down in PhD life but keep going /u/sujini2 , I have had arguments, tears and felt like quitting but it's all part of a shitty cycle that most Phd students go through. FYI I am about 6 months out from handing in my thesis, I started in early 2013. Best of luck mate", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "58": {"Subreddit": "PhD", "Author": "tiny_cheese_merchant", "Date": "1442480107", "Score": 1, "Body": "Unfortunately existing examples would be well out of my knowledge area (Physiology) so I can't help there. If it is \"pioneering work\" i.e. noone is using this method in the field I would position it in that way, point out it's usefulness in other fields (cite examples) and how that is transferable to the field you are using it for. Also don't be afraid to contact experts in your field for some advice, I have always found that they are very receptive to PhD students that have well considered questions.Hope this helps", "Permalink": "https://www.reddit.com/by_id/t3_3kvtmc.json"}, "59": {"Subreddit": "PhD", "Author": "beardyman901", "Date": "1442496517", "Score": 1, "Body": "Mine was very anticlimactic. I expected it to be much harder with tons of criticism, but it just felt like a normal seminar meeting that I overly prepared for.", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "60": {"Subreddit": "PhD", "Author": "sujini2", "Date": "1442510993", "Score": 1, "Body": "Thanks so much for your words of wisdom. Good luck to you too! ", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "61": {"Subreddit": "PhD", "Author": "sujini2", "Date": "1442511007", "Score": 1, "Body": "Thank you! :)", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "62": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": "1442553956", "Score": 1, "Body": "This is what I did. I was working during my Bachelor, so got poor grades (not 1st class Honours thing universities ask you to have to go from BSc straight to PhD). I worked for 3 years post graduation and hated it, so I decided to give uni another shot but as a full time student. I applied for a Master by research and upgraded to PhD after a semester. ", "Permalink": "https://www.reddit.com/by_id/t3_3jrj89.json"}, "63": {"Subreddit": "PhD", "Author": "spookyrufus", "Date": "1442566854", "Score": 1, "Body": "Thank you. \"Unfortunately\" I already defended my PhD earlier this year, so I've noticed how professors are much less receptive to my questions.\nI still believe that the question is relevant though, because I haven't had any experience in writing similar articles before.\n\nThe main point is that everything is really quite trivial, both the way that I extract the data with, and the usage for it (we are talking basic meteorological measurements here, of clear importance for anyone in the field.\nBeing quite of a niche dataset, the point of the article would mostly be 'hey guys, here's what I made, it solves an easy but relevant problem', rather than 'novel method to extract this type of data'.", "Permalink": "https://www.reddit.com/by_id/t3_3kvtmc.json"}, "64": {"Subreddit": "PhD", "Author": "cramur", "Date": "1442752465", "Score": 1, "Body": "Have you read a book \"a PhD is not enough\"?", "Permalink": "https://www.reddit.com/by_id/t3_3lnp4n.json"}, "65": {"Subreddit": "PhD", "Author": "tsonguyen", "Date": "1442768617", "Score": 1, "Body": "I have... Skimmed it. Read it shortly before my defense actually.\n\nI've done some soul searching... Doesn't look like I'll stay in academia.", "Permalink": "https://www.reddit.com/by_id/t3_3lnp4n.json"}, "66": {"Subreddit": "PhD", "Author": "cramur", "Date": "1442773351", "Score": 2, "Body": "Go to the industry then. \n\nI mean, you are not really detailed here :)", "Permalink": "https://www.reddit.com/by_id/t3_3lnp4n.json"}, "67": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1442786685", "Score": 1, "Body": "http://www.ehow.com/how_5516837_start-accredited-online-college.html\n\nIt doesn't say but I was under the impression that only a PhD had the authority to do it.\n\nThe only reason I could ever think of to get a PhD would be to start a University. \n\nYou qualify.\n\nI would consider you foolish if you didn't. Starting a University is the only reason I can think of to get a PhD.\n\nThat is for me though.", "Permalink": "https://www.reddit.com/by_id/t3_3lnp4n.json"}, "68": {"Subreddit": "PhD", "Author": "polyphonal", "Date": "1442824143", "Score": 6, "Body": "A PhD is nothing like undergrad.  Coursework is a very tiny part of a PhD - I think that in the U.S. it's something like a third of the time of a PhD (I'm sure someone else can provide a more accurate value) and in some places there is in fact no coursework involved at all.  As you've ascertained, a PhD is *all* about your research - the goal is to learn to work independently, to contribute new knowledge to your field of expertise, and to publish your work to share it with other researchers.", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "69": {"Subreddit": "PhD", "Author": "sadmoody", "Date": "1442826414", "Score": 7, "Body": "PhD's are heaps looser than undergrad. You set your own deadlines. You find the journals or conferences you want to aim for and then try to enter into them. You're largely in charge of what your coursework is and what you're wanting to achieve.\n\nIf you don't know *why* you want to do a PhD, then don't do it. It really sucks some of the time and if I didn't really want it, I don't think I'd be able to get through those days.\n\nIt's a totally different environment. The undergrads will get younger and younger to you with every passing year and you won't be able to relate to them so easily. You'll also walk out of a PhD with fewer job opportunities than when you entered. So be careful that you aren't getting over-educated. I know some people who've had to lie about not having a PhD in order to get a job.", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "70": {"Subreddit": "PhD", "Author": "talammadi", "Date": "1442849140", "Score": 1, "Body": "Original url https://www.reddit.com//r/AskReddit/comments/3hw3vu/phds_of_reddit_what_is_a_dumbed_down_summary_of/", "Permalink": "https://www.reddit.com/by_id/t3_3lsp0t.json"}, "71": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": "1442866446", "Score": 4, "Body": "&gt; Don't get me wrong though, aside from the structure of academics...\n\nThere is so little strucutre in a PhD that I thought you were trolling for a moment", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "72": {"Subreddit": "PhD", "Author": "congruous_nz", "Date": "1442901025", "Score": 1, "Body": "No one really ever congratulates you on much besides a) getting your first publication accepted [in a *good* journal] b) passing your PhD viva.\n\nAll the rest of it is fairly standard stuff so don't sweat it. There are many ups and downs to come so get used to it and try to focus on the fact that there will be PLENTY of extremely rewarding moments; the tough thing is that they can take quite a while to arrive.\n\nIf you love your area of research and feel that you are making a contribution then that's the main ingredient you need to be successful. Oh - and good advisors :)\n", "Permalink": "https://www.reddit.com/by_id/t3_3l8k6p.json"}, "73": {"Subreddit": "PhD", "Author": "congruous_nz", "Date": "1442901560", "Score": 1, "Body": "You basically spend 4+ years doing whatever you want. No one cares when you come or go, except for when you're doing lab/field work and someone is relying on you for something. You might meet with your advisors regularly and they might ask how things are going, then again, you may not hear from them for months at a time. \n\nThere are very few goals throughout and you will generally have to set them yourself. You can set the bar higher by being ambitious with analyses for conferences and publications, but you're still going to be managing everything yourself and there are always extensions when it comes to abstract deadlines and manuscript revisions. \n\nYou have to self-manage all the way through and if you are not suited to this type of work style, then you'll be even more depressed than the rest of us :) Sounds like it's not for you.", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "74": {"Subreddit": "PhD", "Author": "OskiBrah", "Date": "1442907209", "Score": 1, "Body": "Does this mean you have a lot of free time or are you very busy? How much work do you put in a day towards academics? \n\nAnd, do you think getting a masters would be better for me?", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "75": {"Subreddit": "PhD", "Author": "armorandsword", "Date": "1442922284", "Score": 2, "Body": "It's normal to be apprehensive about starting new things, and a PhD is no exception as it's a significant personal, time and sometimes financial commitment. \n\nHowever, it sounds like the issues you've experienced are more severe than the usual first days butterflies and it may be a good idea for you to seek additional help. Do you have an adviser, PI or counselor you can speak to?", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "76": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442924446", "Score": 2, "Body": "As I haven't completed registration yet I don't have access to the college counselors yet. I could talk to my PI, but if I do and he assumes that I'm quitting then what then? I'm quite confused, I don't know what I'd rather do but I don't feel I can continue like this", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "77": {"Subreddit": "PhD", "Author": "armorandsword", "Date": "1442925567", "Score": 1, "Body": "Unless you tell him that you're quitting, he won't assume so. Do you have a history of suffering from anxiety or depression? You may want to speak to a doctor as well.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "78": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442926957", "Score": 2, "Body": "I have gone through periods like this before,  I've never been clinically diagnosed with anything but maybe I do. Ive been talking to my friends and parents and have  come to the conclusion that ill give this until the end of October. If I still feel the same then I'll move on.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "79": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1442927632", "Score": 6, "Body": "Only you know the answer buddy. We can give you advice, but in the end you are the only one who knows what to do.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "80": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442930817", "Score": 1, "Body": "I know, thank you all for your advice, I'm just completely worn out at the moment.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "81": {"Subreddit": "PhD", "Author": "nhmo", "Date": "1442931620", "Score": 2, "Body": "&gt; Since I started my undergrad a PhD had been my goal but now that I'm here I just want to get out and get a normal job.\n\nI know that feeling. It sucks being around friends that are already on their successful paths while you still are struggling with academia. It's normal.\n\nSo here's my advice to you. Don't compare yourself to other people. There is always someone who is going to be better than you at something. Think long and hard--why do you want a PhD? What do you want to do with it?\n\nTrust me, if you stick with it, you might be jealous that other people have normal jobs, but there are going to be tons of people jealous at you for pursuing a PhD. \n\nAnd in the end, if you decide that it's not right for you--that is 100% OK. Don't beat yourself up over it. There are lots of people that make that mistake way too late in their program. \n\nBut before you make a quick decision, give it some time. Give it a proper try and reevaluate after the semester or year. You'll know deep inside what you want to do.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "82": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442932241", "Score": 1, "Body": "I've been asking myself those questions. I don't have a good answer for either of them. My initial reason for doing the PhD was because I thought I enjoyed what I would be doing and that I wanted to help discover knowledge that might help people somewhere down the line. I'm starting to realize I'm alot more selfish then that. I just want to live my life and be happy. I don't even know if its worth giving it a try until the end of the semester, I just feel so upset.  ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "83": {"Subreddit": "PhD", "Author": "insomniac365", "Date": "1442932608", "Score": 1, "Body": "Is this past me from a month ago? I felt this way too when I first started. I think it is mostly because it was a lot of changes all at once. I left my friends and family to come to this new PhD program and am now surrounded by very smart people! It is scary and I can't go home and talk to anyone about it because I don't have anyone here. It is rough. I don't know, unless you are doing your PhD in the same place as your previous degree, you likely did the same thing. Since this overwhelmed feeling I have started lab rotations with a PI I like, have made some friends and have settled into somewhat of a new routine (I'm a routine kind of person). I don't feel as scared, lost, and overwhelmed as I did when I started but it is still there. I personally decided to give it 2 years and if I still hate it, I'll get a terminal MS and call it quits. Thinking of an \"escape\" or \"backup\" plan really helped calm my mind. I am young, I am single, and I am getting paid to do this. I am giving up nothing but my time and energy at this point and I'm OK with spending 2 years making sure this is what I want before I quit and that way, at least I'll have something at the end of my time.  I'm not sure if that helps you but that is my plan and backup plan and now at least know you know there was one stranger on the internet who felt the same way you do. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "84": {"Subreddit": "PhD", "Author": "nhmo", "Date": "1442932761", "Score": 1, "Body": "&gt; I just want to live my life and be happy.\n\nI totally understand where you're coming from. I was feeling the same way through my program. Now I happen to have a real job and all I have left is my dissertation. I feel like a huge amount of stress has come off of me.\n\nPerhaps you can talk to the school about deferring your acceptance for a year and try making it out in the real world. If you aren't quite happy in a year time and find that you're missing school, you could always come back.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "85": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442933470", "Score": 2, "Body": "I'm actually doing this in the same place I did my undergrad in. I know a few people still around the city and my girlfriend doesn't live to far away as well as some of my extended family. So I have a decent network around me I guess. I don't know if I want to spend even 2 years doing this though. All of the other Grad students in my department look and feel worn out. Many of them have told me they regularly do 11-12 hour days and work weekends. I don't want that, I'm terrified I'll loose contact with my friends and family. I also don't want to have the crazy stress that seems to be part of the PhD experience, I don't know why I decided to do this. Having a back up plan sounds like a good idea though, but its seeming more and more like the back up plan will come into play before christmas. Thank you for your reply.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "86": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442933527", "Score": 1, "Body": "Asking about deferring is not a bad idea. I really am not prepared for this at the minute.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "87": {"Subreddit": "PhD", "Author": "nhmo", "Date": "1442933804", "Score": 2, "Body": "You don't have to be too prepared. Just ask if it is an option--and if it is, what the procedure is for it. You don't need to make the decision today, but it's always good to know about your options.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "88": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442934436", "Score": 1, "Body": "I just sent my PI an email, deferring is not an option due to the way the funding is structured. It seems like its now or never.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "89": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": "1442955836", "Score": 1, "Body": "Lots of good ideas here already. I think it is normal for people to have 'ups and downs' - good day, bad day, good week, bad week, etc. But I always found that was bullshit, because I *only* had 'downs' (bad day, bad week, bad month, bad year). In the end I stuck it out (without having much fun). However, if you're *only* hating everything after a few months, well, it sounds like you might have a real hard think about what that means. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "90": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": "1442969041", "Score": 1, "Body": "What is it that terrifies you? Try breaking it down to get to the core of it. \n\nA lot of things can be overcome with the right state of mind. This is a job. You show up, do your X hours and then try and take a break in the evening. Sure there may be times where you need to work OOH, but getting a good work life balance is key. I did not do this and got very ill. \n\nWhere in the world are you doing this? (UK PhDs tend to be much shorter, EU varies, USA a bit longer).\n\nThe thesis? Dont stress at this point, the length and structure will come with experience. It's a lab report, just a damn long one, but you have plenty to draw from by then.\n\nThe subject? This is a bit of a deal breaker. You have to enjoy what you are  planning to do. I know you may not know much now, but broadly speaking you have to enjoy it.\n\nYou will read a lot of posts (myself included) saying that PhD life sucks. It does. Prepare yourself for low pay (compared to non PhD friends), but still enough to live comfortably on. Also prepare for potentially sucky job prospects. \n\nOn the flip side, some pretty awesome experiences (field dependent). I have had colleagues travel the world, be on the forefront of science and met the loves of their lives. \n\nMeet with your supervisor. They have probably seen researchers like you a million times before and probably have some very sage advice. Find out what is expected of you, set out the foundations of your relationship with them and then go and have a think about whether you would be happy working in that environment. Hopefully you will be able to address what's making you freak out.\n\nGood luck.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "91": {"Subreddit": "PhD", "Author": "congruous_nz", "Date": "1442972448", "Score": 2, "Body": "It all depends on what else you have going on in your life, of course. You can have a month of free time and then return to working 80 hr weeks if you like. If you take on lots of teaching, then that may keep you busy. Some exceptional students get offered the chance to lecture and there was one guy in our group who took a year off just to lecture (and get paid well). \n\nA Master's is much the same as a PhD except for the fact that a Master's is about 1/6th less stressful, requires about 1/6th of the work and takes only ~half the time of the PhD. Your PhD is also supposed to contribute something novel to your field, whereas a Master's won't be so heavily scrutinized. First year of your Master's may involve intensive coursework, which you'd enjoy. \n\nI say go for the Master's and then see how you like your thesis year. If you really hate it then definitely don't do a PhD as each of your main chapters (usually 4 or 5 in science, depending on your field) takes the equivalent amount of work as writing a whole Master's (in my opinion). \n\nAll the best :)", "Permalink": "https://www.reddit.com/by_id/t3_3lrwn1.json"}, "92": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": "1442980086", "Score": 2, "Body": "Maybe it isn't for you, man.  No shame there.  ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "93": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1442981433", "Score": 1, "Body": "If you've been accepted you might as well finish the classes and leave early with a master's degree.  It's usually only 2 or 3 semesters for that.", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "94": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1442997492", "Score": 1, "Body": "Why may I ask did you stick it out? Ive spent the last 5 years in college and my mind set has slowly changed, initially I wanted to work at  something meaningfull but now I just want to have a life, be comfortable and be around people I care about. If you didnt enjoy what you were doing why keep it up?", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "95": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": "1443000729", "Score": 1, "Body": "&gt; I just want to have a life, be comfortable and be around people I care about\n\nI didn't have any idea that I *could* have a life, be comfortable, or care about anyone; a complete failure of imagination. And by the time I fully consciously realised I really hated it (probably after nearly 3 years?) it would have been a shame to have such a long period of work with nothing to show for it. (By the way I was in the UK system, so at 36 months you're really meant to be coming to the end of your thesis). \n\nIn the end it was good to push through, but was it the right thing to do in the first place? I seriously doubt it. \n\nThis doesn't mean much for you, except as an example of what someone else did! really it's difficult to know what's relevant for you, and the thoughts and feelings you're having have various potential resolutions. It's not an easy situation to be in and I wish you the best as you try to figure out what your path is going to look like for these years. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "96": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1443001271", "Score": 1, "Body": "Thanks for sharing. I'm on day 3 now and I'm still fairly unsure about this. I feel that up until now having spent the past 5 years in college completing a BSc and MSc I should be able to just live happily to an extent. Do you think that job prospects wise doing your PhD actually helped you at all? Would you have been better off working in industry or another field for the past 3 years? I was really lonely for much of the past 5 years in college since I was so pre-occupied with getting good grades and doing well. It was only this summer when I was working in a placement which had relatively low stress levels and allowed me to really have the evenings to myself that I realized what I've missed out on. I don't think I can face another 4 years of stressing about work and being lonely. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "97": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": "1443002001", "Score": 1, "Body": "Well, my PhD was in humanities, so 'working in industry' doesn't really exist; university teaching jobs in the UK are thin on the ground. However, it did enable me to work in Asia for 3 years, which would have been unlikely to have happened without the qualifications. So I do think it's possible that the degree can open up doors that would otherwise be closed. But, if your goal is having a life that is slightly more ordinary but fundamentally content and happy, probably a PhD isn't the quickest way to achieve that - which is not to say it couldn't help get you there in the end. Had I been finding my way in the non-research job market I don't know where I'd be. \n\nDay 3 is very very early. It's worth waiting a little while longer, I would say, because maybe there is a way of finding something like the balance of work and life you really want. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "98": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1443002410", "Score": 1, "Body": "I'm doing this in Ireland, the project is for four years. I've had some time to think about it and I'm trying to list my main concerns so I'll try do that here:\n\n1. The commitment - 4 years seems like a lifetime. I've spent the last 5 years in college and another four is daunting. As well as this the amount of time I'll need to put in. Many PhD students I've talked to said they have lost contact with friends and family over it and that is a risk I am not willing to take. I've only started to reconnect with people after my masters finished and I've realized that the people I love are an absolute priority in my life, if I start to drift from them I'm done.\n\n2. The Project - The project is interesting enough, but I just cannot muster up any enthusiasm or motivation. I'm sure if I really concentrate and work at it I could get absorbed in it to some extent, but that's not really what I want.\n\n3. Future prospects - One of my main driving factors for doing this were to get a good job that I would enjoy afterwards. Since then though I've kind of re-evaluated a bit. I've had quite a few different jobs to keep me going through college and the conclusion I've came to is that I don't necessarily have to absolutely be in love with the job, as long as I am working with people I get on with. Science as a profession seems to be a lonely field, I really need to have people around me in my life. Even then, it seems that doing a PhD won't necessarily get me my dream job. If I even knew what that was. \n\nI really don't have a clue what I'm doing. The only thing I'm really terrified about now is becoming complacent and sticking with this and being unhappy for the next four years. ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "99": {"Subreddit": "PhD", "Author": "ilostmyfirstuser", "Date": "1443074115", "Score": 6, "Body": "I hope you will be alright. Please seek someone to talk about this experience with. Reddit doesn't do it justice. Ideally, you should talk to a psychiatrist as this seems to be a pretty heavy and sorrowful experience in your life.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "100": {"Subreddit": "PhD", "Author": "gradschoolatemysoul", "Date": "1443075748", "Score": 2, "Body": "Funny you say that, because almost every fellow graduate student I've known has had to resort to therapy and antidepressants when they approached their thesis defense and the prospect of finding a way out of academia given the dearth of other options. Something grad school programs will never advertise is that they typically have pretty good mental health support programs because otherwise a good portion of the student body would lose it. However, it's as soon as you graduate and no longer have access to healthcare is when you realize just how fucked you are.  ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "101": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1443077783", "Score": 2, "Body": "As someone who has literally just started a PhD in life sciences and who is having serious doubts about it, thank you for posting this. I have absolutely no motivation to stay in academia and your post and the experiences of other Phd graduates I've known is slowly cementing in my mind that doing a PhD is a mistake. I really hope you enjoy the next few years of your life and get back on your feet after your experiences.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "102": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1443080250", "Score": -9, "Body": "Thanks for leaving. Enjoy serving me my next latte. Penury is therapeutic for me.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "103": {"Subreddit": "PhD", "Author": "camfield", "Date": "1443096735", "Score": 1, "Body": "The program \"Papers\" is alright", "Permalink": "https://www.reddit.com/by_id/t3_3ki9mg.json"}, "104": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": "1443102117", "Score": 7, "Body": "I agree with your sentiments here but a few suggestions:\n\nA) do not go to graduate school if you have to pay for it. This is especially true for STEM. There should be some way for you to get your tuition covered and a stipend. For example, in my program (computer science) there are very few students who do not have some form of funding. Most of the time it's from other departments who need programming help on their projects. \n\nB) start a business. It can be as simple as consulting on the side while finishing your phd, and then expand after you finish. You are going to conferences and meeting a ton of people in your industry. You are, by definition, an expert in your field. Use your network. Ps the title helps a lot in your own business. \n\nC) to go off B. Know when to use your title and when not to. This is useful for every situation. From getting a job, to networking, to socializing. \n\nD) apply for jobs that value the rigor of a phd. It doesn't matter if it's in your area of expertise or not. A majority of the value of a phd is not just what is in the dissertation, but also in the fact that you have the perseverance and fortitude to complete a phd. Any employer will know that you are more then capable of tackling, understanding, and completing any problem. \n\nI know you might also just need to rant, and by all means go for it. We all need to do it because the system is flawed. However, the system is playable to your advantage. \n\nDo you mind telling us what field? It seems like you are in some kind of medical research field. If so, I hear similar gripes from people in that field all the time. However, this is not indicative of all programs and shouldn't be used to discourage everyone from getting their doctorate. \n\nEdit: sorry for spelling. On mobile", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "105": {"Subreddit": "PhD", "Author": "mind_numbing", "Date": "1443104115", "Score": 2, "Body": "Sorry to hear about this. \n\nIn a positive note, If you're able to learn programming while doing a lighter job, you should be extreme\nly desirable in a year or so and making 90k in data science or something similar. I'd recommend Oystir.com and go from there. \n\nHope this helps a fellow scientist.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "106": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1443107226", "Score": 1, "Body": "I feel your pain. I got my PhD in physical chemistry last year, just as the department of energy decided to cut funding to my specific area of renewable energy research. I moved to Colorado with my fiancé and hoped to work at the national renewable energy lab, they just got six million inc its and are looking at layoffs. Professors at CU Boulder said they'd love to take me on as a post doc, but their funding was just cut as well and they can't afford to. Luckily my fiancé works for the patent office and can support us both for now, but it is depressing out there.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "107": {"Subreddit": "PhD", "Author": "enter_kasabian", "Date": "1443108303", "Score": 2, "Body": "http://cheekyscientist.com/job-candidates/", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "108": {"Subreddit": "PhD", "Author": "Max_Thunder", "Date": "1443109530", "Score": 1, "Body": "I have a lot of regrets over doing a PhD. I did it for the wrong reasons. I was expecting intellectual challenges but the truth is that most PhD are mostly psychologically challenging and not that much intellectually challenging. There were many rewards along the course, and I'm sure I'll look at all this with nostalgia 10 years from now, but for now it just seems like time wasted that I could have used to learn a lot more. Maybe the PhD will help me get my dream job eventually, but there's a lot of anguish that comes first and the years of PhD could have been replaced by years of work experience and much more job opportunities.\n\n  You can quit your PhD at ANY time, so there's no reason not to persist at the moment and find out if you want to continue. Are you getting a scholarship or some sort of stipend? If so, and it turns out that you really want to quit, I'd recommend finding a job first. Treat the PhD like a job, and there's no reason to have loyalty for your supervisor or university because they have none for you.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "109": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1443111133", "Score": 2, "Body": "Thanks for your input! I am getting a stipend so I suppose I could stick it for a while, the only problem being I feel I may get complacent, even if I am unhappy. \n\nAlso having read the recent post by /u/gradschoolatemysoul I am starting to have serious doubts about my employability afterwards, and I know his isn't an isolated incident, I've had personal friends who have had the same problems. This has kind of encouraged me to just quit sooner rather than later. \n", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "110": {"Subreddit": "PhD", "Author": "bwc6", "Date": "1443127348", "Score": 4, "Body": "Are you getting a stipend? Does your program give you the option of quitting with a Master's? If so, then you could at least get yourself a free master's degree. \n\nMy point is, don't quit yet. For every grad student that regrets getting a Ph.D., there is one that's happy with it. The one's that are happy just aren't as vocal. I love being a Ph.D. student. I thought I would stay in academia when I first started, but after seeing how difficult it is to get funding, I changed my plans. I'll probably end up in industry or doing scientific communication. There's no reason to switch straight from hopeful professor to hopeful barista. There are a million other jobs in between that use scientific skills.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "111": {"Subreddit": "PhD", "Author": "keebz11690", "Date": "1443133314", "Score": 3, "Body": "Current PhD student in Religion here. Most PhD's in humanities these days have some foreign language examination requirement but you probably should not be concerned. Every program will differ, but in my experience and in the experience of most everyone else in my generation I know, the foreign language requirement is mostly a formality. Most programs will differentiate between a research langauge and a reading language. If you plan on doing work which will utilize one language heavily or if you want to read primary sources in a certain language, a program would likely require you to take an intensive language exam. However, if you need a language just to read research in your area written in other languages then it usually consists of taking a not for credit class over a semester and passing that course with a final reading exam. For me, studying Ancient Christianity, I am required to pass an intensive exam in Greek but I have also completed language classes in French and German. I would certainly tell you not to worry about becoming fluent in a new language. Reading for basic comprehension would be the only possibility and, honestly, I have never heard of anyone failing a reading language course. Hope this helps. Definitely do not let that hold you back from applying, no matter how much you struggle with languages.", "Permalink": "https://www.reddit.com/by_id/t3_3m8wng.json"}, "112": {"Subreddit": "PhD", "Author": "emane19", "Date": "1443147105", "Score": 1, "Body": "I feel for you, because of lot of my friends are in the same boat. However, I I think you (and they) might be looking at a PhD as too limiting. Too many people think of a PhD as something that is training you for a very specific job, when it can actually be opening so many other doors besides that one job. A PhD teaches you to:\n\n1) work independently, but be a part of a team \n\n2) quickly master and interpret any information\n\n3) be a leader \n\n4) create and test hypotheses \n\n5) analyze data (almost everyone I know who is NOT a PhD is some sort of data analyst... guess who is really good at data analysis? PhDs!), \n\n6) think critically and creatively \n\n7) teach\n\n8) excellent communication and writing skills\n\nNone of these things are exclusive to a career in academia, but you learn them all during a STEM PhD (and so many more things I'm not listing). Could you learn them all somewhere else? Yes, but having a PhD after your name allows people to know implicitly that you come with these skills, and many companies value this.\n\nIf you want to take a job doing bench science then yes, maybe they would rather have someone with a MS instead, because they don't want an independent thinker, they want someone who is competent enough to do the experiments given to them. PhDs have much more experience in all the skills above though, and they can work to your advantage in so many different career settings. \n\nPeople want to hire PhDs because they have the skills listed, not in spite of those skills listed. Your PhD is much more than your dissertation and can be used to your advantage, especially if you are willing to take these skills outside of academia. ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "113": {"Subreddit": "PhD", "Author": "Brittnom", "Date": "1443172588", "Score": 1, "Body": "I am getting a stipend, I think I have the option of quitting with a Masters but I recently completed an MSc so waiting that long for a masters isn't a big incentive. \nI already have kind of planned that going into academia is not the path for me and while I really enjoy science I'm not even sure if it's what I want to do for the rest of my life. Is there any point in continuing with a PhD if I'm not planning on going into academia? My main concerns at the minute are what I'll do afterwards and more importantly being happy during. I've read so many stories of peoples relationships with their loved ones falling apart due to PhDs and not having enough free time to be with them. \n\nYou have obviously had a good PhD experience, whats your take on this?", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "114": {"Subreddit": "PhD", "Author": "AhuraMahzda", "Date": "1443188568", "Score": 1, "Body": "That puts a lot into perspective. Thank you for the primary source answer. ", "Permalink": "https://www.reddit.com/by_id/t3_3m8wng.json"}, "115": {"Subreddit": "PhD", "Author": "fdgro00", "Date": "1443200461", "Score": 2, "Body": "I agree.  Also, the sad truth is that as online education continues to rise, many lower level academic positions will continue to be lost.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "116": {"Subreddit": "PhD", "Author": "limit_veillance", "Date": "1443204630", "Score": 3, "Body": "You'll get a lot of different answers to these questions, but here's what I can say:\n\n1) Work/life ratios are basically meaningless at the phd level. You're more or less expected to live and breathe the work. Obviously, you still need time for yourself. But really, your life is your work at this level. That doesn't mean you can't treat this like a 40 or 50 hour a week job. It will depend a lot on what stage of the program you're at.  Your personal relationships will change. Some might get destroyed but you'll make new ones, so don't sweat it too much.\n\n2) If you don't want to go to academia I really don't see why you'd do a phd, but the job market is changing and there's definitely plenty of applied science jobs in industry that would value a phd. I think some of the concerns that you'll be over-qualified for industry are a bit out-dated and companies, especially those with lots of resources, are willing to hire experts of the highest level.\n\n3) If you don't like the project at hand why not just change your focus towards something you're interested in? I don't know how much freedom you would have, but in my area it is quite common to hear people changing gears based on their new experiences at the phd level, their research, and their interests. \n\nTalk to your supervisor and see what they have to say. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_3mbgep.json"}, "117": {"Subreddit": "PhD", "Author": "guymandudeperson1", "Date": "1443253556", "Score": 1, "Body": "regardless of whatever one might think about these essay mils, that stratos guy really held his own under the questioning (at least to me).", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "118": {"Subreddit": "PhD", "Author": "guymandudeperson1", "Date": "1443254020", "Score": 1, "Body": "also the stratos guy could've chosen not to respond yet he did. that sorta makes him boss (again in my view).", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "119": {"Subreddit": "PhD", "Author": "insomniac365", "Date": "1443269580", "Score": 12, "Body": "4) he is super busy and hasn't had time to read it in enough detail to provide you legitimate feedback and doesn't want to talk about your proposal until he has given it a good, in depth look. Hence, the silence ", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "120": {"Subreddit": "PhD", "Author": "nashvortex", "Date": "1443269817", "Score": 7, "Body": "It's only been 5 days. This is nothing in the life of a scientist. The standard turn around time for an email in science is 3 weeks.\n\nAlso, if he has not replied to your emails that have to do with *his* work, it is likely that he really is busy and has simply not seen your emails.", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "121": {"Subreddit": "PhD", "Author": "mzaber", "Date": "1443277574", "Score": 3, "Body": "One of your first conversations with your advisor should be about expectations for communication types and frequency. Go see him in person and ask to set up a 15 minute meeting about working style. Then you can see if he prefers email, phone, or drop-bys, and you can try to set up a regular meeting to keep you both in track.", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "122": {"Subreddit": "PhD", "Author": "brimacki", "Date": "1443297285", "Score": 2, "Body": "It's definitely not 1. Professors who have good ideas hire grad students to work on them. That's what's done. Period.", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "123": {"Subreddit": "PhD", "Author": "pisses_on_kittens2", "Date": "1443306304", "Score": 2, "Body": "He's likely giving your ideas some thought.  He is probably super busy, too.  Keep in mind that he himself probably does not have the time to execute your ideas so he probably just won't steal them - he would need you to work on them.  In all likelihood your ideas are probably misinformed but he's probably happy you're thinking about solutions.  Things will probably work in your favor.  Just email him in 2 days, acknowledging that you know and understand he is busy but was wondering if he's had a chance to look over your proposal.", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "124": {"Subreddit": "PhD", "Author": "chiefoverlord", "Date": "1443342246", "Score": 1, "Body": "I agree. That's probably why he does such a brisk business, sweet-talking all his clients!", "Permalink": "https://www.reddit.com/by_id/t3_3ipiik.json"}, "125": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443362684", "Score": 1, "Body": "Thank you for the reply! Just got an email from him :3 ", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "126": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443362732", "Score": 1, "Body": "Thank you for replying~ He just emailed me ^_^", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "127": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443362790", "Score": 1, "Body": "I'll keep that in mind! Thank you for replying~ I just got his email :D", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "128": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443363148", "Score": 1, "Body": "Yup I get a little carried away in crazy thoughts. He responded. Thank you for replying! :)\n", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "129": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443363218", "Score": 1, "Body": "He responded! Thank you for replying :D It was very reassuring", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "130": {"Subreddit": "PhD", "Author": "brimacki", "Date": "1443426980", "Score": 1, "Body": "I can guarantee you this isn't a requirement for STEM degrees. International students *may* have to meet some sort of ESL requirement though.", "Permalink": "https://www.reddit.com/by_id/t3_3m8wng.json"}, "131": {"Subreddit": "PhD", "Author": "tsonguyen", "Date": "1443499623", "Score": 1, "Body": "How was the feedback? Did you get the gig?", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "132": {"Subreddit": "PhD", "Author": "throwawayforqn", "Date": "1443511001", "Score": 1, "Body": "Haha feedback was bad but nothing new there. Just the idea wasn't interesting and novel enough and I overdid stuff. I alr chunked the whole proposal in the bin and began the whole moving-on process. By the way, there wasn't any gig 0_0 ", "Permalink": "https://www.reddit.com/by_id/t3_3mg9xc.json"}, "133": {"Subreddit": "PhD", "Author": "lucius_pixel", "Date": "1443524423", "Score": 0, "Body": "https://www.youtube.com/watch?v=1HORe7spmlo&amp;index=1&amp;list=PLsJ_NKi_e5C3MBLKBvuW-dOl3hUW6Phpw\n\nstart researching boarding schools\n\nyou earned that right", "Permalink": "https://www.reddit.com/by_id/t3_3ms3qg.json"}, "134": {"Subreddit": "PhD", "Author": "tiny_cheese_merchant", "Date": "1443644673", "Score": 1, "Body": "Permission is locked, what's your field?", "Permalink": "https://www.reddit.com/by_id/t3_3n05xf.json"}, "135": {"Subreddit": "PhD", "Author": "Bluffpoint9", "Date": "1443645310", "Score": 1, "Body": "Thank you for telling me that! My field is American Studies", "Permalink": "https://www.reddit.com/by_id/t3_3n05xf.json"}, "136": {"Subreddit": "PhD", "Author": "Bluffpoint9", "Date": "1443645324", "Score": 1, "Body": "But this paper is on the Sami people of Norway and their relationship to the AI", "Permalink": "https://www.reddit.com/by_id/t3_3n05xf.json"}}