{"0": {"Subreddit": "ADPhD", "Author": "msidari", "Date": 1498900569, "Score": 2, "Body": "Yes, two of three know. \n\nMy primary supervisor also has ADHD. We're very open with each other, so I told him straight away. I was initially surprised to find that he told supervisor #2 I'd started meds without my permission...until she said that she takes meds too...and mentioned that supervisor #3's son takes meds. So I'm at 67-100% of my supervisory team with ADHD at this point. I guess we attract each other!\n\nEdit: classic, I didn't read the question. \n\nI told my primary because I've been struggling with writer's block for this paper I'm writing at the moment. I was basically like 'well hey, this might help my writing, fingers crossed.' He said he was glad I'm trying them and let him know how much they help. \n\nSupervisor #2's response was similarly supportive and told me that X drug was better than Y, so I should look into it. She's lovely so I don't expect anything to change.", "Permalink": "https://www.reddit.com/by_id/t3_6k1wb4.json"}, "1": {"Subreddit": "ADPhD", "Author": "tonightbeyoncerides", "Date": 1498943908, "Score": 3, "Body": "Same. Creepily same. ", "Permalink": "https://www.reddit.com/by_id/t3_6koebs.json"}, "2": {"Subreddit": "ADPhD", "Author": "diabeticgolfcourse", "Date": 1498945922, "Score": 5, "Body": "I have heard this a lot as well. Sucks. I think on the flip side though, one of the reasons I enjoy being in school (especially grad school) rather than in the workplace, is that it is mentally challenging and interesting. Also it allows me a lot more freedom with regards to my work habits. ", "Permalink": "https://www.reddit.com/by_id/t3_6koebs.json"}, "3": {"Subreddit": "ADPhD", "Author": "djc103", "Date": 1498946563, "Score": 2, "Body": "The flexibility is the best and worst part of being in grad school. I was on the verge of dropping out of undergrad after failing some classes (poor attendence, unfinished assignments, general inability to focus). I switched to English  because I realized I could fake it better (one or two papers a class instead of regular assignments). I kinda think I kept going with it because I knew I wouldn't be able to manage anything else. But I'm to the point where I can't fake it anymore-- I actually have to regularly and consistently produce work. To me, going to grad school was a way of coping with my symptoms, not proof that they aren't real. ", "Permalink": "https://www.reddit.com/by_id/t3_6koebs.json"}, "4": {"Subreddit": "ADPhD", "Author": "diabeticgolfcourse", "Date": 1498948239, "Score": 2, "Body": "I think you are spot on saying that it is a way to cope. Although its not perfect, I often choose school as an escape from the traditional workplace which I find stifling and  depressing. And I can totally relate to the idea of choosing certain courses based on the way they were structured as well. ", "Permalink": "https://www.reddit.com/by_id/t3_6koebs.json"}, "5": {"Subreddit": "ADPhD", "Author": "djc103", "Date": 1498961824, "Score": 2, "Body": "It definitely depends on your program, field, advisor, etc. The first two years of my PhD weren't as bad because I had coursework and often my research supervisors were also my instructor, but now that I'm dissertating it is totally possible to do nothing for months without any recourse...until someone checks in.and I have to explain what I've been doing or why I have nothing to show. \n\nIn theory, I've chosen something g that interests me and reading papers and thinking about my project has been tough, but more than anything it's the writing that will kill me. On the edge of failing now due to not being able to put words on paper. \n\nNot diagnosed, not medicated, but neuropsychologist says I have strong ADHD-anxiety symptoms. Non-conclusive assessment because lack of symptoms in childhood and I somehow got a master's degree so how could I possibly have ADHD. I just identify so strongly with what I've been reading in r/adphd and r/adhd so I keep coming back and wondering if need to get a second opinion.", "Permalink": "https://www.reddit.com/by_id/t3_6kok53.json"}, "6": {"Subreddit": "ADPhD", "Author": "longwiener22", "Date": 1498978180, "Score": 1, "Body": "Starting my first year in a Ph.D. in agricultural/applied economics. Probably gonna go the behavioral economics route.", "Permalink": "https://www.reddit.com/by_id/t3_6jy96s.json"}, "7": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1498984618, "Score": 1, "Body": "&gt; If science needs me to leave my boyfriend behind and stall marriage and children...\n\nMore than anything, it is the arrangement of a PhD/Postdoc that demands such considerations rather than academia or academic culture in general. In exchange for having to move to an often new and far-away location to work under a short-term contract without absolute certainty for the future, you would receive the opportunity to spend time with and do research in a topic specific to your interest. Postponing buying a house and settling down in anticipation of obtaining a permanent position is a sort of a gamble that seems too \"risky\" for some but an attractive scenario that is overall worth the experience to others. That seems to be the deal, which we can take or leave.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "8": {"Subreddit": "ADPhD", "Author": "tonightbeyoncerides", "Date": 1499034217, "Score": 4, "Body": "Depending on how your program is set up, your structures will gradually dissolve over time. So you need to be training yourself to do well when no one is watching and there are no deadlines. (Don't ask me how, I suck at it).\n", "Permalink": "https://www.reddit.com/by_id/t3_6kuru8.json"}, "9": {"Subreddit": "PhD", "Author": "BensBrotherJoe", "Date": 1499071548, "Score": 3, "Body": "I've not reached my thesis yet but I've done a fair bit of writing. When I get stuck I try to break every down into the smallest parts I can and order them by priority. Then I take the most important thing I need to do and just say I'll write just this section or change one sentence or one word even if your really stuck. After that the flow usually gradually builds up again.\n\nIf that doesn't work I'll drink a beer and try again. Repeat until you've started writing or you've passed out.", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "10": {"Subreddit": "PhD", "Author": "sethzard", "Date": 1499075896, "Score": 1, "Body": "I'm not at the point where I'm doing my PhD but maybe try going to a new location like the library or a coffee shop to try writing. It might help kickstart your brain into writing gear. \n\nAs a longer term solution try going to a place where you only do writing so you'd brain knows \"if we're here, we're writing\". ", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "11": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1499088858, "Score": 1, "Body": "This helped me - I hope it can help you too: if you are struggling to get started at any part of writing/editing, then start by making a list. \n\nFor you it will be a list of edits you need to make, then pick the smallest one and do it - starting with fixing a reference or a typo is a lot less daunting than rewriting a chapter etc. Make the tasks as small as you need to to push through the inertia - if you can't get started on \"rework paragraph X\" then break it into sentences and then gradually work through them.\n\nFor people struggling with blank page-itis it would be a like of what you want in the chapter, and again it can be as simple as you like. Title/intro paragraph/sentence about X. Then just go through and replace the prompts with actual thesis content.\n\nBest of luck :) YOU ARE SO CLOSE!!!!!!!!! :) DOOOOOOOO IIIIIIIIIIIIITTTTTT!!!!!!!!", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "12": {"Subreddit": "PhD", "Author": "doggobotlovesyou", "Date": 1499088861, "Score": 1, "Body": "&gt;:)\n\nI am happy that you are happy. Spread the happiness around.\n\n[This doggo demands it.](http://l.yimg.com/os/152/2011/10/31/Untitled-11_172253.jpg)", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "13": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1499090552, "Score": 3, "Body": "My doctor actually said almost the opposite. That \"average intelligence\" children are diagnosed in childhood because they cannot hold it together. If you have actual ADD and were able to sneak your way through childhood and early adulthood successfully, you're probably more intelligent and driven than most of your peers. \n\nThe fact that I had so many rules in place to try and succeed and yet still was a massive fuck up (and that I had ~5 other friends with PhDs confirm to my doctor that they agreed that it seems like I'm really trying and am clearly smart but keep being a goddamn trainwreck) made her be like \"okay yeah this makes sense, this is literally what adult ADD manifests as if it wasn't caught earlier\"", "Permalink": "https://www.reddit.com/by_id/t3_6koebs.json"}, "14": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1499090727, "Score": 3, "Body": "I told my advisor that I think that there's something wrong with me. \n\nIt was a really loving, sweet, patient conversation. I told her I needed to talk to her about something. I told her that I swore I was trying as hard as I could imagine, but I had such huge blocks. (I'm at the diss writing stage). I didn't have the words for it yet, so I told her I thought it was severe anxiety (even though I only really felt anxious BECAUSE I wasn't accomplishing work). This was about a semester ago. In that time, I went to doctors and talked about whether it was depression and anxiety (even though I didn't feel depressed nor anxious directly), and doctors even explored mania (though again, because clearly not depressed, it didn't fit.) Throughout this whole semester, she was EXTREMELY patient. Clearly would have preferred a more productive student, but I think she recognized that I was really trying and working. Now that I am taking ADD meds I am finally producing again, and she is EXTREMELY supportive and encouraging. I'm so happy with the whole exchange", "Permalink": "https://www.reddit.com/by_id/t3_6kw2oo.json"}, "15": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1499090851, "Score": 4, "Body": "I should also add that during this semester (and during the year prior to this one when I was still being a TERRIBLE student but hadn't stopped to talk to her about it yet) I was just like you. I dreaded every meeting. I was pretty successful early on (whether due to it being more structured, being more heavily carried by straight enthusiasm and novelty, whatever) but I clearly had crashed and wasn't recovering. She was WAY less supportive before I talked to her about me also not being proud of myself. ", "Permalink": "https://www.reddit.com/by_id/t3_6kw2oo.json"}, "16": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1499090924, "Score": 4, "Body": "dude same. Years 1-2 were relatively easy (felt the same as undergrad-ish, with the natural expected progression). Year 6 was impossible, and was what lead me to start meds. SO much easier now.", "Permalink": "https://www.reddit.com/by_id/t3_6kuru8.json"}, "17": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1499091274, "Score": 3, "Body": "Assuming your research process looks-ish like what it does in my field, here are my ABSOLUTELY DO THIS suggestions for success:\n\n(1) set up a Mendeley account. Take it VERY seriously. Every time you read a paper, put it in there. Read it and highlight it. Put notes in the notes section. Writing papers / your dissertation will be WAY more possible if you have this structure for prior literature. I WISH I started this earlier. Useful for all PhDs, necessary for adphds\n\n(2) You might have more structure your first year or two, but for me, years 3-6 were basically completely self-managed. I had no schedule or accountability, other than advisor / lab meetings twice a week. I would REGULARLY not go into work and go on an impulsive day trip instead. You NEED to pretend that this is a  9-5 / 10-6 job. Your peers with better executive functioning will let themselves have funkier schedules. I tried that and wasted 2 full years because I couldn't self manage. In my last year now, and am keeping to a strict schedule, no matter what.\n\n(3) Your advisor might ask you to write her weekly updates. If she doesn't, **ask her if you can.** I kept it short and easy, but the idea was I'd send the 1-3 big things I worked on this week, and my 1-2 goals for next week. **This serves two benefits.** One is extra accountability for you. The other is that **it shows that you're trying and trying to be up-front** by asking her to send these updates (and continuing to send them.) I legitimately think it gives you more sympathy / flexibility when you mess up and miss deadlines or have nothing to show for a week, which you will. If she is a good mentor (some are, some less so), she will follow these and give you advice, and help make sure you don't get off track.\n\n(4) Like I said above, you'll have days where you don't get anything done. Also extremely true for neurotypical people, but especially for us. To help minimize these days, wake up and set your **single** intention. When it feels overwhelming or it's hard to focus, stop and do a 10 minute meditation. (I've actually found setting a timer and doing that adult coloring book thing for 10 minutes really helps - gets me in the headset of 'just keep doing this until a timer tells me to stop' and then I immediately transition to work as soon as the timer goes off.)", "Permalink": "https://www.reddit.com/by_id/t3_6kuru8.json"}, "18": {"Subreddit": "PhD", "Author": "Sir_Ebrum", "Date": 1499092806, "Score": 1, "Body": "I'm at the point of writing my thesis as well and I agree with this advice. Usually when it seems daunting/overwhelming, i focus on a specific paragraph. Or I focus on one small aspect I'm going to write about today -- do the lit search on just that and write about it.\n", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "19": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499097628, "Score": 1, "Body": "the same funding as i am funded by a third-party", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "20": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499097671, "Score": 1, "Body": "I am focusing on \"circuit design based on printed transistors\"", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "21": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1499098302, "Score": 2, "Body": "Choose the school that has faculty studying what you're most interested in. What's most important is that you like the work you do.", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "22": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499099436, "Score": 5, "Body": "This was me a year ago. Like exactly except for the field. It was something I got away with because my output was fine. I had a lot of guilt about people saying I was doing so well when I felt like I was putting in about a 70% effort.\n\nI had to start changing my work technique. I take a few short breaks each day instead of a long lunch break. So I'll work 3 hours and then take 20 minutes off and do that 3 times or so. I also started writing detailed to do lists. I had one for the day which I wrote in the morning or the day before, I have one for the week and I have an on going one of stuff that's not super urgent. I make sure that during my work times I am always working on something on these lists. It's perfectly fine to switch to something that is just bureaucracy and easy if I'm tired. I know when a break is coming up so I'll work through to that quite happily. I keep pretty set hours too so I know I'm going home soon.", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "23": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499100608, "Score": 1, "Body": "both have excellent faculty that are working on the very same area, you can there is a tie in this point.", "Permalink": "https://www.reddit.com/by_id/t3_6htang.json"}, "24": {"Subreddit": "PhD", "Author": "Mythsterious", "Date": 1499109408, "Score": 1, "Body": "Did you do any data analysis for your project?  Are you good at any types of biostats and/or programming languages?  \n\nThese types of fields are generally translatable into business analyst positions if you build up a little bit of a portfolio outside of your graduate work.", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "25": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1499110863, "Score": 3, "Body": "I will try this. I had tried before doing 1 hour + 10 minutes interval. Somehow, it does not work for me. I always feel like 10 minutes feel like nothing. 20 minutes every 3 hours sounds more reasonable to me. Let's see how it goes. Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "26": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499111211, "Score": 3, "Body": "You can even do 2 hours and a 20 minute break. You'll be able to do 8 hours in a day with an hour worth of break which is reasonable if you can make it work. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "27": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1499114159, "Score": 6, "Body": "Are you passionate about the projects you are working on?  I cant tell by what you posted.  You might also be going through a normal cycle of motivation/interest.  I dont think anyone is always motivated or interested in their field/project, so I wouldnt worry about it too much.  Spending 5-6 solid hours working on something in a difficult field is likely a great accomplishment.", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "28": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1499121184, "Score": 2, "Body": "I am, at the beginning. My work pretty much goes like this - reading, think of the way to approach the subject, mathematical analyses, writing + more mathematical analyses, and writing the final product. Although I go through cycles where I'm motivated following by demotivation on all of those steps, for me the hardest are reading (I can't spend the whole day reading) and writing the final product - particularly when I arrive to the part where the manuscript is going between me and my supervisor several times until the final manuscript. ", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "29": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1499121477, "Score": 3, "Body": "Trust me, you are not alone.  Few people can spend all day reading without loosing focus throughout.  It sounds like you have a system down to alternate between reading and analysis.  Im not sure what your career goals are, but if you plan on staying in academia you can plan on a whole lot more of the same (although you may have students/post-docs to do some grunt work for you)", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "30": {"Subreddit": "PhD", "Author": "lazysamare", "Date": 1499123410, "Score": 2, "Body": "I'm also going through a phase of this sort. I'm like 4 months into my PhD in Aerodynamics. My work schedule is quite a lot more erratic than yours though. I've do things whenever I feel like it and I do get through everything that I set out to do on any particular week and my supervisor is pretty happy with my work rate but I still feel that I'm not working hard enough and I should be working to a tighter schedule. ", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "31": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1499127622, "Score": 2, "Body": "Enjoy it while you can. If you are feeling unchallenged, then maybe try taking on more responsibilities, or set your own deadlines that push you to work more than 6 hours a day. Alternatively, you could try to break up your day with a workout or some other break, and then try returning to your work with a fresher mind. However, you also don't want to burn out, so enjoy the balance. ", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "32": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1499129789, "Score": 3, "Body": "&gt; we had to sign a paper saying we did not work more than 20 hours a week\n\ncheap labour exploit right here", "Permalink": "https://www.reddit.com/by_id/t3_6k8123.json"}, "33": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1499132057, "Score": 1, "Body": "&gt; PhD\n\n&gt; jobs/companies\n\n&gt; hire\n\n*[laugh in thesis]*", "Permalink": "https://www.reddit.com/by_id/t3_6kd6o7.json"}, "34": {"Subreddit": "PhD", "Author": "sushiking365", "Date": 1499136239, "Score": 1, "Body": "Good advice. I will give it a go and hopefully it works out . Thanks for your time !", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "35": {"Subreddit": "PhD", "Author": "sushiking365", "Date": 1499136408, "Score": 2, "Body": "When you put it that way, I does not seem that daunting of a task. \n\nI have actually done the other corrections, it's just the literature review rewrite. \n\nThanks for the advice and the encouragement :-) !", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "36": {"Subreddit": "PhD", "Author": "sushiking365", "Date": 1499136548, "Score": 1, "Body": "I do most of my work at home, but I guess I could try a change of location, hopefully it works out.\n\nThanks !", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "37": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499140519, "Score": 3, "Body": "I can relate a lot. I'm almost 6 months in, have a paper submitted, have made a lot of progress both in writing and developing hardware (I'm in electrical/biomed engineering), but a lot of the time I feel like I'm just going through the motions. I'm super passionate about what I'm doing, I just find it hard to work on just one thing all day, every day with no real deadlines in sight. \n\nOddly enough, I find having other things to do helps with my PhD. I tutor, and having that variation from my PhD routine helps me get some of my motivation back. I also try to work through online courses that are relevant to my degree, because my uni counts Coursera courses towards professional development requirements they have of PhD candidates.\n\nSomething I'm slowly learning is that if you set a goal for the day and get it done in 4 hours rather than 8 because motivation levels are high or whatever else, then don't keep working just for the sake of working. High-five yourself and take some me-time to go for a long walk or watch a movie. It might seem like a waste of an afternoon at first but I think it's better for long-term motivation.", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "38": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1499142973, "Score": 1, "Body": "I'm glad it is helpful :) sometimes I even wrote \"sentence about how the parabrachial nucleus processes thermoregulation\" as a prompt. Even the most basic prompt can lead to a sentence/paragraph/chapter/thesis it just takes guiding yourself through each step :) it is a process of effort. Directing your efforts is key.", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "39": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499153316, "Score": 11, "Body": "Tell them that if they want you to do those projects then they can hire you as a post doc after you graduate. You can also help with patenting after you've graduated without you working there if that's experience that you want. Set a hard deadline and tell them. If you have to, tell the head of your committee or your postgrad coordinator for your department as well.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "40": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499153505, "Score": 4, "Body": "Yeah, that could work. I mean it's exactly how I feel. Like, there's nothing they've said that I would be disinterested in doing.. even the patenting, it's a thing that could help people so I'd be keen to see it get out in the real world. It's more that I feel that now isn't the time for anything but getting my PhD done. Thanks for your advice - I'll try to have a firm discussion with them about the date I want to finish by.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "41": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499153676, "Score": 6, "Body": "The other thing is just to start writing. When you feel like you've completed the scope of your original project and written a passable thesis then send it to them. Tell them that you'd like to submit and could they please edit it now. When the work is staring them in the face they cant really just not read it. \n\n\nExplain to them that you have no interest in staying on for a longer PhD and a professional position after the PhD is the only way you'll do that work.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "42": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499153878, "Score": 4, "Body": "That's true. I think I need to work on my assertiveness a bit.. they just seem to assume I'll always do more, probably because I actually care about my topic a lot. I'll try to make sure they know I still have limits. Thanks again :)", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "43": {"Subreddit": "PhD", "Author": "geralt922", "Date": 1499161237, "Score": 2, "Body": "If you mean your personal salary is lowered to 50%?\n\nThen no, tell them to shove their PhD offer and take one up elsewhere with full stipend. \n\nYou CAN work and do a PhD full time, but most of the people who can do that have years of experience and the PhD is not as big of a challenge for them. \n\nComing straight out of a BSc, you are not going to perform well if you have to work and do a full time PhD. \n\nYou are worth being paid to do the work. Do not accept less than you are worth. There will be other opportunities to do a PhD. Even if you work in industry for a year, this will strengthen your application even further. ", "Permalink": "https://www.reddit.com/by_id/t3_6k8123.json"}, "44": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1499173019, "Score": 0, "Body": "I had a similar experience...but the truth is that a PhD is largely a marathon. If you make it till the end i.e. submit a thesis based on your own work it is unlikely that you will fail. Maybe you will have some large corrections, but you really need to try to fail. So supervisors don't care about the PhD in itself, but the work that you have done.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "45": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1499194866, "Score": 1, "Body": "Have you been able to work with them to set a defined scope of your dissertation? Getting clearly defined expectations in terms of the range of topics you will address (and the specific publications that are intended as a result) will make it more difficult for them to include more and more in what they expect of you, and it will give you something to point to when they ask for more. \n\nPersonally, my adviser similarly suggested multiple follow up studies and applying for patents as well, but having a clearly defined scope gave me a position of strength when suggesting we pursue those after my graduation. \n\nAlso, I think my adviser was testing the waters to see how I would handle it. A person with their PhD should be able to drive the direction of a research lab, and showing that assertiveness may help demonstrate that you meet that criterion. ", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "46": {"Subreddit": "PhD", "Author": "Mouspikpis", "Date": 1499197845, "Score": 3, "Body": "My advice would be the opposite. It sounds like you don't want to work in academia, and they want you to  apply for a patent. Wouldn't that give a lot more value to your PhD (increase your job prospects)? Is it impossible for you to continue? Otherwise, just talk to them and explain that you don't want to continue after 3 years.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "47": {"Subreddit": "PhD", "Author": "RHA1989", "Date": 1499198691, "Score": 1, "Body": "Definitely break it down. I'm at the same point as you and it seems so daunting. I will pick a chapter to work on and then work through the sub chapters. Sometimes I find it helpful to have a blank document side by side with it and rewriting there selecting the okay parts from my already written section. Just remember that you'll get there in the end, sometimes it's taken me a whole day just to rewrite a few hundred words. ", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "48": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499212179, "Score": 2, "Body": "Initially, we did sit down and work out the scope of my dissertation. I've sent them both a full outline of it too, and initially they seemed happy. Same with my publication plan. My supervisors are of the opinion that a PhD should change and that I should just be flexible about it. I do understand that to a degree, but I do wish they'd stop changing the scope and focus that they want..", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "49": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499212258, "Score": 1, "Body": "It's not that I actively don't want to work in academia, it's more that I don't really mind. I'd be happy to work for my uni at the end, or go somewhere else that does research. I think I will go after the patent, but I don't want it to become my main focus if that makes sense. It's important to me, but so is finishing..", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "50": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1499212751, "Score": 1, "Body": "Good to hear! Perhaps next time they start to stretch the scope, reference the agreed upon material when conveying your apprehensions about taking on more than you agreed to. Even if they are set about the current proposed extension of research, hopefully the reminder will be in the back of their minds the next time they have an idea for an add-on study. ", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "51": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1499212831, "Score": 2, "Body": "I'll try that, thank you :)", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "52": {"Subreddit": "PhD", "Author": "FrankNix", "Date": 1499230389, "Score": 1, "Body": "What field of study? This sounds like an unfortunate situation.", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "53": {"Subreddit": "PhD", "Author": "tyshteki", "Date": 1499230869, "Score": 2, "Body": "Sociology. And yes, but I feel there's a lot of factors that have nothing to do with me going on behind the scenes.", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "54": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1499246120, "Score": 11, "Body": "This is a really tricky situation because, unfortunately, your supervisors are in a position to potentially force your withdrawal by removing their support of your project/further study. If, as you said, there are no other suitable supervisors, your progression in your department is unlikely. As a Ph.D. candidate in a similar field (you mentioned in a comment you're studying sociology), the only thing I could recommend is editing your lit review and approaching each of your supervisors personally to discuss how passionate you are about continuing in your program and asking specifically what they feel your lit review is lacking, as well as how you can work with them to improve it. Straight-forward communication with your supervisors concerning issues they see in your lit review is vital. It can be extremely uncomfortable confronting supervisors with this kind of stuff, but their decisions affect your future, so it's necessary. I hope this helps in some way. Good luck with everything, I hope it works out for you!", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "55": {"Subreddit": "ADPhD", "Author": "trackaftertrack", "Date": 1499249262, "Score": 1, "Body": "&gt; I somehow got a master's degree so how could I possibly have ADHD\n\n(I'm gonna try to ignore that extremely condescending comment) Well if it's not ADHD, doesn't mean you don't have something right? How long since you saw that neuropsychologist?\n\nThanks so much for replying! Your comment is actually very insightful for me, but I can't put words to paper to explain why =P\n\nI sincerely hope it works out for you. I suggest you ditch the neuropsychologist, but I've had a psychologist before who doubted my ADHD but wasn't unable to help me with anything at all.", "Permalink": "https://www.reddit.com/by_id/t3_6kok53.json"}, "56": {"Subreddit": "ADPhD", "Author": "trackaftertrack", "Date": 1499249655, "Score": 1, "Body": "1. Clarify please: you're busy with teaching work and even though you got research going on, the *main difficulty is organising your thoughts* so you actually *have been doing things *, but it's just that you just *don't have output, ie something organised*  to present? I mean, *what exactly do you say to those people* who check in?\n\n2. Also, what support has/have your supervisor/s offered?\n\nOn the one hand this sounds horrible and so I hope you get a second opinion soon, but on the other hand, I guess this is to be expected to some degree. Just wanna understand better.", "Permalink": "https://www.reddit.com/by_id/t3_6kok53.json"}, "57": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1499251491, "Score": 5, "Body": "I would ask them why. You deserve to know what exactly they are looking for and what  set them off to say this. Have you written lit reviews before? Did you rush it or put your all into it and are completely dumbfounded? And in the meantime, I would analyze my goals and seek additional departments that could help you achieve near similar goals, if possible (I'm an engineer, so there is some similar research transferable topics here).\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "58": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1499252887, "Score": 2, "Body": "What was their justification for you to withdraw? Because the literature review is poor quality or because your topic isn't rigorous/original/interesting enough (often identified through lit review)? ", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "59": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499254882, "Score": 2, "Body": "Let them say what they want--they have their best interests as their #1 priority and the student's interests will always come second.  They get your cheap labor, so they will always push for more.\n\nAlways be writing your dissertation.  When *you* are done at whatever that means to you, contact your committee and tell them that you are defending and schedule it.  Don't let them convince you that your leaving is contingent on finishing various projects.\n\nLike others have said--once you've left, they are welcome to hire you back on as a postdoc at a higher pay (and no timeline commitment) in order to write the patent.", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "60": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499255423, "Score": 1, "Body": "I am the same way--I'm not very motivated by open ended work.  I can do it well enough, but I don't get any sort of rush out of it.\n\nI am motivated by progress toward a clear goal and money.  If you're like me, maybe it would help to do some sort of part time or freelance work for extra $$ on the side.  You can keep working your 5-6h a day on your project but start building some skillsets for whatever you want your next job to be.  Supplementing your PhD stipend certainly doesn't hurt.", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "61": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1499255476, "Score": 5, "Body": "I have a friend who experienced something similar but is in a biology department. She was asked to finish up after handing in her first year progress report, which came as a total shock. As you experienced she also became very wary of her supervisor.\n\nHowever, she was determined not to give up. And as others have advised here, she re-wrote the proposal (with advice) and eventually managed to stay (just about to finish her 4th year now). \n\nHer 'community' was key to this - colleagues/students/friends who could help firstly with advice on the report and second re-building her confidence. \n\nIf it is something you still believe passionately in, stick at it! Get as much advice as you can about your report and guidance in your PhD from anyone you know. It will be very tough but it is possible to continue!", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "62": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499258132, "Score": 1, "Body": "So to sum up the postdoc situation:\n1) you must often move far away\n2) you cannot negotiate a dual offer\n3) you receive low pay\n4) you rarely get retirement benefits even though most postdocs are still postdocing well into their 30s and beyond\n5) you only work short term contracts\n6) you have dubious future prospects\n7) if it doesn't work out, your best option is a *lateral move* for postdoc #2\n8) you can choose an advisor studying a topic that you like\n\nThe purpose of competitive compensation is to attract the type of candidate that you want for the job.  When there are few, if *any* high skill positions with such crappy rewards, it makes you wonder what type of person \"academia\" is attempting to attract from the available talent pool.  The independently wealthy?  The confirmed bachelor/ette?  The non-creatives who claim they can't imagine themselves doing anything else (but have usually never even tried working outside of academia)? \n\nIts easy to say \"you can take it or leave it,\" but academia should really start to concern itself with who they are getting to stay vs who choose to go.", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "63": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1499260780, "Score": 1, "Body": "Oh I did not mean to smart mouth, but it is a reality that most \"attractive\" post-doc vacancies do receive a good amount of motivated applications. From the position of the employer, the system therefore seems to work. You are absolutely right that higher academia often requires personal sacrifices, but the yield can potentially be worth it. What I meant to suggest is that buying a house and getting married (for example) are completely understandable desires, but no more universal rights than finding a dream job in academia is. It is indeed a rat race, but for some the voyage is more important than the destination, which can take the edge off a bit. Science will proceed either with or without us, we simply have the choice to stay in or hop off...", "Permalink": "https://www.reddit.com/by_id/t3_6k8809.json"}, "64": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1499270032, "Score": 1, "Body": "\"-When, where, and what to publish  \n-Writing a foolproof grant application  \n-Cultivating references and crafting the perfect CV\"\n  \nA lot of that is subject area specific. Your adviser would have much more of an impact on your success in those areas.", "Permalink": "https://www.reddit.com/by_id/t3_6le6p7.json"}, "65": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1499277418, "Score": 2, "Body": "It's good to cherry pick from. It's also a cheap book that fills a niche. Kelsky, however, comes across as pretty bitter and arrogant about the academy; yet she apparently had no qualms about profiting from it and the scores of graduate students looking for guidance. ", "Permalink": "https://www.reddit.com/by_id/t3_6le6p7.json"}, "66": {"Subreddit": "PhD", "Author": "zwynorthern", "Date": 1499281328, "Score": 1, "Body": "Talk to your graduate chair to get a sense of whole situation. If she/he is willing to step in, that's a good sign to continue. If not, they probably have discussed this during a meeting. You might want to have a back up plan. Try really hard to stay, just keep in mind that the sky is still blue if opposite happened. ", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "67": {"Subreddit": "PhD", "Author": "cromulo", "Date": 1499289133, "Score": 2, "Body": "I am defending my PhD this month and I have accepted a tenure-track faculty position. This book and her blog were incredibly helpful (if not critical) to securing that job. \n\nHere is a link to the blog: http://theprofessorisin.com/pearlsofwisdom/", "Permalink": "https://www.reddit.com/by_id/t3_6le6p7.json"}, "68": {"Subreddit": "ADPhD", "Author": "djc103", "Date": 1499290278, "Score": 2, "Body": "1. I've become really good at coming up with reasons I haven't made progress, e.g. the project needs to go in another direction or I found a new line of literature that I need to read or I need another project entirely. It's not so much that I haven't been doing anything, but that I can't stay on track with the things that need to be done. The second I sit down I feel pulled in another direction, whether that's another project or literally I need to go for a walk or make some food or do the dishes or whatever. \n\n2.) My supervisors have at this point have been open about talking to each other about my lack of productivity. They have individually taken turns trying to help me meet milestones by breaking up work, outlining, talking through places where I'm stuck, but it hasn't worked out. It's not that I don't know what I need to do, it's that the gap between what I know and what I do is too big. I think they are frustrated and don't know how to help at this point. Starting to worry that I won't be able to hold a job or project at all. And more immediately, not be able to pay loans or have health insurance. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6kok53.json"}, "69": {"Subreddit": "PhD", "Author": "thinksomethingclever", "Date": 1499343127, "Score": 8, "Body": "I have been in a similar situation so I can understand how you feel. I left my PhD with 3 manuscripts waiting to be submitted but never were. Here's the thing, as much as we just want to publish, we don't own the rights to the research- the PI does. No one can force him/her to publish. \n\nYou are also upset that the work was used to get a grant. This is completely normal. Now that the PI has the grant there is a higher chance your paper will be published, so that's actually a good thing. You have to look at it from the perspective of the PI- if they can't get a grant, they will likely be fired. It is totally normal to already have completed major parts of a grant and then submit it- perhaps missing some sections- so that they can be completed, publish and the PI can get the grant renewed.\n\nIt sounds like you were getting ready to defend and that's great! That's what you need to focus on right now. Do you have a postdoc or a job lined up? You can always state that you have a paper in preparation and that your work has been used to get a grant when applying. It's all about how you spin it. Stay positive you'll get through it! ", "Permalink": "https://www.reddit.com/by_id/t3_6ljp7a.json"}, "70": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499345134, "Score": 8, "Body": "What you describe (using complete data sets to pretend there is a project to do when its actually already done) is pretty much par for the course in academic science.  You do *whatever you need to do* to get money.  If you think THAT is unethical, academia isn't for you.  But that's okay, it isn't for me or most either!\n\nYou are doing all you can do right now, which is to submit your thesis and leave.  Don't allow your advisor to waste any more of your time on this paper issue, and don't delay your graduation on account of work to be done on a paper.", "Permalink": "https://www.reddit.com/by_id/t3_6ljp7a.json"}, "71": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499345836, "Score": 0, "Body": "It depends on what your goals are.  I doubt anyone cares about a blog in academia, but I've seen this used as a way to develop a \"personal brand\" in industry.  The theory is that it'll put you in touch with more people in your field/build your network beyond what you can physically achieve in person.  It also gives hiring managers something to look at when they google you.\n\nI've never been a fan of it either way--I'm not really interested in getting into a field that is so oversaturated with job seekers that you have to not only work well, but network well, but ALSO *blog* about it online in your spare time to get ahead!  Seems like a lot of work to me :D", "Permalink": "https://www.reddit.com/by_id/t3_6ljjin.json"}, "72": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1499348318, "Score": 7, "Body": "Indeed, I will rather have it published some how than have it languish in \"writing hell.\" Some consolation for OP, at least it was worthy enough to get a grant approved. You did good, take what you can, defend, get out, find a job and get on with your life.", "Permalink": "https://www.reddit.com/by_id/t3_6ljp7a.json"}, "73": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1499354918, "Score": 5, "Body": "I can highly recommend it.\n\nBlog writing is a great way to improve your technique,\n\nDos: \n\n- Have a clear idea of your content, I value it when someone has taken the time to write good pieces summarising cool research in my area. An alternative is a 'newsreel' style blog which can also be useful to other researchers in your field.\n\n- Back it up with a social media presence (e.g. twitter/facebook/linkendin).\n\n- Keep it up! I have seen so many that just fizzle out after one or two posts.\n\n- Build a relationship with key members of online communities. I have most experience on twitter, sharing, commenting and retweeting others is a way to start. People tend to help each other out.\n\n- Post regularly (weekly/monthly)\n\n- Don't expect many readers to begin with (think less than 10), it takes time to build a presence.\n\n- Consider interviewing prominent academics, or authors of papers you find cool if you can manage it.\n\n- Break up text with videos and pictures.\n\n- Consider the type of blogging platform you want to use, medium/blogger/wordpress, each have their advantages.\n\n- Try looking at lots of different styles of blogs and see what you enjoy reading.\n\nWhat field are you in? there are many subject area blogs out there it can be worth trying to contribute, PLOS in particular have a network of blogs and are always looking for contributors (I used to manage one of them).\n\nexamples:\nhttp://fossilsandshit.com/\nhttps://genemods.wordpress.com/\nhttp://blogs.plos.org/synbio/2016/03/31/progress-and-patents-a-crispr-news-roundup/\n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6ljjin.json"}, "74": {"Subreddit": "PhD", "Author": "charika-bo", "Date": 1499357782, "Score": 3, "Body": "If you have some spare time, I think it is a good idea to have a blog or personal website for personal branding purposes. I did my personal website when I nearly finished my PhD. The website was not purely about my \"academic\" work per se. But I use it to tell people who I am and convey my other interests than academic stuff. Set aside those personal branding things, I have learnt a lot during the website making process, which I found very useful in this digital era (especially I am in the field of business/accounting). Thus, I think it is a positive move, if you have time to do it !!  ", "Permalink": "https://www.reddit.com/by_id/t3_6ljjin.json"}, "75": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1499364966, "Score": 3, "Body": "I keep an updated professional website because I study online discourse and regularly contribute to digital projects as a part of service. When I apply to new jobs it gets an uptick of hits so it's worth it.", "Permalink": "https://www.reddit.com/by_id/t3_6ljjin.json"}, "76": {"Subreddit": "WitchPhD", "Author": "raianrage", "Date": 1499376110, "Score": 1, "Body": "Greetings", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "77": {"Subreddit": "PhD", "Author": "BogusProfiterole", "Date": 1499378383, "Score": 3, "Body": "So your lab sounds fun ", "Permalink": "https://www.reddit.com/by_id/t3_6lguue.json"}, "78": {"Subreddit": "PhD", "Author": "purdybird", "Date": 1499381294, "Score": 2, "Body": "Thank you, this is such great advice! I'm in education but looking at digital literacy so I feel like for my girls in particular, engagement with tech is expected. \n\nI will definitely take your advice and check out other blogs to see how i might design it. ", "Permalink": "https://www.reddit.com/by_id/t3_6ljjin.json"}, "79": {"Subreddit": "PhD", "Author": "tingleshorts", "Date": 1499395943, "Score": 1, "Body": "I totally feel you. I'm due in a month's time (MA thesis) and sometimes I just stare at my screen. \nHere's what I do to kick my butt:\nWhen I wake up, I verbally tell myself what I will do like saying it out loud, \"work on chapter 2 up till...\" \nI get very specific with goals. When I get to my work desk, I get my document drawn up and start writing a few lines. Anything is good, even if it's just ideas/thoughts that need editing. Just enter some things till I get about 2 paragraphs in. Only then, I'll allow myself to get water/cup of coffee/get to Spotify and get music going etc. \nI find this helps so much, I often get sidetracked while \"getting ready\" to write. I mean all the instagram and whatsapp notifications are just calling out to me! \nI take regular breaks to get my butt off my seat and it helps to clear my mind. \nHang in there! You're almost at the end! ", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "80": {"Subreddit": "PhD", "Author": "BillClinternet42", "Date": 1499401843, "Score": 2, "Body": "My university had a very strict thesis format and template that we were to use.\n\nMy presentation format was something I \"settled\" for, I definitely would have spent more time perfecting it if I had had it", "Permalink": "https://www.reddit.com/by_id/t3_6k2ypr.json"}, "81": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1499404916, "Score": 4, "Body": "Super congrats Dr. :) ", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "82": {"Subreddit": "PhD", "Author": "res611", "Date": 1499405628, "Score": 4, "Body": "Congratulations! ", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "83": {"Subreddit": "PhD", "Author": "BillClinternet42", "Date": 1499426497, "Score": 2, "Body": "Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "84": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1499428907, "Score": 2, "Body": "Was it definitely a doctoral thesis and not a master's or honours thesis? A 91-page doctoral thesis on counter terrorism does seem odd. ", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "85": {"Subreddit": "PhD", "Author": "Fakhraddin", "Date": 1499430507, "Score": 1, "Body": "It did mention that the candidate did her masters in 1986 and that this thesis was done in 2011", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "86": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1499430618, "Score": 2, "Body": "Congratulations! It's such a wonderful feeling", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "87": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499430962, "Score": 5, "Body": "It depends entirely on the topic, the department and the university.\n\nMine will be around 80 pages and is basically my three papers stapled together with a 2 page intro and conclusion.", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "88": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499431040, "Score": 0, "Body": "Seems like a way to delay the work.  Just organize it, turn it in, and get out of there.", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "89": {"Subreddit": "PhD", "Author": "Fakhraddin", "Date": 1499431102, "Score": 1, "Body": "Thats very interesting. Would this have taken you 3 years to do? Or did it take a shorter period? ", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "90": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1499439032, "Score": 2, "Body": "Awesome, congrats!  Also, check out our user names", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "91": {"Subreddit": "PhD", "Author": "eesweed", "Date": 1499449530, "Score": 2, "Body": "I'm was in a similar position in that I went to work out of undergrad before doing a postgrad and now about to start a PhD (was recently offered two at once after months of applying without success). I completely get where you're coming from regarding feeling like you have something different to offer, while at the same time having some anxiety with regards to some lower grades / slightly unusual academic career path. \n\nIf it's just about grades I highly doubt it matters about your ex-classmate; you will likely have to submit your transcripts anyway. I could only see it being an issue if she had any reason to fundamentally question your current professionalism/character. Bear in mind she is also a person who (hopefully) understands that people grow/evolve over 5 years. \n\nHaving not started yet I can't claim to have any advice as an insider, just as someone who has gone through similar from the application side. My one solid piece of advice for you is: don't obsess over this one just because it's your number one choice and you got a bite (so to speak). Apply for more, talk to more supervisors. You said it yourself: \"research group fit is so important\". That's what these meetings/chats are all about. Perhaps you'll hit it off and be the best candidate, perhaps not. Perhaps your number one choice on paper will not be the same as your number one choice after meeting a few groups. ", "Permalink": "https://www.reddit.com/by_id/t3_6lubgm.json"}, "92": {"Subreddit": "PhD", "Author": "aending", "Date": 1499458105, "Score": 8, "Body": "Ugh, yea, that sounds about right. Get you a Harry to help push to the finish", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "93": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1499458867, "Score": 4, "Body": "My wife has been an all-star. I owe her some expensive vacations.", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "94": {"Subreddit": "PhD", "Author": "BillClinternet42", "Date": 1499463920, "Score": 2, "Body": "It is! Quite surreal ", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "95": {"Subreddit": "PhD", "Author": "BillClinternet42", "Date": 1499464282, "Score": 2, "Body": "Lulz. Long time no see, sorry bout your blue dress", "Permalink": "https://www.reddit.com/by_id/t3_6lrbtm.json"}, "96": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1499467659, "Score": 3, "Body": "Can confirm. Just hang on in there. \n\nThe worst thing is, when you finish, it winds down slowly, and you are left feeling pretty deflated. \n\nThat's my experience and others that I know. ", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "97": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1499480684, "Score": 2, "Body": "Would be even better if your username is `You-Know-Who`", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "98": {"Subreddit": "PhD", "Author": "NurseA26", "Date": 1499482226, "Score": 3, "Body": "I did this and it was the best decision I made. DM me if you'd like to chat! ", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "99": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1499509033, "Score": 2, "Body": "To add to this, redrafting my MSc dissertation right now and this is what I do - go through and stick in brief prompts in all caps about what I need to write here, and what I want to discuss here, and that sort of thing. It lets me restructure too and think about the big picture in a less daunting way before knuckling down to clear writing goals on each small point. Don't think about the whole write up!", "Permalink": "https://www.reddit.com/by_id/t3_6kxx17.json"}, "100": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499532623, "Score": 3, "Body": "The data itself took about 4 years to collect, the writing itself is totally negligable in terms of time.  I'm in the sciences, so page count isn't the highest concern.  In fact, the *thesis itself* isn't really that big of a concern, because your ability to graduate is determined by your production of papers.  Some journals want to publish low page count papers preferably, and if that's where you published your papers, your thesis will end up being low page count too.\n\nThere's also a lot more weight put on the logic/content of the work than the strict page count, at least in my program.  You could have 200 pages of not very interesting stuff or 100 pages of meaningful stuff, the committee would prefer reading the shorter more impactful work.", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "101": {"Subreddit": "PhD", "Author": "everyonesaysso", "Date": 1499553181, "Score": 4, "Body": "Choose your happiness, friend. ", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "102": {"Subreddit": "PhD", "Author": "pavanblazze", "Date": 1499554216, "Score": 1, "Body": "If I were you, I would first talk it out with another PhD student that was working in similar environment, ask them how they learned to cope with such things. \n\nIf you have a friend among the faculty, who's not related to your advisor, it works even better. \n\nMost universities will have a counsellor to help you in situations like these. Don't feel embarrassed. Maybe it's time you paid a visit to them. Hope you feel better.", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "103": {"Subreddit": "PhD", "Author": "thomasare", "Date": 1499562178, "Score": 1, "Body": "I am in the same situation (different PhD program), and I am meeting with my advisor soon. Am I supposed to have a well-defined hypothesis and methodology?  I don't want to make the wrong impression on the first face-to-face interaction with my advisor...", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "104": {"Subreddit": "PhD", "Author": "GiBear", "Date": 1499569763, "Score": 1, "Body": "Talk to your supervisor/any uni advisors if you can, if not, is this place \"worth\" it? There are plenty of other places to go that will fully fund you. Make sure you can get enough to live off, going into debt for a PhD is usually not worth it.", "Permalink": "https://www.reddit.com/by_id/t3_6k8123.json"}, "105": {"Subreddit": "PhD", "Author": "GiBear", "Date": 1499569978, "Score": 1, "Body": "Have used beta blockers before and they will work well if you practice with them a couple times before your presentation. If you also have any serious anxiety issues there might be other options as well. I found beta blockers worked well at first for me, but then failed to work at all in the future (for my candidacy haha :/).", "Permalink": "https://www.reddit.com/by_id/t3_6j2xyg.json"}, "106": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1499574438, "Score": 3, "Body": "I'm in my 3rd year, and most of my classmates have either slightly or completely modified their research topics (including me). I went into it with a topic and vague idea of methodology. Unless you are grant funded on a specific project, expect that changes will happen during the process", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "107": {"Subreddit": "PhD", "Author": "thorpeb", "Date": 1499588531, "Score": 1, "Body": "I feel like im im the exact same position as you. Im in month nine of my PhD in aerodynamics at a UK university. I really sympathise because this kind of overload is exactly what im Feeling with it being the time of year where we have to do copious amounts of reports etc for our sponsors. \n\nWhat is your proffesor like? Are they the type of person you could actually ask how they feel your project is coming along?\n\nIm also feeling like this might not be for me. But im also thinking that it could be because I still might not fully know whats going on yet. And I think thats ok. A lot of thepeople in these environments who look like they have it all sorted and are better than us are actually just as stressed despite their experience.\n\nSorry for the tangent. In short I would recommend asking yor supervisor how they think the project is going and how they think you as a student are developing. I think its worth remembering we are still students and we should not be expected to be good at performing solid research yet. \n\nPlease let me know how you get on. You have my sympathy.", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "108": {"Subreddit": "PhD", "Author": "phdstud000", "Date": 1499593214, "Score": 2, "Body": "Well, thank you.\n\nI talked briefly with another PhD last day about \"is it better to drop a conference or to go there an present something full of flaws?\", and he reassured me a little, but I was back on my emotional roller coaster as soon I left the uni.\n\nMy professor is very nice, it's easy to work with her, and she's the kind of person full of things to do, so much my colleagues and I often wonder how she can do it. that's why I feel a little guilty when complaining about how hard it's being for me. But she's also understanding, every time I was concerned about my results or delays (I'm often late with results) she was able to reassure me, if I let her know, for some time at least. And I think that's where I go wrong, I should probably speak more with her, but I really don't want to let her down. I know that quitting my PhD would mean to greatly disappoint her, but at least I wouldn't drag all these problems around for two more years and end up damaging her reputation somehow (very important sponsor on international level).\n\nMaybe I should ask her to let me slow down a little until I sort my problems out (when we finish the mountain of work we have to do in the next weeks and months).", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "109": {"Subreddit": "PhD", "Author": "thorpeb", "Date": 1499595413, "Score": 1, "Body": "What university are you at and what do you study?\n\nWell it sounds like you have the right supervisor to talk to. If you talk to her now its going to give everyone the chance early enough to make things work.\n\nDon't feel guilty about complaining. She will have a lot more experience and that's why she is able to handle more. Its probably a skill she picked up from someone who supervised her and helped her learn to manage projects. Let her do the same for you.\n\nI think if you feel she is approachable then talking to her can only help. And don't forget if you talk it out with her and get a plan it will only lead to success for both of you. Whereas if you keep it bottled up and you cant take it anymore she may lose progress in a project but if she really cares then the worst thing to her may be that she was not able to support some one who needed it. That will be far more disappointing for both of you regardless of personality. If she is approachable I really think you have our avenue to move forward there.", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "110": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1499598658, "Score": 1, "Body": "You could talk to the HR rep that is associated with your course and they may be able to help.\n\nDid you submit drafts to your supervisor before submission? \n\nThey will likely just need to to re-submit the report.", "Permalink": "https://www.reddit.com/by_id/t3_6lbw7o.json"}, "111": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1499598910, "Score": 1, "Body": "You will always go through cycles of being motivated and unmotivated. Sometimes the lack of motivation comes from stress sometimes from project not working but there are many reasons.\n\nI wouldn't worry. Perhaps think further ahead and when you have written your code find something else to learn that will help you out in a years time. Or perhaps you need a 2 week break (maybe take this after submitting your most recent paper or after you fix any notes from reviewer?).\n\nYou may find that, in a way, you are a bit burnt out and need a break and to come back to it for motivation.", "Permalink": "https://www.reddit.com/by_id/t3_6l09ac.json"}, "112": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1499599066, "Score": 1, "Body": "Have you thought about approaching HR for advice? ", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "113": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1499601585, "Score": 1, "Body": "Yup, one year in and not a single chapter has remained the same as my proposal.", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "114": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499609042, "Score": 3, "Body": "You won't have a clear research plan when you first start, but you really do want to get there quickly.\n\nIt isn't really about impressing your boss, but to save you time in the process of the project.  Each experiment should test a specific hypothesis, and each potential result should have direct implications for the next thing that you do/next set of hypotheses.  You want to design something that is publishable *either way* that it goes, such as addressing current dilemma or dichotomy in your field.  Beware of fishing expeditions, or pushing forward before you have a strong sense of the structure of your work.  Think through *every* possible outcome, and how the possible outcomes for each individual experiment work together to build a case for something.\n\nIn my current lab, we have two postdocs who have been flopping around for a year each without any real sense of a project.  They don't ask scientific questions and they don't know how to interpret their results because they weren't testing any hypotheses.  Don't fall into that trap!", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "115": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499611387, "Score": 1, "Body": "nice! Good luck with your defense :)", "Permalink": "https://www.reddit.com/by_id/t3_6le6p7.json"}, "116": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499612905, "Score": 1, "Body": "I have just applied there, seems like a good opportunity.", "Permalink": "https://www.reddit.com/by_id/t3_6lxjo6.json"}, "117": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499613844, "Score": 2, "Body": "The number of years it takes to leave is hard to predict before you've even begun.  It depends upon your ability to work, the success of your project (a factor which includes quite a bit of randomness), how \"pushy\" you are with your committee, and what is standard in a particular program.\n\nThe best you can do is find out which university has the fastest graduation time and then hope for something weird to happen.  I know someone who got out after only a few years because their PI ran out of money. :D", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "118": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1499614550, "Score": 3, "Body": "I don't know about top ten, but it's possible. One of my post-docs did his degree at UVA in three years... He also had two Nature papers which probably had a lot to do with it.", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "119": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499615055, "Score": 1, "Body": "Do you know if he did thesis by publication or traditional or a hybrid?", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "120": {"Subreddit": "PhD", "Author": "phdstud000", "Date": 1499615171, "Score": 1, "Body": "I guess I'll tell her I realized my work until now have been a bit sloppy and see what we can do to fix it. Good news, we presented it as work in progress (which it is) to our sponsor, so I hope we can say \"ok, we presented it in a certain way, but actually the most rigorous way to apply these methods is another one, so we'll take a small step back and adjust it\". She's 10 years more experienced than me, so probably she had to deal with the same problems and see someone else go through the same as me.\n\nHonestly I can't understand if it's just the so-called \"imposter syndrome\", or I'm actually realizing my limitations. But, anyway, thank you for your advice.\n\nI'm studying aerospace engineering in Milan, Italy.", "Permalink": "https://www.reddit.com/by_id/t3_6m2wxo.json"}, "121": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1499616830, "Score": 1, "Body": "I'm not sure actually! Sorry :/", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "122": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499617450, "Score": 1, "Body": "I'm talking about Purdue University, UCSD, ..etc. are 2 nature papers enough for PhD?", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "123": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499617896, "Score": 3, "Body": "If your field of expertise shows to be a bubble, shift to a more stable area that intersects with your area. Sure, you can get post-doc in different field from your PhD's.\nBest wishes :) ", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "124": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1499617952, "Score": 0, "Body": "I know, that's why I said I wasn't sure about top ten. It really isn't my area of expertise. My post-doc was one of my mentors; I'm only 23 haha. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "125": {"Subreddit": "PhD", "Author": "Three_Amigos", "Date": 1499619533, "Score": 3, "Body": "Whether or not you can graduate after two papers in up to your advisor and heavily field dependent. Two papers alone is really on the low end for most fields though. That being said Nature papers are kind of a big deal. Getting two in a PhD is pretty incredible. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "126": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499619811, "Score": 0, "Body": "I know someone who got 3 natures in 3 years from UPenn!! but he is very gifted.", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "127": {"Subreddit": "PhD", "Author": "Three_Amigos", "Date": 1499619952, "Score": 3, "Body": "Sure, there are a few labs at my university who could shit on a piece of paper and get it in Nature-- but it is not common or something one should expect to do in graduate school. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "128": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499620157, "Score": 2, "Body": "when i was applying, one of my potential supervisors was talking about 5 \"solid\" papers for a PhD ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "129": {"Subreddit": "PhD", "Author": "Three_Amigos", "Date": 1499620364, "Score": 2, "Body": "That sounds a lot more common than two. I know a lot of supervisors who want 3-4 papers but I do applied math/mathematical bio so my number might be lower than other disciplines. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "130": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499620679, "Score": 1, "Body": "Yes it's more than normal, because others were talking about 3-4 solid papers. I think it varies from one supervisor to another. I he/she is powerful enough in the department, you can finish PhD with one if he wants.", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "131": {"Subreddit": "PhD", "Author": "labedgrad", "Date": 1499625643, "Score": 1, "Body": "That's what I figured. I don't think it is expected of me to start writing straight away, I guess it just biils down to wanting to impress my supervisor and proove I belong in the programme!", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "132": {"Subreddit": "PhD", "Author": "phillitup", "Date": 1499628211, "Score": 4, "Body": "My advisor tells me that a PhD in any scientific topic just means you are a really good problem-solver and those skills are relatable to almost any field. ", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "133": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499635021, "Score": 4, "Body": "I think it's more about skills rather than the topic. So if you learnt a certain type of synthesis or to use a certain instrument, market yourself for jobs that are asking for those skills.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "134": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1499637110, "Score": 1, "Body": "Would mind adding some more detail? I think your comment is interesting, but I only have a vague sense of what you're communicating. Usually when I think of deflated I think of some sort of emotional disappointment. I assumed relief would be the primary emotion.", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "135": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1499645971, "Score": 2, "Body": "There is relief, but that passes quickly. \n\nWhen you complete your PhD, you are glad it's finished, of course, but you also know how much effort you put into it. You essentially got what you worked towards. \n\nThe deflation comes as you have worked hard, putting effort into something you care about, but at the end you pass the Viva, do the corrections, and then hand in. What then?\n\nOf course, some will have a job in place, or a course of action to work towards, but for others suddenly there is a vacuum. Something that consumed your life for X amount of years is now gone, and for what? The experience? Knowledge? Respect from peers? The doctorate? The letters after your name? \n\nFor me personally, I recently finished, and I am glad I had a plan in place. ie reward myself with a long vacation (three months). \n\nHowever I know that when I return it will dawn on me that i have completed an era of my life, and now it's time move on. To what though? I am not anymore certain than when I was before I started. \n\nYes, I am a doctor, and arguably an 'expert' in my field, but does that make me any happier?\n\nProbably not. ", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "136": {"Subreddit": "PhD", "Author": "z-nut", "Date": 1499651774, "Score": 5, "Body": "I think this is highly university, discipline, and specialization specific. Your personal funding situation may also play a role. In my case, I expect to down the road. I think the most reliable advice you can get is from your senior group members and then talk with your advisor.\n\nI think the biggest requirement is that is somehow furthers your skills as a research and the progression of your thesis (is relevant work).", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "137": {"Subreddit": "PhD", "Author": "rutnatuM_ainmO", "Date": 1499674973, "Score": 5, "Body": "I've been working full-time for the past 4 years of my PhD ", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "138": {"Subreddit": "PhD", "Author": "alli_golightly", "Date": 1499686793, "Score": 2, "Body": "Not where I'm from. However, I am just completing a short internship with a museum (I'm a book historian). My sup was cool with it, since it could boost my cv and make it easier for me to look for jobs outside of academia proper. I don't have a contract signed on the part of my university tho, so they had to draw up a private agreement. ", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "139": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1499689218, "Score": 3, "Body": "I don't know much about your field, but I imagine there is some \noverlap between petroleum engineering and earth sciences, so you should be able to transfer to that sort of area (or as you say material sciences) if you can show that you have the required skill set. If you have publications that would help, but also conference talks and similar presentations should also be good.\n\nIn terms of changing topic, I think a lot of people change topic to some degree between PhD and postdoc, it would definitely be helpful to know people in the field you are planning to switch to, but not necessary.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "140": {"Subreddit": "PhD", "Author": "aending", "Date": 1499696985, "Score": 1, "Body": "Ugh, sorry about that rude comment.", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "141": {"Subreddit": "PhD", "Author": "emzzie43", "Date": 1499698186, "Score": 2, "Body": "My scholarship prevents me from working more than 8 hours/wk. ", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "142": {"Subreddit": "PhD", "Author": "davidwhalley", "Date": 1499711724, "Score": 2, "Body": "But you also have to ask yourself - why would a Professor let you go when you can produce a Nature paper every 1.5 years? ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "143": {"Subreddit": "PhD", "Author": "alli_golightly", "Date": 1499723805, "Score": 1, "Body": "Aren't these a thin disguise for the kind of people who will write a thesis for you if you pay them? (no offense or sarcasm meant, I actually do not know of any of those being a serious thing) which btw could also be a solution, if just a tad bit unethical.  ", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "144": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1499725182, "Score": 1, "Body": "As if research needed to be done to determine this. Pointless waste of funds", "Permalink": "https://www.reddit.com/by_id/t3_6lguue.json"}, "145": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1499776213, "Score": 1, "Body": "I'll start. We have Nerf guns in our office, which often results in much childlike behavior and general chaos. Actually, its a good way to blow off some steam.\n\n[Sometimes, it gets a little silly.](https://twitter.com/Leelum/status/884747083554619393)\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6mlvsa.json"}, "146": {"Subreddit": "PhD", "Author": "Leo_Monkey92", "Date": 1499777170, "Score": 3, "Body": "Nothing as cool as yours, we just tease eachother when someone breaks equipment.", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "147": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499777481, "Score": 3, "Body": "Not normally, but they should.\n\nThere is this overarching impression that you must spend all day every day in the lab/office/classroom/whatever during your PhD.  Some advisors require this, but it's *your choice* whether you work for those advisors or if you work for someone else who is more flexible.\n\nWhen I want to do something for my career development that could take me out of the lab, I don't ask for permission.  I *tell* him that I'm doing it.  If it impacts my lab work, I'll come in early to make up lost time--for me and my own progress, not for him.\n\nI trust that if I'm unacceptably overbooked, he'll tell me and we can work something out.  But I definitely don't wait for permission.", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "148": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499777995, "Score": 2, "Body": "Be very careful with postdoc selection.  You may run into the exact same problem--tooling up for some new thing that doesn't exist anymore once you're out.  There is also the real possibility that you won't be any *more* employable after a postdoc than you are right now, even if you re-tool.  Ie you may have been just as likely to get a job post-PhD and learn needed skills on the job itself than you would be after a postdoc stint.  Plus, with industry experience, you are now a better candidate for many other positions than any postdoc would be.\n\nConsider meeting with a career counselor at your university to figure out what actual jobs you qualify for *right now*.  See if those aren't a more attractive position than a postdoc.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "149": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499778391, "Score": 3, "Body": "While true, hiring managers do have a \"career track\" in mind that they are looking for on a resume.  People getting PhDs generally *don't* have any of those features on their resumes, because they spent all of their time doing PhD-stuff and not stuff specific to any career track.\n\nThis is the problem--if you spend 5-8 years after undergrad filling your resume with \"PhD stuff\" instead of \"job stuff,\" you aren't going to look like someone a hiring manager had in mind.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "150": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1499778449, "Score": 2, "Body": "I was accepted into my PhD program and worked the first three years at 25hrs a week while taking classes. I only had to take about three classes a semester, so it was tough but not impossible. \n\nOnce I got to the research part though, I had to quit. Too many conflicting priorities even when \"double dipping\" and not enough time to simply sit, think, and experiment with ideas. \n\nNow I am full time and have two first author papers that are close to completion. My advisor and I even have another idea he came up with that we are exploring now. I should be able to publish at least two journal papers (EE so journals are important for us) before the end of the year, and hopefully graduate next year.\n\nI got the best of both worlds, really. I have practical industrial skills and my papers regarding new ideas are all built using them. Im glad I quit when I did because I wouldnt have had time to develop the ideas for the papers otherwise. \n\nJust my experience. Take from it what you will.", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "151": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1499781033, "Score": 2, "Body": "We do jigsaw puzzles and gossip.", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "152": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1499781115, "Score": 2, "Body": "Not with that spirit. Get yourself a Frisbee! ^Probably ^an ^excellent ^reason ^why ^I'm ^not ^allowed ^into ^a ^science ^lab.", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "153": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1499784640, "Score": 1, "Body": "Wooooooooooot!!!!!!! Drink all the beeeeeeeeeeeersssssss!!!!!! Congrats :) what a massive milestone!!!!! ", "Permalink": "https://www.reddit.com/by_id/t3_6ml46e.json"}, "154": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1499786438, "Score": 1, "Body": "I need to buy some now, that sounds chill :)", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "155": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1499797700, "Score": 1, "Body": "I'm not in your country or field so I can't really help but r/gradadmissions might have some good advice for you too.", "Permalink": "https://www.reddit.com/by_id/t3_6mnv1v.json"}, "156": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1499801521, "Score": 1, "Body": "I honestly feel data science and visualization is a very vague field", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "157": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1499803497, "Score": 2, "Body": "Another thing to keep in mind is that many professors won't \"let\" their students graduate in such a short time if they're talented enough to graduate that quickly.", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "158": {"Subreddit": "PhD", "Author": "habitual_wanderer", "Date": 1499811555, "Score": 1, "Body": "Ok, so I am not in your country or field but I can offer you this advice. Exactly what do you want to research in the field of strategy and entrepreneurship? At a Masters level you do not necessarily need to know specifically what you are interested in researching, unless it is a Master of Philosophy degree. But at the PhD level what you intend to research outweighs your background. Think about the field you are entering to conduct research. Don't show up to school without having some idea as to what you want to do with your time. Knowing what you want to research will help answer your qualifications question. ", "Permalink": "https://www.reddit.com/by_id/t3_6mnv1v.json"}, "159": {"Subreddit": "PhD", "Author": "habitual_wanderer", "Date": 1499812920, "Score": 3, "Body": "We mess with undergrads, masters students or any other poor soul unfamiliar with the building. The classrooms and offices all have numbered labels which can be easily removed or switched by anyone randomly. So in the second or third week of classes, in a new academic year, we switch all the room numbers and chaos erupts. ", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "160": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1499813273, "Score": 2, "Body": "Industry doesn't care about publications, in fact i would go as far to say don't even mention them", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "161": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1499816115, "Score": 9, "Body": "In our astronomy department we have things like Astro coffee, where once a week we gather to gossip about the neighboring Physics department, our deteriorating building, recent break ins, etc.\n\nBut astro coffee is soon followed by Astro lunch.\nBy then it's the afternoon, and everyone needs either more coffee or Astro nap time. \nAnd by the time anybody gets any work done, it's time for Astro beer.\n\nThis is all done on a Friday, so not much work is expected to begin with.   We call it Astro Friday, when ironically, absolutely no astronomy gets done. ", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "162": {"Subreddit": "PhD", "Author": "service2humanity", "Date": 1499821890, "Score": 5, "Body": "I am considering doing the exact same thing. I'm finishing off a Petroleum-related PhD in 3months but there are limited prospects in the oil industry right now due to the oil crash. So, I started taking online courses in Data Science and Big Data with the hope of finding a Data Science job when I finish. Do you have any tips and advice on career change and on transitioning into Data Science?", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "163": {"Subreddit": "PhD", "Author": "culturecouture", "Date": 1499824671, "Score": 5, "Body": "[I impress all of my fellow nerds with feats of strength and stability.](https://www.instagram.com/p/BTXmhkjhuF7/?taken-by=lisajohnson13)", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "164": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1499826002, "Score": 3, "Body": "I went from PhD -&gt; Data Science. I worked on a lot of datasets targeting different problem domains. I was hoping to work in the healthcare industry so I worked on a lot of publicly available datasets from healthdata.gov. Learn to load data in databases, write views and queries and learn to quickly prototype solutions. \n\nIt also helped me to construct narratives to get my point across. You don't have to use complicated predictive models all the time. Try to  come up with a hypotheses and test it using the data. Focus on exploratory statistics and experiment design. These are skills that you might have already learnt during your PhD. Play to your strengths.", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "165": {"Subreddit": "PhD", "Author": "aidan_morgan", "Date": 1499827310, "Score": 1, "Body": "Congrats!", "Permalink": "https://www.reddit.com/by_id/t3_6ml46e.json"}, "166": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1499832049, "Score": 2, "Body": "You can visit http://www.urch.com/forums/phd-business/ to see some profiles of other candidates in strategy.  \n  \nAn MBA will not help you with PhD admittance. Search for strategy related posts, to start learning the requirements for strategy programs.", "Permalink": "https://www.reddit.com/by_id/t3_6mnv1v.json"}, "167": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1499836518, "Score": 1, "Body": "Shit, I hadn't considered that but you are actually right. I mentioned a post-doc position because my plan had always been to stay in Academia after my PhD, but it seems that's no longer an option :/\n\n I still have some time before my thesis deadline, so I'll continue to look into the different options. Thanks for the career counseling suggestion, I had totally forgotten about that for some reason.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "168": {"Subreddit": "PhD", "Author": "xcitech", "Date": 1499836889, "Score": 2, "Body": "Well, I did my PhD in computation geoscience.. so I can say I was in the same boat as you. I spent almost a year preparing for jobs in data science. Took a bunch of ML, algo, comp-sci and stats online and classroom courses. My girlfriend stays in NYC, so made it a point to attend as many data science meetups as possible for networking. Also got a lot of advice and help from r/datascience. \n\nYou may also look at the data science bootcamps such as Data Incubator or Insight. I got selected as a fellow in DI, but didn't take it up for personal reasons. ", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "169": {"Subreddit": "PhD", "Author": "sneakpeekbot", "Date": 1499836896, "Score": 2, "Body": "**Here's a sneak peek of /r/datascience using the [top posts](https://np.reddit.com/r/datascience/top/?sort=top&amp;t=year) of the year!**\n\n\\#1: [xkcd: Machine Learning](https://www.xkcd.com/1838/) | [20 comments](https://np.reddit.com/r/datascience/comments/6bo3mk/xkcd_machine_learning/)  \n\\#2: [I need to print this out and put it on my cube.](https://imgs.xkcd.com/comics/here_to_help.png) | [11 comments](https://np.reddit.com/r/datascience/comments/6gi8lw/i_need_to_print_this_out_and_put_it_on_my_cube/)  \n\\#3: [Cheat Sheets for R and Python](http://www.datasciencefree.com/cheatsheets.html) | [2 comments](https://np.reddit.com/r/datascience/comments/66af1z/cheat_sheets_for_r_and_python/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/6l7i0m/blacklist/)", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "170": {"Subreddit": "PhD", "Author": "04binksa", "Date": 1499858712, "Score": 5, "Body": "Supervisor bingo is our personal favourite. We write down all of our favourite supervisor catch phrases like \"bloody hell\", \"do it again\", \"allow me to bore you again\". He has quite a few. Then we make it into a bingo sheet and play during the lab meeting. It's less fun now that he knows we do it though :/", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "171": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1499860431, "Score": 1, "Body": "I wont lie. I'm impressed.", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "172": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1499863298, "Score": 3, "Body": "Gotta admit I'm a big fan of the concept", "Permalink": "https://www.reddit.com/by_id/t3_6mlxwe.json"}, "173": {"Subreddit": "PhD", "Author": "phillitup", "Date": 1499870605, "Score": 1, "Body": "All those people with real jobs learning real skills. It's kind of terrifying thinking about getting a job. I've been in school my whole life. Do you have any suggestions on how to gain \"job stuff\" skills as a grad student? ", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "174": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1499875336, "Score": 2, "Body": "I did engineering, and no one gives a flying shit that I even did a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "175": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499879587, "Score": 1, "Body": "he can make me graduate and work as a post-doc or researcher and produce more natures!", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "176": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499879630, "Score": 1, "Body": "true. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "177": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1499880798, "Score": 2, "Body": "I would say that it largely depends on what type of job you want after you graduate. If you want a job in industry after you graduate, then interning can be great. It will give you a leg up in full time hiring, and also give you relevant experience on job-specific skills.\n\nIf you want to stay in academic research, national labs (for STEM) or universities, then getting continuous and consistent practice at doing research is probably the best thing for you. Nothing beats the experience of having to discuss and defend your ideas to your research advisor. When you enter the full-time research world you'll end up always doing something that requires slightly different skill sets.", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "178": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1499899649, "Score": 2, "Body": "This is more relevant than you may realise in the US.\n\nIn the UK you would have no problem but in the US you both still have to do exams early on and then supervisors hors students for 7-8 years in a lot of cases if they are good. ", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "179": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1499932102, "Score": 1, "Body": "Well, I'm funded by a project and still did a 180 on my topic in the first year, albeit within the same general area.", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "180": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1499932157, "Score": 1, "Body": "And the sooner you have a solid plan, the sooner you can work towards it, which should do wonders for motivation and productivity :)", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "181": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1499945701, "Score": 4, "Body": "I'd opt for a professional printing service for my thesis, also because I had printers with a bit of a passion...", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "182": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1499945726, "Score": 1, "Body": "Major congrats! And best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_6ml46e.json"}, "183": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499946683, "Score": 2, "Body": "Can't print it out on campus somewhere?", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "184": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1499946976, "Score": 2, "Body": "Depends on what industry.  In bio, I've seen job descriptions that specify they want \"first authorships in high-impact journals\" at the top biotech companies.  Many aren't that strict, though.\n\nTechniques/skills are more important than having papers though, unless these papers are in a research topic of specific interest to the company so that it jumps off the page.", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "185": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1499949158, "Score": 3, "Body": "Sadly, probably the latter. That doesnt mean that you should be happy with that though. \n\nYou have to work with this person for a number of years to come and that relationship needs to be sustainable. \n\nA lot of academics tend to be a bit lax on the communication, some due to volume of email, some due to schedule and some just because it's in their nature to be well meaning, but forgetful. It is, however, harder to ignore a person standing infront of you. ", "Permalink": "https://www.reddit.com/by_id/t3_6n169u.json"}, "186": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1499950140, "Score": 1, "Body": "i found another supervisor that is responsive, should i switch supervisors? the first is a bigger name in the area.\n", "Permalink": "https://www.reddit.com/by_id/t3_6n169u.json"}, "187": {"Subreddit": "PhD", "Author": "CskW_", "Date": 1499951175, "Score": 1, "Body": "That was my initial thinking as the university has a print service (0.3p colour and 0.15p b/w) but doing some of the rough costs \n\nSay for 250 pages thesis printing 3 copies *(external, internal, myself)* price wise come out pretty much the cost a buying a printer.  ", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "188": {"Subreddit": "PhD", "Author": "CskW_", "Date": 1499951301, "Score": 2, "Body": "haha, i'll have to scout out what the folk we have are like :) ", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "189": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1499951355, "Score": 3, "Body": "Who can answer this question? My supervisor is unresponsive like yours and I wish I could have switched early on. But then the person I would have switched to might have been awful and given me terrible advice causing me to fail. Just make your best judgement and then try to live with it.", "Permalink": "https://www.reddit.com/by_id/t3_6n169u.json"}, "190": {"Subreddit": "PhD", "Author": "alphanumericsheeppig", "Date": 1499952026, "Score": 1, "Body": "When I was in my final year, a group of 3 got together, bought a printer, printed what they needed to, and then sold the printer 2nd hand. Too bad I'd already printed by then.", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "191": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1499954203, "Score": 5, "Body": "And no, he didn't stipulate two decimal places or TNR until our last meeting where he chewed me out for thirty minutes on this stuff. I should know this stuff, he says. I feel like I'm losing my mind.", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "192": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1499955969, "Score": 2, "Body": "Keep your calm bruh. Its stressful writing up stuff. Have discussed this with your guide?", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "193": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1499957345, "Score": 2, "Body": "What is my guide?", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "194": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1499958773, "Score": 2, "Body": "I mean supervisor", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "195": {"Subreddit": "PhD", "Author": "richljames", "Date": 1499959256, "Score": 1, "Body": "I just started 3 days ago, and I am already booked.  Which was my biggest worry.", "Permalink": "https://www.reddit.com/by_id/t3_6lxjo6.json"}, "196": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1499959628, "Score": 2, "Body": "Is that supposed to be different from my chair?", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "197": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1499961201, "Score": 4, "Body": "I'm no expert, but AFAIK professional doctorates are not considered the same level as a PhD in academia. Now, as far as prenominal letters goes I don't know, but if you want into academia as opposed to industry, which the degree is geared for, you'd be better off with a PhD.\n", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "198": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1499969303, "Score": 2, "Body": "Um, we in uk call supervisor as a guide who help with the phd. If you say your chair is your supervisor, then you might need to contact your head of department or phd programme manager.", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "199": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1499975080, "Score": -1, "Body": "Shrug. I'll just make the changes and hope he's happy. Usually a very nice man. Has been grumpy this month. I've had really really abusive advising professors in the past. This is fine.", "Permalink": "https://www.reddit.com/by_id/t3_6n1qm6.json"}, "200": {"Subreddit": "PhD", "Author": "carnivorous689", "Date": 1499977495, "Score": 3, "Body": "There are major differences. First of all the PDEng is only offered in a couple of Technical universities in Netherlands, nowhere else (not even in the UK). In the UK you either have the PhD option which is usually 3-3.5 years full time or the EngD which is 4 years full time (usually).\n\nThe PDEng only lasts for 2 years. I'm not sure about the Dr. title but i doubt it has the global recognition that the PhD/EngD have. If you're looking for a doctorate degree focused on industry rather than academia, I'd go with the EngD", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "201": {"Subreddit": "PhD", "Author": "katrahura", "Date": 1499977733, "Score": 1, "Body": "Nobody has it figured from day one. I am at the end of my first year and I have only now put together a compact proposal and research questions (which I am sure will be modified along the way slightly again). You need to be very flexible with the PhD and leave room for changes because improvements come with them. ", "Permalink": "https://www.reddit.com/by_id/t3_6m3xda.json"}, "202": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1499977901, "Score": 2, "Body": "In the UK an EngD also confers a doctorate. I don't think there is a prejudice either way, generally EngD implies a funded project, and you spend time within a company.", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "203": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1499978577, "Score": 1, "Body": "I bought an inkjet for my soft copies for my viva. I will get a professional printer for the hard bound versions.", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "204": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1499982413, "Score": 2, "Body": "The EngD in the UK gives you doctorate, yes.  However, the Dutch PDEng is definitely not equivalent to a PhD; it's a 2 year \"post-masters\" program and is heavily industry-oriented.  It does usually come with a stipend but it's less than a PhD student makes.  I know a few people who did a PDEng and then went on to do a PhD on the same topics and at best it shaved a year off the total length of their PhD.  ", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "205": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1499986241, "Score": 1, "Body": "I've noticed some universities are now instituting 'post-masters' degrees. My uni set up a DPsych which is essentially, from my understanding, 1.5 years course work, .5 years clinical placement and 1 year of a mini-thesis/research project. So it's basically an extended Master's, but under the guise of a 'doctorate'. However, it's very difficult to discern whether it's a legit doctorate or not. \n\nI feel this is going to become more common in the future, creating a lot of ambiguity with what constitutes a doctorate, and perhaps devalue the traditional Doctorate (PhD) qualification. ", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "206": {"Subreddit": "PhD", "Author": "Im_Not_A_Socialist", "Date": 1499988282, "Score": 6, "Body": "Do they have tips for ready more good as well?", "Permalink": "https://www.reddit.com/by_id/t3_6n58r7.json"}, "207": {"Subreddit": "PhD", "Author": "xcitech", "Date": 1500006934, "Score": 2, "Body": "My job (starting in september) is in tech, and I am inclined to remain in the tech industry in the future. The publications, if I choose to continue with my research, will be in theoretical geoscience, of no direct interest to prospective employers.", "Permalink": "https://www.reddit.com/by_id/t3_6mn89p.json"}, "208": {"Subreddit": "PhD", "Author": "alesierra28", "Date": 1500022759, "Score": 3, "Body": "Just keep pushing yourself and think about the amazing stuff you will accomplish. At the beginning it may be hard, but trust me little by little you will get it! ", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "209": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500033818, "Score": 1, "Body": "Ignore all of the rules about \"you can only have one job--and that job is your thesis/research!\" and try to intern at a company, or even do part time/remote/contract work for a company if you can.\n\nWhat company/industry/whatever you choose depends on your interests for what you want to do in the future.  If you want to work at a biotech company after grad school, a teaching fellowship associated with your university won't help you.  An NRSA won't help you.  A conference award won't help you.  An internship at a pharmaceutical company *will* help you, though.  Working as a science advisor to a life science consulting firm could help you.  If nothing else, making a fancy business card and ducking out of lab early to hand it out at biotech networking events will help you.  I'm talking about biotech here because that's what I know, but there are versions of this for whatever field you want to go into.\n\nIf you have a career counselor at your university, start going to them!  Come to them with a plan to 1) learn about an industry; 2) learn about how to get into it; 3) write a resume for an entry level position in it; 4) identify missing skills and ways to acquire them; 5) attend at least 1 networking even with a business card to make contacts.  Your counselor should know exactly how to help you do each of these steps!", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "210": {"Subreddit": "PhD", "Author": "Charlotka", "Date": 1500034199, "Score": 2, "Body": "I'm going through a similar situation right now. Still haven't found my own motivation, but goox luck to you!", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "211": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500034331, "Score": 2, "Body": "There is so much advice out there that boils down to \"dunno what you want to do?  Do a postdoc to bide your time!\"  That is INSANE to me, considering you usually have to move for a postdoc and barely get paid more than you were as a grad student, some health insurance plans are WORSE than grad student plans, and you still get no retirement matching.  You're basically doing grad school all over again but without having to give journal clubs.  But you won't have any more time to \"figure it out\" as a postdoc than you did as a grad student, so what is the point in biding the time?\n\nUnless you get a postdoc that is a significant step up from the \"level\" of your grad lab (state school to MIT) or you want to go in a completely different direction (you're a psychology grad student who wants to go into biotech so you postdoc at a CRISPR lab), the postdoc adds only marginal benefit to your resume.\n\nConsider part time/contract work also that you can start right now alongside wrapping up your thesis.  You'll feel a lot less pressure to default to a postdoc if you have some income and you're building some relevant experience to get your feet wet.", "Permalink": "https://www.reddit.com/by_id/t3_6m8ajb.json"}, "212": {"Subreddit": "PhD", "Author": "bwc6", "Date": 1500035866, "Score": 1, "Body": "What field are you in? What country are you in? I never submitted a research proposal before I interviewed, so I can't help you out.", "Permalink": "https://www.reddit.com/by_id/t3_6n8l1j.json"}, "213": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1500037164, "Score": 2, "Body": "try to think about what drove you to do a PhD in the first place, it is very easy to lose sight of", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "214": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1500037364, "Score": 2, "Body": "For science (might be the same for other fields) - read the latest papers of who ever is interviewing you, think of some questions to ask, showing an interest in there work is helpful. Be your self! Also remember it is a two way thing, you should also use it as an opportunity to make sure you like the place and the people, you are going to have to work there and with them for several years! again if science try to find out a bit about your potential supervisor, are they good at supporting students or not.", "Permalink": "https://www.reddit.com/by_id/t3_6n8l1j.json"}, "215": {"Subreddit": "ADPhD", "Author": "oldireliamain", "Date": 1500050887, "Score": 1, "Body": "Just downloaded.  I usually wake up later on weekends, since I have to wake up at 6.30 for work.  Does it distinguish weekend wakeup time from weekday?", "Permalink": "https://www.reddit.com/by_id/t3_6l05zc.json"}, "216": {"Subreddit": "ADPhD", "Author": "gingersnaplibido", "Date": 1500052739, "Score": 1, "Body": "you're allowed to set what mornings you want it to apply :)", "Permalink": "https://www.reddit.com/by_id/t3_6l05zc.json"}, "217": {"Subreddit": "ADPhD", "Author": "oldireliamain", "Date": 1500053423, "Score": 1, "Body": "Awesome!\n\nDid you find you were more successful as the app added habits for you over time, or if you added habits yourself all at once?  I'm worried I'll schedule so much I overwhelm myself", "Permalink": "https://www.reddit.com/by_id/t3_6l05zc.json"}, "218": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1500054499, "Score": 1, "Body": "They rejected my application :(", "Permalink": "https://www.reddit.com/by_id/t3_6lxjo6.json"}, "219": {"Subreddit": "PhD", "Author": "CskW_", "Date": 1500054793, "Score": 7, "Body": "From one stranger on the internet to another, best of luck for the future.", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "220": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1500057450, "Score": 7, "Body": "This might be a blow to your supervisor 1 year in. But your needs and priorities come first. Ensure u secured a job before jumping or you might looking for a long time.", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "221": {"Subreddit": "PhD", "Author": "LeonEntreLosDioses", "Date": 1500060453, "Score": 1, "Body": "This is what my masters supervisor said too [that it's a post-masters diploma]. I'm currently more interested in the industry than on academia, but I've no clue if the industry accepts PDEng as a valid doctorate either.", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "222": {"Subreddit": "PhD", "Author": "LeonEntreLosDioses", "Date": 1500060735, "Score": 1, "Body": "Thank you so much for your reply. The recognition of PDEng in the industry is what worries me. I'm interested in the industry than in academia, and I want to know if organisations that require PhDs (at positions like chief engineer, or technical head for example) consider PDEng to be a similar degree.", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "223": {"Subreddit": "PhD", "Author": "LeonEntreLosDioses", "Date": 1500060826, "Score": 1, "Body": "This is what my masters supervisor said too [that it's a post-masters diploma]. I'm currently more interested in the industry than on academia, but I've no clue if the industry accepts PDEng as a valid doctorate either.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "224": {"Subreddit": "PhD", "Author": "davidwhalley", "Date": 1500070175, "Score": 2, "Body": "yes, but then he has to pay you more as a post-doc", "Permalink": "https://www.reddit.com/by_id/t3_6m7yo2.json"}, "225": {"Subreddit": "PhD", "Author": "Mythsterious", "Date": 1500093490, "Score": 1, "Body": "Don't 'work-around' it...are you serious dude?  What does this post even mean?", "Permalink": "https://www.reddit.com/by_id/t3_6ndm9j.json"}, "226": {"Subreddit": "PhD", "Author": "Mythsterious", "Date": 1500093691, "Score": 2, "Body": "Definitely do an internship.  Do as many as you need to get a job.  Don't forget why you are in school...it's not to do continue to be a perpetual student despite whatever lifetime academics try to convince you of", "Permalink": "https://www.reddit.com/by_id/t3_6mam9k.json"}, "227": {"Subreddit": "PhD", "Author": "BecB21", "Date": 1500095965, "Score": 1, "Body": "So write a detailed description? ", "Permalink": "https://www.reddit.com/by_id/t3_6ndm9j.json"}, "228": {"Subreddit": "PhD", "Author": "Mythsterious", "Date": 1500096441, "Score": 2, "Body": "Why not?  At best you make your supervisor look like an idiot, at worst you get your paper pushed through.", "Permalink": "https://www.reddit.com/by_id/t3_6ndm9j.json"}, "229": {"Subreddit": "PhD", "Author": "Doorknob_Goswami", "Date": 1500098225, "Score": 2, "Body": "This might seem a little juvenile, but I suggest using the power of the written word. \n\nTake a sheet of paper, write down all the stuff you've accomplished in the course of your work so far. Throw in some funny incidents, doodles if you're creative. On the other side of the sheet, write down all that you need to accomplish. Neat, concise and realistic targets. Remember, your accomplishments and goals are the 2 sides of the coin (or on the sheet). Have the sheet with you and have a glance at it when needed. But you should look at both sides. \n\nAfter that, the more important thing. Stop wasting time thinking you need motivation all the time. The aim here is to convince yourself that \"Great work is its own reward\". \n\nGood luck. ", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "230": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1500104946, "Score": 1, "Body": "Industry outside of the Netherlands will not be familiar wtih a PDEng and therefore won't accept it as one (especially since it's only two years); industry inside the Netherlands knows that it isn't one.  \n\nHowever, in my experience, lots of international students used the PDEng program as a way to get into local industry jobs after graduation.  Applying cold from another country is difficult but if you've successfully done a PDEng project with the company and networked well while in the program you're pretty employable (but not as a PhD, probably as a masters graduate).", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "231": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1500108179, "Score": 1, "Body": "That's amazing prices if UK based for printing off. When I printed my soft bound copies it was about £300 for 3 copies of 320 pages (with 70 colour) ", "Permalink": "https://www.reddit.com/by_id/t3_6n08wi.json"}, "232": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1500108467, "Score": 1, "Body": "Are you US-based? Because not being able to defend until you've published x papers is something American PhD students told me when I had a conference out there. In the U.K. \nThere is no requirement to publish - just that the data are \"publication worthy\" but it obviously helps your examiners decide if work has already been peer-reviewed and published. ", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "233": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1500109247, "Score": 1, "Body": "I had the same experience with my PI always having ideas on what to do. Eventually you have to stand up to them even though they are your boss and say \"no I won't do that\" and then give reasons why. I stated papers I read that made that avenue seem inappropriate or that it wouldn't make sense within the framing of my idea of what the thesis would look like. \n\nIt's hard to tell them to back off but you will be worked like an animal with no respect or gratitude. There's some fantastic supervisors out there like my co-supervisors who gave me advice on how to strengthen the thesis etc but others want to use you for 3 years to boost their career (it looks good to have PhD students). ", "Permalink": "https://www.reddit.com/by_id/t3_6l5ivw.json"}, "234": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1500125440, "Score": 2, "Body": "What title would you get once you submit your thesis? ", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "235": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1500131173, "Score": 2, "Body": "Take a week off and chill. You're overthinking things dude. ", "Permalink": "https://www.reddit.com/by_id/t3_6nfo5l.json"}, "236": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500133393, "Score": 1, "Body": "Yeah, I'm US based.  It is quite variable depending on program, though.  The \"X papers published\" rule is more like \"7 years or 3+ years + X papers published, whichever comes first\" in some programs.  The last 3 people to graduate from my program didn't have *any* papers, but they were here for a long time.\n\nThe idea is that the PIs want to get something out of their time and efforts, because once you're gone it becomes a lot harder to get your data out.\n\nWhen you get to graduate also seems to depend a lot on how valuable you currently are to the program/PI depending on various factors.  I actually met the publication requirements to graduate at year 3, but it was considered too \"early\" to let me go and they figured they needed to keep me since I had some additional promising data on a new project.  So here I am, end of year 5, being told that I need to push out this last paper before they'll let me go. :D  This insistence on pushing out the last paper has only grown stronger as   Alternately, a friend in my year got out after year 3 because her PI ran out of money--her continuation in the program was less advantageous to the department since she'd have to start completely over in a new lab.  Third scenario: a labmate of mine has 2 first authors and a couple second authors at the end of her 5th year and her committee is *still* trying to keep her for another year+ because its advantageous to them in various ways--she's been the go-to person for a lot of the new personnel training, and she's partnered up with a postdoc who is working under a collaboration between multiple PIs.  Being such a valuable asset to multiple ongoing projects translates into \"not being ready yet\" or \"just learn this one more technique before you go.\"\n\nThe NIH is trying to clamp down on this kind of thing to shorten programs, but the problem is that these programs don't provide students much preparation for actual working life beyond the postdoc track.  What good is a short program if you aren't employable afterwards?  This is why I so strongly advise fellow US PhDs/postdocs to take a hard look at what you're spending your time on and figure out if you're actually getting anything tangible and marketable out of it.  If your committee is pushing another year on you, spend 6 months of that in a non-university contract position or something.  If you listen to your PIs advice to never leave the lab, or you exclusively perform university-related part time positions, your CV will look like a \"perpetual student\" instead of a working professional.  If *you* don't spend it for *you*, your program will spend it for you on stuff that benefits them.\n\nWell, that was a rant :D", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "237": {"Subreddit": "PhD", "Author": "berfection", "Date": 1500133651, "Score": 2, "Body": "You don't have to buy a ticket to go somewhere. You just need a break from academia. Take a week to have a \"staycation\" and put an out of office reply on your email. Then give yourself time to reset. Hang in there!", "Permalink": "https://www.reddit.com/by_id/t3_6nfo5l.json"}, "238": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500134066, "Score": 3, "Body": "Believe me, \"cum laude\" and \"excellence\" don't mean jack shit in the real world.  You saved yourself years of your life and made a decision that you stand behind, which really matters.\n\nAs others have said, put emphasis on the job hunt.  Get a job first and then put the thesis in their hands.  You have the advantage at this point.", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "239": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1500134675, "Score": 1, "Body": "Your last paragraph is very true but in a different way here. You need to be employable but I don't think the PhD (in the U.K. anyway) has done a good job of being dynamic enough to adapt and train students in any career but as an academic post doc. \n\nI'm training to become a clinical scientist (a scientist who trains in the same route to become a consultant medic - instead consultant scientist -in that field, so for UK the Fellowship exams of the associated Royal Colleges) and everyone from my uni, supervisors included almost turn up their noses at me for not pursuing postdoc positions. \nPeople still seem to refuse there is an alternative to the tried and tested path. I still conduct research and there are the all-important PhD transferable skills that I think you learn whatever the duration; independence, ability for critical analysis, tenacity, leadership, initiative. \n\nIf the PI wants to keep you post 3-4 years they should fund your post doc, as what was continually offered to me, despite me saying I had no intention of doing that. ", "Permalink": "https://www.reddit.com/by_id/t3_6lsqjt.json"}, "240": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500141620, "Score": 10, "Body": "There is a lot we don't know that would help us provide advise. What was your reason for pursuing the PhD? Field of study? Are you paying or is it free? How do you survive financially? Why aren't you working on what YOU want to? Is this in the US? The point of Doctoral programs is to develop yourself into a researcher who can act independently, so lack of guidance, and, getting sent a paper as a resources is part of what a PhD is. If you switched to another school you'd likely lose whatever credit you've earned in your current program.\n\nYou've already invested a shitty year, don't throw it away too quickly. School sucks, even for those of us who enjoy learning.\n", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "241": {"Subreddit": "PhD", "Author": "readyforhappines", "Date": 1500147057, "Score": 5, "Body": "Sounds like youre looking for your dream cushy PhD position. This is going to be a very taxing and hard experience. There will be things you don't like about any lab you go into. It's never going to be perfect. \n\nGetting a PhD is not like getting a master's degree or an undergraduate degree. As the other commenter has said, getting a PhD is about learning to work and think independently. It doesn't sound like you disagree with your advisor on a personal level, so I think it will just take some getting used to the lifestyle of a phd student. Remember, it's only for 4-7 years. You're already a year through it.  My father has given me some good advice my entire career. Any time I have problems with school he always says it. You're there to graduate. You're not there to make friends or have fun. It's school, your number one goal is to graduate. It won't hurt to enjoy yourself, and have fun. But your goal is to graduate.\n\nIf you don't like the work you're doing, working long hours, or working independently then continuing a PhD in your current position probably isn't the right decision.\n\nGood luck buddy. Hope everything works out.", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "242": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1500163741, "Score": 2, "Body": "ABSOLUTELY NOT!", "Permalink": "https://www.reddit.com/by_id/t3_6ngxhe.json"}, "243": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1500167948, "Score": 1, "Body": "So.....do it?", "Permalink": "https://www.reddit.com/by_id/t3_6ngxhe.json"}, "244": {"Subreddit": "PhD", "Author": "p10_user", "Date": 1500176815, "Score": 6, "Body": "It sounds like you don't have your work environment to your satisfaction but this is an easy fix. \n\nClean up your work space and make it your own (I brought my vacuum cleaner to my lab on the weekend once). If you hate your workspace, find a cushy chair in a secluded area to work with a laptop or something. \n\nFind someone to talk to and bounce ideas off of. Get coffee or lunch with them regularly. It's easier if it's someone in your own lab but if that isn't happening find a peer in a different lab. \n\nYou have to find your own way to make things work. As long as you are at least somewhat motivated and enthusiastic about your work and you have a supportive PI that you can communicate with then you can fix these other things. ", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "245": {"Subreddit": "PhD", "Author": "Larianna", "Date": 1500181152, "Score": 3, "Body": "Couldn't agree more. Of course you will get a paper if you're a PhD stundent asking other academics for useful information...do you expect them to summarize the papers for you? \nGetting a PhD is isolating and hard. It's really not just about being smart, much more so about research skills, independence, perseverance, and intelligent stress management. \nYes, funding tends to be volatile. You are not the only victim there, being pushed from one chair to another for financial reasons happens all the time. \nIf you find it hard to connect to your colleagues, take initiative. They are probably shy and socially awkward. Also not out of the ordinary in a PHD program.", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "246": {"Subreddit": "PhD", "Author": "LeonEntreLosDioses", "Date": 1500187810, "Score": 1, "Body": "Thank you so much. It's much clearer now.", "Permalink": "https://www.reddit.com/by_id/t3_6n1d6e.json"}, "247": {"Subreddit": "PhD", "Author": "mustafafayez", "Date": 1500192711, "Score": 2, "Body": "Why did you enroll in the program at first???? to quit now because of a problem that is already solved (since you now have the fund)? If you quit now you would have just wasted the past years doing nothing for your future. If you resumed the program, you will accomplish something good for your future. I know it seems difficult now, but believe me it's not as difficult as it seems.\n\nbest wishes.", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "248": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1500196847, "Score": 1, "Body": "Yes, I don't see a reason why not. ", "Permalink": "https://www.reddit.com/by_id/t3_6ngxhe.json"}, "249": {"Subreddit": "UNEMPLOYED_GUY_PhD", "Author": "Capt_Reynolds", "Date": 1500204141, "Score": 2, "Body": "How about a good sandwich? ", "Permalink": "https://www.reddit.com/by_id/t3_6mrsra.json"}, "250": {"Subreddit": "PhD", "Author": "RandomRedditPhDGuy", "Date": 1500225876, "Score": 0, "Body": "I am stuck to a funding with deadline from NSF - which clearly indicates that yes I am in the USA. I don't know, I can still work very efficiently and produce output on a regular basis. It is just I am demotivated as hell these days... The thought of going to work just disgusts me and I believe I am at least thrice more productive at home compared to work place...", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "251": {"Subreddit": "PhD", "Author": "RandomRedditPhDGuy", "Date": 1500225913, "Score": 1, "Body": "I will need to try in the other lab - thanks! My lab as I described is a shit show...", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "252": {"Subreddit": "PhD", "Author": "RandomRedditPhDGuy", "Date": 1500225940, "Score": 3, "Body": "That really means a lot. Damn I never know PhD can hit like a truck...", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "253": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500234733, "Score": 3, "Body": "I have not had this. If your anxiety manifest in such a negative way it might be wise to seek professional help. ", "Permalink": "https://www.reddit.com/by_id/t3_6nmrvn.json"}, "254": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1500240476, "Score": 2, "Body": "https://marketing.eller.arizona.edu/people/caleb-warren \nCaleb Warren studies humor in the context of consumer behavior and has worked with PhD students.", "Permalink": "https://www.reddit.com/by_id/t3_6no82e.json"}, "255": {"Subreddit": "PhD", "Author": "ursath", "Date": 1500243965, "Score": 3, "Body": "Not enough info. What era, are you specialising in an area, which country are you applying in, etc etc. Do you have a Masters? ", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "256": {"Subreddit": "PhD", "Author": "ursath", "Date": 1500244050, "Score": 3, "Body": "usually PhD students receive an MPhil after passing their first year of their PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "257": {"Subreddit": "PhD", "Author": "ursath", "Date": 1500247569, "Score": 3, "Body": "Good on you. I'm currently looking for jobs outside academia (post-PhD, mind you) and it's hard to admit to others. Feels like a betrayal almost. ", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "258": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1500248615, "Score": 3, "Body": "Which languages? I could read Swedish after a year no problem but Japanese took like 5 years before I could read anything complex", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "259": {"Subreddit": "ADPhD", "Author": "spaceblip", "Date": 1500258712, "Score": 3, "Body": "Right now I'm using three things: a bullet journal (a sort of custom planner system), the default iPhone calendar, and Habitica (a habit gameification app). \n\nThe bullet journal is where I dump my daily tasks, thoughts, things I need to remember, etc. I keep it with me basically at all times, now. I mostly stick to the \"standard\" method except that I migrate tasks weekly instead of monthly, because I need to frequently look over tasks to remember them. \n\nI also have a lab notebook where I keep all my research stuff, (I'm an experimentalist,) and I've started using a bullet journal system there, as well. Indexing pages has been a big help. \n\nFor both of these notebooks, I use colourful highlighters, because my brain finds monochrome text to be extremely boring, which makes reading difficult, and causes me to skip details. Highlighting helps with that; I can use different colours to add urgency to things, categorize things, etc. \n\nI use the iCloud calendar for stuff like appointments, my class schedule, remembering birthdays, etc. I also keep a calendar in my bullet journal, but anything that I absolutely cannot forget goes into the digital calendar. \n\nI have it set up as a widget on my phone so that I'm always up to date, and I also keep it in a pinned tab in my browser on my work computer. I would use Google Calendar if it had a widget on iOS, but unfortunately it doesn't. \n\nHabitica I use for habits that I have difficulty getting done, because it gives me an extra reward for getting tasks done. Stuff like doing the dishes, taking out the trash, etc. \n\nI also have a couple of habits in Habitica that are just titled \"finish journal task\" with varying degrees of difficulty so that I can also reward myself for anything I cross off my bullet journal without having to have that exact to-do task set up in Habitica. \n\nNow that I write this out, it all seems fairly convoluted, but it's working for me so far, at least in the sense that I'm not forgetting to do things. My habits (especially cleaning) could still use some work, though. And I still procrastinate a lot, I need to work on that. ", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "260": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1500271542, "Score": 1, "Body": "They don't need to really come up with something new again, they don't need to do as much research, they mostly create teaching material based on existing material and maybe involve themselves in side projects. They finish when the class they're teaching finishes, they control how much work they want to give and how much they want to mark. ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "261": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500272307, "Score": 2, "Body": "That may be true. A common trait I observed even in professors who focus on research and not on teaching, is that they expect all ideas and all problem solving to be done by the students and be presented by an already digested range of options so they can give their opinion on. In other words, they just evaluate your progress and counsel you but they don't search and grind to find solutions as their students do. Thanks for your answer", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "262": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1500275229, "Score": 6, "Body": "Anxiety and stress are reactions to a situation, not descriptions of the intrinsic level of work or expectations.  Many professors (especially pre-tenure) face more work and higher expectations than they did as grad students, but they have gotten to that position because, among other things, they have learned to be highly efficient and manage their emotional reactions to a heavy workload.  ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "263": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500279835, "Score": 2, "Body": "Does that mean that PhD students who experience stress and anxiety are not fit to become professors ?", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "264": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1500286514, "Score": 1, "Body": "Do you have any industry specific software that you are likely to be using? I find at least in my field a lot of software is Unix based so that means Mac or Linux. Since pro software like MS office doesn't exist on Linux then Mac is the default option. Otoh it's also possible that ur field is Windows only software in which case most laptops would also work. Personally my preferences ATM would be either a MacBook Pro 13 mid tier or a dell xps 13. Both solid laptops with great support. \n\nEdit: missed the part about the budget. The low end xps13 is a little over ur budget but I think it's definitely worth the extra. https://www.amazon.co.uk/gp/aw/d/B01MCVYGQZ/ref=psdcmw_429886031_t1_B018FSWX44 \n\nMacBooks might be a little out of reach for 1000gbp unless you opt for the 2015 model, which is respectable still or the air which I wouldn't recommend. ", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "265": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1500287638, "Score": 3, "Body": "The PhD peeps I know who experienced significant stress/anxiety do not go on to become professors. Though its not usually to do with their capabilities in research, but rather, their PhD experience as a whole has just put them off a career in academia. They just went off to pursue less intense careers such as making beer or teaching in a high school. \n\nOne thing that baffles me is when people have done a master's thesis but really, really struggled in this experience and required extensions and so on, and then yet decide to pursue a PhD thinking it'll be all fine and dandy? If you found doing a master's thesis stressful, you'll find doing a PhD thesis a hundred times for stressful. Anyway, I am ranting. ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "266": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1500289305, "Score": 3, "Body": "In some cases, tenure.", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "267": {"Subreddit": "PhD", "Author": "Woozle64", "Date": 1500289504, "Score": 2, "Body": "I use a Lenovo x250 12.5\" laptop, I like it because it's light weight and has a 12+ hour battery life. It's not the fastest, but it handles MS office and matlab pretty well. I really enjoy not having to carry a charger with me.\n\nMost of my work is simulations run on a server through remote access, so I don't need much local computing power. If I do need some I have a workstation desktop in my cubicle and one at home.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "268": {"Subreddit": "PhD", "Author": "nemesis18082", "Date": 1500293895, "Score": 1, "Body": "You mentioned the need to use equipment specific software, so I recommend you let this guide your choice of operating system. My equipment necessitates Windows, but there are a number of Linux based tools I use also. I've set up a virtual machine with a lite version Ubuntu which works great and gives me good flexibility to use the tools I need without hassle of having to dual boot.\n\nAs far as hardware, I've used Lenovo for quite some time. Currently using a Lenovo T440s (I think they're up to the  T470 series now) which I find to be a great balance between battery life, performance, and portability. If that's out of your price range, they offer an E series which is cheaper, but still performs quite well. You just lose a few extra display ports and the tougher build of the T series.", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "269": {"Subreddit": "PhD", "Author": "Yeti_-", "Date": 1500298622, "Score": 2, "Body": "Justification x 1000000.\nAlso, try and put together a 3-miute thesis presentation. This will help you crystalise in your own mind how your work is relevant to your field and how you are contributing. It will help you to avoid tripping up when they ask those deceptively simple questions to which they are looking for a higher level answer. \n\"Why are you interested in this field\" etc.. \n\nI know we all know the answers to these questions, but sometimes trying to articulate it on the spot can be tricky, especially in a viva.", "Permalink": "https://www.reddit.com/by_id/t3_6n2auj.json"}, "270": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1500301333, "Score": 2, "Body": "I think there are more and more applications and experiments that require coding and scripting to become feasible. We have been moving into the realms of big data for quite some time and I don't mean ISP or Google sucking up everyone's private lives. I mean, a lot of experiments nowadays require processing a huge amount of data to make sense of them. Gone are the days where you can do a few experiments with clear univariate or dual-variate relationships. Multivariate analysis is heavily used and often deals with a lot of variables all convoluting together. I don't know much about physical chemist but this is especially true for biochemistry, biology and analytical chemistry. Even NMR is being used for profiling highly complex matrix solution using some very creative pulse programs and that is definitely in Pchem realm. This means you need a lot of routine, highly repetitive steps to process these data and that means a lot of coding. Without scripts, it is nearly impossible to do. Learning to code will not be detrimental.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "271": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1500301716, "Score": 4, "Body": "Coding is a hot skillset for all PhDs, even if it is just doing statistics in R. Of course, you probably didn't go into physical chemistry to do coding, but in response to \"is it worth my time learning to code?\", the answer is probably yes.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "272": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500301869, "Score": 3, "Body": "&gt; tenure\n\nYou are right, and I also think having a salary matters a lot (instead of struggling financially ) ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "273": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1500303646, "Score": 2, "Body": "Indeed. I do not think I will ever go into academia as a research professor, the stress I feel is just not worth it for my life. ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "274": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1500304117, "Score": 3, "Body": "I always think that once you have experienced pains a certain number of times, you become immune to them. \n\nWe are just lvl 10 while they are already lvl 80 RPG. We facing lvl 15 boss might be a final climax while to them it is just farming. Not to mention once you reach somewhere around lvl 50, you starts getting assists from global players as well. ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "275": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500305114, "Score": 1, "Body": "Is it pay-to-win as well ? :)", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "276": {"Subreddit": "PhD", "Author": "Andge0", "Date": 1500305924, "Score": 3, "Body": "I work in tissue engineering and do a lot of finite element modeling and for the most part my Dell xps13 has been awesome, but the top of the line processor and RAM might be out of your price range. Fellow grad students really like their Lenovo yogas which I believe are just a bit cheaper ", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "277": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500309434, "Score": 1, "Body": "PhD students have a lot on the line.  They're underpaid and may have no finances to fall back on, typically haven't had time in their lives to become marketable in anything else, and a failed experiment can actually be the downfall of years of personal work.\n\nI found that developing a \"secondary career\" outside of my science career to actually *decrease* my level of anxiety and stress.  There is less riding on the success of my PhD project.", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "278": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1500309613, "Score": 1, "Body": "Go around the department folks and ask if there are any funds for this.  You shouldn't accept having to fork over personal money for work materials.  Simply tell them that you cannot afford a £1000 laptop on the university stipend.", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "279": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1500311767, "Score": 10, "Body": "Worked part time as a lecturer in the department, and also as a student support provider. Saved money for about a year, and am now going travelling for three months with my girlfriend... :-)\n", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "280": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1500313495, "Score": 1, "Body": "Thanks! I actually got told after my mock Friday oh by the way your External would like a 10 minute introductory presentation. I was gobsmacked that I now have to rustle something up so close to the event. \nI'm going to try to enjoy the Viva as best I can though... ", "Permalink": "https://www.reddit.com/by_id/t3_6n2auj.json"}, "281": {"Subreddit": "PhD", "Author": "mensgarb", "Date": 1500315016, "Score": 5, "Body": "Trying to move out of academia and into nonprofit work doing research in a more structured environment.", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "282": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1500322447, "Score": 1, "Body": "I've thought about this comment a lot since you wrote it. I'm almost done and I feel a creeping sense of uncertainty and pointlessness. The mediocrity will follow me from this job to the next. Is the next step worth the work I put in?", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "283": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500323347, "Score": 2, "Body": "Thanks for the response. Is R your recommendation? I had been thinking of Python but friends in other fields hate it because of lack of info with errors. So I'm unsure now :p", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "284": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500323386, "Score": 1, "Body": "You've put my feelings into words, thank you. Any advice on which language to start with?", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "285": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500323433, "Score": 2, "Body": "You've put my feelings into words, thank you. Any advice on which language to start with?", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "286": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1500323523, "Score": 1, "Body": "i don't have the answers for this, unfortunately. I think 'the meaning of life' is a question that many people struggle with. I just hope that when i return from my travels, i can put effort into a project that i believe in and that i feel does good for the world. That is all i have right now. ", "Permalink": "https://www.reddit.com/by_id/t3_6lvqto.json"}, "287": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1500324418, "Score": 3, "Body": "Yes.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "288": {"Subreddit": "PhD", "Author": "sportyjack", "Date": 1500324789, "Score": 1, "Body": "the golden age of Caribbean piracy so primarily spanish, dutch, and french. i would apply in the states. i dont have a masters and im reluctant to get one, what do you think ?", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "289": {"Subreddit": "PhD", "Author": "sportyjack", "Date": 1500324861, "Score": 1, "Body": "not japanese thank god ! spanish, french, and dutch. what did you do to become proficient in swedish so fast ?", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "290": {"Subreddit": "PhD", "Author": "CskW_", "Date": 1500324999, "Score": 4, "Body": "I think if you have any reservations at all just ask if you can have time to think about it and get back to them. It totally reasonable and that way you can chat to friends/family for some outside perspective. \n\nHowever, here's hoping that they are contacting you offer a full studentship.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "291": {"Subreddit": "PhD", "Author": "sportyjack", "Date": 1500325104, "Score": 2, "Body": "nice! i say go in there with a positive, open mind and reserve any cynicism you may have until you're at home. from then we can reevaulate whats going on ", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "292": {"Subreddit": "PhD", "Author": "CskW_", "Date": 1500325663, "Score": 3, "Body": "I've found the Dell xps 13 also too be a really great laptop. \n\nI'd say its worth checking out the [dell outlet site] (http://www.dell.com/learn/uk/en/ukdfh1/campaigns/splitter), they have a load of refurbished models which are like new and a 15% student discount atm. Worth noting prices don't initially include VAT but if you click through it adds it in later so keep that in mind.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "293": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1500326420, "Score": 2, "Body": "Good luck with your PhD! Procrastination is kinda the best part about it :) I'm staying in academia until either I get sick of it or I don't have a permanent position in 5 years. I'm currently on a postdoc fellowship and applying for another one. If I get that I'm hoping I can apply for faculty positions after.", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "294": {"Subreddit": "PhD", "Author": "Yeti_-", "Date": 1500327047, "Score": 1, "Body": "Ouch, ramps up the stress a bit! It will be useful though. Best of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_6n2auj.json"}, "295": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1500329040, "Score": 1, "Body": "What year is your MacBook? \n\nYou would be amazed what a clean install of the latest OS would do....", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "296": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500329303, "Score": 2, "Body": "Direct and to the point, thank you haha", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "297": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1500329890, "Score": 5, "Body": "I'm also a physical chemist/inorganic chemist/physicist (I'm not sure exactly where I sit, it's an identity crisis) but I code everyday, and it makes a 10 hour job, a 20 second job. I honestly credit it to the amount of work I've managed to do this year", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "298": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500330577, "Score": 2, "Body": "Wow! We're very similar so! That's great to hear, you have no idea. Can you give me any advice on where to start? Are there websites you use to help you? Or, what language/programs do you use? \n\nI haven't found anyone in my department that sees a point to coding which seems insane to me. We do so much mundane repetitive stuff! I really want to be able to make\"scripts\"(?) to make it all more efficient.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "299": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1500332790, "Score": 1, "Body": "I heard that R, Python and C are what a lot of statisticians used for bioinformatics. My own lab uses Python heavily.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "300": {"Subreddit": "PhD", "Author": "jackbrux", "Date": 1500333437, "Score": 3, "Body": "&gt; lack of info with errors\n\nThat's strange. Python has pretty good error reporting in my opinion, and because it's an easy language you shouldn't get many errors. Also because of its popularity you can always Google it. For custom modules its up to the developer of a module to provide good exception reporting nothing to do with Python. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "301": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1500333856, "Score": 2, "Body": "I was living in Sweden, did my master there. Swedish is really simple, especially if you know some German and English. Language learning takes a lot of time and practice. If you only need to be able to read then it's much easier. Get on duolingo and just expose yourself to the languages as much as possible. Movies, video games, irc etc.", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "302": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1500343136, "Score": 0, "Body": "Sounds like you really deserve the studentship, most supervisors would jump at the chance to have an enthusiastic, knowledgeable student join their team. Don't be too worried about being upfront with what you want - if you can't talk to them about that then they're probably not going to be a great boss.   ", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "303": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1500344684, "Score": 1, "Body": "I think it's probably because they've already *got* the job, and they're being well paid to do it. Whereas to do a PhD, you basically put aside financial gain (even on a scholarship you're unlikely to be earning even half of what you would in industry), you've got the constant worry of \"am I good enough\" and \"will I ever finish this\", and your work is constantly under the spotlight and can be ripped apart by your advisors any time.\n\nAlso, I think professors have a bit more variety in their lives than PhD students, which probably helps. I'm a tutor during the undergraduate semesters, and I actually find that I'm less stressed when that's on. Maybe because I get to use my brain for something other than my own research.", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "304": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1500345029, "Score": 1, "Body": "I'm doing a PhD in some combination of electrical, software, and biomedical engineering, and I've got a MSI laptop. They're great value for what they include, particularly when compared to other brands offering similar options (in Australia anyway). Mine is the GE62 Apache Pro and they go for about $2000AUD, which is about £1200 with the current exchange rate. It's got a 15\" screen, but I still consider it to be light and portable. There are options cheaper than mine with smaller screens and no SSD, so they could be worth looking into to see whether there's an option that suits your needs :)", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "305": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1500345390, "Score": 2, "Body": "My undergrad was computer systems engineering so I might be biased, but I think coding is a valuable skill for anyone to learn. It's definitely highly sought after in the \"real world\" and it can also be very useful for data processing and analytics regardless of what field you're working in. \n\nPython is a good general language that you can use for most things, and it's very high-level which isn't perfect for everyone but sounds like it would be suitable for your field. I *love* Matlab because it's very powerful for working with data, but again it's not for everyone - it's mostly used by engineers and data scientists in my experience. Most of the other languages I know and love are more for software/web design or really low-level microcontroller programming, so they wouldn't be too relevant to you. I haven't personally used R in much depth, but from what I have seen and heard, it's pretty good for statistics purposes.\n\nAt the end of the day if you learn programming logic while teaching yourself a programming language, you'll be able to pretty easily apply it in any other language you might need in the future anyway.", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "306": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500350095, "Score": 1, "Body": "I agree, thank you for your answer.", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "307": {"Subreddit": "PhD", "Author": "taseng", "Date": 1500352153, "Score": 0, "Body": "Wow!!! I wanted to apply for PhD in US. I am in the end of my MS. Thinking of giving GRE which is so costly. But reading this I am scared...", "Permalink": "https://www.reddit.com/by_id/t3_6nx6w6.json"}, "308": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1500367230, "Score": 2, "Body": "For what it's worth, I *really* don't think telling them that you just resat a maths GCSE would have had a beneficial impact on your application. Assuming it's not a humanities PhD, GCSE maths is far below the level required.", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "309": {"Subreddit": "PhD", "Author": "fab4lover", "Date": 1500372177, "Score": 2, "Body": "In terms of funding, a lot of fields and/or schools can guarantee funding through your entire PhD, especially \"hard\" sciences. I'm in the social sciences, so no such luck. And the rest is just my personal issues, so don't let those scare you! A PhD is rough, but if you're fully funded, I don't think it's really worse here than anywhere else.", "Permalink": "https://www.reddit.com/by_id/t3_6nx6w6.json"}, "310": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1500383898, "Score": 1, "Body": "Thank you for all the answers thus far. They have helped!", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "311": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1500384428, "Score": 2, "Body": "A fair amount of statistical analysis would have gone into determining the impact of different obesity intervention, which you would need to understand in order to compare them.", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "312": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1500386049, "Score": 1, "Body": "If it helps, I also got rejected from a PhD I *really* wanted to do because of a lack of quantitative experience. I was super interested in the topic and got along great with the supervisor, but then someone else applied with more stats knowledge. I did a masters to gain that experience, and am now doing a PhD I love.", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "313": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1500387142, "Score": 2, "Body": "Thanks! Yeah, that's kind of my plan too. My biggest fear, however, is that - at least where I am - they expect us to move around a lot until you get the faculty position. While that it isn't necessarily a bad thing for me - I can cope with loneliness and it's quite exciting for me to move to a new city - I'm a bit afraid of ruining potential relationships. For instance, I have a girlfriend and I don't know how things will end. If everything goes alright, then either she makes that sacrifice for me or I will lose a relationship. Did you have to deal with sort of things?", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "314": {"Subreddit": "PhD", "Author": "ursath", "Date": 1500396515, "Score": 1, "Body": "MA before PhD is standard these days. Why the reluctance? Do a Masters first that includes at least one of those languages. ", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "315": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500402348, "Score": 4, "Body": "Why do you have to play for the application? ", "Permalink": "https://www.reddit.com/by_id/t3_6o22y2.json"}, "316": {"Subreddit": "PhD", "Author": "cromulo", "Date": 1500402499, "Score": 1, "Body": "Did you get any info about the opportunity? Be ready to ask questions about it that are thoughtful and indicate that you understand the topic. ", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "317": {"Subreddit": "PhD", "Author": "cromulo", "Date": 1500402559, "Score": 1, "Body": "I'm transitioning from a PhD student to an assistant professor job. My stress has already decreased considerably because I don't have to worry about finding a job anymore and my income is almost tripling. ", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "318": {"Subreddit": "PhD", "Author": "sportyjack", "Date": 1500405206, "Score": 1, "Body": "i just think theres rather little to be gained from obtaining a masters if youre already a strong candidate. if the masters is part of the phd program then thats fine, but to take a masters just to gain foreign language experience, i cant bear", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "319": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500405387, "Score": 6, "Body": "You need to take your progress into your own hands. You can't rely on anyone else to motivate you. \n\n\nWork out a plan for the completion of your PhD. Then tell your supervisor what you need of them in order to complete the plan. If they don't agree, or don't respond then involve the administration. ", "Permalink": "https://www.reddit.com/by_id/t3_6nzj42.json"}, "320": {"Subreddit": "PhD", "Author": "sportyjack", "Date": 1500405406, "Score": 1, "Body": "keep us posted !", "Permalink": "https://www.reddit.com/by_id/t3_6nvnp1.json"}, "321": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1500406055, "Score": 2, "Body": "To be honest if your supervisor sees you every 6 weeks and regularly gives you feedback on work, they're putting more time and effort into supervising you than most people would. If you feel dissatisfied with the feedback, explain why that is and what you'd like more details on. ", "Permalink": "https://www.reddit.com/by_id/t3_6nzj42.json"}, "322": {"Subreddit": "PhD", "Author": "hellogorillaz", "Date": 1500406985, "Score": 1, "Body": "Trust me, I've tried everything. Including literally saying 'I am broke, please help me out'. Others could use their consumables budget, but my supervisor is quite strict. ", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "323": {"Subreddit": "PhD", "Author": "hellogorillaz", "Date": 1500407023, "Score": 1, "Body": "I've tried that, but it's quite tired anyways. Many apps don't work on OS, sadly, so I will need a windows computer.", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "324": {"Subreddit": "PhD", "Author": "hellogorillaz", "Date": 1500407081, "Score": 1, "Body": "Thank you, looks like Dell XPS 13 is a winner! I was looking at Asus zenbooks too as they are way more affordable, but maybe I should spend a little extra on Dell..", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "325": {"Subreddit": "PhD", "Author": "AlexDiru", "Date": 1500407229, "Score": 2, "Body": "Nearly finished a CS PhD here, in your situation I would suggest looking into these languages:\n\nMATLAB - if you require a lot of mathematical formulae/calculation, traditionally this is used by engineers\n\nR - this is a 'statistical' programming language, very good if you want to analyse data sets and infer statistics\n\nPython - very much an all purpose language (I'm personally not a fan myself) but there are many, many packages out there giving this language a lot of flexibility\n\nGiven that I don't know what you intend to do, I would suggest Python due to its flexibility, and there is probably the most demand for it in jobs", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "326": {"Subreddit": "PhD", "Author": "SeaQuest36", "Date": 1500410950, "Score": 1, "Body": "HP Pavilion. ", "Permalink": "https://www.reddit.com/by_id/t3_6ns51e.json"}, "327": {"Subreddit": "ADPhD", "Author": "trackaftertrack", "Date": 1500412247, "Score": 1, "Body": "Thanks so much for sharing your experiences. I know they'll be part of your success story later in life regardless of how your PhD turns out for you.", "Permalink": "https://www.reddit.com/by_id/t3_6kok53.json"}, "328": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1500414722, "Score": 5, "Body": "I'd highly recommend python, or I hear some people also say R is good. But python is much better documented. Do a google search for anything you're struggling with or what bug you have and someone will have posted the problem for python. I use stackoverflow a lot, and the python/numpy/scipy documentation, they're very well written. When I started doing this I was told to use this book: http://www3.canisius.edu/~yany/python/Python4DataAnalysis.pdf also very helpful. For a bit more heavy duty number crunching stuff I use fortran, but that's because it's good for larger data arrays and it's what my supervisor uses. I would like to learn c++ at some point, because it's used so often in industry, but for now python is great. For places to start I would say take the first few lesson of codeacademy and then jump in the deep end. Set yourself a challenge (simple at first) and then have a go. Google 'how to import data file' for example, and then learn how to manipulate that data and present/export it. As for programs i'd say get anaconda, it's like a developing environment but it has several useful tools within it. It has spyder (a more conventional IDE) and iPython Notebook which is really user friendly. Anaconda also install a bunch of standard libraries for python and allows for easy install of other packages", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "329": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1500414957, "Score": 1, "Body": "Additionally someone else mentioned Matlab. It is as powerful as python but it has so many drawbacks. For start: an expensive license is required and python is free (and better)", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "330": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500417086, "Score": 1, "Body": "Ok great advice. I think Python and then R would be my choice so. Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "331": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1500417637, "Score": 2, "Body": "Ok great. I'll use code academy and then that book as starting points, thank you. I've also heard c++ a few times, it seems like the one for all of languages really. I'll worry about that later. \n\nI'll have to come back to this comment regarding those programs! \n\nThis is really great advice, thanks a million! ", "Permalink": "https://www.reddit.com/by_id/t3_6nstjd.json"}, "332": {"Subreddit": "PhD", "Author": "olorinii", "Date": 1500421691, "Score": 1, "Body": "I was lucky.  I was offered a teaching position after completing my comps.  Then I finished my PhD while teaching full time.  It took longer this way but I am glade that I received a position when I did.  ", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "333": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500430624, "Score": 2, "Body": "Lol don't over think it academic types are almost always willing to help. Explain what you will use it for, how you will protect their data, and just ask. You may come out with the data your looking for plus another connection to help along your studies.", "Permalink": "https://www.reddit.com/by_id/t3_6o2rha.json"}, "334": {"Subreddit": "PhD", "Author": "Littlemissquick", "Date": 1500461722, "Score": 2, "Body": "Bring a pencil! They do not suffer pens in that building. ", "Permalink": "https://www.reddit.com/by_id/t3_6o75km.json"}, "335": {"Subreddit": "PhD", "Author": "sherpan2", "Date": 1500470397, "Score": 2, "Body": "I will receive a PhD, since this decision has political implications. Let me show you the two possible outcomes after saying I want to quit the PhD:\n1. My PhD thesis is not finished. In my university there is no possibility of getting a M.Sc. (AFAIK), so everybody loses.\n2. They allow me to finish after 1 year with a very limited thesis, but ensuring that the content is good enough to get it passed. My advisors get in return teaching points for having advised a PhD thesis.\n\nSo, I would argue that I am getting a PhD because it is a win/win situation. If it was a win/lose situation, I would be probably screwed up.", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "336": {"Subreddit": "PhD", "Author": "sherpan2", "Date": 1500471007, "Score": 1, "Body": "Thank you very much for the support!\n\nYes, it is important what you said about delivering the thesis after having a job.\n\nActually, my advisors is slowly reacting to my decision. I feel he has finally got angry (as I was expecting...), since lately he told me that a major part of the work that I carried during my PhD will not be included in thesis due to the fact that it is research not 100% authored by me or it was done before starting the PhD officially (during my M.Sc. degree). Additionally, he will quit from being my advisor, so only my co-advisor name will appear, and I will have to leave my workplace during the writting of my thesis in September, to leave room to new M.Sc. students. Can't complain, seems reasonable (my scholarship will last until the end of the year, if I do not find a job first).\n\nHe literally told me: \"with the thesis that you will get, forget about getting any cum laude or excelent qualifications\". I understand that I cannot achieve that in 1 year only.\n\nMy answer: \"If you think my PhD thesis will pass, I trust you\". \nWhich is really what I feel.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "337": {"Subreddit": "PhD", "Author": "sherpan2", "Date": 1500471152, "Score": 2, "Body": "I encourage you to be honest with yourself and do not care about what your colleagues might say, as long as the decision is taken correctly and nicely.\n\nYour time is yours.", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "338": {"Subreddit": "PhD", "Author": "too_much_2na", "Date": 1500509450, "Score": 10, "Body": "It's a complete non-issue from my perspective as an early 30-something who is in the process of applying to graduate school. If you're worried about stamina or something like that, I'll tell you that 32 feels no different than 25. I guess my biggest concern would be maintaining a good work/life balance because I have a relationship and pets now. If that sounds like something you might be concerned with, my advice for you (and myself) would be to make lab culture high on your list of priorities when deciding where to go. \n\nHonestly, I see my age as a benefit. I know myself and what I'm capable of and I feel very confident in the direction my research career is headed. ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "339": {"Subreddit": "PhD", "Author": "nullp0int3rz", "Date": 1500511472, "Score": 2, "Body": "Thanks, that's good advice and a good outlook. I would definitely say knowing what you're capable of is a key strength that comes with age and experience. ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "340": {"Subreddit": "PhD", "Author": "too_much_2na", "Date": 1500512284, "Score": 2, "Body": "No problem! I think about this stuff too... It'll take ~6 years to finish my PhD, then maybe I do a post-doc, then I'm starting my career in earnest at almost 40. However, I have enough to worry about without psyching myself out about something that hasn't even proven to be a problem. I found something I love to do and I'm on a road to making it my career, it's pretty exciting! ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "341": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1500516841, "Score": 3, "Body": "Go for it! \nFollow you dreams, make your dreams come true...\nResearch the market, job market, etc...\nKnow what you're getting into and go for it.\nThere are people all over and all sorts of ages who are just getting by and doing work cause they need to work. If you can do something you're good at, and get paid for it and have a great career, then go for it! \n", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "342": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1500517962, "Score": 4, "Body": "Not an issue- I'm 40 in my 3rd year", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "343": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1500522962, "Score": 2, "Body": "I am in a group with bioinformaticians and I'd say more than half the PhD students are 30 years old or older. The biggest issue I see is personal sacrifice. It's infinitely easier to do a PhD without being in a relationship (or to be in one with someone who is understanding) and having/raising kids. Most 22-28 year olds are okay with putting all that on the back burner, but what about 30-36 year olds? It's a personal decision, but if you want to have kids by then, it'll definitely be a challenge during the program, and you'll probably have less output than others by default. Just the way it is...", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "344": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1500527266, "Score": 1, "Body": "I'm 21 and in my first year of a PhD, and honestly most of the other PhD students I've met through workshops and whatnot are 30 and above. I feel like a total baby every time I go to one. I've got several friends who are married with kids and are managing a PhD, and most of them are doing it full-time or close to it. Others are doing it part-time, and I really admire that because I think I'd go nuts after 6 years in the program. I also have met a few people doing it as a \"later in life\" thing, like after they've had kids and sent them off to university. So most of those are people who are 50+.\n\nLong story short, I don't think that doing a PhD in your 30's is even remotely a problem in terms of the academics, as long as you can balance it with whatever else will be going on in your personal life then. If anything it seems to be the norm at my university, and I think from an advisor's perspective it just shows that you really, really want to do it because you worked so hard to get there.\n\nBest of luck with your undergrad studies and any studies you do after that :)", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "345": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1500533327, "Score": 2, "Body": "I did 6 months intensive, but that's because my fieldwork was based in a developing country, so intensive was the only feasible option. I must say 2 years is a long time though? Here we don't expect people to be collecting data for more than a year. I was given the impression that a 6 month fieldwork stint is 'long-term fieldwork' by my School (social science). \n\nAt the end of the day though, it doesn't really matter how long your fieldwork is. The type and quality of data matters. ", "Permalink": "https://www.reddit.com/by_id/t3_6oejut.json"}, "346": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1500533475, "Score": 1, "Body": "Thanks for the response. I find 6 months pretty long too, but I know anthropologists do much longer a lot of the time. I guess I'm worried about reviewers wondering what I was doing the rest of the time haha", "Permalink": "https://www.reddit.com/by_id/t3_6oejut.json"}, "347": {"Subreddit": "PhD", "Author": "greyfriar", "Date": 1500537776, "Score": 1, "Body": "And I'm 41 in my first year, working in the same office as a 42 year old in his final year.\nEdit: We're surrounded by 'twenty somethings' PhD students and several late teen internships, and we all get on really well, professionally and personally. Age has never been an issue. ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "348": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1500540441, "Score": 1, "Body": "41-year old second-year here. It's fine. I get on well with my peers and I'm very satisfied with my experience so far. ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "349": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500545566, "Score": 1, "Body": "What does this guy think that the rest of us are doing our PhDs when we are 18 ?", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "350": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1500550168, "Score": 1, "Body": "I think it's less about how long you were there and more about how rich your data is!\n\nI did an intense ten months of fieldwork (social science) and I think my data is quite rich and informative. You can 'embed' and observe in a lot of different ways, and I think the point is to be able to reflect that in your work. You could be in 'the field' for three years and not have any data you can use- or manage to get a tonne of data in three weeks. It really depends on your research design too. Is it an ethnography? Or is it broadly qualitative - such as observations and interviews? And, really, once you hit and confirm saturation, there's not much point in continuing to hang about. It doesn't add much to your research. And, in my opinion, gets ethically dicey. ", "Permalink": "https://www.reddit.com/by_id/t3_6oejut.json"}, "351": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1500556857, "Score": 1, "Body": "This is really reassuring, thank you. It is ethnographic but more of a case study. I think you're right, it is really about saturation although if you're always trying to find uniqueness in everything it's hard to know when you hit that point :P Thank you though, this is honestly helpful", "Permalink": "https://www.reddit.com/by_id/t3_6oejut.json"}, "352": {"Subreddit": "PhD", "Author": "nullp0int3rz", "Date": 1500559960, "Score": 1, "Body": "Personal sacrifice is another good point. As of now I don't plan on having kids but obviously that can change when I reach that point. Thanks for your input.", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "353": {"Subreddit": "PhD", "Author": "nullp0int3rz", "Date": 1500560237, "Score": 1, "Body": "Weirdly enough at my job I'm the baby. Working with people well into their 30's and 40's, but if I were to do a PhD I might be that guy making someone else feel like one. Maybe that doesn't sound so bad...", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "354": {"Subreddit": "PhD", "Author": "nullp0int3rz", "Date": 1500561042, "Score": 1, "Body": "Awesome, this is good stuff. It sounds like starting a little later in life is a more common occurrence than I had thought. ", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "355": {"Subreddit": "PhD", "Author": "Imagine_a_name", "Date": 1500567915, "Score": 1, "Body": "One of my colleagues is (I think) 52, double my age. Regarding research, she is doing great! Regarding getting along with colleagues for work, she is doing great. Regarding getting along with colleagues for fun, she is doing great. As others have pointed out by giving their examples, age is not much of an issue. All the best!\n\nEdit : Forgot to mention, we both are in pre-final year of PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "356": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1500569264, "Score": 2, "Body": "Work out the number of pages you need to write per week or day or whatever and stick to it. Knowing it'll be over once I finish those pages forces me to do it without procrastinating. Then I get to ignore it without guilt afterwards haha.", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "357": {"Subreddit": "PhD", "Author": "Imagine_a_name", "Date": 1500573268, "Score": 1, "Body": "Thanks! Sounds useful! Will keep a weekly target for the number of pages.", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "358": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1500573363, "Score": 1, "Body": "If you're near the beginning of grad school, keep a detailed notebook.\n\nIf you're near the end (as I am), I've found it helpful to make the figures, outline, and then fill in everything. It's not quite as clean as that, as I've made figures since filling everything out, but the overall process is helpful. ", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "359": {"Subreddit": "PhD", "Author": "Imagine_a_name", "Date": 1500574029, "Score": 1, "Body": "I am close to beginning my final year. Alright, having an outline with figures is another good advice. Also, I was wondering if I should start with Introduction chapter or keep it for later, as it would be more like reading and sorting out references than actually getting something written, might feel like having nothing in the beginning. What do you recommend?\n\nEdit : Being forgetful is something I can't forget, apparently. Forgot to mention this - Thanks for your reply!", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "360": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1500575192, "Score": 2, "Body": "Since you're so near the beginning I would caution against working on your thesis directly. Your thesis should answer one overarching question, with each chapter/paper answering a small part of the question. Your thesis comes together near the end based on all your work. No use trying to write something you have only a vague outline of. However, as you answer the questions, they'll coalesce into chapters and/or papers. Here's a general outline of how most people do it:\n\n1. Find out what others have done on the subject (this'll turn into an introduction)?\n2. How will you take/do the measurements/simulations (this'll turn into your methods and apparatus chapter/section)?\n3. What are your data showing you? Does it look like what you expected? Are there parts of it that you can check against other people's work?\n\nThe process is non-linear. You don't go from 1 -&gt; 2 -&gt; 3 -&gt; thesis. You have to go back and redo stuff. It might look more like 1 -&gt; 2 -&gt; 1 -&gt; 2 -&gt; 3 -&gt; 2 -&gt; 3 -&gt; 1 -&gt; 2 -&gt; 3 -&gt; depression -&gt; 2 -&gt; 3 -&gt; 1 -&gt; 2 -&gt; 3 -&gt; thesis. Discovery and creativity are an iterative process. At least it was for me. It would be difficult to outline your thesis when there are going to be serious roadblocks and detours along the way. So keep a good notebook so you remember it all and aren't trying to piece together the last five years from vague recollections and badly commented code. (Aside: Many people essentially write four papers, staple them together, and present it as their thesis. I would highly recommend doing this.)\n\nTLDR Don't write your thesis now. Answer the important questions, and this'll turn into your thesis.", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "361": {"Subreddit": "PhD", "Author": "Imagine_a_name", "Date": 1500575930, "Score": 2, "Body": "Wow! Great points! I do keep an everyday journal typing out all the important highlights of the work day but it's more like headlines, maybe should start putting more stuff into it.\n\nThat \"depression\" step in between writing steps made me chuckle, I can already imagine how true that is going to be (remembering my first paper experience)!\n\nThanks for your comment, was very insightful!", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "362": {"Subreddit": "PhD", "Author": "TrappedGrad", "Date": 1500576048, "Score": 1, "Body": "I almost wish there were an age/prior work experience requirement for starting a PhD program.  The amount of unwarranted, entitled ignorance of fresh undergrads in grad school is too much for me to handle sometimes.", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "363": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1500576953, "Score": 2, "Body": "&gt;Know what you're getting into\n\nThis, OP. I'm nearing mid thirties and have a few friends who are 36-38 finishing up. And while they are happy they have finished, there's regrets for not starting earlier and general dissatisfaction with their lives. Not trying to be discouraging but there's a lot you'll be putting on hold (or even tossing away in some cases). It's the ugly side of academia.\n\nQuestions to ask yourself (I am currently asking myself these!) - Is this something I really want? Do I have a clear goal in mind? Can this goal be achieved with or without a PhD? Am I willing to make sacrifices in regards to health and family (yes, health, no matter what anyone says, every year that goes by takes a toll on your stamina and well-being...x5 when you're a PhD student) and will they be worth it? \n\nRegardless of all of that, most of the people in my program are over 27. I know 3 people over the age of 40 who just started as well. People of all ages and walks of life!\n", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "364": {"Subreddit": "PhD", "Author": "wh_sky", "Date": 1500581405, "Score": 2, "Body": "I use DEVONthink to organise pdfs alongside notes, jpegs, word documents, etc. It has a good search function, and you can use various features to sort through and categorise things. I particularly like that you can duplicate OR replicate files between different folders, and have found the system of 'tags' useful too. \n\nIt costs £38-£62 (depending on whether you want the 'Pro' or 'Personal' version) after the free trial period expires, but there's a 25% discount for students, and sometimes they have promotions at the beginning of the academic year with a larger discount. \n\nI still keep bibliographical information in Zotero though, because (afaik) DEVONthink doesn't have a reference management function that integrates with Word and Open Office like Zotero does.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "365": {"Subreddit": "PhD", "Author": "nullp0int3rz", "Date": 1500581702, "Score": 1, "Body": "Thanks, I appreciate mentioning the regrets.  I certainly regret not being able to finish my undergrad sooner. It sounds like although age is not an issue, I'll have to ask myself what I want out of life when the time comes to apply for a program.", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "366": {"Subreddit": "PhD", "Author": "johnsnothere", "Date": 1500583038, "Score": 1, "Body": "No problemo. Just remember that happiness and life fulfillment doesn't always come from having a \"Dr.\" beside your name :-)", "Permalink": "https://www.reddit.com/by_id/t3_6ocazm.json"}, "367": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500585444, "Score": 3, "Body": "But how do you know how many pages you will need in total until you've written them? ", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "368": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1500585486, "Score": 3, "Body": "You don't, but you can make a rough estimate. ", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "369": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1500589460, "Score": 1, "Body": "So, who passed Medawar's test?\n\n(I passed it, but my research involves a lot of microscopy which I believe gives me an unfair advantage.)  ", "Permalink": "https://www.reddit.com/by_id/t3_6ogq62.json"}, "370": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1500603666, "Score": 3, "Body": "I am/was a bad writer. What helped me the most when writing a new chapter, was writing a list of questions that I thought needed answering. I would then write down detailed answers for those questions. You can then move the questions around to get a passable structure for the chapter.", "Permalink": "https://www.reddit.com/by_id/t3_6ohffz.json"}, "371": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1500604246, "Score": 1, "Body": "Is language a barrier between you. Maybe you can talk to a senior student(even from other groups) to learn more about the work requirements.", "Permalink": "https://www.reddit.com/by_id/t3_6o4307.json"}, "372": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1500604923, "Score": 6, "Body": "&gt;My impression (and I am absolutely willing to be corrected) is that three-year PhD countries typically expect their students to come in at a higher level. \n\nCouldn't agree more.\n\nMost programs in my field are already set up to allow for students to graduate in 3 years (if coming in with a Master's). If a student is ready to hit the ground running and is highly self-motivated, then they should be able to make it out in 3 years. If a student is not as driven and has to have their research dictated to them, then they will likely take longer. \n\nIn my opinion, someone who is graduating with a PhD should be equipped to drive their own research. This system allows for all students to naturally graduate when they merit the title. When the authors claim\n\n&gt;For a PhD to be completed in three years, the level of supervision and university support students receive must be increased. \n\nit is undercutting this system. If a program says you only get 3 years of funding, perhaps it isn't unrealistic expectations of all candidates, but rather a way of disincentivizing under-prepared individuals from applying. \n\nTreating a PhD student like an UGRA, by dictating all of their work, in order to churn out more graduates ultimately will lead to worse candidates. Schools have a responsibility to (*i*) bluntly state they will be expected to drive their own research if they want to get out in 3 years, (*ii*) help students develop the skills to pursue their own funding sources for years 4+, and  (*iii*) not coddle students, as that ultimately would prevent them from developing the skills they need to be a leader in their field.  \n\nThis may sound insensitive, but if you expect to get a PhD in 3 years by simply going to class and doing exactly what your adviser tells you, then you are delusional. ", "Permalink": "https://www.reddit.com/by_id/t3_6ohcl7.json"}, "373": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1500613632, "Score": 5, "Body": "A giant Excel sheet. I have standardized columns that fit the length of a large desktop where I keep notes, citation info, my rating, keywords, and what papers I've used it for. I created it. Yes I'm that neurotic and happy to answer more if that interests you.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "374": {"Subreddit": "PhD", "Author": "ilevex", "Date": 1500619936, "Score": 2, "Body": "I use my iPad Pro with the GoodNotes app, import the PDF to GN, annotate it (it even recognizes handwriting!), and export the final PDF back into Mendeley.\n\nAnother app that people recommend me is the Highlights app (http://highlightsapp.net), although I'm slightly reluctant due to its cost.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "375": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1500630084, "Score": 1, "Body": "I'm beginning to think the same. After all this time, I just can't seem to attenuate to it.", "Permalink": "https://www.reddit.com/by_id/t3_6nr55w.json"}, "376": {"Subreddit": "PhD", "Author": "deepxs", "Date": 1500632073, "Score": 2, "Body": "He has a lot of international students and we can communicate with others well enough except for the research. Besides, I worked with a Russian adviser when I was in States and we had no communication problems on research. So, I'm not sure what I am missing here..", "Permalink": "https://www.reddit.com/by_id/t3_6o4307.json"}, "377": {"Subreddit": "PhD", "Author": "PhDStudentCES", "Date": 1500639530, "Score": 1, "Body": "How do you get a PhD after only 1 year? What field? I'm in my 3 rd year, post masters, and haven't begun dissertation.  That's another question,  isn't it usually a dissertation for a PhD? ", "Permalink": "https://www.reddit.com/by_id/t3_6n9www.json"}, "378": {"Subreddit": "PhD", "Author": "PhDStudentCES", "Date": 1500639941, "Score": 1, "Body": " they don't write it,  the proof and edit. ", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "379": {"Subreddit": "PhD", "Author": "totallylegitburner", "Date": 1500663699, "Score": 1, "Body": "Saving this. Would also be interesting to learn how this compares to something like and Open University phd. ", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "380": {"Subreddit": "PhD", "Author": "charika-bo", "Date": 1500668424, "Score": 2, "Body": "I number coding all the papers I have read. During my PhD I identified main themes that related literature fell into; coded each paper like 1.1, 1.2 and so on. And I had master word file for category 1 briefly summarising each paper with key words (I also exclude paper that I coded from this summary if they are not really useful for writing). I do this for all categories of papers. Really useful for my PhD and some summary from those master files are still useful after my PhD nowadays.  ", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "381": {"Subreddit": "PhD", "Author": "charika-bo", "Date": 1500668783, "Score": 1, "Body": "Depending on what you feel like doing really. I was mentally suffering from my PhD so I decided to go out of academia (also because of money). At the end, I came back to academia. I an now working as a researcher/lecturer... happy life and really satisfying. But this varies from individual to individual. I blogged my experience what's next after my phd here in case you are interested ... http://www.charika-bo.com/2017/06/18/diary-8-month-unemployed-phd-life/", "Permalink": "https://www.reddit.com/by_id/t3_6ntees.json"}, "382": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1500701833, "Score": 2, "Body": "What's a D.E Mres? I tried to google it, but no luck. ", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "383": {"Subreddit": "PhD", "Author": "Fakhraddin", "Date": 1500707454, "Score": 2, "Body": "Distance education, masters (Research)", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "384": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1500711679, "Score": 3, "Body": "Ask the University of Birmingham?", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "385": {"Subreddit": "PhD", "Author": "revvy_o", "Date": 1500712591, "Score": 1, "Body": "Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "386": {"Subreddit": "PhD", "Author": "revvy_o", "Date": 1500712645, "Score": 1, "Body": "I really appreciate this! I'll do it now.", "Permalink": "https://www.reddit.com/by_id/t3_6n7ujj.json"}, "387": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500722166, "Score": 1, "Body": "I do distance. I have presented at my uni 2 or 3 times over the past 4 years. I could do it more if I pushed for it. Like a lot of things in PhD, most of the effort is under your own steam. ", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "388": {"Subreddit": "PhD", "Author": "SatansAvocado", "Date": 1500722212, "Score": 1, "Body": "Considering the PhD workload and the direction it may lead you, I'd say you are right for being more than upset about the topic change. First and foremost I would ask whether this topic is something you will have a passion for in 5 to 10 years? If it isn't then why not change directions?\n\nIn my opinion academics are rarely held accountable for how they handle students. It sometimes frustrates me to the point where I want to quit. If you do quit, I would urge you to finish the qualifier and have a job secured first. Just work hard until then. Also, consider searching for other PhD positions. At the very least, you have funding and something to work on until then. The worst case scenario is you'll finish your current PhD.\n\nOh yeah, and my partner in my PhD is the opposite. He constantly talks and explains way too many details. Can we trade? :D", "Permalink": "https://www.reddit.com/by_id/t3_6ngy3j.json"}, "389": {"Subreddit": "PhD", "Author": "Fakhraddin", "Date": 1500723136, "Score": 1, "Body": "Even the 2 or 3 talks that you have already done? This is quite fascinating. How have you done it as a distance ed. Student? Online or did you go to the campus? ", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "390": {"Subreddit": "PhD", "Author": "Fakhraddin", "Date": 1500723161, "Score": 1, "Body": "Definately will", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "391": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1500723484, "Score": 12, "Body": "Most people suggest that you only do it if you require a PhD got your future employment goals. PhDs are a long term commitment and they are hard. They will test your personal motivation, mental health, dedication ect to their limits. Also, as an aside, PhDs in psychology are very hard to get in to. Particularly clinical although you didn't mention if that's what you wanted.\n\nEdit: also, never do an unfunded PhD. So it shouldn't cost you anything except the reduction in salary while you're doing it.", "Permalink": "https://www.reddit.com/by_id/t3_6ouinu.json"}, "392": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1500728290, "Score": 3, "Body": "&gt; I was never able to justify the extremely high costs of university when I was 18.\n\nDoes that mean you've never gone to college/university? Can you go directly into a PhD? I know in the US you can go from undergraduate to PhD with courses that you follow, but in some countries (mine included) you've got to have a two-year master's to even be considered into the PhD programme.", "Permalink": "https://www.reddit.com/by_id/t3_6ouinu.json"}, "393": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1500728775, "Score": 1, "Body": "i went to campus but they do allow online presentations. My course attracts a fairly international group of students so they do allow and even encourage presentations via skype.", "Permalink": "https://www.reddit.com/by_id/t3_6ontw4.json"}, "394": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1500735505, "Score": 2, "Body": "Do you have a related undergraduate degree? And, in some contexts, a related MA? ", "Permalink": "https://www.reddit.com/by_id/t3_6ouinu.json"}, "395": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1500740584, "Score": 3, "Body": "Don't do a PhD unless you are passionate about the field, can't reach your career and life goals without one, and are willing to *completely* invest yourself to the endeavor for up to 7 years. Not enjoying your current work and believing other degrees to be too expensive aren't good enough reasons to pursue a PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_6ouinu.json"}, "396": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1500741341, "Score": 2, "Body": "This is pretty much everything I came here to say.  \n  \nBe very clear about what you want to do with said PhD... whether it's to go the academic route (post-doc; assistant professor), or practice route (psychologist), or industry/government route (consultant). If you don't see yourself getting a job in one of those three buckets, then maybe it's not worth all the effort that antihero790 mentioned.", "Permalink": "https://www.reddit.com/by_id/t3_6ouinu.json"}, "397": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1500752770, "Score": 1, "Body": "It depends what the deadlines are for funding in your field. I am in Australia and while the application for admission for my PhD wasn't due until November, the application for the scholarship/funding was due in September. It also depends on how well you know your planned project and if you have a supervisor lined up to help you. That will speed things along a bit.", "Permalink": "https://www.reddit.com/by_id/t3_6owwba.json"}, "398": {"Subreddit": "PhD", "Author": "AlexDiru", "Date": 1500758153, "Score": 3, "Body": "Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "399": {"Subreddit": "PhD", "Author": "HeAbides", "Date": 1500764027, "Score": 1, "Body": "You should seek out the each school's graduate studies directors, or even department admin, before asking a group of people who are far, far less familiar with the specifics. \n\n&gt;Is there enough time to get everything sorted, funding, proposal etc?\n\nAll of these variables can be answered precisely for each institution by seeking out the information from the individuals who know the answers. The schools may also prefer someone who is capable of tracking down the information effectively and accurately, rather than someone who unknowingly applies after the deadline because Reddit said it would be okay. ", "Permalink": "https://www.reddit.com/by_id/t3_6owwba.json"}, "400": {"Subreddit": "UNEMPLOYED_GUY_PhD", "Author": "wantto-die", "Date": 1500764289, "Score": 2, "Body": "Thank you captain", "Permalink": "https://www.reddit.com/by_id/t3_6mrsra.json"}, "401": {"Subreddit": "PhD", "Author": "Desert_Coyote_115", "Date": 1500767592, "Score": 8, "Body": "Hi, I will admit that I accidentally discovered this sub by hitting the 'random' button, but regardless, I hope that you will be successful in your defense.  Im a pilot and have my Instrument Checkride (flight test) coming up on Monday; I've been preparing for it for the past 7 months or so.  In short, it's how to fly an airplane without using outside references, you're dependent on the flight instruments.\n\nBest of luck!  Here's to hoping that you succeed!", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "402": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1500768039, "Score": 4, "Body": "Thanks stranger pilot.", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "403": {"Subreddit": "PhD", "Author": "biznatch11", "Date": 1500773642, "Score": 5, "Body": "I spent the vast majority of my days during my PhD doing research in the lab.", "Permalink": "https://www.reddit.com/by_id/t3_6oypqs.json"}, "404": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1500794589, "Score": 1, "Body": "All the best!\n", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "405": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1500802610, "Score": 2, "Body": "I space it out over a week. So I have a day or two a week that are writing and data analysis, one day that is teaching and teaching related duties, and then the rest are in the lab. This works better for me because it annoys me to walk back and forth all day from the lab to my computer haha.\n\nEdit: I am almost 2 years into a 3 year PhD so there's a bit more writing at this point.", "Permalink": "https://www.reddit.com/by_id/t3_6oypqs.json"}, "406": {"Subreddit": "PhD", "Author": "Vfjpelt", "Date": 1500803993, "Score": 2, "Body": "Focusing each day on one particular activity (research, teaching, etc) works best for me. I try to make attainable and concrete goals every day saving more mundane and easier tasks for the afternoon and evening. Writing and more difficult tasks I try to do in the morning. ", "Permalink": "https://www.reddit.com/by_id/t3_6oypqs.json"}, "407": {"Subreddit": "PhD", "Author": "the--imposter", "Date": 1500816331, "Score": 1, "Body": "I don't tend to group things together by days but try and put hardest tasks in the morning and then admin type tasks in the first hour or so after lunch and then something else in the afternoon but that's just how I work.\n\nThings are a bit different now I'm not teaching but even when I was I would just take stock before each day started of what fixed activities I had (meetings, teaching sessions etc.) and then try and fit everything else around that. All the while time-journaling to try and see where my time was going in the week and then reviewing at the end. But I'm still working on it to some extent.", "Permalink": "https://www.reddit.com/by_id/t3_6oypqs.json"}, "408": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1500838154, "Score": 5, "Body": "Fifth year Ph.D. student here, giving my two cents.\n\nDepending on what you're studying, Ph.D. programs can be highly competitive.  You first need to weigh which schools you *know* you can get into, and ones you *might* get into.  Do not make the mistake of applying to a bunch of dream schools if you know they're looking for geniuses.  Applications and transcripts get expensive, so don't waste your money or time.\n\nIf you're absolutely 100% sure about what you want to study and are aspiring to go into academia, then program and school choice should be above all else when weighing your options.  If you are flexible in what you want to study and want to go into the industry with your Ph.D., then you have more options.\n\nThe average Ph.D. program takes 5-6 years ( sometimes longer depending on the field).  You should prioritize funding, as living as a professional student gets depressing on such a low salary.  You should also prioritize location.  Do not go to a school that gets 300 days of rain or snow if you know you hate rain and snow.  For me, it was between a private school in rural Pennsylvania, or a public school in California.  I chose California, with zero regrets, because I knew I wouldn't be happy in Pennsylvania.  \n\nYou have a pretty good list of priorities already, but you also need to consider the things I mentioned above.  They may seem unimportant now, but when you're 5 years deep into your program, they're going to matter a whole lot more. ", "Permalink": "https://www.reddit.com/by_id/t3_6p23t4.json"}, "409": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1500840855, "Score": 2, "Body": "Location, location, location haha. Yeah, I made the mistake of casting my net too far the first time I applied. I visited the midwest and it was depressing (for me)", "Permalink": "https://www.reddit.com/by_id/t3_6p23t4.json"}, "410": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1500842856, "Score": 5, "Body": "I'd suggest that rather than just going by school/department, you look at recent publications and conferences in your field and find potential PIs that way.  There maybe people working in universities you haven't thought of who would be a perfect match.   I'd also suggest considering looking abroad, if you're willing to move, since every country has a different PhD system; some other place might have a system that really suits you and it seems a shame not to familiarize yourself with all the options.", "Permalink": "https://www.reddit.com/by_id/t3_6p23t4.json"}, "411": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1500878832, "Score": 6, "Body": "Hang in there, but I think you need to tell your supervisor. Communication is key, they are the only person who can help lighten your load. You don't have to blame them, just say that you really need help! ", "Permalink": "https://www.reddit.com/by_id/t3_6p6omv.json"}, "412": {"Subreddit": "PhD", "Author": "sburgess86", "Date": 1500879308, "Score": 1, "Body": "Number 1 most important is to find a topic that fascinates you, number 2 which is very important - go to a successful lab if you can. If you want to do academia in the long run you need to start as near to the top as possible to ensure you get good papers, which will then allow you to get a good lab for postdoc, which is necessary to get good papers to become a PI! Number 3- research the PI (including looking on social media - i.e. twitter, and if you get the chance to interview later, by talking to the lab members), are they a good supervisor? they may be a good academic, but that does not mean the can manage people properly, or help students in their career later on. Also do you buy into their vision?", "Permalink": "https://www.reddit.com/by_id/t3_6p23t4.json"}, "413": {"Subreddit": "PhD", "Author": "gelinrefira", "Date": 1500884463, "Score": 1, "Body": "If your adviser is worth the money they pay him, he will have been mad as hell that you are being used like that. However, I get a feeling that he can't afford to pay you as RA. No money means he does not have much say. Still any decent dept will want to graduate their PhD students. Your graduate coordinator should be aware of this situation. If your dept is not helping to grad, then you might have to go to the dean of graduate school because the last thing they want is a student not graduating because he was swarmed with TA duties because that is stupid as hell and hurt the school. ", "Permalink": "https://www.reddit.com/by_id/t3_6p6omv.json"}, "414": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1500886370, "Score": 1, "Body": "Speak with the head of the school or the relevant department for postgraduate student coordination. You can explicitly ask for hour reduction in teaching or taking an extension/switching to part time for your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6p6omv.json"}, "415": {"Subreddit": "PhD", "Author": "throw_away_968935869", "Date": 1500886629, "Score": 2, "Body": "Thank you for the responses. \n\nThe main issue is my PhD adviser is also the one who has assigned me the difficult TA positions. When I've tried to bring up the workload of these assignments in the past, she dismisses it and changes the subject.\nShe is a kind person, very intelligent, and a good model of being a true intellect, but not good at considering another's perspective. \n\nI would go to the graduate school but I have seen people do this before and it accomplish nothing or worse, get back to their adviser. \n\nI'm thinking since my adviser also has a short attention span and this is a lot to talk about, I'll write her an email. I will try to avoid anything that sounds like I'm blaming her, but say I was overloaded by the difficult TA assignments and extra course work. Hopefully she will be on my side. Not sure about the repercussions of a failing grade. I assume I will have to retake the course next spring?", "Permalink": "https://www.reddit.com/by_id/t3_6p6omv.json"}, "416": {"Subreddit": "PhD", "Author": "throw_away_968935869", "Date": 1500887439, "Score": 1, "Body": "The recommendation to speak to the dean of the department, or the graduate school surprises me. Based on previous examples, I would say with a fair amount of certainty that if I'm went to the department head, they would look down on that and it would make things much worse. The graduate office and administration of our department is not viewed as ever being on the students side; the student is just expected to deal with it. I haven't tried the Graduate School; that may be my next step after speaking with my adviser. For reference, I'm at a US top ten school for graduate engineering. ", "Permalink": "https://www.reddit.com/by_id/t3_6p6omv.json"}, "417": {"Subreddit": "PhD", "Author": "thomasare", "Date": 1500934033, "Score": 4, "Body": "In grad school I wrote detailed notes on each journal article or chapter I read. This included definitions, important facts, and main ideas. I brought my notes to class for reference that way I never ran into an issue of retaining the information. Also, I read some tougher concepts out loud to understand them better. ", "Permalink": "https://www.reddit.com/by_id/t3_6p9tw2.json"}, "418": {"Subreddit": "ADPhD", "Author": "djc103", "Date": 1500940899, "Score": 2, "Body": "I use Google calendar and an elaborate Google spreadsheet. Different tabs for different tasks, e.g. dissertation, teaching, misc. Personal, grant x, grant y. Each tab has its own gantt (major tasks by week) chart and daily calendar where I log hours and smaller tasks. There is also and area in each tab for notes. My favorite part is that I set it up so the data from each tab fills in the \"overview\" tab so I can see how much I've devoted to each area by day, week, month.\n\nThe whole thing works pretty well for me, as long as I always fill it out. If I don't have access to it, I send myself emails that tell me to put x thing in the sheet. Google inbox has a nice snooze feature that really helps me too.", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "419": {"Subreddit": "PhD", "Author": "andrewjdb95", "Date": 1500941568, "Score": 1, "Body": "Thanks! Yeah I'm trying to take notes now with EverNote on journal articles to extract the main ideas of the text. It's still quite time-consuming though.", "Permalink": "https://www.reddit.com/by_id/t3_6p9tw2.json"}, "420": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1500942653, "Score": 1, "Body": "Please explain more - I am struggling with my papers right now (I find methods sections just so boring to read but I have to know them inside and out!). I would like to hear about your idea because this is the first time I've heard someone use excel for note taking! Maybe it could help me get through my papers.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "421": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1500945053, "Score": 5, "Body": "The more you read the easier it becomes.  Most of the knowledge is acquired by experience.  Just keep going and it will become easier. ", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "422": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1500945101, "Score": 3, "Body": "No you are not the only one. I find reading SOME papers challenging. \n\nWhat helps me is to highlight anything I can't explain on my own, then read about it and write a quick synopsis on that thing as a comment in mendeley (or whatever). As I read more papers, I find myself needing to do this less and less. ", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "423": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1500945718, "Score": 1, "Body": "Even when I look up things it's a never ending spiral of more questions for me...It turns me off now to the point I hate having to look up something new because I end up feeling like an idiot. How does one get over that? Been getting worse I feel...", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "424": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1500946879, "Score": 3, "Body": "I'm not crushing my Ph.D., so I might not be the one to be giving this much advice, but I'm going to.\n\nFigure out how well you need to understand it for your purposes before you read it. Then you'll know how far down the rabbit hole you need to go. I guess.", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "425": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1500951548, "Score": 2, "Body": "Have this saved, will do within the next few days, too busy to usefully expand now.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "426": {"Subreddit": "PhD", "Author": "berfection", "Date": 1500954463, "Score": 2, "Body": "Don't be worried. I am in my third year of my doc program and haven't had any sort of surprises like that. The biggest surprise for me has been the amount of time spent on work and the competitive nature of the program. I have enjoyed it and look forward to starting my dissertation in January. Good luck on your journey!", "Permalink": "https://www.reddit.com/by_id/t3_6pdk5l.json"}, "427": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1500961003, "Score": 6, "Body": "I think you know what the answer should be, OP. I think you probably see that both of you are hurting, and for seemingly opposing reasons. I think you know that he reminds you of the PhD you wish you had, and that you cannot relate to his getting bogged down after the perfect head start. \n\nIt seems like both of you are withdrawing into yourselves individually, and that's not healthy for a married couple imo. Would you be brave enough to initiate and sustain effort to just be there for him, and stow away those emotions of your own for now? When one half is better, the whole is better. You can then work on your emotional state after that, when he is better able to help you too. What do you think?", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "428": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1500962731, "Score": 14, "Body": "No. For every person publicly reaching out for guidance for their PhD-anxieties, I'd say there are ~20 PhDs who are having no issues. \n\nI think the key to success to PhD completion is to not get too emotionally attached to it. I know it's easier said than done. Try and treat your PhD as a work project, rather than having it consume your life where even something minor goes wrong, it takes a toll on your emotional wellbeing and triggers anxiety. There are always ways to manage or mitigate challenges and continue your journey.\n\nI worked for a few years in the corporate consulting sector prior to commencing PhD studies and I found this experience instrumental in guiding my PhD journey, as I just treat my PhD project as I would treat a work project for a client. I employ my project management skills with my PhD, where I also think about potential risks associated with the project, and then strategise with my supervisors to mitigate these potential risks to ensure successful completion of the PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_6pdk5l.json"}, "429": {"Subreddit": "PhD", "Author": "Revanchist95", "Date": 1500964096, "Score": 5, "Body": "My 2 cents for the results: Focus on reading the figures only. Find out what type of data they're showing (Is it a Western Blott or a qPCR plot?), what are the controls, design, what are they testing, what are the conclusions based upon what you know from the introduction, etc. After that go back to the text and you'll see it much clearer. Then the discussion is just breezing through their explanation of their data. After a while you'll identify things fast enough you can skim a paper in no time.  ", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "430": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1500965213, "Score": 3, "Body": "Thank you so much for replying :) and for summarising the situation so concisely. Yes, it's exactly that. I admit, I lack the temperament to emphatise with him, and as much as I want to stow my own issues someplace so I can help him get back on his feet, I can't. I'm currently looking for a job (because my scholarship is ending in 2 weeks) and so far, nada. I'm starting to feel anxious about not being able to transition smoothly into the industry/clinic. Again, my situation is in direct contrast to my husband's (he got his postdoc position immediately after he submitted his thesis). I am genuinely happy for his success (he's paid well, and we need that money). I just don't get the depressed part. Like... I'm starving while his pockets are full to the brim with cakes and he's *sad* about it, because he doesn't like cakes. \n\nI agree with you, one of us have to give, and I think, it's gonna be me because between the both of us, I have the \"better\" state of mind (weirdly enough). I agree, that I have to stop being selfish, or I'll ruin this beautiful relationship (we've been together 7 years!). I'm starting to feel bitter about the PhD (it's his idea to do the PhD, and I followed 'cause I liked research but coming from the clinic, I didn't mind staying, too - and as the years went by, he lost his confidence while I gained mine). I kept thinking about what-if's, you know? What if we got jobs instead of doing the PhD, what if I joined a different lab, etc. It's terrifying, because it's starting to invalidate what my husband and I have built together all these years. \n\n@.@ This sucks... I see the logical solutions, of course. And I wholeheartedly agree with what you said. I just need to find the strength and compassion to follow through.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "431": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1500971720, "Score": 2, "Body": "just my two cents on the depression side, sometimes it feels like you see that you are well off compared to others (eg your husband could be aware that his phd experience was smoother than yours) and then think I should be FLYING and doing really really well, to the point where anything but absolute perfection should be attained and nothing else is acceptable. \n\nI experienced something similar and it led to me having mental health crap too, so it could be one reasoning for the depression. I started telling myself that I'm in a good position (blah blah blah) ergo I should be outputting awesome stuff but I'm not, which pissed me the hell off. Atleast, thats how I saw things for myself, and what your situation sounds like to me? IDK if this made any sense at all LOL ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "432": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1500972258, "Score": 2, "Body": "I understand what you mean :) And that's interesting. Maybe he is feeling that way. It makes me want to invent a body swap machine XD 'cause I'm all down for switching positions, baby.\n\nI need anger management classes.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "433": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1500974224, "Score": 1, "Body": "It was just an idea :D \n\nHopefully it works out for you guys and your phd :D ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "434": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1500975811, "Score": 2, "Body": "You might be on to something here. My husband has mentioned that he feels guilty all the time. He feels like he's not \"appreciating\" these privileges and good fortunes, that he's squandering resources. We trade sob stories from our own circle of postgrad friends (we're from different faculties), and he feels like students who are more talented and cleverer than he is are being \"shortchanged\" for mediocre/toxic PIs/labs :(\n\nHe's not wrong... but I try to make him see his own strengths. Like, not everybody is born to fly, or swim, or run, right? He can't seem to appreciate himself. Zero self-esteem and confidence. Initially we passed this off as impostor's syndrome. I think it graduated into something else :(", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "435": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1500977773, "Score": 2, "Body": "A lot of what you've said regarding his feelings are very relatable, I pretty much thought the same for myself and still do struggle hard to accept stuff xD Sadly I have no solution, if you find one let me know :D\n\nThis is kinda related to that exponential growth, expectation leads to achievement leads to more expectation etc, its not sustainable, but its a really hard to stop thinking that way, youre kinda having to reprogram your brain to think differently, which takes time and a lot of effort (I think). But yea, like I said, I dont have a straight solution. ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "436": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1500981751, "Score": 2, "Body": "You're way more ready than I was. Now I'm proof-reading my thesis.", "Permalink": "https://www.reddit.com/by_id/t3_6pdk5l.json"}, "437": {"Subreddit": "PhD", "Author": "mugbrushteeth", "Date": 1500982593, "Score": 4, "Body": "\"The key to success to PhD completion is to not get too emotionally attached to it.\" \nThis is GOLD..!", "Permalink": "https://www.reddit.com/by_id/t3_6pdk5l.json"}, "438": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1500985216, "Score": 1, "Body": "I have the same issue of feeling stupid when asking questions or reading a paper and realizing I didn't understand a lot. I think in programs like masters and PhD (even undergrad), part of gaining confidence as a researchers involves internally deconstructing the shame of not knowing something. You're a researcher and it's your job to ask questions, no matter how small or trivial they seem. Repetition with those papers will help, and if you're more visual like I am, try and find a way to watch methods in action via YouTube or colleagues that use those methods. ", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "439": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1500985640, "Score": 2, "Body": "Hence why I eventually went with a program in California as opposed to Oklahoma (and to be fair, I did like the project in California. It wasn't all about the beaches).\n\nAs mentioned above, what you're studying is key. I'm a biology student and found my potential PIs through the process you're using as well as asking for PI recommendations from my faculty at my undergrad institution. My focus is endocrinology, so the community is smaller and they all sorta know each other, so they could direct me to the specific projects in which I had interests.", "Permalink": "https://www.reddit.com/by_id/t3_6p23t4.json"}, "440": {"Subreddit": "PhD", "Author": "SLGC", "Date": 1500989534, "Score": 7, "Body": "People here should post \"I'm x months into my PhD, I'm having fun and no major issues. My supervisor is nice and my last experiment went pretty okay.\" more often.", "Permalink": "https://www.reddit.com/by_id/t3_6pdk5l.json"}, "441": {"Subreddit": "PhD", "Author": "irrelevant_fondle", "Date": 1500995127, "Score": 2, "Body": "Similar to a comment from another poster, friends of mine experiencing depression in academia have commented that part of their depression comes from guilt at not appreciating what other people want so badly, even though it turns out they maybe don't, and guilt at not feeling they can make the best of the position and opportunities they've been given. Maybe your husband needs time to come to terms with his feelings about the new position, and settle in - it sounds like excess guilt may play a role, and if he is able to get past those feelings, he may actually come to like the position? It sounds like a very difficult situation where your emotions and experiences are negatively spiralling with the other persons, if you see what I mean?! Can you see any way to break the negative spiral, from either of you?", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "442": {"Subreddit": "PhD", "Author": "reddit_joanna", "Date": 1500999183, "Score": 1, "Body": "Hey OP, sounds to me like your husband may be suffering from the imposter syndrome. It's very common in academia. Please google it if you never came across it.\n\nAnd I agree with others that if you want this relationship to survive this difficult time you need to be supportive and put aside your opinion of how great his life seems to be. You mentioned that he is going to counselling - that's good, give him time to open up. You can also go together if you think the situation is affecting your relationship too much.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "443": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1501008813, "Score": 14, "Body": "Prove him wrong.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "444": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1501009368, "Score": 2, "Body": "Gives me hope. ", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "445": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1501011751, "Score": 5, "Body": "Nah. I motivated myself with the desire to prove someone wrong. It's so much more rewarding instead saying \"if I put my head on my pillow at the end of the day satisfied that I've lived/worked/produced results well according to my values, then that's good.\"\n\nNot even \"good enough.\" It's really the most rewarding measure of success I've found. ", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "446": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1501012025, "Score": 10, "Body": "Congratulations! \n\nDon't be discouraged. Your PhD results are not what the rest of your career depends on. You've worked hard, but now it's not for you to coast and 'retire' and become a consistently successful person. \n\nNow is when you start actually working. When you take the tool that graduate school has honed you into and use it to work hard and make an impact. \n\nSimply ask yourself \"five years from now, what does my daily routine need to look like in order for me to lay my head on my pillow at night satisfied and at peace?\" And then fight for that vision. \n\nBest of luck!!", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "447": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1501014538, "Score": 3, "Body": "Sounds like you've got it all figured out!", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "448": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1501015091, "Score": 2, "Body": "If I can encourage someone with my experiences, great. If you've been through something similar and have valuable insights, I am eager to hear! \n\nThis is a model that has worked well for me, and fits my worldview in an enriching way. More experiences will either add deeper nuance to it or invalidate it, but that doesn't mean I should equivocate when sharing :)", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "449": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1501015410, "Score": 2, "Body": "I think its important to experience a wide variety of insights and strategies on living life. You're better able to pick and choose things that fall in line with your values and core beliefs.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "450": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1501026428, "Score": 1, "Body": "Nice. ", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "451": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1501031657, "Score": 5, "Body": "I feel so sad.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "452": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1501032718, "Score": 4, "Body": "It's okay to feel sad. It's sounds like your advisor was cruel. That's not your fault, but it's okay to be sad about. \n\nYou got your PhD. That's hard and it took a lot of work. A lot of other people had to give you passing grades and sign off on your work for you to get this far. Your advisor is only one person. From the sounds of it, not even a good person. \n\nI believe in you though. I believe you can do great things. Don't give up. I know this feels like an end, but it's just a begining. Hang on. It won't be like this forever. ", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "453": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1501037657, "Score": 5, "Body": "Remember that day.  Remember it really well, keep a perfectly clear picture of how you feel on that very moment.\nWhen it'll be time to work hard for, sometimes, very little results, or when you'll have that really-too-close-to-sleep deadline : remember how you felt on this day, and you won't have to think twice about giving the best of you whatever it takes.", "Permalink": "https://www.reddit.com/by_id/t3_6pjtns.json"}, "454": {"Subreddit": "PhD", "Author": "healthacorn", "Date": 1501039456, "Score": 4, "Body": "Your dissertation is one blip in a much longer career, and your advisor is just one coworker. You passed! You have your doctorate now! You no longer have to care what your advisor thinks and you can go build the career you want with people who want to work with you. Many graduate students have shitty relationships with their advisors. Don't worry. There are good mentors out there too. So CONGRATULATIONS! Now go rock your doctorate!", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "455": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501039785, "Score": 1, "Body": "I understand what you mean :) We talked about this, and came to the conclusion that he's not confident enough. He compared his research experience and mine for example. I had the opportunity to present my work to a Howard Hugh PI last year, and boy, he spared me nothing XD He tore my poster apart, but it was an eye-opening experience and discussion (and when he said \"We will talk more about this by the end of this week!\" my heart shriveled and glowed at the same time, like OMG he actually gives a damn to my shit, and I was actually looking forward to seeing him again the following day of the conference). In contrast, my husband said whenever someone questioned his shit (someone like the postdoc next door, or another postgrad from the neighbouring lab) and he couldn't defend his project, he just spiralled into a \"I'm a failure\" blackhole. He asked me quite a number of times, \"How do you people do it? To be so confident and sure of ourselves.\" \n\n--&gt; Which is not true? I think we doubt our work and capabilities too, but we don't feel guilty about not knowing certain things, or overlooking details, I mean, it happens!\n\nIn my attempt to make him feel better, I told him stories about my experiences/screw-ups in the clinic. For example, improper calibration of the X-ray machine --&gt; repeat takes of X-ray + pissed off patient + complaint + potential lawsuit (some patients are just difficult...). Or! Not noticing a slight tear in the gloves + microscopic wound on my hand + treating patients who's Hep B or HIV positive --&gt; well... (BTW this is hypothetical, I'm clean XD)\n\nI told him, in academia, there's almost no stakes, right? I mean, OK, money, resources, time, etc. But, there's a lot more leeway for making mistakes compared to \"out there\" where one misstep is usually irreparable.\n\n&gt;.&gt; It didn't help make my husband feel any better.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "456": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501040223, "Score": 1, "Body": "Oh yes, the almighty impostor syndrome. We discussed about the best way to deal with it, and for me, I take my work and present them to experts of the field several times per year. I think being daring/brave enough to put oneself in a \"vulnerable\" position and succeed, and doing so consistently is a good way of breaking out of the impostor syndrome. But, apparently this doesn't work for my husband. This depression hits him the hardest after he passed his viva, because the examiners tore his thesis apart but still granted him the PhD O.o He feels like he's not deserving.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "457": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501040396, "Score": 2, "Body": "It's interesting isn't it, how people respond to stress and success differently? You're right, that whole success --&gt; more expectation --&gt; neverending desire for *more* success is bad... and weird (to me XD because this is not how I operate). But, many others do, my husband, too.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "458": {"Subreddit": "PhD", "Author": "navayan", "Date": 1501047796, "Score": 1, "Body": "Use this affirmation ,\" others opinion can harm me only if I accept them as true.\" And \" I reject any opinion that denies my value as a human.\"\n Also about guide \" high positions titles ,degrees does not add to anyone's value or worth\"  keep repeating in mind and writing it would help.\nSource  book maximize confidence by Jerry minchinton", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "459": {"Subreddit": "PhD", "Author": "blufox", "Date": 1501048182, "Score": 2, "Body": "Congratulations Dr. ICreateAccountToPost, may you have a great career. If you don't mind sharing, What is your thesis in?\n\nOn your advisors opinion, think of it as nothing more than a criticism, one among the many you will face, and overcome, just the same way you completed your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "460": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1501052272, "Score": 1, "Body": "I love this - thanks!", "Permalink": "https://www.reddit.com/by_id/t3_6pjtns.json"}, "461": {"Subreddit": "PhD", "Author": "drainbox", "Date": 1501056273, "Score": 1, "Body": "what did you get your PhD in?", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "462": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1501060706, "Score": 1, "Body": "Yes exactly, it is very interesting, also probably highly related to upbringing (or past) and things like that I reckon. \n\nOut of interest, how do you see it? I see it that way too, I was taught that the real success was in successive achievement rather than standalone. ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "463": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501062989, "Score": 1, "Body": "I agree with you, definitely, that real success is doing/achieving something good, and then repeat that over and over again. We don't want a one-hit-wonder, we want to be consistent in our achievements :) But I've accepted the fact that it's not always a linear projection... like, my entire PhD journey has it's extreme ups and downs... I'd like to think it hasn't broken me (despite me being angry all the time, which I think is justified XD), as it has broken my husband (whose BTW journey is rather uneventful, just a smooth way up). And when good things happen, celebrate a little. My idea of a celebration is to give back to the people (a treat to my friends who've supported me, some charity work)... and I give pep-talk to myself: great, we hit a milestone, what's next? And look forward to the next big challenge. If we didn't hit the milestone: it's fine, we've tried our best, at least we know this won't work, it was fun though, so what's the next big challenge?\n\nTo summarise my answer, I agree with you :) Success is consistency in doing something well. There will be \"failures\" in success, and our job is to turn around that failure into a lesson, instead of a \"de-motivator\". I find this easy to practice, but to my husband, this is mind-boggling O.o So, I think maybe individual's personalities play a huge part, too. Like, some are more inclined to positive-thinking, some are not?", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "464": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1501072401, "Score": 2, "Body": "You and your husband are very different people. When someone is depressed, they can't see the great things about their own situation, so unfortunately no he isn't going to be able to satisfactorily compare his situation with yours and realise he has it great. \n\nFor the record, I had an absolutely terrible supervisor in my PhD. They were awful, like you, this person refused to accept a review article for publication by me, they criticised everything about my work - the week before I went to a big conference for a poster they made some corrections and I did them then I sent it back a day later, got nothing and they eventually replied when I touched down in the US and they said it was awful and they were ashamed to have their names associated with it and I should meet this person in their office to discuss. Ignoring I was already at the conference. This person was so nice to me in front of people but awful in meetings, took a year to order me rats for my investigations, hindered me at every turn and ultimately left when I was writing up with no notification. I have no publications but where I am in Europe this isn't a major drawback necessarily. \n\nUltimately you have to realise everyone is different and of course we would prefer to have smooth PhD projects but this has changed us (for the stronger). You should try not to resent your husband because their smooth ride has resulted in possibly a lower threshold for stress while you possible can cope better. You must accept that your PhD is different to his and there is no turning back the clock. Do not let this come between love. You will still have your experiences and qualifications. ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "465": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1501078235, "Score": 2, "Body": "Whatever the reasons might be, please do your self a favour and NEVER work your ass off simply because you want to prove your advisor wrong. \n\nDo it for your sake, not for the sake of possibility of laughing on someone's faces. Also a friendly reminder that your advisor will always win in these situation.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "466": {"Subreddit": "PhD", "Author": "Azonata", "Date": 1501079752, "Score": 2, "Body": "Key his car.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "467": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1501086011, "Score": 1, "Body": "Lol. Behave", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "468": {"Subreddit": "ADPhD", "Author": "WiredWierdly", "Date": 1501089856, "Score": 1, "Body": "That sounds really awesome. How effective do you think the feedback system is maintaining your schedule?", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "469": {"Subreddit": "ADPhD", "Author": "WiredWierdly", "Date": 1501090320, "Score": 2, "Body": "I'm familiar with bullet journals but I never thought to use it for my experiments. That's a really great idea.", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "470": {"Subreddit": "ADPhD", "Author": "djc103", "Date": 1501095792, "Score": 2, "Body": "At the end of the day it still takes a lot of effort to establish and maintain habits. But I do get a lot of gratification from seeing the tasks checked off and the hours add up. And forcing myself to constantly refer back to the document helps me keep everything straight-- helps me compartmentalize my tasks and time. It's a struggle though", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "471": {"Subreddit": "PhD", "Author": "kemushi_warui", "Date": 1501099802, "Score": 1, "Body": "What do you mean by \"exactly like\"? Same ideas? Same wording? There's a huge difference between the two.", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "472": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1501100869, "Score": 1, "Body": "Are you worried because they are plagiarizing or because you might've just gotten scooped?", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "473": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1501100995, "Score": 2, "Body": "Scooped. I've been working five years on this and I'm afraid my work might be worthless now.", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "474": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1501101072, "Score": 2, "Body": "Similar ideas to one of my studies. Like very similar. It's a conference paper so I won't know exactly what they've done unless I attend the conference.", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "475": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1501103155, "Score": 7, "Body": "I guess it depends on how similar it is to your work and what field you're in, but I think it will probably be ok. Will you have more than one paper from your PhD? Hopefully this only affects one of them... Plus, you can always take a different angle in your publications than in your thesis, so unless they have your actual data, it shouldn't be impossible to publish, you just might have to change the slant.\n\nIf it makes you feel any better, I was 3+ years into my PhD when my supervisors told me that I was actually the second candidate to work on my project, and the first had quit after a few months, stolen the project and continued it at another uni. So she was doing my PhD but with 6 months head start. And it still managed to work out ok, so there is hope for you too :)", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "476": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1501105246, "Score": 3, "Body": "That's terrible.", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "477": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1501105525, "Score": 2, "Body": "It seemed it at the time but honestly didn't have much effect in the end. Just thought it might be encouraging to hear that other people have also experienced and survived similar things!", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "478": {"Subreddit": "ADPhD", "Author": "WiredWierdly", "Date": 1501105542, "Score": 1, "Body": "Awesome. Thank you for the tips.", "Permalink": "https://www.reddit.com/by_id/t3_6n1s5i.json"}, "479": {"Subreddit": "ADPhD", "Author": "spaceblip", "Date": 1501114480, "Score": 1, "Body": "UPDATE\n\nLeave it to RSD and impostor syndrome to give me the impression that people think badly of me, because I just got offered a position with the advisor who was my first choice for my PhD! (Also, said advisor is, and I quote, \"very interested\" in working with me!) \n\nOf course, I still have nagging doubts and stuff, but this will definitely make them shut up for a bit. It's a huge relief! \n\nNow, to learn to write emails without overthinking every word. ", "Permalink": "https://www.reddit.com/by_id/t3_6pkm68.json"}, "480": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1501117239, "Score": 1, "Body": "I’d email/call your advisor ASAP. I don’t want to give you anxiety, but I’d be freaking the fuck out. Is there a way you can change your population/target subject slightly? Like, even just put something stupid in there like testing it with the lights on and the lights off. Idk", "Permalink": "https://www.reddit.com/by_id/t3_6pqlc8.json"}, "481": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1501127862, "Score": 1, "Body": "Doesn't matter. A W is a W.", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "482": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501128677, "Score": 1, "Body": "Thank you for sharing your thoughts :) And I'm sorry to hear about your experience, too :( I agree with you, I have to accept that my husband and I are different, our PhD journeys are different, too. I'm ashamed of myself sometimes for being envious of his luck, but at the same time, extremely happy for him because if there's one guy who deserves the good things in life, it's him. He has a heart of gold (gee, maybe that's why he can put up with me for the past 7 years XD), the kindest, most giving person I ever known.\n\nI mentioned to him some of the points discussed in the earlier posts, like is he guilty because some of us are in worse positions and he feels like he should totally carpe diem, and he says yeah... he says, we're already privileged, with or without publications, or degrees. We're not running away from bombs. We're not being persecuted for having certain faiths. We're not starving. So, he's guilty because he won the birth lottery, and he should use this lifetime to improve people's lives, but he's not... and I'm like... damn. How can I out-Gandhi that?", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "483": {"Subreddit": "PhD", "Author": "Kagemand", "Date": 1501135652, "Score": 1, "Body": "The only support I can give is to tell you that you are not alone, I feel the same way. So did my friend, he just managed to finish writing his.", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "484": {"Subreddit": "PhD", "Author": "plsobeytrafficlights", "Date": 1501136400, "Score": 6, "Body": "It is war, it is tears and blood, and when it is all said and done, no one will look at it again. Just get it done. It doesnt have to be Shakespeare or even everything you ever did. make a story and get it done. You know that in your mind, you are already all that you will be after, now you just need to do the perfunctory things that gets everyone else to see that.   I...might be willing to pitch in copy-editing a chapter or two...(boy, probably going to regret that,but I know that I would not have made it alone in time for my deadline). message me. maybe some others might be crazy enough to pitch in too.", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "485": {"Subreddit": "PhD", "Author": "plsobeytrafficlights", "Date": 1501136751, "Score": 2, "Body": "also...  i dont know your field, so really depends but 2 seconds of google said:  \n\n\n\"1. A PhD takes twice as long as a bachelor's degree to complete. The average student takes 8.2 years to slog through a PhD program and is 33 years old before earning that top diploma.\"  -CBS News.  \nyoure doing just fine.", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "486": {"Subreddit": "PhD", "Author": "alexashin", "Date": 1501140138, "Score": 2, "Body": "You can do it! It is possible to be burnt out after many years with the single project. Finish it so it doesn't bother you. Also it is very intimidating to have the whole text ahead of you. Set yourself a certain time every day to write, do small parts like abstract, reference list etc just to get you going. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "487": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1501145431, "Score": 1, "Body": "Hey there OP, just wanted to pop by and say you're doing a good job, and you're able to make this work. No, more than that - you will make this thrive! I can throw platitudes at you, but I'll just say I believe in you. \n\nNow go out there and do what you've set out to do! You can do it! :)", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "488": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1501145784, "Score": 2, "Body": "Sorry for the late reply! Was busy doing PhD related stuff then slept xD I think I've read some of your posts before, and sounds like you do have good reason to be angry. \n\nThat's a pretty good view regarding the celebration of success, I don't think I really celebrate anything anymore xD Also regarding your comment about not hitting the milestone, my brain thinks more like \"great you fcked up you're worthless, why are you even here , do you really deserve this position\" (or stuff like that ). I don't know why, it just does :(  \n\nBut yes, individual personalities, everything that contributed their make up dictates their response to the situation . I guess though, with time and training you can change the way you think.", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "489": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1501153801, "Score": 1, "Body": "8.2 years! Jeez. I am nearing finishing writing my PhD (submission in December) and that'll be 3.5 years since I started (in Australia), and there's no bloody way I'd want to spend any longer on it. That's my main motivation with the writing - I just want to get it over and done with. ", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "490": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1501155943, "Score": 2, "Body": "&gt;This may sound insensitive, but if you expect to get a PhD in 3 years by simply going to class and doing exactly what your adviser tells you, then you are delusional.\n\nAs someone from a country where 3 year PhDs are the norm, the simple answer is that you don't go to class. \n\nWe don't have taught classes (other than the odd short course on research methods or stats) - that's masters level. Your PhD is purely your research. \n\nTeaching classes as a PhD student is often optional rather than part of your funding, and whilst your project is linked into your supervisor's research, you don't work for them per se. \n\nThe focus is totally different, and arguably has more depth and less breadth.\n\nThe idea of having to take classes and maintain grades whilst researching is totally foreign, and explains why a PhD takes so much less time IMO. \n\nHowever, there is an increasing trend towards 4 year PhDs with an intercalated masters year for students coming straight from undergrad, especially in STEM, which is a little more like the US model.", "Permalink": "https://www.reddit.com/by_id/t3_6ohcl7.json"}, "491": {"Subreddit": "PhD", "Author": "samoels", "Date": 1501161418, "Score": 1, "Body": "I suggest setting a limit of writing a few lines to a paragraph each day and dont be hard on yourself on every single sentence, thats your supervisor/examiner's job. I understand that you hate your research at this point but you're so close. The majority of PhD candidates I've spoken too have gone through this at some point during the degree especially as it gets closer to the end. Based on the timeline you gave Im assuming you're not doing your PhD in the US, so think of it as being 3 years ahead (would have taken you 7-8 years on average if you were in the US). Might also be useful if you post about your research somewhere on reddit. Let the community inspire you and tell you what future applications they see for your research (further research on the topic or even mixing it up with something else for commercialization). This could give you a good 'future work' chapter too :).\n", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "492": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1501165337, "Score": 2, "Body": "Some days during my write up all I had to motivate me was spite. I would sit down and say \"I hate you thesis and I will end you!!\" It made me feel a little bit like Anakin Skywalker using the dark side of the force - but it pushed me through it!\n\nYOU ARE SO CLOSE!!!!!!!! DOOOOO IIIIIIIIIIIIITTTTTT!!!!", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "493": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1501167020, "Score": 5, "Body": "I'm in my very early stages and in no position to empathise with this but I've definitely read about others having this same fear. It's called Imposter Syndrome, it's a real thing.\n\nAs far as the writing block, my naive advice is: ditch the computer. Get a pen and paper. Write your outline as a few words, not even in any order. Just \"Battle of X\", \"This important figure\", \"background\", \"gap in knowledge\" or whatever. Order them all. Find out if there's a big jump/divide between sections and think how to fill that. When you have that skeleton, make dot points for each. \"Battle of X. Who was in it. Outcome of battle. Leaders. Reasons for fighting\". (I know shit all about history/historical anything, can you tell?). \n\nThen just write. Know that it will come out shit, don't go back and edit or micro-analyse the last sentence, the last paragraph, the last page. Write until you have gone through that list, and then put it aside knowing that you are keen to re-read it and edit it all. Never take a break when you have a mental block or you're not sure where to go next, or it's such a battle sitting back down to start again. Always have a task prepared so you can pick it up easily.", "Permalink": "https://www.reddit.com/by_id/t3_6pv09q.json"}, "494": {"Subreddit": "PhD", "Author": "plsobeytrafficlights", "Date": 1501174972, "Score": 1, "Body": "ah.  Well, I didnt take 8, but 3 would only be a masters in the states. I dont think i even started the core work that became my focus for the first 2.", "Permalink": "https://www.reddit.com/by_id/t3_6ptsxj.json"}, "495": {"Subreddit": "PhD", "Author": "mrsnuggets", "Date": 1501186927, "Score": 1, "Body": "SO DID YOU PASS?????", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "496": {"Subreddit": "PhD", "Author": "Prawldrowland", "Date": 1501189270, "Score": 3, "Body": "I think it's natural to have a rollercoaster of confidence when you're writing up. You've endured so much over 4 years that the final stretch feels like the hardest. You should definitely apply for the job. It might take two or three days to write the application but the process of doing so will remind you about all of your experience and hopefully boost your confidence a bit. It can be really lonely and difficult to maintain your self confidence in academic settings, but refocus your expectations on the thesis being \"good enough\", get it out of the way and start putting it to good use! ", "Permalink": "https://www.reddit.com/by_id/t3_6pv09q.json"}, "497": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1501192872, "Score": 1, "Body": "That is reassuring to hear! Supportive spouse-check.  However, I do need speak with the supervisors about how much teaching I am required to do. \n\nIt's a fully funded social sciences and health PhD and thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6pwris.json"}, "498": {"Subreddit": "PhD", "Author": "happy_and_proud", "Date": 1501199617, "Score": 4, "Body": "I'm a mom of almost 6 years old boy, almost 2 years old girl, pregnant with baby number 3, and doing my PhD. I had 2nd baby right after my candidacy exam, after that I haven't really done much in my research, anyway, back to the part where it worked for me.\nSupportive spouse is number one thing that will help, number two is school+daycare+routine, these are great, everything is mostly expected and on time. Number three is to never procrastinate, moms never have the luxury of doing an overnighter the night before sth is due, you start working on it the minute you're assigned it.\nHope i helped, good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6pwris.json"}, "499": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1501201877, "Score": 1, "Body": "Okay! Thanks :)", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "500": {"Subreddit": "PhD", "Author": "uw_gooselord", "Date": 1501209238, "Score": 1, "Body": "Get cracking soon. Be a bit proactive if your advisor seems busy with other students (well known professors are usually neck deep in work). Unfortunately, being a research intern with a professor puts your timeline entirely in his/her control, so showing more enthusiasm helps.\n\nSource: Had to do this in my one year research internship after undergrad. ", "Permalink": "https://www.reddit.com/by_id/t3_6n1iqg.json"}, "501": {"Subreddit": "PhD", "Author": "NotRexManningDay", "Date": 1501214050, "Score": 1, "Body": "My oldest daughter was almost 2 when I started.  I had baby #2 in November of my second year, older daughter was 3 at that time. Hubby worked full time. Both kids were in daycare full time. One thing that really worked for me was to work as much I could in blocked out times.  So, I addition to 8-4 scheduled, I stayed at work Tuesdays and Thursdays until midnight or so, instead of a few hours here and there, so other nights I could be fully present with my kids and enjoy my time with them. I also went back to homework or writing after kids when to sleep most nights.  Hubby did all the grocery shopping, cooking, and most of the house work for those. Those were a killer few years but I'm glad I powered through instead of dragging it out. I finished in 3 years (went in with a master's), kids were 1.5 and 4.5 when I finished. ", "Permalink": "https://www.reddit.com/by_id/t3_6pwris.json"}, "502": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1501215314, "Score": 2, "Body": "When I started I had a 2yo and soon fell pregnant with #2. I'm 18 months real time (9 months PhD time) into this. It is HARD. I am part time so only expected to do 15 hours a week. Lately I have easily been doing double that. 8pm-2am 7 nights a week (but so many interruptions with waking babies, family stuff taking me away to have discussions with husband etc). Then snatched bits of time during the day. I constantly feel guilty. If I'm with my children I think of all the work I could be doing. If I do work I feel bad for not playing with them and letting my work affect them. \n\nI love what I do, I'm glad I took on the PhD, but I would be amazed and jealous if any parents said that their PhD never once negatively affected their children, or that their children were at times \"neglected\".", "Permalink": "https://www.reddit.com/by_id/t3_6pwris.json"}, "503": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501218662, "Score": 2, "Body": "Thank you so much for your encouragement :) There's no easy way out of this one, and I'm not willing to go back, so ONWARD! ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "504": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501218791, "Score": 1, "Body": "As my husband puts is, where do we draw the line between optimism and delusional? Between confidence and arrogance? \n\n:) Guess time and more experiences will tell, as you've nicely put it, too.\n\nThank you for your encouragement and kind words. Hugs! I sincerely hope all is going well with you and your PhD!!!", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "505": {"Subreddit": "PhD", "Author": "alphanumericsheeppig", "Date": 1501223412, "Score": 2, "Body": "Those last two months were when I wanted to quit the most. It seemed I had an insurmountable amount of work, and my grant was coming to an end. I felt my research had been a failure (my results were somewhat obvious and unimportant). I just convinced myself that since I'd poured years of my life into my work, I'd stick it out for two more months. It felt like my thesis would never end and then suddenly I had no more to write. I had a complete thesis even though my last 2 chapters feel to me like the most boring drivel I have ever read. I just wrote to get it done.  When I sent a draft to my supervisor, I was really surprised that for some reason he liked it (at least he said he did). \n\nI've never been a quitter and that was the only time in my life that I felt like I couldn't do something. I was just so tired and emotionally drained, I felt I wasn't capable of carrying on. I did it anyway. It's just exhaustion and lack of confidence setting in. You just have to push through and persevere. ", "Permalink": "https://www.reddit.com/by_id/t3_6pv09q.json"}, "506": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1501229093, "Score": 3, "Body": "You did help - thank you. Gosh, I don't know how you're doing it while pregnant! There's no way I could have!", "Permalink": "https://www.reddit.com/by_id/t3_6pwris.json"}, "507": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1501231752, "Score": 2, "Body": "Exactly, I like that line \"line between optimism and delusional\", its a hard line to draw I've found xD\n\nLikewise, I'm sure me and this subreddit are rooting for you and your husband :D GLHF. ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "508": {"Subreddit": "WitchPhD", "Author": "viper67", "Date": 1501249390, "Score": 2, "Body": "Spectacular as always!  ", "Permalink": "https://www.reddit.com/by_id/t3_6q3rgp.json"}, "509": {"Subreddit": "WitchPhD", "Author": "imembarrassedwithme", "Date": 1501252805, "Score": 2, "Body": "Always so perfect :) thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6q3rgp.json"}, "510": {"Subreddit": "WitchPhD", "Author": "yakmoo", "Date": 1501253628, "Score": 2, "Body": "Sweet Satan you're posting again- keep it up!", "Permalink": "https://www.reddit.com/by_id/t3_6q3rgp.json"}, "511": {"Subreddit": "WitchPhD", "Author": "tikibowtiki", "Date": 1501258309, "Score": 2, "Body": "Still my favorite😍", "Permalink": "https://www.reddit.com/by_id/t3_6q3rgp.json"}, "512": {"Subreddit": "PhD", "Author": "icreateaccounttopost", "Date": 1501268378, "Score": 3, "Body": "Yes.", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "513": {"Subreddit": "PhD", "Author": "stephella", "Date": 1501269693, "Score": 1, "Body": "Hey folks :) \n\nthought I'd let you know that I made it. I will start teaching at the uni in November, doing my PhD associated. Thank you so much for your kind, encouraging words - you really made me try again and harder. \n\nLoads of appreciation and love to all of you! ", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "514": {"Subreddit": "PhD", "Author": "mrsnuggets", "Date": 1501283111, "Score": 1, "Body": "Congrats! That is awesome ", "Permalink": "https://www.reddit.com/by_id/t3_6ox54c.json"}, "515": {"Subreddit": "PhD", "Author": "SpicyLiver", "Date": 1501308297, "Score": 1, "Body": "Thank you so much!!! ", "Permalink": "https://www.reddit.com/by_id/t3_6pd45m.json"}, "516": {"Subreddit": "PhD", "Author": "signorpiscinio", "Date": 1501321983, "Score": 2, "Body": "Thanks, all! I sent what I had for the review and will probably just have to grin and bear it. What are they going to do: delay my submission? I just had a couple of days off and am now refocused and clearer about what to write. To be honest, I think this was one of my biggest problems -- being compelled to write something just to have a product, when many of my ideas were still very much in flux. \n\nEight weeks to go. Time to dig in! ", "Permalink": "https://www.reddit.com/by_id/t3_6pv09q.json"}, "517": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1501335672, "Score": 9, "Body": "Realize that you are going to heavily doubt yourself and your abilities at all times. I don't really have a way to combat this but I spent the first half of my first year hating the program because I thought I was garbage. It's much more enjoyable when you realize that you're not competing against anyone and the PhD is whatever you make it to be.", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "518": {"Subreddit": "PhD", "Author": "haikucigarette", "Date": 1501340272, "Score": 5, "Body": "I'd have chosen to do my PhD at the institution where the best supervisor for my interests and intellectual approach was, not at the institution that was the most prestigious", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "519": {"Subreddit": "PhD", "Author": "Eternalthesiswriter", "Date": 1501341785, "Score": 1, "Body": "Hold on there and keep moving forward. Tell me what your research is about and what are your main ideas. I'd love to hear. ", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "520": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1501364058, "Score": 5, "Body": "If you want an academic job after, start publishing early and often. Aim as high as possible. Try to be first or only author on a few of those, although this is discipline specific. Apply for every kind of academic award possible. Present at as many conferences as you can. Teach and get good teaching scores. Easy peasy:)", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "521": {"Subreddit": "PhD", "Author": "bomchikawowow", "Date": 1501369222, "Score": 1, "Body": "Me too OP! \n\nAlso you only have to touch the finish line, not heave your whole body over it. You can do it.", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "522": {"Subreddit": "PhD", "Author": "bomchikawowow", "Date": 1501369348, "Score": 1, "Body": "This! Also make sure your supervisor is the right match for you, and address it early if not - even if that means changing supervisors. I have seen so many students undone by shitty supervisors that they stuck with because they didn't want the hassle and confrontation of turning them loose. ", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "523": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1501376744, "Score": 1, "Body": "I hope you didn't forget... ", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "524": {"Subreddit": "PhD", "Author": "RotanitsarcorpDaeh", "Date": 1501387501, "Score": 2, "Body": "Thanks!  It's small and medium (SME) business stuff, set in the wine industry (my real world specialisation).  My thesis consists of 4 free standing papers (plus intro, methodology and conclusion chapters).  My papers are: 1 explores lack of definitional clarity around the concepts like \"formal\" and \"informal\" in accounting systems. I review a fairly recent contribution in this space against the SME context, pointing out where their definitions don't fit but showing how their ideas are useful and important anyway; takeaway is that we need a broader, more contextually aware understanding of accounting systems when conducting research in the SME space.  2 considers the concept of \"sophistication\" in SME costing systems. Existing (survey-based) research has typically focussed on technical considerations. I bring the user back in and compare the technical potential sophistication of the system against the \"in use\" sophistication of the system. 3 considers stakeholders experiences of isomorphic forces in a patchy institutional field.  I was careful to this point to avoid jargon because I have no idea what your field is but I've just remembered this is a thesis.  Losing battle.  And you were likely just being polite!  But...  just in case...  there's a seminal paper in the field that shows how organisations tend to become more like each other over time (and then plenty more that argue they don't).  I examine four firms experiences with regards to an industry intervention that was intended to help them / would have made them more similar... but it didn't work.  So I look at whether they experienced pressures to comply / if not why not etc.  4 fits into the institutional logics space.  Other researchers have looked at how actants cope with competing institutional logics in given situations (eg it's appropriate to act a certain way in one setting, a different way in another; it's mental work to constantly balance / shift between the two).  Conflicting logics tend to get painted as exactly that: conflicting / in opposition / battling it out for dominance.  In contrast, I show that in the wine industry, key stakeholders (tacitly) understand that they need an appropriate balance between aesthetic (artistic) and market (commercial) logics.  Not only do they tolerate the co-existence of these opposing logics, they actively seek it out.  Partnering with someone who typically displays the opposite logic to you means you can reduce the mental load required to internally balance the representation - you can externalise it by bestowing power in a carrier of a conflicting-yet-complimentary logic.\n\nSo now that I've potentially embarrassed myself by delivering that murky mess of jargon that still completely glosses over stuff....    tell me, what's your area? ", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "525": {"Subreddit": "PhD", "Author": "RotanitsarcorpDaeh", "Date": 1501387541, "Score": 1, "Body": "I love this.  Thank you!", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "526": {"Subreddit": "PhD", "Author": "RotanitsarcorpDaeh", "Date": 1501387811, "Score": 1, "Body": "NEXT DAY UPDATE:  Didn't make my self imposed deadline.  Fell asleep on my thesis at about 2am ish?  Then kept waking up in a panic thinking I'd finally worked out how to make my paper flow, but forgotten because I fell asleep... so then I'd lay there stressing until I \"remembered\" but I'd be too sleepy to write it down, so I'd drift back to sleep....  then repeat.    The thing is, I already KNOW how my paper needs to end up; I'm not looking for a magic hook?  The whole thing was just one big stress dream.  And interspersed I had other stress dreams eg being caught up in an armed robbery.  \n\nOh well, TODAY IS A NEW DAY.  I'm back at it.\n\nPS. Last night I found my paperwork.  Submitting on the 10th, not the 12th! (12th is a Saturday so it only makes one day difference anyway... but still.... )\n\n11 sleeps to go people!!", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "527": {"Subreddit": "PhD", "Author": "RotanitsarcorpDaeh", "Date": 1501388295, "Score": 1, "Body": "I added an extra supervisor from another institution.  He's been amazing. He gets nothing out of supervising me (except I suppose the likelihood of his name in papers down the track, but I honestly don't think he cares about that?) yet he's given so freely of his time and expertise. Wouldn't have (almost) made it if it wasn't for his input.  \n", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "528": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1501388529, "Score": 2, "Body": "Nope, just busy. Likely will be able to respond in full Monday / Tuesday. Got legit grading work for the first time in my life + moving.", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "529": {"Subreddit": "PhD", "Author": "RotanitsarcorpDaeh", "Date": 1501389290, "Score": 1, "Body": "Oh my gosh! I opened this thread expecting happy motivation - was not expecting the rest of your comment!  What a jerk!  You're clearly NOT a failure because he signed off on it.  It doesn't make sense that he'd be self important enough to feel the need to tell you your work is horrible AND be prepared to sign off it and send it out in the world with his name on it as supervisor....   so I'd say that him saying those things to you is way more likely to be related to some misery afflicting him, not actually a reflection of your work.  \n\nThe cool thing about your PhD - you have one or your don't.  No one ever asks what the examiners comments were or what your supervisor thought of you.  You did it or you didn't.  And you did.  So stuff him.\n", "Permalink": "https://www.reddit.com/by_id/t3_6phox1.json"}, "530": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1501390581, "Score": 1, "Body": "Hit me up. I'm EXACTLY where you are too. I'm setting my submission deadline tomorrow for less than two weeks from now. I have a bunch of changes and things that I need to do but it's such a struggle.", "Permalink": "https://www.reddit.com/by_id/t3_6qa9qm.json"}, "531": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1501394280, "Score": 2, "Body": "Not sure about your field, but in mine (social sciences) a lot of papers are very hard to read, especially older ones before a noticeable shift to writing in more easy to read English.\n\nHowever, something I have noticed and has been corroborated by senior academics I know is that...a lot of articles are just bad. They're poorly written, maybe poorly researched, and might have been done in a really rushed way. Some people don't really get out of an undergraduate 'use big words' mentality. So don't always blame yourself for not being able to understand papers - sometimes it actually is the author's fault.", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "532": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1501395393, "Score": 2, "Body": "I would say roughly a quarter of my time is spent writing", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "533": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1501397525, "Score": 1, "Body": "I have one day a week of thesis writing and a half day of other writing. So about a third of my writing time.", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "534": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1501397641, "Score": 1, "Body": "Full 8hr day and half 4hr day? ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "535": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1501397659, "Score": 1, "Body": "All writing or writing on other things? ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "536": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1501397739, "Score": 1, "Body": "On average. It's probably 7.5-8.5 on the full day and 3.5-4.5 on the half day. ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "537": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1501397885, "Score": 1, "Body": "To clarify, I am 1.5 years into a 3 year PhD and just started writing my thesis a month ago. The idea is that I will write like this and not have to do as much full time writing of my thesis at the end. I'm also in a field that publishes quite a bit. I normally get 2 first author papers and 2 second to mid author papers per year so there's a bit of writing to do there.", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "538": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1501397914, "Score": 5, "Body": "Wish i had that level of concentration. I probably do a 10hr day quite often with 9.5hrs procrastination. ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "539": {"Subreddit": "PhD", "Author": "TheAgonyOfLaffitte", "Date": 1501397957, "Score": 1, "Body": "Wow, that seems quite regular. Mind if i ask what field? ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "540": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1501398295, "Score": 1, "Body": "Physical chemistry is probably the best describer but I'm between physics and chemistry. It's only been that regular recently when I realised how soon I would need to sit down and write for 3 months straight (at the end), if I didn't write now.\n\nI have a page limit that I have to get to every week (for thesis) so that pushes me to get that done. I get to go home when the pages are done. I also get to write anything in my thesis. So some days I'll write methods and the next week I might write conclusions and abstracts. For the other writing I keep an ongoing to do list with deadlines and it feels good to cross stuff off and stay ahead of the dead lines so that pushes me to do that.", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "541": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1501400510, "Score": 1, "Body": "Writing on other tings : I'm in my first year, haven't started writing the thesis yet", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "542": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1501423730, "Score": 2, "Body": "Maybe this is field dependent. 100% of my research and writing has been for thesis-related work.", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "543": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1501424205, "Score": 1, "Body": "I used many of these techniques to finish my dissertation. ", "Permalink": "https://www.reddit.com/by_id/t3_6qhgsw.json"}, "544": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1501425573, "Score": 1, "Body": "OKay no problem! Good luck :)", "Permalink": "https://www.reddit.com/by_id/t3_6ohbit.json"}, "545": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1501425669, "Score": 1, "Body": "Yea I did read a recent article about the writing style for papers, but these are not old papers these are recent. Just my field (genetics/next-gen stuff) uses a lot of bioinformatic tools and it's like, \"We used A to test for B where as C tests for A and B, we also implemented D with E while changing the variables in D to match E...\" Very dense stuff.", "Permalink": "https://www.reddit.com/by_id/t3_6pchj3.json"}, "546": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1501433774, "Score": 1, "Body": "3 years in the UK - here we just do the research. No courses or exams required ", "Permalink": "https://www.reddit.com/by_id/t3_6ohcl7.json"}, "547": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1501443332, "Score": 1, "Body": "Thank you for all your replies. I'll definitely be taking them on board.", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "548": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1501452966, "Score": 2, "Body": "It's \"do you want a TT professorship after graduation\" dependent. ", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "549": {"Subreddit": "PhD", "Author": "arugulafanclub", "Date": 1501457404, "Score": 1, "Body": "&gt;Aren't these a thin disguise for the kind of people who will write a thesis for you if you pay them?\n\nNope, not at all. \n\nWhat OP is proposing might cross those lines:\n&gt;my hope would be for someone to look at my proposal and give me detailed chapter outlines, that I could write out \n\nHowever, most editors and coaches would help him/her talk through what he/she wants to do, look over work he/she has already done, that sort of thing. \nAny good editor or coach will not do the work for you but work more as a guide. Kind of like how you might get a tutor for a physics class. \n\nMost programs allow a coach or editor as long as that editor is not doing the work for you. \n\nSource: I edit theses/dissertations on occasion. ", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "550": {"Subreddit": "PhD", "Author": "arugulafanclub", "Date": 1501457765, "Score": 1, "Body": "I guess the clarification here is it looks like OP is looking for someone to do the work for him/her, but that's not going to happen. Well, maybe, but it would be unethical. If OP hires a good editor/coach, it can help everything go more smoothly, however, OP has to be willing to put the work in. Like the physics example,  in my other comment, if you hire a physics editor but make no effort to learn the material it's likely that your grade will not improve. You have to put the work in to see the results. A tutor can help you, but not learn material or do work for you. ", "Permalink": "https://www.reddit.com/by_id/t3_6looow.json"}, "551": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1501457860, "Score": 1, "Body": "Hmmm not sure if that's always the case?\n\nSome fields / depts let you make a thesis out of published papers, so it won't always correlate with tenure competitiveness. I know grad students who became profs right after grad school who worked on many different projects and others who did only their thesis work and achieved the same career placement.", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "552": {"Subreddit": "PhD", "Author": "arugulafanclub", "Date": 1501468339, "Score": 1, "Body": "Sounds like you need a friend to talk to who's interested and engaged in your work/field. Is there a nearby university? A reddit page? \n\nI'd also note that school can't be everything. Are you doing things outside of school to stay happy? Meeting a friend for a drink every once in a while, hiking, taking a weekend to yourself, meeting people, etc.? You may not have much time for yourself, but try to do something for yourself, you deserve it!", "Permalink": "https://www.reddit.com/by_id/t3_6nzj42.json"}, "553": {"Subreddit": "PhD", "Author": "valgrind_error", "Date": 1501484444, "Score": 1, "Body": "Don't be a penny wise and a pound foolish, you are shooting yourself in the foot if you go into the admissions process without competency in all of the necessary languages of your field. Whatever time you spend in an MA program getting essential basic training in conducting graduate research will be paid back with interest later on. You will get into a better program and you will be able to perform at a much higher level with MA training than without. \n\nMy advice is to find a reputable Master's program (preferably at a school without too many PhD students) with respected scholars in your field (respected != \"most famous\"). You need not worry about twiddling your thumbs \"just\" studying foreign languages. Your schedule will be full. If you have any free time, read books and journal articles. A Master's program, if used correctly, will speed you up, not slow you down.\n\nI had to make a similar choice as you when I was coming out of undergrad: either go directly into a PhD or first enter a three-year Master's program (funded, which makes a difference). At first, I thought an MA would be a waste of time as well (especially three years). But my thesis advisor told me to choose it over everything else and I can now say it worked out incredibly well. If you can find a two- or three- year MA program with funding and a proven track record of sending students to elite programs, I suggest doing that first.", "Permalink": "https://www.reddit.com/by_id/t3_6noptk.json"}, "554": {"Subreddit": "PhD", "Author": "Mohankumar12345", "Date": 1501493997, "Score": 1, "Body": "Thanks for sharing your experience.", "Permalink": "https://www.reddit.com/by_id/t3_6n1iqg.json"}, "555": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1501502805, "Score": 2, "Body": "I struggle with this still but, read and take notes all the time. Anything that will help you in your writing process later. And whenever you do take notes, make sure you keep even a small reference of it next to the note and have the paper saved on your cpu somewhere.", "Permalink": "https://www.reddit.com/by_id/t3_6qaoa2.json"}, "556": {"Subreddit": "PhD", "Author": "Harame9", "Date": 1501503141, "Score": 1, "Body": "I'm only read science articles on http://paperity.org/ It's very interesting and I like to learn new things", "Permalink": "https://www.reddit.com/by_id/t3_6qfv9u.json"}, "557": {"Subreddit": "PhD", "Author": "lazarescu", "Date": 1501518564, "Score": 6, "Body": "My experience is with the Kindle PaperWhite 3.\n\nI hate reading articles on computer screens. I would **love** it if journals would release their articles as .mobi or .epub files. However, it seems that PDF is here to stay and this causes problems for e-readers. Most e-readers will display PDF files, but typically this means that you're displaying it at 100%, so the text becomes rather tiny to read. \n\nThere is software, such as [k2pdfoft](http://www.willus.com/k2pdfopt/), that can convert journal PDF files into e-reader files. The idea is that it strips out all the header and footer data and can combine columns back into one piece of text. In my experience it's overly complicated and needs to be finely tuned for each paper. This makes it very time consuming and frustrating.\n\nSorry I'm not answering your question positively, I just figured that I'd let you know my experience so you could decide if you think it's worth the effort (hint: sadly, it's not).", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "558": {"Subreddit": "PhD", "Author": "Rhymes_W_Purple", "Date": 1501522209, "Score": 1, "Body": "Thanks for the reply and all the information!\n\nSince you haven't been liking your Kindle that much, how have you mostly been reading articles? Are you printing them out or reading them on your computer?", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "559": {"Subreddit": "PhD", "Author": "lazarescu", "Date": 1501525380, "Score": 4, "Body": "As much as it is bad form, I do print out articles I want to read in their entirety. It's a bit oldschool but I like to highlight and take notes in the margins. If I'm just scanning for references, I'll just stick to the computer screen - it helps to have two! ", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "560": {"Subreddit": "PhD", "Author": "Etal_2017", "Date": 1501527700, "Score": 2, "Body": "I tried using a Kindle Fire for this and encountered a lot of problems with formatting since software to convert PDF into whatever ebook format can't really hand the column layout of most articles in PDF format. \n\nWhat I did instead was copy and paste the webpage versions of articles into a word document and convert that instead. It works pretty well tbh, though it depends on the format of the journal (Science Direct articles seem to work the best) and probably requires some tweaking.\n\n If you're at the beginning of your studies I would recommend this approach because with the new Kindles you'll be easily able to look up terms you're not familiar with, you can place different papers into different folders and easily find highlighted passages. My biggest problem once I'd worked out the kinks was that I'm near the end of my PhD and I have stacks and stacks of dead-tree notes and papers, and digitising that lot is more effort than it's worth. \n\nFor my post doc I fully intend to do something like this to organise papers. \n\nEdit: Formatting ", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "561": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1501535610, "Score": 8, "Body": "Your situation is more common than you would believe.  Im in my 3rd year and my advisor is basically useless.  Im not in a lab based program, so its really not that big of a deal.  My recommendation would be to document all of your struggles in an email to your advisor- I wouldnt put any inflammatory language in the email, just state the facts regarding why you are struggling and what you recommend to remedy the situation.  If the response is not helpful, you now have everything documented and can take that information to the department chair, student services, etc.  Not sure  if that helps, but those are my thoughts.", "Permalink": "https://www.reddit.com/by_id/t3_6qqc7i.json"}, "562": {"Subreddit": "PhD", "Author": "Rhymes_W_Purple", "Date": 1501536557, "Score": 1, "Body": "Good advice, thanks! \nI'm starting my first semester in two weeks and have already noticed that all of my textbooks for the semester have digital versions, hence the e-reader. \nI thought that between e-books and online articles, an e-reader would be easier to lug around too.", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "563": {"Subreddit": "PhD", "Author": "Etal_2017", "Date": 1501537040, "Score": 2, "Body": "Definitely. As I say, it can be a pain formatting them, especially resizing figures but if you do it as you go it should be manageable and I think the benefits outweigh this drawback. I just wish I'd thought about it at the beginning of my PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "564": {"Subreddit": "PhD", "Author": "Rhymes_W_Purple", "Date": 1501537214, "Score": 2, "Body": "There are also some (pricier) e-readers that are between 9-13 inches that are supposedly easier to view original PDF files on.", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}, "565": {"Subreddit": "PhD", "Author": "Etal_2017", "Date": 1501537834, "Score": 2, "Body": "Could be. I like the Kindle/Convert approach for the dictionary feature (which afaik doesn't work with PDF) and if the dictionary doesn't know a term then a little box with the relevant Wikipedia article will come up. This is the real benefit over just putting PDFs onto a device. \n\nNot sure on your field but certain PubMed articles are also available in ebook formats which are easily converted too. \n\nThe big drawback of my approach is the work copying/pasting and then some manual formatting. Also with Kindle it is a bit of a pain to sort papers into specific folders (though that might be a drawback of having to do it for over 100 papers!). ", "Permalink": "https://www.reddit.com/by_id/t3_6qowut.json"}}