{"0": {"Subreddit": "PhD", "Author": "Every_username_used", "Date": 1504231643, "Score": 1, "Body": "Perhaps compiling stats from various universities?", "Permalink": "https://www.reddit.com/by_id/t3_6xbc47.json"}, "1": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1504231892, "Score": 9, "Body": "I want to be a professor and do research. Therefore PhD is kind of required. Trust me, if there was another way I would do it.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "2": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1504233825, "Score": 10, "Body": "The PhD represents that you somehow advanced the theory/knowledge of a subject (formally through a PhD thesis) and is somewhat of a prerequisite to get grant funds aimed at advancing knowledge/producing solutions - the PhD demonstrates that you are capable of doing so, by showing that you have done so in the past under formal circumstances.\n\nAt a personal level, the reasons people get a PhD vary (prestige, higher income, proving excellence), many being somewhat misguided (especially higher income, job prospects), but I'd say the 'purest' reason to get one is simply a drive to move forward our understanding of a topic - the motivation for this usually stems from personal curiousity (e.g., typical of theoretical physics, etc.) or a perceived societal need (e.g., more typical of engineering, medical science, etc.).\n\nEthics are extremely important to a PhD holder. However, PhD holders are human as well, and there are always a few 'bad eggs'. For instance, a researcher that cares so much about prestige that they are willing to falsify data - this only serves to help their career (so long as they don't get caught) and is counterproductive for the disciple/field as a whole (and goes against the most important point of advancing knowledge). But again, the ethical standards are usually much greater.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "3": {"Subreddit": "PhD", "Author": "MrsGrayGubler", "Date": 1504235196, "Score": 2, "Body": "You really want to keep it within the same dataset because you interfere with the validity because each university collects and stored data differently.", "Permalink": "https://www.reddit.com/by_id/t3_6xbc47.json"}, "4": {"Subreddit": "PhD", "Author": "JWOINK", "Date": 1504241557, "Score": 1, "Body": "What exactly do you consult on? I see this word thrown around so often that I'm confused what exactly the person does.", "Permalink": "https://www.reddit.com/by_id/t3_6wknfm.json"}, "5": {"Subreddit": "PhD", "Author": "UnitedLaborParty", "Date": 1504243476, "Score": -7, "Body": "Im asking less about individual ethical flaws and more overarching decisions and connections.   Im on mobile so this may not be 100% but Im curious if the PhD will survive being connected at the hip with Federal dollars and the University system.\n\nThe PhD seems almost completely reliant, ethically, on the phrase \"that's just the way it is.\"  You mentioned perceived societal needs, would that make the PhD beholden to the public?  Without the public, the actions of the PhD would be useless and the esteem, and prestige, attached to the title would be useless.\n\nLets say an institute like Harvard, who participates at the highest levels in the Justice system, and critiques the end result - disparity in justice/punishment between those with means and those without.  Can I, after witnessing their participating and apparent inability to act, trust their promotion of UBI or any welfare that helps those that may not have needed it had they been given a fair shake?\n\nIf a MD has more weight in their words, and is a part of the same process/title system that Okays a system from schooling to drinking age that promotes binging, lack of information, and addiction, aren't they required to say something other than \"that's just the way it is.\"\n\nIf the University is to advertise themselves as \"anti-racism\" while a PhD in statistics creates thousands of documents focusing on breakdown of crime by race rather than focus on the root cause, while telling their students \"statistics lie\", is that ethical behavior?  What if no-Nazis use those statistics to sell hate and the university uses that hate to sell themselves?\n\nIf the university system bills itself as \"anti-rape\"/pro-women, and profits from it, while an accredited university pays off a victim - and doesn't prosecute a minor league/college sports star, is that ethical?  Or only ethical when it is convenient?\n\nMy overall question, regarding the use of a title, is if the PhD title uses a group reward system - shared esteem/prestige - does that also include negatives and failures?  \n\nIs the overall ethics of the system that grants the PhD the responsibility of the PhD?  \n\nIf yes, can the PhD ask the public to subsidize the university system without taking the whole system into account when acting?  If the PhD is beholden to the public, is the whole public considered valuable?  Including the shitheads, failures, and destitute?\n\nIf no, is the title, and PhD/doctor individually, going to survive until the 22nd-23rd century while being attached to so many different systems (Government, student loans, college culture, minor league sports, MD association with insurance monopolies, and the like) without being bastardized, weakened, and prone to avoiding schools of thought, industries, or even publicly revealing evidence of failure in a system or industry that they are reliant on or attached to?  If the PhD is an old brand, of sorts, can they be attached to so many institutions reliant on money without destroying the original intent of the brand?\n\nIf that's insane, or something you don't care to or can't answer, can you point me in the direction of overall PhD ethic guidelines or papers regarding the large change to the PhD's system in the 20th century in regards to its application in the future or the PhD in the futures role?   Thanks", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "6": {"Subreddit": "PhD", "Author": "UnitedLaborParty", "Date": 1504243649, "Score": -1, "Body": "Fair enough, I have some questions about overall ethical guidelines and concerns regarding PhDs, I asked the other dude in this thread.  If you could take a look and shoot me a response, or where I could do more reading on the subject.  Or any reading.  Id appreciate it.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "7": {"Subreddit": "PhD", "Author": "Vdags2017", "Date": 1504245943, "Score": 1, "Body": "That's brilliant. Thank you ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "8": {"Subreddit": "PhD", "Author": "Vdags2017", "Date": 1504246180, "Score": 1, "Body": "Hi. The field would be law/medical ethics. I think finding an already devised program will be like a needle in a haystack so it's likely I will have to begin with my own idea. I would actually be applying for funding as well.", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "9": {"Subreddit": "PhD", "Author": "Vdags2017", "Date": 1504246290, "Score": 1, "Body": "Yes I suppose I could ask 1) whether they were willing to supervise my own project and 2) if they know of any upcoming projects in the field and then I'll know what my options are. Thank you ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "10": {"Subreddit": "PhD", "Author": "blue_cinos", "Date": 1504250664, "Score": 1, "Body": "I'm a normal guy and I'm doing a PhD because I find it interesting. \n\nI recognise that ethics are important in some fields of research, however as my research is solely in physical sciences it's not important to me.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "11": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1504253257, "Score": 1, "Body": "You missed the most important question of all - funding! Do they have any, are they expecting any etc. I'd strongly recommend not doing a PhD without 100% funding ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "12": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1504255890, "Score": 1, "Body": "Really depends on your discipline. \n\nI work in the private sector, largely consulting for Government clients.\n\nSome consulting projects include monitoring and evaluation of a specific social policy, research to inform/recommend policy development, research on a geographical area to advise whether they should approve a planned development (ie. a mine, highway etc) and so on.\n\nBasically, Government, as well as some private sector organisations, require specific advice and that's where consulting comes in. They engage consultants with specific expertise to provide expert advice (in my case, its applied social research and policy), and we get paid big dollarydoos to do so. It's all research, but in a more practical and applied manner. \n\nBut it depends on discipline. If your area of expertise is 17th century romantic literature, I don't think there'd be many consulting opportunities out there. ", "Permalink": "https://www.reddit.com/by_id/t3_6wknfm.json"}, "13": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1504260211, "Score": 2, "Body": "Do a search for your variables of interest on the ICPSR website, you will find lots of datasets. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_6xbc47.json"}, "14": {"Subreddit": "PhD", "Author": "Vdags2017", "Date": 1504261048, "Score": 1, "Body": "I am already aware of funding the uni offers and would have to create a separate application for that. Although I could always ask if they are aware of any others. Thank you ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "15": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1504262989, "Score": 1, "Body": "I think they are but you might extend your career a bit. One of my supervisors said it's normal to do one post doc in Germany and then move on to a junior professorship but if you drastically change field then you might do two post docs because the first one would be more about learning the new field. I'm not sure what it's like for industry.", "Permalink": "https://www.reddit.com/by_id/t3_6xcznq.json"}, "16": {"Subreddit": "PhD", "Author": "Hazafraz", "Date": 1504263606, "Score": 1, "Body": "Yes. And you should. Otherwise you could be stuck in a situation where your rotation PIs don't actually have money for you. ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "17": {"Subreddit": "PhD", "Author": "kalamano", "Date": 1504269583, "Score": 3, "Body": "I do a PhD in political economy in the uk. I look at institutional ways at the global level to make development aid/cooperation more effective on the ground. \n\nI get paid a fairly decent amount, get to decide on the shape of my project and I also get to travel the world on fieldwork/conferences. I don't have a boss, I take complete ownership for my project, and I get to work from home. I also get to teach a module on the side and do other stuff conducive to my CV and career plans.\n \nI love it, and I wouldn't be happy doing anything else. Getting a doctorate at the end of it is also a great plus.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "18": {"Subreddit": "PhD", "Author": "csteacher", "Date": 1504273465, "Score": 1, "Body": "A Ph.D. is nothing more than a certification.  It certifies that you can complete research and also that you are somewhat of an expert in a given field.  What you do for a Ph.D. will typically define the closely-related field that you end up doing more research in simply because you've spend a lot of time working on it and have knowledge about it.  However, what you end up doing depends on what you want to do and what is expected of you in academia or in industry.", "Permalink": "https://www.reddit.com/by_id/t3_6xcznq.json"}, "19": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1504273602, "Score": 11, "Body": "There isn't a handbook for PhD ethics in the way you're describing. To be honest, your post above has nothing/little to do with the ethics of PhD holders. It seems like you are upset about the some recent news stories vaguely related to some of the country's universities and are for some reason are improperly associating it with PhD holders.\n\nHow you've associated it to minor league sports, insurance monopolies, anti-rape, anti-racism in one broad stroke that applies to the whole system of PhD awarding is beyond me and comes off as rambling. Professors aren't really involved with the type of controversial things you'e talking about here. To give an example, imagine a post where someone questions the ethics of the United States government because of their frequent involvement in warfare, and then goes on to use the relationship between the government and its citizens to question the ethical foundation of a group of its citizens. Does that make sense to do in terms of evaluating the merits, usefulness, or ethics of that group specifically?\n\nI think my original post adequately describes, in a simple form, what a PhD holder is, why people get a PhD, and what their ethical standards are compared to the average person. And actually, the PhD brand is gaining strength.\n\n&gt;The PhD seems almost completely reliant, ethically, on the phrase \"that's just the way it is.\"\n\nWhere does this idea comes from? PhD holders generally hold the opposite viewpoint - they do not settle on things being the way they are.\n\n&gt;Without the public, the actions of the PhD would be useless and the esteem, and prestige, attached to the title would be useless.\n\nWithout the public, is anything worth anything? If you start a business to make money, is it worth anything if no public outside of the business exists? For a PhD holder that works tirelessly to conduct research aimed at cleaning up toxic waste near urban areas, does his/her research matter if there is no public? No. Does your statement hold any relevance to anything worth discussing? No.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "20": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1504304597, "Score": 2, "Body": " I do it the other way around lol.", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "21": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1504306301, "Score": 3, "Body": "I am tempted to keep it in times new roman until the last month, then turn it into comic sans and submit like that, wonder what would happen..", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "22": {"Subreddit": "PhD", "Author": "Kagemand", "Date": 1504306989, "Score": 8, "Body": "And then you change the document to Latex... poof, mind blown!", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "23": {"Subreddit": "PhD", "Author": "Soggy_Biscuit_", "Date": 1504309624, "Score": 5, "Body": "I change mine to comic sans to freshen things up or when I need a pick me up.", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "24": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1504318575, "Score": 5, "Body": "I think Calibri looks smarter. I guess it's a matter of taste. (Though according to experts it's because I prefer to read on screen rather than print.)", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "25": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1504319512, "Score": 4, "Body": "I am not, but probably most people who do a PhD are also rather normal. At least in fields where many people do a PhD and where a PhD is required or helpful also outside academia, such as most of chemistry and big parts of biology. I am doing it mainly because I like the living and working conditions I have during it (and hate the alternative), but that's probably a quite rare motivation/ situation.\n\nFor every PhD student and academic researcher it is important to adhere to academic honesty and integrity (maybe you will enjoy [the movie/game](https://ori.hhs.gov/thelab)) - properly cite sources and acknowledge collaborators, and not plagiarize or falsify... if nothing else then at least because getting caught in such dishonesty will result in getting expelled with no PhD, no good recommendation letters, and no academic future.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "26": {"Subreddit": "PhD", "Author": "gr33nblu3", "Date": 1504321812, "Score": 8, "Body": "Team Arial here. ", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "27": {"Subreddit": "PhD", "Author": "KatieLady80", "Date": 1504323005, "Score": 3, "Body": "We have a prof in our department who hates Times New Roman and includes anti-TNR propaganda on the assignment sheets for his undergrads. ", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "28": {"Subreddit": "PhD", "Author": "eofn", "Date": 1504332902, "Score": 3, "Body": "Super helpful question and replies. I'm glad I'm not the only one thinking/wondering these things. :)", "Permalink": "https://www.reddit.com/by_id/t3_6x58si.json"}, "29": {"Subreddit": "PhD", "Author": "HeckerIT", "Date": 1504333155, "Score": 6, "Body": "My procrastination cycle is 80% toying with fonts! My personal favourite is definitely Garamond (12 pts, 1.5 spacing)", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "30": {"Subreddit": "PhD", "Author": "Gradstudentcons", "Date": 1504344727, "Score": 1, "Body": "Exactly! I'm a conservation social scientist.", "Permalink": "https://www.reddit.com/by_id/t3_6vcm33.json"}, "31": {"Subreddit": "PhD", "Author": "abighazard", "Date": 1504344835, "Score": 1, "Body": "Awesome. I am researching an urban animal which requires some degree of social science (as obviously there is a large habitat overlap with humans). An amazing resource, but humans can be frustrating haha!! ", "Permalink": "https://www.reddit.com/by_id/t3_6vcm33.json"}, "32": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1504351288, "Score": 3, "Body": "Go on, try Garamond. It'll blow your mind.", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "33": {"Subreddit": "PhD", "Author": "Lamojasto", "Date": 1504386115, "Score": 1, "Body": "What is local for you? ", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "34": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1504386323, "Score": 1, "Body": "Delaware", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "35": {"Subreddit": "PhD", "Author": "CrunchyHobGoglin", "Date": 1504408943, "Score": 1, "Body": "Yes please. I am doing my Ph.D in Peace and Conflict Studies in India and I emailed the 3 professors whom I was interested in working under. They all replied back and it was immense help in figuring things out. ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "36": {"Subreddit": "PhD", "Author": "CrunchyHobGoglin", "Date": 1504409117, "Score": 1, "Body": "Conflict does affect children’s education... ", "Permalink": "https://www.reddit.com/by_id/t3_6vcm33.json"}, "37": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1504420020, "Score": 1, "Body": "Depends on specific skills such as expertise in techniques/ instruments, e.g. there is some overlap between some work on semiconductors and some formulations research (or at least I was told so by a R&amp;D head and a HR person in a pharmaceutical company in Europe, e.g. they would value my experience in scanning electron microscopy and GC-MS even though it's on totally different types of chemicals). Analytical chemistry tends to use lots of such methods and be more transferable and in demand than any other chemistry.\n\nEDIT: And, of course, if the situation is temporary (1-3 years) a postdoc or adjunct position at the same or nearby university is likely to also be an option.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "38": {"Subreddit": "PhD", "Author": "Loving_Linux", "Date": 1504425559, "Score": 3, "Body": "I think it's good to mention them as a semi-cpd activity, just keeping your hand in etc. don't make them out to be anything more than helpful in facilitating your own study and you'll be fine.", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "39": {"Subreddit": "PhD", "Author": "jwaves11", "Date": 1504433732, "Score": 1, "Body": "To piggy-back on this, I'm in geochemistry and everything I do falls under analytical. It's a very diverse field.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "40": {"Subreddit": "PhD", "Author": "Mohankumar12345", "Date": 1504445382, "Score": 1, "Body": "Yeah. makes sense.", "Permalink": "https://www.reddit.com/by_id/t3_6vq0nz.json"}, "41": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1504449492, "Score": 5, "Body": "I agree. I've seen resumes from established PhDs where online courses were mentioned. As long as they're mentioned as what they are, I don't see why it would be pathetic: it shows you can find relevant information by yourself. If you get an interview, /u/Scare0123, and they bring it up, be completely open about it. Not sure where you apply to do a PhD, but in my experience a PhD is mainly being proactive enough to find info alone and act on it, so online classes are something I would find interesting in a candidate.", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "42": {"Subreddit": "PhD", "Author": "OptimalGoat", "Date": 1504453138, "Score": 1, "Body": "I still have questions about my field.\n\nI mean, there are other things too, like the fact that I'm realizing that the best way forwards for me doing the work I want is probably being a professor to do research, so.. well, PhD. Other reasons too, but mainly it's that I still have questions. I still have stuff to explore and study and research, so I might as well keep studying and exploring and researching.\n\nAs for ethics... I mean they're important for me both in the sense that they're generally important, and from my background as an artist(My BFA is in Music, MFA in Contemporary Arts) spending a lot of time thinking about culture and societal issues. In terms of my specific research now... I'm not really dealing with people or ethical issues, so in terms of the specifics of research ethics, it doesn't really affect me.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "43": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1504455666, "Score": 1, "Body": "You are a student currently?  Or do you work in geochemistry?  If the latter, have you gotten a job in a parallel field with a different specialization?", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "44": {"Subreddit": "PhD", "Author": "Scare0123", "Date": 1504456491, "Score": 2, "Body": "Honestly I'm a bit surprised. But in a good way. I thought I would be despised for such a thing. ", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "45": {"Subreddit": "PhD", "Author": "Loving_Linux", "Date": 1504458677, "Score": 2, "Body": "Why would you be criticised for learning more when you're doing a PhD? The only thing you could be criticised for is making it out as a big deal :)", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "46": {"Subreddit": "PhD", "Author": "adi279", "Date": 1504460241, "Score": 3, "Body": "A PhD gives you the freedom to pursue what you think is important rather than working under someone. I pursue my PhD with that idea that the research I am conducting is mine and I strive to do my best so as to be the best in my field of study. A PhD gives you discipline to stay focused. Think about what a PhD meant 300 years ago. Great scholars spending their time in the university trying to gain knowledge. It's only today that this definition seems to have morphed into a degree that gives you better job opportunities. But I still stick with the classical thought that a PhD is a pursuit of knowledge more than anything else. Good luck with your PhD !", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "47": {"Subreddit": "PhD", "Author": "adi279", "Date": 1504473250, "Score": 2, "Body": "I agree that it does help to portray your online courses. I would recommend that you also do a small project/ experiment ( since you are in computational biochem, and you have access to a computer) and put that on your resume. I would suggest something not too complicated but still shows your spirit into research. Professors dig individual leadership and taking up a small project on your own( it could be replicating existing work in current literature) exemplifies your spirit for research and such a candidate would be hard to denounce for a potential candidacy . \n\nGood luck with your application!\n\nCheers", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "48": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1504476498, "Score": 1, "Body": "I know you said you are hoping to stay in Delaware, but to be honest, that will really constrain her prospects - Unless she's lucky, she'll probably fall into something that underutilizes her skills. If you are looking to compromise somewhat, Research Triangle Park in northern North Carolina might be worth looking into.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "49": {"Subreddit": "PhD", "Author": "jwaves11", "Date": 1504481097, "Score": 1, "Body": "PhD student, but others in my cohort came from an engineering background with limited chem knowledge. So I'd imagine that someone with a background in analytical chemistry wouldn't have a hard time.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "50": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1504491314, "Score": 1, "Body": "To find my supervisor, I wrote emails that were basically: \"Hi, I'm &lt;name&gt; and I saw your research on &lt;topic&gt; at &lt;source&gt;.  I'm a prospective PhD student interested in this field, and I was wondering if you would have time to meet/Skype &lt;suggest a specific week, 'sometime' is too broad&gt;\"", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "51": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1504491999, "Score": 1, "Body": "Okay great.  Thanks very much for the responses!", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "52": {"Subreddit": "PhD", "Author": "Vdags2017", "Date": 1504505458, "Score": 1, "Body": "Thank so much. That's great ", "Permalink": "https://www.reddit.com/by_id/t3_6x99cl.json"}, "53": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1504506838, "Score": 1, "Body": "Thanks for your comment! It really helped :D", "Permalink": "https://www.reddit.com/by_id/t3_6x58si.json"}, "54": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1504515022, "Score": 1, "Body": "Are you willing to work hard? Can you stand feeling like you're not smart enough but persevering? These are *far* mare important than intelligence for doing a PhD. If you can get to the stage where you're capable of starting a PhD, you've demonstrated that you're smart enough.", "Permalink": "https://www.reddit.com/by_id/t3_6x58si.json"}, "55": {"Subreddit": "PhD", "Author": "bellasalsa", "Date": 1504538215, "Score": 1, "Body": "I'd really like to read this and what your findings and conclusions are. \n\nI was thinking of doing something similar but more just on their identities online and how they form actual relationships and parasocial relationships with others. ", "Permalink": "https://www.reddit.com/by_id/t3_6vcm33.json"}, "56": {"Subreddit": "PhD", "Author": "frogicle", "Date": 1504542144, "Score": 1, "Body": "Some people feel really bad after they have been through a life-threatning event. Of those people, some feel bad in one way and others in other ways. Does the way in which you feel bad predict how you feel after a couple of years? ", "Permalink": "https://www.reddit.com/by_id/t3_6vcm33.json"}, "57": {"Subreddit": "WitchPhD", "Author": "imguralbumbot", "Date": 1504545077, "Score": 1, "Body": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\nhttps://i.imgur.com/JrV4Bza.jpg\n\n^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=ignoreme&amp;message=ignoreme) ^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=delet%20this&amp;message=delet%20this%20dmjzz0o) ", "Permalink": "https://www.reddit.com/by_id/t3_6y1n8d.json"}, "58": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1504546821, "Score": 1, "Body": "Photographer: /u/johns_van69 ", "Permalink": "https://www.reddit.com/by_id/t3_6y1n8d.json"}, "59": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1504548126, "Score": 4, "Body": "Calibri for the week. Tahoma for weekends. ", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "60": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1504553163, "Score": 3, "Body": "Non-academic for that field may be tough.  Aside from consulting for lobbying firms in the DC area I can't really think of much.\n\nWhat kind of skills did your PhD teach you?", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "61": {"Subreddit": "WitchPhD", "Author": "HaryM84", "Date": 1504556406, "Score": 2, "Body": "Waiting 16 days for the next Picture was it worth every second! \nKeep going on!", "Permalink": "https://www.reddit.com/by_id/t3_6y1n8d.json"}, "62": {"Subreddit": "WitchPhD", "Author": "crishkur1976", "Date": 1504562658, "Score": 1, "Body": "i love you", "Permalink": "https://www.reddit.com/by_id/t3_6dge83.json"}, "63": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1504565418, "Score": 1, "Body": "Def consulting - outside of D.C., depending on your area, you could work for global policy firms as well. Or the world bank, undp, etc. ", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "64": {"Subreddit": "PhD", "Author": "sagarbhatt0904", "Date": 1504571274, "Score": 1, "Body": "PhD is always evolving. You don't finalize your final dissertation on day 1. You basically work on several projects and then a final research materializes over some time. In very few cases you will be hired for a specific project.\n\nInitially you should email a potential advisor giving your background, mentioning their research that really appeals to you and why you think you would be a useful addition to their research group. Get an interview scheduled, face to face or over Skype and have a frank discussion on what the expectations are for both you and the professor. Try to understand the research they are doing. After taking a few of such meetings, it should become more clear what really excites you and which group you really want to join. If the professor is as impressed by you as you are by their research, they would be happy to entertain your application. \n\nYou can always email current grad students in the groups you like and talk to them first if you're apprehensive of contacting the professor directly.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_6x9kbo.json"}, "65": {"Subreddit": "PhD", "Author": "infinitequestions4", "Date": 1504576031, "Score": 1, "Body": "I will check this out!\n\nAlso, thanks for the reassurance! I always feel out of place so it's nice to know maybe I'm not the only one in that room who feels so.", "Permalink": "https://www.reddit.com/by_id/t3_6w6ki4.json"}, "66": {"Subreddit": "PhD", "Author": "infinitequestions4", "Date": 1504576063, "Score": 1, "Body": "I will try this!", "Permalink": "https://www.reddit.com/by_id/t3_6w6ki4.json"}, "67": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1504578041, "Score": 1, "Body": "How easy would you say these jobs are to come by?", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "68": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1504578168, "Score": 1, "Body": "A lot of advanced statistical methods, industry data analysis tools (R, Python, STATA), of course research skills, digesting complex information and breaking it down for an audience unfamiliar with subject matter (teaching upper level undergrad classes), public speaking skills, etc.", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "69": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1504578740, "Score": 5, "Body": "I have an Ipad 2 with PDF reader- you can get a used one for under $100", "Permalink": "https://www.reddit.com/by_id/t3_6y4udv.json"}, "70": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1504587756, "Score": 1, "Body": "Not super easy, but they're out there. It gets much easier if you know people. I would try to reach out to professors you know who have worked in consulting / the private sector and ask for some career mentorship, start to cultivate a network, etc. That would be a good starting point. Poly sci is not my field, but I do know some people in other overlapping areas of consulting/private sector work, and having a good network is a huge advantage to getting in the door. ", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "71": {"Subreddit": "PhD", "Author": "Cibex", "Date": 1504592013, "Score": 2, "Body": "I dropped out in January after 9 months in. I was researching animal movement and mechanistic energetics of movement in montane environments.\n\nIt was freeing to leave as it wasn't the right project for me and I realise that I was pursuing just to pursue a phd. That being said easily one of the toughest decisions I've made and there are times where I honestly miss it and feel like I've somehow failed. I don't miss the 70+ hour weeks or the crippling anxiety though.\n\nWithin a month of leaving I'd walked in to a 6 month seasonal job at a nature reserve and I've secured another position working with an SNCO so it's not been bad. \n\nWhat I would say though is if you're thinking of quitting is to have an honest chat with your supervisor or if you can't with them then a member of the academic staff you trust.  ", "Permalink": "https://www.reddit.com/by_id/t3_6vctfu.json"}, "72": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1504597146, "Score": 2, "Body": "It won't be affected. ", "Permalink": "https://www.reddit.com/by_id/t3_6y6elm.json"}, "73": {"Subreddit": "PhD", "Author": "GuillaumeDuCoin", "Date": 1504616183, "Score": 2, "Body": "wanted to say this.... :-)", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "74": {"Subreddit": "PhD", "Author": "smartaxe21", "Date": 1504617275, "Score": 15, "Body": "my field is biochemistry,  I am not exactly sure how papers are written in your field. One thing i learnt very quickly was that a normal person cannot remember everything so it is very important to budget and prioritise what you need and how much of it you need.\n\n Here's what I do: When I find a relevant paper, I put it in one of the three bins \n\n1. Something that I need to read very critically (for this I set 3 days per paper) \n\n2. Something that I need to read for information (I set 1 day per paper) - these are papers that someone suggests and tells me that the data are good and there are good things to learn from the paper (like a technique or an elegant experiment) \n\n3. Something I need to skim over to stay in touch (i set 3-4 papers per day) these are papers that are very close to what I am working on and because of practice and hands on experience with the techniques I can read them very quickly. \n\nI keep 3 separate notes for each of these things so when i have to refer back to those paper, i know immediately how indepth i read into the paper. \n\nFor reading, I set 1 hr a day as soon as I wake up before going to work and for critical readings ..I might have another reading session in the evening. I do not read anything on sundays, i have sunday mornings to kind of reminisce on what i read through the week or check through some of the things that are more interest in the paper. This process is kinda slow but it is plenty enough for my field.\n\nHow I make notes: \n\nusually the articles that I read are a set of experiments answering certain hypothesis. \n\nI divide papers (many articles are already divided into bite sized pieces- 1 piece per experiment)in 5-6 parts based on no. of sub hypotheses. \n\nthe notes goes..\n\n1. The hypothesis --- the experiment-----my interpretation of the experiment vs the paper's interpretation of experiment--extra comments or something odd that I found. \n\n2. Many people in the lab end up reading or going through the same papers so I'll add any useful sentences after talking to other people. \n\nI try to avoid writing very trivial things or things that are obvious. \n\nFinally how I make use of this information:\n\nFor my field of work, this information is useful while presenting in journal clubs or when my boss has to write reviews and asks one of us to help her with a section, writing proposals or eventually when I write the thesis. \nSince my notes is organized by the sub topics and by how indepth in read the papers..i can find the papers that I read very quickly. sometimes it takes some digging through but thats part of the process. While writing i try to emulate famous review articles or news and views articles to get ideas about how to organize and bring together the information at hand. it is kind of different for each topic in my case so its a learning process everytime i need to write. A very good thing to do is practice writing news and views style articles just for oneself but i barely ever do it because of time constraints. \n\nHope this helps. ", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "75": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1504619806, "Score": 3, "Body": "When I had my comps, I would write down two sets of notes for papers. One set would be 1) what were they looking/testing for?, 2) how did they do it? (Method), and 3) what did they find? Then I would organize the papers with how they related to each other and make notes about how they went together. For instance, I had a lot of papers about computational models of memory so I would make notes about how one was about cued recall using vector representations while the other was about free recall using matrix representations and the pros and cons of each. It's a lot of work but helps create a schema of the literature in your head as well as help you preemptively retrieve the information in that context (I.e. Retrieval practice) which makes it easier to retrieve later.", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "76": {"Subreddit": "PhD", "Author": "wizardyourlifeforce", "Date": 1504620760, "Score": 3, "Body": " hope you're using research management software like Mendeley; makes the whole process much, much easier.\n\nOne option for finding connections is to use a qualitative analysis package like nVivo, not just for the data you collect but also for the actual literature you review as well. Put the PDFs in as sources, and code as you read (or immediately after), then you can run queries later on and see where articles talk about common issues.", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "77": {"Subreddit": "WitchPhD", "Author": "czechwan", "Date": 1504624520, "Score": 2, "Body": "You are an absolute vision. ", "Permalink": "https://www.reddit.com/by_id/t3_6y1n8d.json"}, "78": {"Subreddit": "PhD", "Author": "-omniphobia-", "Date": 1504636627, "Score": 1, "Body": "You'll be fine, I'm also in your position.\n", "Permalink": "https://www.reddit.com/by_id/t3_6y6elm.json"}, "79": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1504641044, "Score": 1, "Body": "Your funding is guaranteed for the length of the course. Whether you'll need to apply for a visa for the last year or not is anyone's guess (£100 say you'll be fine)", "Permalink": "https://www.reddit.com/by_id/t3_6y6elm.json"}, "80": {"Subreddit": "PhD", "Author": "specific_account_", "Date": 1504655968, "Score": 1, "Body": "Do mock interviews to prepare. ", "Permalink": "https://www.reddit.com/by_id/t3_6wvyxp.json"}, "81": {"Subreddit": "PhD", "Author": "Maxkraeft", "Date": 1504660719, "Score": 3, "Body": "Absolutely this! Personally, I like to use Excel, but there more specialised tools out there like Citavi. \n\nAssign categories, relevance, keywords etc. Everything that helps you to categorize and sort your papers and even more important... Find specific papers again. \n\nAlso, I like to assign numbers too papers. That helps me to keep track of them and find them more easily. This way, organizing several hundred papers is quite easy.", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "82": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1504660897, "Score": 3, "Body": "So if I'm reading correctly, are your notes hand-written?", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "83": {"Subreddit": "PhD", "Author": "Huwbacca", "Date": 1504689844, "Score": 6, "Body": "It varies field to field, journal to journal and even by departments.", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "84": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1504695025, "Score": 4, "Body": "Whatever style the LaTeX template I'm writing in uses... I've not thought about doing actual referencing in years! ", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "85": {"Subreddit": "PhD", "Author": "smartaxe21", "Date": 1504696609, "Score": 3, "Body": "yes mostly, because I tend to read on a tablet. But I scan whatever is handwritten to have an ecopy and also be right next to comment tags that I sometimes make on the pdf when I am reading on a computer.", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "86": {"Subreddit": "PhD", "Author": "IcySoup", "Date": 1504704462, "Score": 3, "Body": "Journals in my field primarily use APA, therefore I use APA. One stubborn journal refuses to abandon Chicago, so occasionally i'll switch to that but mainly my style will be whatever the journals demand. ", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "87": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1504716455, "Score": 1, "Body": "It really does. For political science in the US, we use the APSA's own format, for which there are BibTeX templates.", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "88": {"Subreddit": "PhD", "Author": "Screamshock", "Date": 1504720288, "Score": 3, "Body": "As much as it is unrealistuc of me to say, I dosagree with the point of looking for projects solely for purposes of employability. I chose my PhD topic based on interest and passion for the topic. \n\nAs such I might not be much help, but I work in an anatomy department which has a strong comparative and evolutionary neurobiology lab in it. It is located at the University of the Witwatersrand, Johannesburg, South Africa. I am not sure how your interests may be aligned to projects of that nature but it is an option to consider. If you are interested you can look up the Prof heading that lab, his name is Paul Manger, he has multiple concurrent projects on offer and if you look at his publication record it might tickle your interest. A lot of what he does involves various vertebrate and some of his papers have made national (and maybe more) news. I am not sure in the complexities in terms of statistical depth or script writing the projects might require but I know his most successful post-doctoral fellow and one of his PhD students I know are getting into learning R simply to be able to do some of the more complex analyses they conduct.  Particularly in sleep  or electrophysiological studies. One of Prof Manger's most recent papers was on the only 2 hours of sleep the elephant requires, and he has done a lot of work on dolphin neurobiology. But I am far from clued up on his work as I work in a different field of anatomy. Maybe check Prof Manger's recent publications out and see what you think. Either way all the best!", "Permalink": "https://www.reddit.com/by_id/t3_6yfusl.json"}, "89": {"Subreddit": "PhD", "Author": "HenryGWells", "Date": 1504730464, "Score": 1, "Body": "Yeah, even more stress and workload.", "Permalink": "https://www.reddit.com/by_id/t3_61p197.json"}, "90": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1504746741, "Score": 5, "Body": "I know nothing about physics or what ICT even is. I'm quite new in my PhD so keep that in mind.\n\nCan you not accept the ICT job and if it doesn't work out, find a PhD project that you ARE passionate about? I'm part time and I find it very hard to work only part-time hours. I can't even imagine the struggle if I wasn't completely passionate about my field of research (health science). I have a list pinned up at my desk of things that I want to chip away at when I have a spare hour or two, nothing that's going to help me get my PhD but because I just love the whole field.\n\nEven so. I think I've seriously considered quitting three times now. It is so hard, demoralising, frustrating, exhausting. I think the following are problems for you: You are tired of physics. You \"kind of\" like materials science. You're possibly burned out from college. You feel peer pressure to do a PhD.\n\nIf I was you, I'd take the gamble because it really doesn't seem like you're risking that much. If the job doesn't work out or you find a PhD project that you're truly passionate about, that option is still open to you. Because truly, you don't sound like you have any passion for this particular PhD project and that seems like a disaster. Like marrying someone you hate.", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "91": {"Subreddit": "PhD", "Author": "JZ2018", "Date": 1504765480, "Score": 0, "Body": "Dude, you should get married with your GF. Because she is going to meet a bunch of thirsty wolves. (unless she is the tiger,lol) ", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "92": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1504767315, "Score": 3, "Body": "Not your field, so take advice with a large grain of salt.\n\nFirst congratulations on not spending 5 years with a sociopath.\n\nI imagine staying in the program the entirety of a PhD might not be tenable, if he's powerful in the department.\n\nIf you can stick it out for the mattress go for it. If not leave. You can get into other PhD programs too, though that's difficult, as it would (somewhat) require you to acknowledge the situation, or at least why you're leaving.", "Permalink": "https://www.reddit.com/by_id/t3_6yiwux.json"}, "93": {"Subreddit": "PhD", "Author": "Reppicurr", "Date": 1504770760, "Score": 1, "Body": "ICT - information and communications technology\n\nGood points. Although for physicists it is kind of expected to get a PhD, without it, we are not real physicists. Also none of my colleagues seems super hyped about their PhD, but they will pursue it because it is a natural extension of our education as physicists.\nI don't think I'll ever find one thing that I am very passionate about. I am very generalist type of person, I'm too much jack-of-all-trades but master of none.", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "94": {"Subreddit": "PhD", "Author": "mylilliputianlife", "Date": 1504775830, "Score": 2, "Body": "I'm using EndNote right now which I find useful to store papers, and it makes referencing so much easier (especially with the Word plug-in). I read about NVivo being used for literature but wasn't quite sure how. Since you reminded me, I downloaded it and watched a couple of tutorials on how to use it. It's so simple to code, I think I'll really be able to pull out subtle similarities and differences across the literature. So thank you for reminding me of this tool!\n\nGreat idea to number the papers - I will do this. I'm seeing an Excel spreadsheet forming with the number and the reference.", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "95": {"Subreddit": "PhD", "Author": "mylilliputianlife", "Date": 1504776159, "Score": 2, "Body": "Those are some stellar tips, thank you so much for sharing all of that! There's plenty there for me to implement. I really struggle to pull my ideas together in writing so I particularly like the idea of doing a bit of more informal writing. I figure that whatever I do, I just need to be consistent and persistent with it. All the best with your research!", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "96": {"Subreddit": "PhD", "Author": "mylilliputianlife", "Date": 1504776245, "Score": 2, "Body": "That's pure anarchy!", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "97": {"Subreddit": "PhD", "Author": "Soggy_Biscuit_", "Date": 1504779370, "Score": 2, "Body": "If you're feeling ~~a little~~extra saucy and your eyes can take it you can also change it to a fluoro pink or green :^))))", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "98": {"Subreddit": "PhD", "Author": "infinitedigital", "Date": 1504785615, "Score": 1, "Body": "End to End PhD Assistance and Thesis Writing-Innovation System Plus ", "Permalink": "https://www.reddit.com/by_id/t3_6ymqmh.json"}, "99": {"Subreddit": "PhD", "Author": "Biscuit_Admirer", "Date": 1504786590, "Score": 3, "Body": "100% don't continue in my opinion. Consider doing the Masters, not in your field so I don't know how helpful to your career it would be, otherwise get out of the uni bubble and join the real world. I don't know the full extent of your relationship problems with X, but swap out a few words and it's the same thing that happened to me and everyone I know. I promise you, the experience/relationship with your advisor only ever goes downhill, so don't count on things being different with someone else. Last reason why I think this isn't for you is that you don't really want it. When everything is crashing down around you and have to deal with people like X on a daily basis the only thing that will get you through is the love of the work. On a side note, I didn't have your experience of getting to dip a toe before committing, but if I had I don't think i would have chosen the PhD option for myself because as much as I enjoy the work the career of an academic (and becoming people like X) just isn't for me", "Permalink": "https://www.reddit.com/by_id/t3_6yiwux.json"}, "100": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1504789743, "Score": 1, "Body": "Haha that's not bad advice thank you.  I imagine there aren't a lot of women in her field ", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "101": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1504795182, "Score": 1, "Body": "They seemed like a narcissist. Give yourself time to explore all possibilities. You might find a topic you like and an external advisor. ", "Permalink": "https://www.reddit.com/by_id/t3_6yiwux.json"}, "102": {"Subreddit": "PhD", "Author": "samclifford", "Date": 1504823453, "Score": 6, "Body": "Don't do a PhD in a field you're not interested in, it'd be like marrying someone you had a summer fling with but don't love. It's okay to not do a PhD, it's okay to wait a few years before starting one if it's what you want to do. ", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "103": {"Subreddit": "PhD", "Author": "samclifford", "Date": 1504824741, "Score": 1, "Body": "For all you font nerds looking for an alternative to Times New Roman, Ariah, etc. http://practicaltypography.com/font-recommendations.html\n\nA friend showed it to me while I was looking for an alternative to Courier New for coding. ", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "104": {"Subreddit": "PhD", "Author": "KP3889", "Date": 1504835913, "Score": 5, "Body": "I am taking ChemE's Advanced Transport and damned if it is not the hardest class I've ever taken. \n\nI straight up spent 30 hrs on six homework problems this last week. ", "Permalink": "https://www.reddit.com/by_id/t3_6yqx2k.json"}, "105": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1504873987, "Score": 5, "Body": "Since no one has responded, I'll pipe up to say that I don't mind the lack of categories/flair. It's not an overwhelmingly busy sub and people make it clear from the titles what the content is. If it's something I'm not interested in doing (like a survey) then I just don't open it. \n\nHowever, I do like the idea of individual users creating flairs, maybe to say how far along they are or their field of research etc.", "Permalink": "https://www.reddit.com/by_id/t3_6ynvo7.json"}, "106": {"Subreddit": "PhD", "Author": "andyy23", "Date": 1504879956, "Score": 1, "Body": "I am in the same position. The truth is nobody has any idea what will happen in 2 years but likely we'll be able to finish our programmes and get the full funding, grants get allocated years in advance anyway.", "Permalink": "https://www.reddit.com/by_id/t3_6y6elm.json"}, "107": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1504893563, "Score": 5, "Body": "Full time employee and PhD student here. Now that my seminars are done, it's more manageable. Thesis writing mainly and some articles on the side. Otherwise before, was doing 40 hours for work and about 30 on my PhD. \n\nBut I'm in my 40s, kids are gone from home and my work and thesis  research are related. \n\nMuch respect for students with small kids and part time job. They are amazing. ", "Permalink": "https://www.reddit.com/by_id/t3_6yqx2k.json"}, "108": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1504971025, "Score": 4, "Body": "A similar thing happened to me this summer.  I, as well a bunch of other graduate students, were offered a contract upon acceptance saying we get some *minimal* amount of funding support per quarter.  It is an actual legal contract with actual dollar values attached to it, and it is guaranteed for five years.  Basically a five year fellowship.  This funding included summer. \n\nThis summer the department decided that it wasn't going to pay some students, the reason being that \"there weren't enough TA positions\".  It turned out that there were TA contracts offered to students and illegally withdrawn post-offer and given to other students.  There were graduate students who were given priority over others even though the contract says you are only guaranteed funding for the first five years, and there were 6-8 year grad students getting full support for the summer. Some like me who were still within their contract got literally nothing.  It turns out the professor in charge (why a professor would be in charge still escapes me) of deciding who gets a TA position made sure certain students got TAships and for anybody else that was out of luck just said \" there's nothing I can do.\" I  went to the department and they said \"there's nothing we can do.\"  I even contacted my school's graduate student union and got no response which I take as \"there's nothing we can do.\"  I'm about to go to the Graduate Division office, show them my contract, and half expecting them to do some kind of bureaucratic calculus to end up telling me \"there's nothing we can do.\"  This wasn't a payroll error, it was a clear breach of contract, with legal ramifications.  \n\nThe thing is, we are poor graduate students, we can't afford legal advice, let alone to take our department and school to court, and if we did, they would probably terminate our contracts and boot us from the program.   What they did was probably illegal, but fighting it would likely put me in more financial ruin or not amount to anything.\n\nYou'll probably get an answer like the one I did: you effectively volunteered your time and there is nothing the department can do.  Go to your graduate student union ( if you belong to one), and see if they can do anything.  I guess having your time and funding abused is just part of being a graduate student.  ", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "109": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1504971543, "Score": 3, "Body": "Do a white strike. Walk out after the 'legal' number of hours is up. And make a point of announcing it. ", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "110": {"Subreddit": "PhD", "Author": "davidc9320", "Date": 1504971612, "Score": 1, "Body": "Personally speaking I'm still finishing my master's but, as soon as I do, I'm 99% sure I'm going to apply for a PhD. This is just to advise to take my words as those of somebody who has not gotten a PhD yet nor any kind of full time job.\n\nIn a sense I am almost in your situation, the main difference I see is that you don't seem passionate about the PhD that has been offered to you. In my case I hope to pursue a PhD in machine learning (I'm know that's vague but it would require another post), which I'm really passionate about and I really can't wait to finish my studies to dedicate myself to that particular field!\n\nJust like the others said I wouldn't advise starting a PhD on a subject that you don't like. From what I hear it's hard enough when you like what you do, I can't even imagine how stressful it would be to do something you only partially like! \n\nIf you really want to do a PhD find a subject you love and that you feel you would like to give a meaningful contribution to. Otherwise don't be scared by the \"a physicist is not real without a PhD\" common idea. You are free to do whatever you like, without following the \"classic\" path.\n", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "111": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1504971703, "Score": 3, "Body": "I am a bit jaded post-phd. I would not recommend doing a PhD unless you are TOTALLY dedicated to academia, or can leverage that phd into a higher paying non-academic job. My recommendation would be to go for the ICT job, see if you like it, the university will always be there to exploit your cheap labour later on.", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "112": {"Subreddit": "PhD", "Author": "kutekittenkisses", "Date": 1504972713, "Score": 3, "Body": "Is there a graduate student union at your university? Typically the graduate student union can help you in seeking outside legal advice if necessary, but they would be very interested in hearing about this.", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "113": {"Subreddit": "PhD", "Author": "msalad", "Date": 1504983336, "Score": 2, "Body": "There is likely a lawyer/firm affiliated with your university that you can seek free legal advice from. ", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "114": {"Subreddit": "PhD", "Author": "wickedfreethinker", "Date": 1505000055, "Score": 3, "Body": "I am done with coursework so my schedule is mostly writing. It's insane when I have a deadline. I have not slept for four days. ", "Permalink": "https://www.reddit.com/by_id/t3_6yqx2k.json"}, "115": {"Subreddit": "PhD", "Author": "FacelessGradStudent", "Date": 1505000372, "Score": 2, "Body": "Thank you for sharing and giving a well thought out answer. We have a graduate student government but it's not clear what type of resources they have for a situation like this. I'm going to reach out to them after discussing with my advisor on Monday. ", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "116": {"Subreddit": "PhD", "Author": "FacelessGradStudent", "Date": 1505000407, "Score": 2, "Body": "I tried to look into it but could only find the legal offices that represent the university itself.", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "117": {"Subreddit": "PhD", "Author": "FacelessGradStudent", "Date": 1505000745, "Score": 2, "Body": "I like this idea but unfortunately, the class is over till next summer. I'm still TAing in other classes but do not go over the legal limit. ", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "118": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1505024899, "Score": 3, "Body": "I try (emphasis on the *try*) to treat it like a 9 to 5 job. I actually make a timetable and put in what I'm going to work on during what hours and try to stick to it. If I fall behind on something I'll add a couple of extra hours in on a night I'm feeling particularly good or on the weekend.\n\nBut that being said it's also equally important to prioritize time for relaxing, time with friends/family, and time for hobbies or other things you enjoy. I've not been doing a great job at this part lately and I'm feeling a lot more burnt out than I did when I was prioritizing my life over my PhD...", "Permalink": "https://www.reddit.com/by_id/t3_6yqx2k.json"}, "119": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1505025462, "Score": 3, "Body": "I second this :)", "Permalink": "https://www.reddit.com/by_id/t3_6ynvo7.json"}, "120": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1505025546, "Score": 4, "Body": "It definitely varies from field to field. I'm doing biomedical/electrical/some-kind-of engineering, and I use IEEE style. I'm pretty sure electrical engineers are pretty much the only ones that use it. Your best bet is to talk to academics in your department and work out what the norm is in your field.", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "121": {"Subreddit": "PhD", "Author": "waterloograd", "Date": 1505078567, "Score": 1, "Body": "A student that applied to our lab included all of his online courses. Our advisor liked it. He said that his application was the best he had ever seen or heard of and showed it to us for help in applying for our PhDs. I only ended up meeting the student twice since he started a few days before I graduated and left for my PhD", "Permalink": "https://www.reddit.com/by_id/t3_6xrvpj.json"}, "122": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1505154041, "Score": 3, "Body": "I just think we should start by pushing for more content on this subreddit. Such as news of any conferences or particular anecdotes. Then start categorising when there's considerable content coming in.", "Permalink": "https://www.reddit.com/by_id/t3_6ynvo7.json"}, "123": {"Subreddit": "PhD", "Author": "TheForrester7k", "Date": 1505156352, "Score": 1, "Body": "Thanks for the response!\n", "Permalink": "https://www.reddit.com/by_id/t3_6x9kbo.json"}, "124": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1505225346, "Score": 3, "Body": "Since I started my phd, max TA work hours were reduced from 15 to 10 and now it is 6 per week. They also reduced the fee so it is £17 per hour. I know we are not necessarily meant to live on that and most people have scholarships anyway but it is still a massive problem. It did not actually reduce the workload because my module still has the same number of students, maybe even more - meaning that multiple tutorial sessions are needed. I am just not getting paid for it. Most of us searched for part time work outside the uni but it is time consuming and annoying to apply outside and impress them and get the job, especially when you know there are more work you can do at your own department. \n\nWhen we complained, they said it is a uk research council decision and there is nothing they can do about it. The reason for this decision is to have students focus on their theses without distractions and finish in 3 years. So we are basically rushed to finish and leave, without enough work experience or time for other things, just to face unemployment at the end of it.", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "125": {"Subreddit": "PhD", "Author": "lilhuman0", "Date": 1505353299, "Score": 2, "Body": "I'm five years into my PhD program and about to graduate. This may seem overtly negative and I appreciate that sentiment. But when I encountered negative feedback from people when I was starting out on my program, I thought \"Heh, what do they know, they must've done it wrong, hence they feel this way\". I have learnt over time and the hard way that a PhD will break you down and test your patience to a degree you haven't experienced before. If you think you're being driven insane just by the decision of whether to do it or not, well.. just don't. The only reason you want to do a PhD is if you want to pursue research/academia as a full-time job - and you're clear about this goal. No other reasons. It'll save you a lot of pain. The opportunity cost is humongous if you go down this rabbit hole without a clear vision in mind.", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "126": {"Subreddit": "PhD", "Author": "Im_Not_A_Socialist", "Date": 1505498365, "Score": 1, "Body": "&gt;For political science in the US, we use the APSA's own format...\n\nUnless you're in International Relations, in which case we use Chicago. ", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "127": {"Subreddit": "PhD", "Author": "shaydez37", "Date": 1505515385, "Score": 6, "Body": "Congratulations to you! ", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "128": {"Subreddit": "PhD", "Author": "kalamano", "Date": 1505519034, "Score": 6, "Body": "Congrats! ", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "129": {"Subreddit": "PhD", "Author": "seven_ensi", "Date": 1505528004, "Score": 5, "Body": "Grats =P", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "130": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1505532227, "Score": 1, "Body": "We're still using APSA for our IR papers... I'm a third year grad student so I haven't had any journal publications yet, but the general consensus I get from our IR faculty is it doesn't really matter as long as you use a somewhat-common-within-the-disciple citation system, as journals will tend to reformat according to their own publication specifications upon acceptance for publication? I've been using APSA for my conference papers and haven't run into any issues (yet)...", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "131": {"Subreddit": "PhD", "Author": "pourqouionfaitca", "Date": 1505550124, "Score": 4, "Body": "Congratulations!", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "132": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1505576750, "Score": 2, "Body": "Wooo congrats!!", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "133": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1505578203, "Score": 1, "Body": "Yayyy", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "134": {"Subreddit": "PhD", "Author": "yonyonson69", "Date": 1505583999, "Score": 1, "Body": "That is awesome! Just started this semester and am questioning the wisdom of of my choice to begin.", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "135": {"Subreddit": "PhD", "Author": "Im_Not_A_Socialist", "Date": 1505595085, "Score": 2, "Body": "&gt;the general consensus I get from our IR faculty is it doesn't really matter as long as you use a somewhat-common-within-the-disciple citation system.\n\nThis is pretty much accurate. It really depends on your specific field and which journal you're submitting to. Broader political science journals will use APA/APSA whereas more niche but high-impact journals such as *International Security* use Chicago. Additionally there are some that are just weird and use their own custom format (*International Organization* is Chicago-esque).\n\n&gt;as journals will tend to reformat according to their own publication specifications upon acceptance for publication?\n\nSort of. They'll usually tell you on their website what the citation format for submissions needs to be. *International Security* for example says that any format is acceptable for submission, but after being accepted you'll be respinsible for converting it to Chicago before publication. By contrast, *International Organization* instructs everyone submitting to their journal to use their format by default.\n\n*Foreign Affairs*, is a sort of outlier in that they don't usually require any specific format so long as it's common within the field since they rarely include footnotes in their actual publication for aesthetic reasons. \n\n&amp;nbsp;\n\nI know Chicago like the back of my hand because the graduate school (not my specific department) where I did my masters required all theses to be submitted in Chicago format. I know APA as well because I minored in psychology during my undergrad, but I just find Chicago's footnote citation format because I just find it more aesthetically pleasing, which I know is sort of a stupid reason.  ", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "136": {"Subreddit": "PhD", "Author": "ianmgull", "Date": 1505609709, "Score": 2, "Body": "I applied to 13 schools and got accepted to 3. Given, the top four were definitely a long shot given my stats, but the one I ended up going with was in my top 5. \n\nProfessors will mostly understand. They usually just receive an email link to upload your letter to. Part of a professors job is to do exactly that, so don't worry too much. ", "Permalink": "https://www.reddit.com/by_id/t3_6wk1ha.json"}, "137": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1505639491, "Score": 1, "Body": "Hi, \n\nWhen I started, someone told me I had to do it. It's difficult, it's hard, and sometimes you do a lot of work that you just have to erase or... store inside a drawer. \n\nBut at the end when it's done, it's not only satisfying for the sake finishing after 3-5 years, it's also knowing that you are one of the world experts on that specific subject.\n\nI don't know what my future will be but I'm applying to job offers that I couldn't before, and the pay is 2x what I have been making while I was studying. So there is that.\n\nDo not question it, just do it, and enjoy the ride. It is important.", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "138": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505666197, "Score": 1, "Body": "Without exception, you should always take a job over a PhD.  A PhD is to allow you to be an academic, or to take an industry job that requires the PhD for higher pay.  In the latter case, the prior job experience will always be a bonus for getting work.  In the former case, the job experience will help you decide *if* the PhD is something you want to do, and *which* program to choose.", "Permalink": "https://www.reddit.com/by_id/t3_6yj2cr.json"}, "139": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505666724, "Score": 1, "Body": "That depends entirely on her specific skills, the specific industry, where you live, and how willing she is to do something outside of her previous line of work.  You can only know that by doing a bunch of research.\n\nShe also has to be concerned with the fact that she might find *one* job in Delaware, but that isn't going to set her up for a career.  The general rule of thumb is that the more specialized the work, the fewer locations you have to choose from.  Unless you have job prospects that will reasonably pay more than hers (which are 6 figure starting with incredible opportunity for growth, if she picks the right city), you should seriously consider moving to the city of *her* choosing.\n\nThe first job you get out of a PhD can have a huge impact on the trajectory of your career.  It might sound harsh to you, but she really ought not overlook that for the sake of Delaware and a boyfriend of one year unless you're pulling some serious bank.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "140": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505666953, "Score": 1, "Body": "Plant vs animal systematics probably won't matter, but know that such a specific field will not qualify you to do anything else in biology most likely, and will likely have no application at all outside of academia.", "Permalink": "https://www.reddit.com/by_id/t3_6xcznq.json"}, "141": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505667090, "Score": 1, "Body": "This is going to depend on what else you have done/can do outside of your PhD.  Can you build a resume that the PhD (and the stuff you did during it) is a tiny line of?", "Permalink": "https://www.reddit.com/by_id/t3_6y1txh.json"}, "142": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505667685, "Score": 1, "Body": "If you're interested in keeping industry options open, you should look for something that will give you some kind of disease angle.  In vitro level of analysis using molecular techniques would also be ideal.\n\nThe most critical piece, however, is making sure you *get the heck out of lab* as often as possible to make industry connections.  Nobody will be impressed by your project in industry beyond a brief \"get to know you\" talking point.  They want to see how you think, what techniques you know, and if you are personable.  Having a \"side hustle\" doing something directly interfacing and transferable to industry will get you those things and relevant connections.\n\nI'm coming from a neuro PhD here, and let me tell you--it is *NOT* easy securing work after the PhD.  Neuro people end up all over the place in whatever jobs they can find.  You have to actively craft yourself into something more than a PhD student if you want to be ahead of the crowd.", "Permalink": "https://www.reddit.com/by_id/t3_6yfusl.json"}, "143": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505667949, "Score": 1, "Body": "I'm getting a PhD because the job prospects and pay increase dramatically with one in comparison to the B.S. degree I entered the work force with.  I have little interest in the academic research machine, accolades, proving excellence, or being called \"doctor\".", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "144": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505668071, "Score": 1, "Body": "What do you want to do after the PhD?", "Permalink": "https://www.reddit.com/by_id/t3_6x9kbo.json"}, "145": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505668323, "Score": 2, "Body": "Do not teach above the explicit minimum requirements of the PhD program.  Use that extra time to find employment outside of the university (which will invariably pay more and be more useful for your resume).\n\nIf you are mid semester, inform the department head that you will be logging your hours from now on and will not show up to the classroom after the billable 9 hours a week have been met.  The department is welcome to find some money to pay you for any hours over 9 that they would like for you to work.", "Permalink": "https://www.reddit.com/by_id/t3_6z19nh.json"}, "146": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1505668652, "Score": 1, "Body": "I can't imagine why you'd ever need a sand timer.\n\nYou don't need to buy anything, just grab a marker or pen from somewhere.", "Permalink": "https://www.reddit.com/by_id/t3_6x0u8w.json"}, "147": {"Subreddit": "PhD", "Author": "Kylo_Rey", "Date": 1505671619, "Score": 1, "Body": "I think that a lot of the advice that has been given so far is great, but as a social worker who went through an MSW program and is now in their 3rd year of a PhD program, I would encourage you to stay focused on your MSW for the time being. As I'm sure you already know, it is a lot of work between classes and your field experience. I think it sounds like you will be a great PhD candidate, but remember, one goal at a time. \n\nOne other thing to consider, if in the future you want to teach classes in the social work practice sequence, CSWE requires that you have 2 years of post MSW direct practice experience. \n\nGood luck as you finish your MSW!", "Permalink": "https://www.reddit.com/by_id/t3_6x58si.json"}, "148": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1505672877, "Score": 1, "Body": "I appreciate the lengthy response!  Yeah, that all makes sense.", "Permalink": "https://www.reddit.com/by_id/t3_6xn6z4.json"}, "149": {"Subreddit": "PhD", "Author": "ASpeechForAmerica", "Date": 1505682291, "Score": 1, "Body": "I'm making a series of educational videos in my spare time, sand timers help me test the scripts and time myself on video. I must have had some crossed wires when I wrote this question!", "Permalink": "https://www.reddit.com/by_id/t3_6x0u8w.json"}, "150": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1505752352, "Score": 2, "Body": "Congratulations! I hope now that you're appreciating your field even more. What is your speciality doctor ?😁", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "151": {"Subreddit": "PhD", "Author": "TheForrester7k", "Date": 1505758327, "Score": 1, "Body": "Well all I'm really sure about is I want to do research. That could mean staying in Academia or maybe in a government position. I think I will try to feel that out while I'm doing the PhD. I've seen the type of work that biologists with just masters typically get into and it just doesn't seem fulfilling or intellectually stimulating to me.", "Permalink": "https://www.reddit.com/by_id/t3_6x9kbo.json"}, "152": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1505762392, "Score": 3, "Body": "Thanks!\n\nIt's social Communication. I did an experiment about the effects of music in a restaurant, mixing direct effects and advertised effects (communication). Since social communication is usually considered and studied from a cultural perspective, what I did was consider communication as a human phenomenon and compared communicative effects vs psychologic effects.\n\nApplication/methodology wise, restaurants and other stores can use my panel of variables to study different kinds of effects of music, both from communicative and from psychologic perspectives.", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "153": {"Subreddit": "PhD", "Author": "tkasliwal", "Date": 1505801892, "Score": 2, "Body": "You won't have to look at TNR till you finally submit your research paper. Try this, https://typ.st/2xMZn6l. It will allow you to write freely and all formatting issues are handled automatically at the end of your writing.\n", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "154": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1505825268, "Score": 1, "Body": "That's seriously awesome project 👍😊", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "155": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1505831732, "Score": 1, "Body": "Thanks! Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "156": {"Subreddit": "PhD", "Author": "coolman6969696969", "Date": 1505857182, "Score": 5, "Body": "What made you go into it in the first place? I really think doing the Ph.D. is mostly for yourself so if you aren't excited about the prospects and/or you can get your fill through other means then it probably isn't for you. ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "157": {"Subreddit": "PhD", "Author": "PhDMightBeAMistake", "Date": 1505858729, "Score": 2, "Body": "Several reasons. \n\n(A) I felt no motivation or meaning in my career. But I started remembering how much I enjoyed studying my subject as an undergrad and found it intellectually stimulating. So doing a PhD felt like a legitimate way to get out of my \"funk\" with my work/life. \n\n(B) I really enjoying talking about my subject with others, as well as learning and reading more about it. So it seemed like a natural fit, although I realize that this could be done independently of graduate school as I type this out. \n\n(C) I wanted to move to my career elsewhere, and I felt like a career in my subject would be perfect. But I don't want to do academia and I don't expect a significant pay increase with that career change, which is one reason why I'm worried about money. ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "158": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1505860024, "Score": 1, "Body": "Would you mind sharing what subject area you are in?\n\nIs your position funded? \n", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "159": {"Subreddit": "PhD", "Author": "PhDMightBeAMistake", "Date": 1505860329, "Score": 1, "Body": "History. I currently work as a consultant full time and study history part time. It's not funded because I am part time, but if I switch to full time, then I'll have funding. ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "160": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1505860752, "Score": 1, "Body": "Well done, actually smiled reading this :)", "Permalink": "https://www.reddit.com/by_id/t3_70chrl.json"}, "161": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1505861753, "Score": 2, "Body": "i think you answered this yourself, if you love the subject, and are passionate about it and all that is worrying you is money then take up the phD full time. If you are unsure, give it more time, at least till you have completed a semester  and see how you feel then. The transition into a phD is not easy for anyone, especially people with full time jobs and other commitments. ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "162": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1505863104, "Score": 3, "Body": "If you are attending part time and you already having doubts about wanting to complete the program I strongly suggest you speak to your program advisor about your doubts. At this point it is a financial cost to you as well as emotional, unless you can find a way to relieve your concerns then I wouldn't suggest continuing in your program as anything other than full time.", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "163": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1505873011, "Score": 5, "Body": "There are some online PhDs out there... Not sure about in psychology though.\n\nIn a normal PhD program, you do have to be physically at the university for your coursework. In my (political science) program, after 3 years once we finish our coursework we don’t have to be physically present. But until we finish coursework, we do have to be there.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "164": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505873312, "Score": 1, "Body": "That will be challenge if she has to stay overseas for 3 years since she has so much going on here. We will have to weigh the pros and cons of her leaving everything behind to pursue her dreams. Thank you for your swift reply!", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "165": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1505889583, "Score": 2, "Body": "Well yes it’s an important commitment, not to be taken lightly. The PhD is shorter in the UK (3 years) and I know several people with families, companies, caring responsibilities. It’s difficult but if you care enough you’ll make it work. Dedication and good time management will be essential. ", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "166": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505892087, "Score": 1, "Body": "You're so right. We will have to sit down and decide what's best for our future. The big plus now is that we do not have children. If UK is just right next to us it wouldn't be a problem but being overseas is a challenge. \n\n10,588 km= 6,579 miles (Malaysia to England)... yeap I actually took time to google that.\n\n&gt; The PhD is shorter in the UK (3 years)\n\nDidnt know that. Thanks for the info.\n\nI really appreciate your thoughts and I would offer you a pine or two if I was able to.\n", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "167": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1505896106, "Score": 2, "Body": "Mine too!!! You're my font soulmate.", "Permalink": "https://www.reddit.com/by_id/t3_6xf91o.json"}, "168": {"Subreddit": "PhD", "Author": "es56789", "Date": 1505902530, "Score": 3, "Body": "I'm not sure if it's like this in the UK, but where I am (Australia/New Zealand) PhD doesn't involve any coursework. I'm doing my PhD in psychology and have never needed to be at university physically except if I'm teaching. Most PhD students in my cohort work from home. I'm not sure if they'd allow us to enroll if we lived in another country though. It will depend on the nature of the research. I think it'd be hard to do a psychology PhD remotely because of the research demands (mostly with humans, often requiring access to equipment etc).", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "169": {"Subreddit": "PhD", "Author": "whatisthescore101", "Date": 1505906763, "Score": 1, "Body": "I'd stop for a week and have a sex-a-thon. Then come back and do it", "Permalink": "https://www.reddit.com/by_id/t3_6vrevo.json"}, "170": {"Subreddit": "PhD", "Author": "whatisthescore101", "Date": 1505907013, "Score": 1, "Body": "I finished but have seen others drop out; I think it's fine not everyone is cut out for it . Ppl I know have tended to regret it and can't seem to shake the failure tag . ", "Permalink": "https://www.reddit.com/by_id/t3_6vctfu.json"}, "171": {"Subreddit": "PhD", "Author": "alberhasky", "Date": 1505910609, "Score": 1, "Body": "You should at the very least finish your first year! The first year (or even few years) of the program might not be indicative of what the program or career is really like.   I would argue that nobody enjoys grad school all of the time, and you might just be experiencing a difficult start. If you really can't afford it, that's a different story. But I'm guessing you pursued a PhD for good reason, and it might just take some hard work and time before you start to appreciate it! ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "172": {"Subreddit": "PhD", "Author": "tcush89", "Date": 1505912329, "Score": 2, "Body": "But don’t you have to already have a masters going into a UK program? In American programs you don’t need a masters first.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "173": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1505918137, "Score": 7, "Body": "If you are providing proof reading or other services for PhD researchers and your website contains Lorem Ipsum text, then I would not touch your services with a barge pole. Bravo, you've managed to make a massive rookie error on your sales pitch.", "Permalink": "https://www.reddit.com/by_id/t3_71adaf.json"}, "174": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1505920767, "Score": 3, "Body": "It’s becoming more common to have a Master’s as an entry requirement but it’s not universal. Generally in the UK you do a 3 year Bachelor’s, (maybe a 1 year Master’s) then a 3 year PhD with an optional 1 year write-up period. You could go from pre-university to post-PhD in 6 years if everything works out well for you. ", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "175": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1505922521, "Score": 3, "Body": "Well done. You’ve played yourself ", "Permalink": "https://www.reddit.com/by_id/t3_71adaf.json"}, "176": {"Subreddit": "PhD", "Author": "kuwabara_has_a_sword", "Date": 1505940177, "Score": 2, "Body": "Experimental psychology programs would be your best bet, as they focus on research and lab work. \n\nClinical, Counseling, and Psy.D programs typically require a practicum where you do therapy or assessment for a nearby health provider, which has to be approved by the program. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "177": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505956693, "Score": 1, "Body": "Yes she does. She has her masters in one of the ivy league university in the States. Next step would be her PhD but due to financial issues and family she couldn't do it at that time.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "178": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505957354, "Score": 1, "Body": "Australia is one of her choices too. Can you PM the university that you're attending so we can inquire more information from them?\n\n&gt; I think it'd be hard to do a psychology PhD remotely because of the research demands (mostly with humans, often requiring access to equipment etc).\n\nI'm not too sure but I think she doesn't need the equipment because she wants to have her PhD in Family Therapist.. or maybe Clinical Psychology (she worked in a mental institute before during her studies)... Clearly, I can't explain as thorough what she wants to be exactly (sorry) since I have little knowledge as to what she wants to do in her career but what I know is she wants to take her PhD =). ", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "179": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505957700, "Score": 1, "Body": "&gt; Experimental psychology programs would be your best bet, as they focus on research and lab work.\n\nIn other words, she might have to have a physical lab with equipment? Not sure if she is able to do that remotely.\n\n&gt; Clinical, Counseling, and Psy.D programs typically require a practicum where you do therapy or assessment for a nearby health provider, which has to be approved by the program. Good luck!\n\nDo you think if she does her practicum in Malaysia at a nearby health provider that is approved by the university, would it be alright?  There are many crazy people in Malaysia right now =P. \n\nCan you recommend any universities?", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "180": {"Subreddit": "PhD", "Author": "es56789", "Date": 1505962426, "Score": 2, "Body": "I probably should have also specified that my PhD is in experimental (not clinical) psychology. The clinical students are required to be on campus more than the experimental students.\n\n&gt;I'm not too sure but I think she doesn't need the equipment because she wants to have her PhD in Family Therapist.. or maybe Clinical Psychology (she worked in a mental institute before during her studies)\n\nI think wanting to do Clinical will make things harder, at least in Australia and NZ. The pathways to becoming a registered psychologist can be quite strict and they will also differ from country to country (even between Australia and NZ). Clinical psychology is quite competitive, and I can imagine that the program(s) would prefer students who are able to be based here rather than those based overseas. There is no harm in asking, though.\n\n&gt;Can you PM the university that you're attending so we can inquire more information from them?\n\nI can, but it probably won't be overly helpful. You're just as well off doing a search for the major universities in Australia and New Zealand that offer clinical psychology. Maybe this link will help: http://www.ahpra.gov.au/Education/Approved-Programs-of-Study.aspx", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "181": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1505965630, "Score": 1, "Body": "&gt;  I think wanting to do Clinical will make things harder, at least in Australia and NZ. The pathways to becoming a registered psychologist can be quite strict and they will also differ from country to country (even between Australia and NZ). Clinical psychology is quite competitive, and I can imagine that the program(s) would prefer students who are able to be based here rather than those based overseas. There is no harm in asking, though.\n\nOne of the main problem in Malaysia is there is no clear guideline what a credible psychologist is; hence, it is much more credible to obtain from overseas (e.g. US,UK,AUS,NZ). I'm sure it is tough to be a clinical psychologist but she is a bright one. haha.\n\n\nShe is also searching for the major universities as well. Thanks for the link! I've already forwarded it to her and she appreciates your help.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "182": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1506016475, "Score": 2, "Body": "While there are probably exceptions to the rule, I would say not really. You might be able to arrange something with an advisor (professor that oversees/funds your wife's research), where they are okay with her working remotely, but that's a big thing to ask for upfront. ", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "183": {"Subreddit": "PhD", "Author": "TheIrishCrimeGuy", "Date": 1506154666, "Score": 1, "Body": "That's kind of sad you included his and your sex into the equation. My supervisor is a woman and I'm a man and if never even consider that a factor nor she I hope", "Permalink": "https://www.reddit.com/by_id/t3_6vtktg.json"}, "184": {"Subreddit": "PhD", "Author": "innovationsystemplus", "Date": 1506159740, "Score": -2, "Body": "PhD Assistance Complete Guidance-Embedded Electronics,Thesis Writing", "Permalink": "https://www.reddit.com/by_id/t3_71xdzd.json"}, "185": {"Subreddit": "PhD", "Author": "mosquitoman45", "Date": 1506162480, "Score": 5, "Body": "So you are encouraging students to cheat. Shame on you.\n\nStuff like this gives South Asians a bad reputation.", "Permalink": "https://www.reddit.com/by_id/t3_71xdzd.json"}, "186": {"Subreddit": "WitchPhD", "Author": "imguralbumbot", "Date": 1506173952, "Score": 1, "Body": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\n**https://i.imgur.com/GoDxlGP.jpg**\n\n^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=ignoreme&amp;message=ignoreme) ^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&amp;subject=delet%20this&amp;message=delet%20this%20dneapr8) ", "Permalink": "https://www.reddit.com/by_id/t3_71yba5.json"}, "187": {"Subreddit": "PhD", "Author": "mugbrushteeth", "Date": 1506242953, "Score": 1, "Body": "thanks :) I am getting more used to being alone in lab and socializing out of the lab ", "Permalink": "https://www.reddit.com/by_id/t3_6seue3.json"}, "188": {"Subreddit": "PhD", "Author": "innovationsystemplus", "Date": 1506263995, "Score": -2, "Body": "Practical Approach and real-time learning environment.", "Permalink": "https://www.reddit.com/by_id/t3_725d8g.json"}, "189": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1506282118, "Score": 2, "Body": "Definitely do not accumulate debt for a history PhD.  No matter what else you do, do not take on debt for a history PhD.\n\nYour point C below--you don't want to do academia, but you want a change of career.  Someone in the humanities might be a better source than I, but there is really nothing you can do with a history degree outside of academia.\n\nPlease think long and hard about what you want to do after the PhD.  Do not use a PhD to run from a career.  You might find that you're in the same place, or worse, when you're done.", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "190": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1506282494, "Score": 2, "Body": "Psychology degrees involve a lot of time collecting data for independent research, often on campus.  Many have extensive teaching assistantship requirements.  I'd be suspect of the legitimacy of any program that *could* be completed remotely.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "191": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1506287713, "Score": 1, "Body": "It's only September...", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "192": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1506306235, "Score": 1, "Body": "You're definitely correct especially all the way in South East Asia where credibility is not what we are famous for. ", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "193": {"Subreddit": "PhD", "Author": "brahblah", "Date": 1506306386, "Score": 1, "Body": "She has been emailing universities to inquire and we are still waiting for their reply. I'm guessing the more prestigious the university is the less likely they will allow her to work remotely to meet their high standards/expectations to maintain their own credibility.", "Permalink": "https://www.reddit.com/by_id/t3_717x8s.json"}, "194": {"Subreddit": "PhD", "Author": "jkzr25", "Date": 1506429657, "Score": 1, "Body": "I recently wrote a blog article about the challenges of pulling together a multi-disciplinary literature review. You might find it helpful https://sgsahblog.wordpress.com/2017/09/19/writing-the-literature-review/ ", "Permalink": "https://www.reddit.com/by_id/t3_6y6hws.json"}, "195": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506431437, "Score": 2, "Body": "As mentioned, it depends on your field and institution. I'm in the UK, and we tend to use Harvard or Vancouver style (typically, for the sciences)", "Permalink": "https://www.reddit.com/by_id/t3_6ye8ry.json"}, "196": {"Subreddit": "PhD", "Author": "doidoidestroy", "Date": 1506436446, "Score": 4, "Body": "Haha, good luck! After watching my wife go through this just last week, I can completely relate to what your going through. The last push is the most intense and tedious. You've made it this far, you'll get it done.  You've got this! Nearly there.", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "197": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506436942, "Score": 1, "Body": "Thank you dude! ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "198": {"Subreddit": "PhD", "Author": "tyrsu", "Date": 1506437262, "Score": 9, "Body": "Yoooouuuu caaaaaaaaannnn dooooooooo iiiiiiiittttt!!!!!!!!\n\n * Cheerleaderstuff *", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "199": {"Subreddit": "PhD", "Author": "cloduliser", "Date": 1506437604, "Score": 2, "Body": "keep going dude, you can do it!", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "200": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1506437858, "Score": 8, "Body": "Trust your supervisors! When they say it's good enough to go, then it's good enough to go. It's bad for them too if you don't pass so you should be fine if you give them enough time to review it. Good luck!!", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "201": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506438102, "Score": 2, "Body": "Thank you guys, the support is really motivating actually :D", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "202": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1506439030, "Score": 1, "Body": "Heyyyyyyy, im not as close to the end as you, but im writing up tooo. It's quite the process eh? One of my best mates submitted last week. Make sure you take some time for yourself in the next few days, even if it seems impossible. Go walk to a nice shop and get a fancy coffee instead of instant (or juice or smoothie). Maybe hit up an exercise class or the gym before or after work. Call a friend or home for a chat. Don't isolate yourself too much!!! and congrats you're nearly there! X", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "203": {"Subreddit": "PhD", "Author": "Becca-Reyna", "Date": 1506439496, "Score": 1, "Body": "Good luck!!! You can do it! It will all be over soon and then; pub.", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "204": {"Subreddit": "PhD", "Author": "kellylisah", "Date": 1506440187, "Score": 1, "Body": "Am in the same boat! Just gotta push through - eye on the finish line and nothing else! *shakes pompoms*", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "205": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506442507, "Score": 1, "Body": "Sounds like a plan! ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "206": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506446848, "Score": 3, "Body": "I was you! 4 years ago. I graduated in 2009 and began employment in a biotechnology company in Jan 2010. Got fed up of them and the glass ceiling for someone without a PhD, and desperately wanted out.\n\nI found a few websites that advertised PhD studentships, and found one in the same city as me, applied and got it. I think it'll be more difficult if you want to move abroad, bit just look around the Web for adverts,. LinkedIn, research gate, jobs.ac.uk or findaphd.com are particularly good.\n\nI'd say go for it, definitely.. You'll feel happier, and assuming you enjoy the PhD process (which I have done), you'll get far more out of it than just a qualification.\n\nAlternatively you could speak to one of your collaborators and ask if they are interested in sponsoring or helping you out. ", "Permalink": "https://www.reddit.com/by_id/t3_72l2bv.json"}, "207": {"Subreddit": "PhD", "Author": "arphunix", "Date": 1506450554, "Score": 1, "Body": "May the force be with you!", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "208": {"Subreddit": "PhD", "Author": "obd2", "Date": 1506461242, "Score": 1, "Body": "Thank you so much for the reply!\n\nIt's always nice to know that you aren't alone. My company would be categorized under biotechnology as well. The phd glass ceiling certainly is real. \n\nMy issue would be that if I were to seek a phd position in my area I would almost be forced to go to the same school as I got both my masters and bachelor's from. I'm a bit worried that having all your degrees from the same (average rated I guess) school doesn't look too hot on your CV. It's definitely an option though. I'm pretty certain that my adviser would welcome me to come and do a phd with him. \n\nI'm going to take a look at the websites you mention and see if I can't find something to apply to.\n\nThanks again for your input. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_72l2bv.json"}, "209": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1506461899, "Score": 2, "Body": "Germany and Max Planck.  \nThe most important thing is whether having a PhD will assist you in your career or not.  Sounds like it would do in your case.\n\nI graduated with my Bachelors and then worked for 3 years in a health-related field, but not scientific.  After that, I started my masters and it was definitely a bit of shell shock to go back into this really surreal pressure cooker reality (also know as academia), but it's doable and you've probably developed skills and coping capacities that far outstrip your peers who haven't worked outside of academia.  Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_72l2bv.json"}, "210": {"Subreddit": "PhD", "Author": "alphaaldoushuxley", "Date": 1506465824, "Score": 1, "Body": "Awesome! You can do it! I'm writing my first paper and it feels that way. I think it's the intimidation factor. ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "211": {"Subreddit": "PhD", "Author": "theatre_of_mind", "Date": 1506479698, "Score": 3, "Body": "Hey there, maybe you should just give some time with math. I know the jolting sensation you are talking about, I had the same feeling. Math is something that you cannot master overnight struggling to meet a deadline.\n\nInstead, try and appreciate it. Go look at different fields in math. Heck, maybe check some youtube videos about how math beautifully makes sense of abstract concepts. This will foster appreciation for the subject, then you will be prepared to learn it.", "Permalink": "https://www.reddit.com/by_id/t3_72ln5e.json"}, "212": {"Subreddit": "PhD", "Author": "LolaCampari", "Date": 1506487792, "Score": 2, "Body": "Oh man! You can do it, for sure! I'm 6 weeks from submitting, finalising my last couple of experiments and tying it all up in my thesis... it's such a daunting task! Just keep your eye in the prize, you're almost there! And then... rest! What field are you in by the way? ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "213": {"Subreddit": "PhD", "Author": "caz-", "Date": 1506493345, "Score": 2, "Body": "I love the technical writing process, but the final stages of preparing my thesis was probably the most stressful time of my candidature. Part of it is just the length. It's so tedious to proofread, and it's hard to work out whether you've repeated yourself because you know the content so well that it *all* sounds familiar while you're reading it. It's also the fact that you know in the back of your mind that you could throw in the towel now and all of the work you've put in over the years would be for nothing. One of my supervisors told me he had a student who did exactly that!\n\nThe fact is, if you're happy with your research, your thesis will be fine. You just have to persevere and get it done. When it's all over, you will feel absolutely fantastic.\n\n&gt;They say good enough is good enough for a thesis, but how much is good enough, and when can I say I'll be ok to hand it in!?\n\nThere's no easy answer to this. The truth is that if it's \"complete\", in the sense that there are few typographic errors, no unfinished sentences, no placeholder figures, etc., then you're probably fine. However, every extra level of polish you put in now will make you feel that much better when it's over. ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "214": {"Subreddit": "PhD", "Author": "PhDMightBeAMistake", "Date": 1506528028, "Score": 1, "Body": "Perhaps your right - maybe I am using my PhD to run from my career. I always wanted it, but something changed in me after working for years in a professional job. I definitely need to think about this a lot more. \n\nThanks for your comment. ", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "215": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1506529758, "Score": 1, "Body": "I just want to ask one thing. By 'the PhD', do you mean the degree, the student studying for the degree, or the degree holder?\n\nIf the degree itself, then I struggle to understand how you can generalise so hugely - a PhD in medicine compared to history compared to linguistics compared to theoretical physics are very, very different beasts, only really linked by the requirement to provide something novel in the field.\n\nIf the student, then why draw the line at a PhD student compared to a masters student, or even an undergraduate? Why is a doctoral student more or less responsible for the actions of their university as a body?\n\nand if the holders... well all that's in common is Dr. in front of the name tbh.", "Permalink": "https://www.reddit.com/by_id/t3_6xalf1.json"}, "216": {"Subreddit": "PhD", "Author": "williamarbour", "Date": 1506552827, "Score": 6, "Body": "It is normal not to have a precise idea at this point. Do you have a advisor? It's mainly its role to guide you into finding a subject and a research question. The advisor has experience in writing scientific papers and has a larger knowledge of the field.\n\nFirst step would be to read some literature about your field. You can search in Google Scholar some key words, such as \"behavioral economics\" and read the abstracts of the recent articles. You will have some ideas about what has been done recently. \n\nYou can also think about what kind of master you want. Do you want to do an experiment or have a theoric approach? \n\nOnce this is done, you can contact your advisor, specifying which subfield interest you the most and what kind of research you want to lead. Then, he'll be able to precise the project a little more.\n\nHope this helps! \n\n", "Permalink": "https://www.reddit.com/by_id/t3_72vb2z.json"}, "217": {"Subreddit": "PhD", "Author": "keto_relapse", "Date": 1506583175, "Score": 1, "Body": "I literally just did this yesterday.\n\nSuch a relief. I screwed over my advisor because I was TAing for his class but the decision had to be done for myself. \n\nIn my situation I have a pregnant girlfriend in a different country and just had to be there for her. Then i mention this and my supervisor starts trying to convince me why i don't need to necessarily be with my pregnant girlfriend and I should make it work if i really want the PhD.\n\nThen I realized I just don't want the PhD. It's a third priority basically because I have other work i do and family. So it's better to just get out and not delay it.", "Permalink": "https://www.reddit.com/by_id/t3_715vbt.json"}, "218": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506627916, "Score": 2, "Body": "Dentistry (not a dentist though), but oral microbiology.. It's been great to do! ", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "219": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506627969, "Score": 1, "Body": "I did it! I finished and have had it printed to submit tomorrow!! I can't explain how proud I feel. To have achieved it it's such a fantastic feeling.. Bring on the viva! 😁", "Permalink": "https://www.reddit.com/by_id/t3_72k7w4.json"}, "220": {"Subreddit": "PhD", "Author": "TheForrester7k", "Date": 1506697707, "Score": 1, "Body": "Are there professors who you admire their published work? Comb through the literature to find people who you could potentially work with, check out their lab websites, and contact them. Keep in mind if you want to start in the fall of 2018, most deadlines are in december and january, so contact them soon!", "Permalink": "https://www.reddit.com/by_id/t3_72l2bv.json"}, "221": {"Subreddit": "PhD", "Author": "titian834", "Date": 1506701757, "Score": 1, "Body": "I did this too... 4 yrs working just started my PhD 2 days ago. Chose to do it abroad as well...many more opportunities, new contacts and funding. I think overall it was a good decision. Moving was hard though.", "Permalink": "https://www.reddit.com/by_id/t3_72l2bv.json"}, "222": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1506710734, "Score": 7, "Body": "Make sure to take time to talk directly to his other employees without him around about the culture of the lab. Anyone can seem nice over email. This person could turn out to be satan incarnate and you'd never know. Other than that it seems like you're doing the best you can. Just try not to kiss his ass too much with that presentation you have planned. You don't want to come across as that kind of person IMO. ", "Permalink": "https://www.reddit.com/by_id/t3_738gdy.json"}, "223": {"Subreddit": "PhD", "Author": "TheForrester7k", "Date": 1506712754, "Score": 2, "Body": "Thanks for the input. Yea, I guess I just want the presentation to emphasize how Ive already done related work so my experience and way of thinking will make me fit in well in his lab.", "Permalink": "https://www.reddit.com/by_id/t3_738gdy.json"}, "224": {"Subreddit": "PhD", "Author": "rejectbread", "Date": 1506726424, "Score": 6, "Body": "Honestly, just be yourself! You're going to be spending a lot of time with this guy. I wouldn't put on any more of a show than who you actually are so you don't end up deceiving him and making things awkward down the road. \n\nSeems like he's already really impressed with your skills so I wouldn't even worry :)", "Permalink": "https://www.reddit.com/by_id/t3_738gdy.json"}, "225": {"Subreddit": "PhD", "Author": "shaydez37", "Date": 1506779291, "Score": 3, "Body": "This. Be yourself and show genuine interest. Unless you're a professional actor, most people will be able to see through any fake you are portraying.\n\nIt's not expected that you are familiar with this professor's work down to the last detail. Having a general view should be good, and asking questions about their work will show interest.", "Permalink": "https://www.reddit.com/by_id/t3_738gdy.json"}, "226": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1506782634, "Score": 1, "Body": "Try the YouTube channel Numberphile, I've been watching for years and I love it.", "Permalink": "https://www.reddit.com/by_id/t3_72ln5e.json"}, "227": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506786346, "Score": 6, "Body": "The easiest way I find to stay on track is to write out headings and sub headings of the content I want to write then stay within the remit of the headers.\n\nIf you write something outside of the immediate scope, then you'll k ow and can get back on track. But I'd you find it's interesting and relevant, you can add a new header and move it to there, and elaborate. Otherwise, you can remove it! ", "Permalink": "https://www.reddit.com/by_id/t3_73ezny.json"}, "228": {"Subreddit": "PhD", "Author": "feather_red", "Date": 1506804982, "Score": 5, "Body": "I’m currently working on my PhD in counseling psychology. I can say almost from the beginning I began doubting whether I should continue. That was over 3 years ago and I’m still here, now working on dissertation. Over the last year the thoughts of quitting have nearly stopped but I feel so jaded and worn down. I feel the need to keep going because I’m so close but I question what long-term effects having this degree will cause me. I came into this program straight from a masters degree and I feel like my mental and physical health have regressed and the progress I felt like I had made before is pretty much gone. I’m hoping it will all be worth it in the end but if I could go back in time, I would definitely not start the program I’m in (perhaps another program would be different).  I’m so burnt out that I’m not even sure if I want to stay in this field anymore. I guess we will see what the future holds and how I feel in a couple years time.", "Permalink": "https://www.reddit.com/by_id/t3_73fh73.json"}, "229": {"Subreddit": "PhD", "Author": "thththrowa", "Date": 1506807791, "Score": 1, "Body": "Thanks for your response. What made you decide to continue? Why do you think another program may have been different? Sounds like you won't be searching for a job in your field after you defend, do you have any other plans/fields you may be interested in instead?", "Permalink": "https://www.reddit.com/by_id/t3_73fh73.json"}}