{"0": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1514834674, "Score": 9, "Body": "Omg OP! I did exactly this in the past month. I'm starting at my new lab tomorrow. I've been nervous about whether a PhD is the right route for me because of everything that happened with my old supervisor but I'm taking a chance on myself one more time under a more supportive mentor who is much more well established in his field. Fingers crossed.\nGood luck with the paper!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/ds1oiq9/"}, "1": {"Subreddit": "PhD", "Author": "throwawayfailphd", "Date": 1514836830, "Score": 4, "Body": "I know the transition into a new lab can be scary. I felt like people in my new lab might judge me for quitting my first PhD, but it's not the case. Good luck with everything. Support and good behaviours can do wonders.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/ds1qcsx/"}, "2": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1514847515, "Score": 3, "Body": "Thank you. I hope it works out. It's tough putting myself out there again after all the self doubt my previous mentor put me through. It's so upsetting when teachers do the opposite of their job and tear you down instead of building you up. I'm glad that you're doing well, it gives me hope. Good luck with the paper!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/ds1z5o7/"}, "3": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1515020401, "Score": 2, "Body": "Consider your ultimate career path before you invest this time.  If you don't need a publication for your next job, it may not be worth blocking away time for it.  You could always write things up in the evening after work.\n\nEdit: how practical advice like this could possibly earn a downvote, I'll have no idea.  I've watched so many people blow months on academic ventures and immediately take non-academic jobs where none of that effort was even considered relevant.  I'm not saying to put the research in the trash bin, I'm saying to prioritize time and make the publication a secondary goal if it isn't immediately relevant to your next job.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/ds5g555/"}, "4": {"Subreddit": "PhD", "Author": "ELDOR-King", "Date": 1515203043, "Score": 1, "Body": "Common, you can do this! You don't have to know everything when you start. You should just know a bit more when you finish. You'll have a lot of time. Focus on your skills, and not only \"results\". And you know, nobody really knows what they are doing in academia. That's the whole point of it!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/ds98rsu/"}, "5": {"Subreddit": "PhD", "Author": "amesbury", "Date": 1515356685, "Score": 1, "Body": "Are you interested in data science or machine learning? There is a great demand for Chief Science Officers and PhD is a must", "Permalink": "https://www.reddit.com/r/PhD/comments/7oswpc/how_to_apply_a_phd_in_industry/dsc0kk1/"}, "6": {"Subreddit": "PhD", "Author": "TotesMessenger", "Date": 1515360997, "Score": 1, "Body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/nonacademics] [How to apply a Ph.D. in industry?](https://www.reddit.com/r/Nonacademics/comments/7otj4r/how_to_apply_a_phd_in_industry/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "Permalink": "https://www.reddit.com/r/PhD/comments/7oswpc/how_to_apply_a_phd_in_industry/dsc4mfl/"}, "7": {"Subreddit": "PhD", "Author": "TotesMessenger", "Date": 1515361794, "Score": 3, "Body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/mba] [Finish MBA after Ph.D.?](https://www.reddit.com/r/MBA/comments/7otmdq/finish_mba_after_phd/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "Permalink": "https://www.reddit.com/r/PhD/comments/7ot0uf/finish_mba_after_phd/dsc5di9/"}, "8": {"Subreddit": "PhD", "Author": "colorbliu", "Date": 1515372420, "Score": 7, "Body": "I vote no here. Seems like you're qualified enough to do any job that requires an MBA with a doctorate degree in management. I doubt an MBA would open any doors. This is probably a big waste of time and a good example of sunk cost fallacy. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ot0uf/finish_mba_after_phd/dsceyrg/"}, "9": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1515377031, "Score": 2, "Body": "If you're going into academia no. The MBA makes you no more qualified and in fact makes you look odd. Frankly I'd be shocked if your advisor would allow it.\n\nIf you're going into industry likely only makes sense to do the MBA if you drop doing the PhD.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ot0uf/finish_mba_after_phd/dsciua9/"}, "10": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1515377920, "Score": 2, "Body": "This was me a month ago. I just got sick of writing and regurgitating words from articles to drive my point. Then it seemed like I was looking into an empty void of the *next step*. When I completed the first draft and had my seminar, I then felt relieved but also questioned my work a lot. I believe I had enough to finish but it didn't feel like it was something significant.  \n  \nWhat helped me was to think about the things I wanted to do in the short term and the effects of finishing my thesis. I became less stressed. I can start on small projects. Maybe, start an online class or something like that. I can read non-academic books or go to the art gallery, enjoy summer, etc.  \n\nFor a non-state-of-mind measure, I think it's best to talk about these feelings with somebody. Admit you're tired and demotivated then start writing again. If it's 90% done, another 5% would probably bring it to level that's acceptable for submission/editing. Finish the first draft, spend some time away from it then look at it again with refreshed eyes. I've learned I don't need to make everything 100% perfect because it's just not efficient to do that.  \n  \nAnyway, good luck! I'm probably at a similar stage as you are. Making minor changes for two weeks before I have to submit my thesis for examination.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dscjjyk/"}, "11": {"Subreddit": "PhD", "Author": "Doprrr", "Date": 1515380443, "Score": 1, "Body": "Its mostly the feeling that you know its going to be done and that someone has to do it; you just wish it wasn't you.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsclko9/"}, "12": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1515382787, "Score": 6, "Body": "Oh my god, I'm going through the exact same thing rn. All that's keeping me going is that it's nearly done, and friends who've done it swear that it gets exponentially harder the closer you get to finishing. \nMaking a list of things I'll get to do afterwards helped me a little bit, but really, I know what I have to do. I feel your feels. You're nearly there. YOU'RE NEARLY THERE.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dscnffd/"}, "13": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1515384569, "Score": 2, "Body": "Oh man, me too. I JUST have to finish chapter 7 section 7.3 and section 7.4 and my future work. And I'll finally be done with the first draft. Yet I just can't seem to :(", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dscoqdj/"}, "14": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1515408638, "Score": 2, "Body": "I'm going through the same thing also. Have three months left and while I have the majority of the writing done, the thought of finishing it is exhausting. \n\nI'm sorry I don't have much advice, just wanted to add my commiserations and let you know you're not the only one. \n\nI think a meeting with your supervisor might get things kick-started? And as someone else mentioned, trying to look at short term goals. I think that might help me too, because right now I'm only thinking of the end and not really focusing on what I should be doing right now. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsd0c44/"}, "15": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1515408911, "Score": 3, "Body": "Good enough is good enough (and while we're at it, do as I say, not as I do). I've just sat down at my desk for the day. Big deep breath. Hope y'all have a good day's work. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsd0fmo/"}, "16": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1515409240, "Score": 1, "Body": "It's not PhD related, but I just stumbled across [this](https://www.reddit.com/r/getdisciplined/comments/1q96b5/i_just_dont_care_about_myself/cdah4af/) post about motivation that ultimately started /r/NonZeroDay/\n\nI really really really recommend you read it, it's kind of a long post but it's worth it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsd0jy6/"}, "17": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1515410356, "Score": 2, "Body": "Hello from the other side. I definitely felt how you do. I especially had trouble writing my discussion chapter, because by the time I got to it w everything that needed to be discussed seemed so obvious and self explanatory from the results that I really resented having to spell it all out again. \nBut I'm done now! Just keep chipping away. I also ended up just going ahead and submitting it when my supervisors thought it could have been a bit more polished. Be wary of the eternal loop of \"just change this one thing\" \"Have you tried having the figure captions in bold? Come back next week with bold captions and we'll see how it looks\"\nOn top of that I was 8.5 months pregnant, excellent motivation to just get it done.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsd0z43/"}, "18": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1515423841, "Score": 2, "Body": "If your PhD was in some form of science or not-business related I could see the point, but in this case your PhD would be more than sufficient for any realistic goals.\n\nI'm trying to imagine a scenario where an employer would rate a MBA over a PhD in management where the employer is not an imbecile but I'm running a blank.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ot0uf/finish_mba_after_phd/dsd8phk/"}, "19": {"Subreddit": "PhD", "Author": "phqx996", "Date": 1515426083, "Score": 1, "Body": "It's fatigue. There really are only two ways around it. First, keep pushing through until you manage to shift your personal limits further. Second, stop what you're doing and try to focus on something else such as exercise, for a week.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsdal8p/"}, "20": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1515435379, "Score": 4, "Body": "Google is your friend. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7p05le/phd_degree_in_business/dsdjex1/"}, "21": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1515438923, "Score": 1, "Body": "I second the suggestion of hitting the pause button and completely forgetting about it for a week.  I got completely burned out, didnt write or read anything related to my proposal for 1 week, then came back to it with renewed energy.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsdmy28/"}, "22": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1515445875, "Score": 3, "Body": "Maybe not in your list of universities, but also consider INSEAD, which is excellent in business. In general, though, I think you would need to define the topic that you want to work on a little bit more concretely to determine which are the good universities in your area of interest, \"business\" is still very broad. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7p05le/phd_degree_in_business/dsdtwfu/"}, "23": {"Subreddit": "PhD", "Author": "SGupt", "Date": 1515448511, "Score": 1, "Body": "How did you find this?", "Permalink": "https://www.reddit.com/r/PhD/comments/7a52wm/i_just_found_this_tool_which_uses_machine/dsdwinn/"}, "24": {"Subreddit": "PhD", "Author": "bcbaxter", "Date": 1515452708, "Score": 1, "Body": "I'm interested in AI so was looking at the Allen Institute's projects", "Permalink": "https://www.reddit.com/r/PhD/comments/7a52wm/i_just_found_this_tool_which_uses_machine/dse0dhw/"}, "25": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1515471006, "Score": 1, "Body": "One thing I find really works for me in terms of motivation is to set a goal to work for 2 solid hours in the morning. No phone, no getting up for coffee, nothing. I tell myself that after that, I can do whatever I want. Usually what happens is I get a load done in that 2 hours, feel pretty tired after, and then keep going through the less important tasks for the rest of the day (for you that might be editing or doing figures rather than writing?). 2 hours doesn't sound like much and that's kinda the point. You can probably motivate yourself to work for 2 hours every day, and even if you get nothing done after that at all at least you've done *something*. \n\nKeep up the good work, you're almost there! Congratulations on getting this far, and good luck with the last 10% :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsegubd/"}, "26": {"Subreddit": "PhD", "Author": "0102030405", "Date": 1515471697, "Score": 2, "Body": "Out of those, McGill. Out of Canada, Rotman (U of T). Out of North America, Harvard/Wharton. Out of the world, maybe still Harvard/Wharton, INSEAD, Bocconi, Oxford.", "Permalink": "https://www.reddit.com/r/PhD/comments/7p05le/phd_degree_in_business/dsehg6i/"}, "27": {"Subreddit": "PhD", "Author": "Doprrr", "Date": 1515474961, "Score": 3, "Body": "You know, its the thought that I'm not alone in this struggle that's keeping me going.\n\nI am so glad I reached out cause knowing that others have walked this path makes it so much more bearable. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsekcve/"}, "28": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1515486757, "Score": 1, "Body": "I so feel this! Only, I'm about 10% done :(\n\nI have exactly 11 months left. 1 paper submitted. Another one 90% written, and 4 more to analyse and write up. I'm already exhausted just looking ahead to the year... And really not looking forward to writing the cushioning chapters. \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dseqtw8/"}, "29": {"Subreddit": "PhD", "Author": "Doprrr", "Date": 1515561019, "Score": 1, "Body": "God speed my friend. I wish you the best of luck and that your journey is as smooth as possible.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsgeevf/"}, "30": {"Subreddit": "PhD", "Author": "PhDmum", "Date": 1515586384, "Score": 3, "Body": "My issue with my supervisor is different. The issue is that since few months I have proposed topics for my PhD, but every two weeks he rants about it and removes basically everything. This doesn't allow me to read a substantial literature an define my own topic. He is very clever and has a substantial list of publications, but he scares me. I don't sleep, eat and have even recently developed panic attacks. I don't want to lose him as supervisor, but I am afraid this will affect my health.\nThis has already affected my home situation. My mind is so tired that I don't feel like a great mother or student. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/dsgq7x0/"}, "31": {"Subreddit": "PhD", "Author": "neuropsycho", "Date": 1515657772, "Score": 3, "Body": "If you're not doing it exclusively for the money, then I'd say go for it. But I don't think research is a work for life. After a few years, you either become a professor, a PI (which is mostly a supervision role) or move to the private sector. Being able to move to other countries is very valuable, at least in the first stages of your career. Being Spanish you won't have any problem in that regard.\n\nI also think that basic science is a bit toughter than applied science, at least when it comes to getting funds for your lab. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiegem/"}, "32": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515677884, "Score": 2, "Body": "I know the Spanish system and I find it odd you are doing physics and medicine at the same time. I know you need straight A to get into medicine, and how hard it is to pass... How do you deal with this?\n\nI would ask you what would you like to do when older. I mean, you need to choose at some point if healthcare or physics. The normal progression when studying is choosing a path and maybe diversifying at master's level. As after doing medicine you can focus on a neuroimaging master's if you wish.\n\nI think that before thinking on doing a PhD you first need to focus on which area you want to master since you will need a master's in order to have access to a PhD.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsinnwo/"}, "33": {"Subreddit": "PhD", "Author": "BetaD_C6H1206", "Date": 1515680903, "Score": 3, "Body": "A good advisor certainly would not. If you fail, it reflects poorly on them and they certainly don’t want that. \n\nSome of the best advice I received from my advisor was this: “A Masters is for you to learn the lab skills you need to be independent. A Phd is where you make your own project. A Post doc is where you specialize in your field. Either way, your goal is to get in and get out ASAP, so that you can start your career sooner rather than later. My job is to help you do that” \n\nIf you look at the track records of good advisors they have students in and out of their doors very quickly and mentor several students at once. \n\nMy advice to you is, get cracking and do whatever it takes to finish ASAP. Sit down with your advisor and ask him for help with that. You are a student after all and need their guidance. \n\nFollow their advice to the T and GTFO with your degree. \n\nP.S You probably have thesis committee members you can talk with as well. Usually you have three total including your advisor", "Permalink": "https://www.reddit.com/r/PhD/comments/7po7v5/would_an_advisor_ignore_you_to_make_you_drop_out/dsipz2o/"}, "34": {"Subreddit": "PhD", "Author": "throwawayfailphd", "Date": 1515681908, "Score": 2, "Body": "Maybe see if you can ask your supervisor for guidance on how to find an appropriate topic. The lack of guidance is mainly what drove me away from my first supervisor. \nAlso, pay attention to your health. Talking to other PhD students is what helped me a lot.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/dsiqug0/"}, "35": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515683082, "Score": 1, "Body": "I started studying medicine, and the moment I got interested in research, I focused in that path. My grades where excelent, so my teachers allowed me to spend some time in the lab, helping and learning (specially during summer). Eventually, I learned a lot from them, and most of them recommended me to move out of Spain (because the situation is dire), and because of my interest, to study physics, because right now it complements neuroscience research. So this year I'm trying to study both physics and medicine, but the truth is, that right now I'm more inclined towards physics (but I don't know what field interests me yet, because I just started), so probably I'll end up doing science in physics (and if that is the case, I'll get out of medicine, as most of it doesn't interest me at all)\n\nI want to know how viable it is to work in basic research, provided I get a PhD in physics/math", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsirw8n/"}, "36": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515683220, "Score": 1, "Body": "How does a scientist start researching? Once you finish your PhD succesfully, you get a contract or you get funds and start your own lab? Are labs public-funded or private-funded? Is there demand for scientists in physics/math/medicine?", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsis0vn/"}, "37": {"Subreddit": "PhD", "Author": "ItMeRG", "Date": 1515683397, "Score": 5, "Body": "I wouldn't spend money on it if I didn't have to. If, like you said, your laptop does the job, why buy something else?", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dsis6to/"}, "38": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515684059, "Score": 3, "Body": "Ok. Gotcha. \n\nSo yeah, given that you manage to become an A student you will probably achieve a PhD position outside Spain.\n\nAs far as I know, in Spain there are available scholarships for PHD, 1200€ per month or so from MEC, but you need to be straight A in order to obtain it.\n\nOn the other hand, in foreign universities you'll get better funding, better installations, international networking and possibilities.\n\nMy advice is, ditch medicine. Focus on having straight A in physics if that's what you want. And once you get the 4 years degree, find a master's abroad. I would advise you to keep improving your English (which is pretty good but I noticed some Spanish touch) and learn a third language. It could be German, French or a Scandinavian Language, choose it wisely since it may open doors you would never imagine.\n\nOnce in a master's you will get to know professors in a more individual way and your path to PhD will be easier. A master's is compulsory for any PhD as far as I know.\n\nGiven your (pending) profile in physics, I'd strongly advise to do a PhD in collaboration with some kind of international company. I know about engineers whose PhD is made between Airbus and an University. This is a great option for getting the best out of both worlds and networking for a future profesional path post-phd.\n\nLet me know if you need anything else from me", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsist3r/"}, "39": {"Subreddit": "PhD", "Author": "ItMeRG", "Date": 1515684175, "Score": 6, "Body": "I started at 35 after a late MSc and years in the industry :|\n\nI haven't had comments about my age, but it wouldn't matter if I did. I chose to do this. \n\nYour age may be seen as a disadvantage by some, but I would like to remind you of the advantages that come with experience.\nPlus, like you said, \"I don't need the PhD to keep my job but I do go up a few pay scales once I get it\", so why not get it?\n\nCongrats on leaving your previous supervisor and getting accepted into your dream program.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dsisx0f/"}, "40": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515685139, "Score": 3, "Body": "Regarding how viable it is. It's all about grades. Grades (and languages) open doors to PhD. Once in PhD grades+languages+publications open doors to postdoc. Once in postdoc languages+special skills+ publications+ experience in teaching open doors to Associate Professor... And after lots of publications and research and stuff there's a goal for being a professor.\n\nIn academia you will be a muppet of government funding unless you get some deal with some private company as I said. Therefore my advice on a third language, they have oil in Norway, therefore funding, they probably have better funding in Germany than in Spain, so German. I wouldn't advise Uk right now given the Brexit situation. I don't think france would be of my choice either. I know nothing about USA so idk. ;).  But it all depends on the previous research you make, which areas and institutes are in your scope etc etc etc", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsitu01/"}, "41": {"Subreddit": "PhD", "Author": "temporallock", "Date": 1515685262, "Score": 3, "Body": "BetaD wrote it pretty well.\n\nDependent upon a lot of things with your advisor and group size, including number of projects he's got in his focus, writing grants, papers, editing articles, collaborations, etc. (especially since it's the beginning of the year) I had a similar experience when I was around your time in my candidacy. \n\nI was in Materials Chemistry, in a large group for a very well known advisor in the ACS and MRS. My project was essentially impossible from the start, but we don't need to go into that.\n\nI can pretty much assure you that at your length of tenure your advisor does not want you to drop out, but use this exercise to take the initiative and start to convert this summary into the backbone of your dissertation. Unless you're funding yourself you need to remember that your advisor secured the grants for your project and it's your responsibility to do your best at that project first and foremost. \n\nI very much agree with BetaD though about getting out ASAP, and your committee members are generally very happy to help out (start trying to get a short meeting with them). Bring that summary, send it to them early, they'll have questions and you can use it to help you in continuing your research. \n\nGood Luck!\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7po7v5/would_an_advisor_ignore_you_to_make_you_drop_out/dsityav/"}, "42": {"Subreddit": "PhD", "Author": "hixidom", "Date": 1515685704, "Score": 1, "Body": "Thanks for the advice. My advisor is relatively new to professorship. Big mistake in hindsight.", "Permalink": "https://www.reddit.com/r/PhD/comments/7po7v5/would_an_advisor_ignore_you_to_make_you_drop_out/dsiudtb/"}, "43": {"Subreddit": "PhD", "Author": "neuropsycho", "Date": 1515686095, "Score": 1, "Body": "Mmm, not an expert, but people usually spends a couple of years doing a post-doc in order to get more experience and get some papers published. You basically need to do interviews and find another job as a researcher, as it is usually discouraged that you remain in the same university for both the phd and post-doc (e.g. some universities don't hire professors that have worked in just one place). If you have done some networking during your phd, that'll be easier.\n\nYou usually don't start your own lab unless you have a consolidated position in the institution/company where you work. They can be both public (research centers/departments in universities and hospitals) and private companies (biotech and pharmaceutical companies, I guess). You can make more money in the private sector, but in some countries the public sector is accounts for the 90% of the research options.\n\nNo idea about the demand in that area, sorry.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiurmx/"}, "44": {"Subreddit": "PhD", "Author": "neuropsycho", "Date": 1515686725, "Score": 11, "Body": "Also, not entirely related to your questions, but I think people should be warned before enrolling in a PhD. It can really take a toll on your mental health. Working in a long-term project for long hours and weird schedules, most of the time having a feeling of being completely alone and having no support, doing the dirty work of the lab, and having uncertainty about the validity of your project and your future is not good for you.\n\nAccording to the statistics, one-third of PhD students will suffer from some form of mental disorder, ^[[1](http://www.sciencemag.org/careers/2017/04/phd-students-face-significant-mental-health-challenges), ^[2](https://qz.com/547641/theres-an-awful-cost-to-getting-a-phd-that-no-one-talks-about/)]  mainly depression or anxiety.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsivdzt/"}, "45": {"Subreddit": "PhD", "Author": "PeriwinkleAppleTree", "Date": 1515687079, "Score": 2, "Body": "Thank you! That makes me feel a lot better. I do wish I hadn't wasted so much time with a program I hated but it gave me some necessary knowledge and experience. Good luck with your PhD! :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dsivqlu/"}, "46": {"Subreddit": "PhD", "Author": "kraefty", "Date": 1515689107, "Score": 2, "Body": "I think the last part is really important. Look into different countries because the PhD experience will differ greatly depending on where you are. This is also true for how a PhD is valued. \n\nIn Norway for example, you getting paid a full salary, which is not the case for pretty much every other country. German PhD tends to take 5+ yrs but it's generally more relaxed than let's say in the US. In the UK however, 3 yrs are standard. In Europe, PhDs are valued highly in the industry. In the US not so much.\n\nSource: I'm German doing my PhD in the US. My girlfriend is doing her PhD in the UK and had offers from Norway, so we looked into that as well.\n\nIf you have questions regarding the different systems or my experience, just shoot me a message.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsixu7d/"}, "47": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515689242, "Score": 1, "Body": "Yup +1", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsixzej/"}, "48": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515689298, "Score": 1, "Body": "I'm curious now, what made her choose Uk instead of Norway?", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiy1h8/"}, "49": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515689643, "Score": 1, "Body": "this is all advice I need, thank you very much\n\nI'll focus in physics/math, I'm pretty sure the path will unveil itself once I get to the last years of college\n\none last question, *how important is to get good grades?* I heard in medicine most of teachers had C+ or B, but nowadays less tan A might be enough to stop you from getting a PhD", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiyedg/"}, "50": {"Subreddit": "PhD", "Author": "kraefty", "Date": 1515689670, "Score": 2, "Body": "Imperial college + full stipend ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiyff4/"}, "51": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515689968, "Score": 1, "Body": "Grades is everything unless for some weird reason the potential phd mentor in a department believes you are the perfect match for a phd position despite of your average grades but you compensate with valuable skills.   \n\nBut in general, in academia grades and publications is all that matters.\nBabyboomers were way luckier than you will ever be, what a bunch of snowflakes they were. Don't trust babyboomers information, they lived in a lollipop fantasy. Things are way harder now.\n\n\nHonestly if you like math, I would combine it with IT. I know a few mathematicians that do dope stuff combined with IT and those are the ones with better prospects in both academia and private sector tbh.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiyqld/"}, "52": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515690111, "Score": 2, "Body": "Daaaammmnnn congrats", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiyvyy/"}, "53": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515690431, "Score": 1, "Body": "Also before taking any babyboomer advise, take into account that besides their lollipop experience, Spanish professors are in general totally oblivious to international options or international environment as far as I know.\n\nLolz sí que pongo bien a mi país, cagüen la leche.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsiz7uz/"}, "54": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515693982, "Score": 1, "Body": "What is IT? I get it, I'll work a lot in my grades then\n\nIs the college where you study/studied important towards getting funds or PhD positions?", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj2yl6/"}, "55": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515694605, "Score": 1, "Body": "Ingeniería Informática.\n\nDepends. Not in Spain since it all depends from MEC, or maybe it varies between communities.\n\nIt does in the USA since the private sector is very powerful.\n\nI guess it varies within countries and how much money they use for I+D.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj3ma1/"}, "56": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515694762, "Score": 1, "Body": "absolutely not interested, in Spain that degree is so undervaluated it's not even considered a science degree.. I have two friends with both degree and master and haven't found job in 4 years, they made a bad decision choosing that career path", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj3s7s/"}, "57": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515694907, "Score": 1, "Body": "In Spain. On the other hand I know a matematitian that combines IT and just got a super job in San Francisco, a similar case found a great job in Australia. I also know another guy who combines those two profiles who researches in network stuff. I encourage your friends to go abroad... Note I meant both math and IT, not just IT.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj3xr6/"}, "58": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515695190, "Score": 2, "Body": "For academia grades matter a lot. For private sector not so much. Depends on what you want.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj48lt/"}, "59": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515696660, "Score": 2, "Body": "well they are pretty terrible with math, and they do have awesome job opportunities in Ireland or UK, but they don't want to go there. Maybe you are right", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj5skp/"}, "60": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1515697545, "Score": 1, "Body": "Im in my 3rd year and have an advisor that is basically absent from my work.  I am not in the lab sciences, so Im not sure my experience is relatable to OP.  In the beginning I was having the exact same thoughts- I was convinced that something terrible was going to happen.  I soon learned this is just her \"style\", which is to ignore me.  She suggested at one point \"this might not be the program for you\".  Great, thanks for that helpful insight.  I pushed through and now we tolerate each other.  I am about to take my candidacy exams, which means interacting with her.  Stick with it- you have come far and will be disappointed with yourself if you give up.", "Permalink": "https://www.reddit.com/r/PhD/comments/7po7v5/would_an_advisor_ignore_you_to_make_you_drop_out/dsj6q9t/"}, "61": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515698383, "Score": 2, "Body": "4 years of unemployment having awesome job opportunities out there.\n You'll do better than this.\n\nBest of luck!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj7lvg/"}, "62": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515698837, "Score": 2, "Body": "https://www.economist.com/news/united-states/21646220-it-depends-what-you-study-not-where\n\nhttps://elpais.com/elpais/2015/12/22/media/1450786621_713557.html\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj83a8/"}, "63": {"Subreddit": "PhD", "Author": "azknight", "Date": 1515699449, "Score": 10, "Body": "Defending in 3 months. You'd think this would make me excited, but I'm a bigger rut than ever. This is mostly because I have hated my thesis project for the latter half of my time in grad school. My lab turned out to be a total dud, and all of those neat upcoming projects and publications discussed during my first 2 years never transpired, leaving me to cobble my dissertation from mostly old data. \n\nI've been working my ass off to make things right and to make sure that these last years won't go completely to waste, although these efforts are all outside the lab. I did an entire extra Master's and have been involved in multiple internships, where I've found actually effective mentors who do work that I can actually care about.\n\nHowever, this thesis still needs to be written. Although I've been making progress (nearly at 100 pages), I just truly hate the topic, knowing that it really contributes nothing to the field, or society in general. The document will be technically proficient with correct stats, etc, to uphold my own standards, but I will never feel proud of this work. And boy it is *really* hard to work on something you know is only ever going to serve as a paperweight following graduation. I'm absolutely dreading my defense for that reason, to go up in front of my department and present something I have no faith in. My mental and physical health has just been shredded last year, and I really need to get out.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsj8qcq/"}, "64": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1515700572, "Score": 4, "Body": "That's a real tough situation to be in! As much as it will be hard to see right now, try to remember that this whole experience of getting the PhD hasn't been a waste. You would've learnt a lot of things, built resilience and remained committed even when shit wasn't going as planned. You're no quitter, and you're almost done! Don't underestimate even being able to present \"technically proficient\" work. Keep your standards up and your head high. It'll be over soon!", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsj9wqs/"}, "65": {"Subreddit": "PhD", "Author": "StarbornProject", "Date": 1515700653, "Score": 1, "Body": "thanks for all the information and help, best wishes", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsj9zs4/"}, "66": {"Subreddit": "PhD", "Author": "decon89", "Date": 1515702280, "Score": 9, "Body": "Got 8 months to go and I kinda feel the same - thesis will be a paper weight. Having talked with other phds, post docs, professors etc., I feel a bit more relaxed. They tell me that the degree isn't about how much of an academic contribution you make, but rather that you actually went through years of focused, hard and frustrating work. This is what gives you respect from other academics and the job market in general. There aren't a lot of seminal phd dissertations out there. Don't knock on yourself for not being Einstein or Alan Kay😀", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjbode/"}, "67": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1515704018, "Score": 1, "Body": "This is good to read! Also would like to pointlessly throw this in there: I think Claude Shannon arguably wrote the most significant/impactful PhD thesis of all time!", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjdiov/"}, "68": {"Subreddit": "PhD", "Author": "Jinglejingle123", "Date": 1515707275, "Score": 1, "Body": "I'm not sure about biostat/bioinformatics, but I'm in a chemistry phd program with a lot of international students. Your tuition being waived really depends on if there are TA/RA positions available in your program. If you get one of those your tuition is waived and you get a stipend. In chemistry, when you get accepted to the program you get your TA assignment and you get told what your stipend is. I would contact the programs you are looking at to be sure that this is the case. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7osu4v/us_phd_tuition_waivingfullride_funding_for/dsjgyb7/"}, "69": {"Subreddit": "PhD", "Author": "Jinglejingle123", "Date": 1515707638, "Score": 4, "Body": "I would not hire a lawyer. I know some people that have been dismissed from their PhD program and it is due to their relationship with their adviser and their work ethic. I'm not sure what you will get out of hiring a lawyer? If you have been dismissed from your adviser, a lawyer will not make him take you back.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7mjyrd/dismissal_from_phd_program/dsjhbyx/"}, "70": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515709541, "Score": 1, "Body": "Un placer", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsjja2s/"}, "71": {"Subreddit": "PhD", "Author": "hixidom", "Date": 1515710733, "Score": 1, "Body": "Yeah, but I'm also disappointed with myself for staying. Not a lot of dignity here. Thanks for the story and support. I'll keep at it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7po7v5/would_an_advisor_ignore_you_to_make_you_drop_out/dsjkgvy/"}, "72": {"Subreddit": "PhD", "Author": "CoLab_Science", "Date": 1515711178, "Score": 3, "Body": "It is horrific how the academic research infrastructure wastes the incredible, bright minds which power it. \n\nI'm amazed by the resilience of graduate students and what they are forced to put up with just to be a part of the scientific community.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjkwg6/"}, "73": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1515713158, "Score": 3, "Body": "I am only 24 but I hate how people think of a PhD as \"school\".", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dsjmrj1/"}, "74": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1515713231, "Score": 0, "Body": "Start by improving your writing skills...?", "Permalink": "https://www.reddit.com/r/PhD/comments/7p2nqb/how_to_survive/dsjmtxn/"}, "75": {"Subreddit": "PhD", "Author": "LolaCampari", "Date": 1515714868, "Score": 4, "Body": "Just finished in November and the final year was pretty brutal. Deadlines, finishing up labworks and not having a weekend ever without going into the lab was full on. I spent a lot of days bitching/venting about supervision, writers block, being exhausted... and now I can hardly even remember the year - I KNOW it was tough, but you'll get through it! Vent away and keep at it! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjocdx/"}, "76": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1515717487, "Score": 1, "Body": "Practice", "Permalink": "https://www.reddit.com/r/PhD/comments/7o1m4q/how_to_get_better_at_writing_papers/dsjqvcc/"}, "77": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1515717528, "Score": 2, "Body": "What has this got to do with health?", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dsjqwrc/"}, "78": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1515717539, "Score": 2, "Body": "What has this got to do with health?", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dsjqx3g/"}, "79": {"Subreddit": "PhD", "Author": "Netcat2", "Date": 1515720096, "Score": 1, "Body": "Pretty much in the same situation, I’m sort of getting the feeling that nobody really cares and the fact you’re still there at the end means you get the PhD regardless of the work. \n\nAnyone else loathing the thought of working in academia? xD ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjt5ly/"}, "80": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1515723045, "Score": 2, "Body": "I am actually looking forward to working in academia (should I be lucky enough to get a position). I just really want to finish this PhD project and 'start fresh' so I can hopefully apply all the lessons I learnt by making so many stupid mistakes so far.  Or I'll just continue to make more mistakes and eventually give up *sigh*", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjvqjm/"}, "81": {"Subreddit": "PhD", "Author": "istudyscience", "Date": 1515727333, "Score": 2, "Body": "I'm aiming to finish my the end of the year. I have no idea how I'm going to get everything done. My desk is swimming in papers trying to organize what my thesis would even look like.\n\nTrying to network and get a job (just started an internship because I REALLY want to leave academia)\n\nI thought I would be motivated but I really just want to be home snuggling my dog.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsjzbv7/"}, "82": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1515731969, "Score": 1, "Body": "Submission in three months, although I can push that out to five months if I have another mental breakdown (sick leave is pretty good in Australia), and I can add another three months to that if I can live without pay. It is so bloody stressful; I only wrote one paper in my entire degree, and am trying to rush out a second so that I can have some content in my thesis. Since it's theoretical quantum biology, I spent my entire degree creating a new theory, which boils down to a single equation and it just feels so ... tiny.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsk2vy5/"}, "83": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1515737333, "Score": 0, "Body": "About two weeks to submit my thesis, yet I'm revising a publication manuscript for the manieth time instead of having started writing the thesis itself. It is now dawning on me that the thesis will mostly consist of two papers stapled together.\n\nNevertheless, those papers are quite good, if I may say so. Therefore, I'm confident something sufficiently defendable will come out of this!\n\nBest of luck to those in similar situations!", "Permalink": "https://www.reddit.com/r/PhD/comments/7pqeu1/any_final_year_phd_student_need_to_vent_out_or/dsk6e8i/"}, "84": {"Subreddit": "PhD", "Author": "OnLamictalLike", "Date": 1515737436, "Score": 2, "Body": "I started mine at 29 - you’re fine. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dsk6gan/"}, "85": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1515739530, "Score": 1, "Body": "Don't be discouraged.  I can assure you ML is not junk science.  It is a critical area of research right now.  What you are seeing is the lack of industry experience that many Phd students have. Since a Phd is typically done by students who have never actually worked in the field yet, you tend to get theory.  If you look at Phd dissertations and DCS dissertations, you will note that Phd tend to be about theory and DCS tend to be about application because most DCS students are already in the field.  \n\nIt is important to keep in mind that knowledge builds on previous work, so theory is essential.  Just because you do not know exactly how it will be applied does not mean it is useless.  Someone else may see it and find it to be a perfect solution to what they are working on.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ptgdu/computer_science_research_is_like/dsk7m1l/"}, "86": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1515739801, "Score": 1, "Body": "The idea of publish or perish is strongly ingrained into people.  The concept of telling someone not to publish can be blasphemy to some.  In my case on publication will probably help, but certainly not hurt.  But I can see where it would be uneccessary for those who go into industry.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/dsk7r52/"}, "87": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1515757386, "Score": 1, "Body": "My research in ML is applied by a team of medical experts, and I’m thinking about using it for geology and biology.\n\nI’m far from a theoretical work, as do most other PhD students in my lab. Maybe you’re only looking at your lab’s work ?\n\nBut my opinion based on your post is that science isn’t what you should invest your time into. You’ll be, as it seem, better off in a more industrial context.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ptgdu/computer_science_research_is_like/dskf1j0/"}, "88": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1515766284, "Score": 1, "Body": "Im 28. Still working on my first paper now. I spent 5 years industry before I decided to try a PhD. Best decision ever.\n\nIt takes a long time to become an actual researcher. Most people who I find get their PhDs quickly can't fill their shoes when they are out.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dskk5p1/"}, "89": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1515771719, "Score": 9, "Body": "Pubs, good letters from people well known in the field you’re interested in, and good test scores. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dskou92/"}, "90": {"Subreddit": "PhD", "Author": "rollawaythestone", "Date": 1515774644, "Score": 1, "Body": "Most of the time it will require a position at a research University - in which you will secure funding and conduct research. Sometimes you can do research in the private sector. It depends on the field, but lots of funding for research is federal or state - although there is a lot of private organizations that fund research. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dskrq7m/"}, "91": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1515799515, "Score": 3, "Body": "Your academic history, letters, and statement of purpose show that you are a good *fit* with the department’s mission and faculty. \n\nSo in your statement, make it clear that there are *at least* a couple of professors in that department that would *perfect* for you to work with - to further your own research *and* for you to contribute to theirs. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dslgo03/"}, "92": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1515804999, "Score": 1, "Body": "I'm sorry you had to go through this. I realize this was more than a month ago. What did you end up doing ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7hzq9b/my_advisor_is_talking_about_switching_me_to/dslla1l/"}, "93": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1515805330, "Score": 2, "Body": "You aren't whining at all. Imposter syndrome is so so debilitating. I recommend looking into therapy. That's what a lot of us PhD students do. The only advice I can really give you is that if you are feeling less that your best then you should take that seriously. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7kvydh/grad_student_with_social_anxiety_and_imposter/dsllk3v/"}, "94": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1515806818, "Score": 1, "Body": "Thank you u/kaygee_ki.\n\nI will see about that therapy option. I really have to improve!", "Permalink": "https://www.reddit.com/r/PhD/comments/7kvydh/grad_student_with_social_anxiety_and_imposter/dslmsg4/"}, "95": {"Subreddit": "PhD", "Author": "adelcioms", "Date": 1515807311, "Score": 2, "Body": "What about publications?", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dsln79p/"}, "96": {"Subreddit": "PhD", "Author": "schlaf518", "Date": 1515807589, "Score": 2, "Body": "You don’t have to have publications, although having them definitely makes your app stronger. \n\nMy understanding is that they look at you entire application as one package and will not cross you off for one weakness as long as there’s something else that makes up for it. Don’t have publications? Better have a good writing sample or great recommendations. If your GRE is not up there in the sky so high then you gotta make up for it with all the other things. \nI think having good recommendation is really important. Remember that they don’t necessarily have to be from famous people, it’s more important that they’re from people who like you and believe you can do this and have great potential in the future. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dslnfpj/"}, "97": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1515814172, "Score": 3, "Body": "Yeah, it depends on the field and whether you’re coming from another graduate program or just undergrad.\n\nIn general, I would say publications are always a plus, but honestly I’ve never seen them to be necessary or even typical for a PhD applicant. \n\nI suppose it’s possible that in certain fields, it might be typical for previous graduate students to maybe have publication or two? But I can’t imagine *any* field that would expect publications for an applicant coming straight from undergrad.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dslsrw1/"}, "98": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1515819758, "Score": 2, "Body": "We all do. It's so scary that it makes you question everything about yourself and your life's goals. I hope you feel better. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7kvydh/grad_student_with_social_anxiety_and_imposter/dslwolz/"}, "99": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1515827857, "Score": 1, "Body": "I know what you mean. It's almost as if I'm not cut out for anything even though I'm interested and trying hard. Communication is important and yet so difficult!", "Permalink": "https://www.reddit.com/r/PhD/comments/7kvydh/grad_student_with_social_anxiety_and_imposter/dsm11e5/"}, "100": {"Subreddit": "PhD", "Author": "aecone", "Date": 1515829302, "Score": 5, "Body": "There are many different motivational techniques.  The Thesis Whisperer describes several in her book and website here: https://thesiswhisperer.com/category/on-writing/.\nA book I enjoy is \"Writing Your Dissertation in Fifteen Minutes a Day: A Guide to Starting, Revising, and Finishing Your Doctoral Thesis\".  \nMy bottom line is just start writing anything, don't edit or proof yourself.  Just do a stream of consciousness brain dump at the keyboard.  Then rewrite it, and edit.  Repeat.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7o1m4q/how_to_get_better_at_writing_papers/dsm1o7f/"}, "101": {"Subreddit": "PhD", "Author": "aecone", "Date": 1515830093, "Score": 1, "Body": "We are just the start of a trend.  \nhttps://www.nytimes.com/2016/04/16/your-money/taking-on-the-phd-later-in-life.html", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dsm1zuw/"}, "102": {"Subreddit": "PhD", "Author": "eh2mc", "Date": 1515831679, "Score": 1, "Body": "Your situation sounds bad and sadly not unusual in a PhD program. Practical advice:\n-Talk to the department admins, department head, about transitioning and what you can do in this situation. If you show them initiative that you're proactively trying to solve the problem, they will be receptive.\n\n-Talk to friends and family. They won't have the answers but talking about will help *you* find the answer.\n\nOff the cuff I would say your mental health and well-being are more important than your PhD program, especially since it sounds like you've only committed months with this particular PI. Ultimately the situation is too complex for anyone on the internet to be able to give direct advice. Find friends and family and talk to them. It worked for me...\n\n*Edit oh wow this thread is a month old ha", "Permalink": "https://www.reddit.com/r/PhD/comments/7hsd53/what_do_i_do/dsm2mzs/"}, "103": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1515839057, "Score": 2, "Body": "Keep in mind that most of these horror stories come either from the US or from poorer, less (scientifically) developed countries. In decent programs in Western Europe, including these 4-year programs in the UK, it is usually less stressful and more reasonable. Research is still challenging and uncertain, some supervisors are still difficult, it's still lots of work and lots to learn, but the working hours and publishing expectations tend to be notably lower than in the US, and benefits and legal protections for PhD students higher.\n\nAnd yes, if you got offered sufficient funding, you should do your PhD (at least from what you wrote here, and unless you can and would prefer to switch to a totally different field...). Most stories of being better off after quitting PhD come from fields such as computer science (and again from the US). You are in chemistry, where most jobs without a PhD (where even available) are for most people worse than doing a PhD and post-PhD jobs. Even if you aren't interested (mainly) in academia, see for example [\nIs a PhD worth it in industry?](https://www.reddit.com/r/chemistry/comments/7q03tn/is_a_phd_worth_it_in_industry/) and other topics on the chemistry subreddit.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o8eti/would_love_to_hear_some_good_things/dsm5cvx/"}, "104": {"Subreddit": "PhD", "Author": "DrSantiago_", "Date": 1515844676, "Score": 3, "Body": "Hey there, I’m currently a masters student in Exercise Physiology with a background in Psychology as well. I would recommend trying to break up a long workout into shorter periods of exercise to fit your schedule. \n\nSay you’ve been writing/reading for a while, then go for a short walk or jog to get your blood flowing. Breaking up exercise into shorter periods has been shown to be as effective as long duration exercise and will help you stay focused when working on something for long periods. \n\nIf you I want to go further, I recommend High intensity interval training (HIIT), where you alternate from periods of high intensity (all out sprint) and low intensity (walking or no movement.) with hiit you can get similar and/or greater results than continuous training in a fraction of the time. \nHere’s a link for a guide to interval training:\nhttps://greatist.com/fitness/complete-guide-interval-training-infographic/amp", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsm7dgx/"}, "105": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1515852918, "Score": 1, "Body": "I actually did all the things you said. The department was great and fiercely protected me and several different professors reached out to me and encouraged me to stay. \nAs of now I have switched labs and am working under a very supportive and kind professor who also happens to be a genius. But I'm still struggling with my anxiety so the immediacy of the situation has pivoted to me trying to talk myself into picking up a pipette and not falling to pieces in front of my new lab mates. Just taking it one day at a time for now. \n\nThanks so much for thinking of me, I really appreciate it :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7hsd53/what_do_i_do/dsmb4u6/"}, "106": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1515859437, "Score": 2, "Body": "The k you for your reply :) \n\nI think taking time to go for some walks in between writing is a great way to start. Forcing myself to actually do it is the next thing!", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsmfhiw/"}, "107": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1515860853, "Score": 2, "Body": "It looks like this subreddit is near-dead and everyone is just on r/gradschool... Or maybe from the wording of your question everyone assumed it's just for people who already finished their PhD. Me? I am just about halfway through... Doing this PhD has been the only way for me to stay in the same place (research institute) for a few more years, the place I love, and the job I would have had to get elsewhere as the alternative is clearly worse in the aspects most important to me. I don't know if it is the right path, but it's the best I could (and still can) do for myself at least short-term.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mb646/why_did_you_pursue_your_phd/dsmglkt/"}, "108": {"Subreddit": "PhD", "Author": "rollawaythestone", "Date": 1515861394, "Score": 2, "Body": "The last two months before submitting my PhD was rough. Very hard to make it to the gym or eat right. Three months later and I feel like i'm still slowly recovering.", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsmh1ij/"}, "109": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1515861658, "Score": 2, "Body": "It's hard enough to find motivation to finish everything up, never mind doing anything else (besides drinking :P).", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsmh9f5/"}, "110": {"Subreddit": "PhD", "Author": "Abi1i", "Date": 1515874647, "Score": 1, "Body": "I have a MacBook Pro and I'm pursuing a math education Ph.D., at no point am I needing my MacBook Pro to do anything with graphics and architecture. The only reasons for getting/considering a MacBook are:\n\n1. Already heavily invested in Apple's ecosystem\n\n2. Believe in the Apple fandom\n\n3. Have software that will only work on a Mac\n\n4. Wanting a quality product that will last you about 5-10 years\n\n5. No real reason\n\n\nFor the 1st reason listed, this can be convenient but also powerful since Apple products tend to get better (unlock new features) the more of their products you have. (Such as if you have an Apple Watch you can unlock a Mac with it just by being in near your Mac).\n\n\nFor the 4th reason listed, you can usually find other quality products that aren't built by Apple and cost about the same if this is your end goal. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dsmsjdy/"}, "111": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515900192, "Score": 2, "Body": "Congrats! You should be proud of yourself!", "Permalink": "https://www.reddit.com/r/PhD/comments/7mpils/i_earned_my_phd/dsnevqw/"}, "112": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1515900233, "Score": 1, "Body": "O_o", "Permalink": "https://www.reddit.com/r/PhD/comments/7jx5uq/holy_crap_its_so_expensive_to_publish_open_access/dsnewy1/"}, "113": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1515902432, "Score": 1, "Body": "https://darebee.com/", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsngnxo/"}, "114": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1516028061, "Score": 1, "Body": "You missed the actual best reason to get a mac, which is wanting a Unix based operating system that is stable, supported and can run commercial programs ", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dspps9w/"}, "115": {"Subreddit": "PhD", "Author": "Chemweeb", "Date": 1516029089, "Score": 1, "Body": "As a current chemistry PhD student in europe, here's the main differences between masters internships and PhD:\n\n1: Lots and lots more writing. To prepare yourself for your thesis, regular reports are part of the experience and they are not exactly the most exciting to do. Don't get me wrong, it's very necessary especially considering that your thesis is supposed to be huge, but it's no fun.\n\n2: No feedback. In your masters you received grades for courses and internships and reports and all that. That's gone now. Whether you do well means judging your own progress by yourself and also whatever reactions your supervisors may give you (which can be hard to read. They are people too). \n\n3: You're at the forefront of science. Your supervisor does not have all the answers. It's your research, your subject. That means that after all this YOU are supposed to be the expert.\n\n4: A LOT more literature. Since you are supposed to be the expert, you have to be up to date with everything related to the reactions you use, the fields your experiments are related to, etc. Of course, your supervisors read literature too and can forward some good things every now and then, but it's mostly up to you to read.\n\n5: Data organization becomes massively important. You won't just get spectra and reports. You need to organize literature, calculations, tables, etc. Your lab notebook needs to be meticulous because it's a legal document proving that you did this and that experiment at that time. Your data needs to be so organized that any one student can pick it up and continue where you left of with some instruction. (and they will, once you are done)\n\n6: Irregular schedule (at least in my case). You were used to go to uni 9-6 during the masters, but during the PhD what matters is that the work gets done. That means some days you'll stay 8-9, some other days 9-4. You'll quickly find out most supervisors do not care a lot about your number of hours. But don't waste what little time you have. \n\n7: The default state is that things won't work. This is research after all.\n\nI hope that helps you to be a little mentally prepared for what's to come. Of course it's not easy. It's not supposed to be. But a lot of people had no idea what they were getting into, especially in the US since they combine masters and PhD there and call it PhD. You'll find that most horror tales of a PhD are from there and understandably so (also considering that their work culture is completely different and unfair).", "Permalink": "https://www.reddit.com/r/PhD/comments/7o8eti/would_love_to_hear_some_good_things/dspqllp/"}, "116": {"Subreddit": "PhD", "Author": "Chemweeb", "Date": 1516029184, "Score": 1, "Body": "It may help to look for Marie Curie funded programmes. As far as I know, they are obliged to have the research in english with english speaking supervision. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7msw1i/phd_in_italy_in_english/dspqofm/"}, "117": {"Subreddit": "PhD", "Author": "Nyborgatron", "Date": 1516029581, "Score": 3, "Body": "I proofread PhDs as my job - www.proofandpolish.co.uk. I’m an actual person (with a PhD in English). Beware of many awful online proofreading companies. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qjbkx/editor/dspr06e/"}, "118": {"Subreddit": "PhD", "Author": "mdarlinglove", "Date": 1516042505, "Score": 1, "Body": "Try NewEgg.com I found some for like $500, and I'm excited! I started making videos and I'm in love with iMovie =)", "Permalink": "https://www.reddit.com/r/PhD/comments/7odkco/phd_health_should_i_get_a_macbook/dsq3jp6/"}, "119": {"Subreddit": "PhD", "Author": "mdarlinglove", "Date": 1516042612, "Score": 2, "Body": "Congratulations! =0) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ng764/changed_phd_supervisoruniversity/dsq3nki/"}, "120": {"Subreddit": "PhD", "Author": "24poker", "Date": 1516055552, "Score": 1, "Body": "I had a similar experience with math leading up to graduate school (sans the parental pressure). I think math anxiety in political science programs is pretty common, at least, it is in my department. You are not alone!\n\nDid you talk to your stats professor about your need to drop the class? That's an important first step so that your department knows what is going on. You said you have tried taking medication and didn't like it; have you tried weekly therapy to try and uncover what exactly makes you anxious and why that is? A lot of grad students (myself included) start therapy shortly after they start grad school because issues like this crop up. Sometimes talking through the unique experiences and pressures of graduate school with a therapist (who has a PhD) can be very helpful. My university covers a certain number of sessions for free and yours might too. It's not a guaranteed fix, but it might be worth looking in to.\n\nFurthermore, keep in mind that grades don't mean the same thing they did in your undergrad. In graduate school, you can do pretty mediocre in a stats course, get a B, and still get a great job. Hiring committees don't care about your transcript. No one is going to yell at you for not doing well on your first stats midterm as long as you continue working at it and stay committed (unless you're at Berkeley or Stanford?). That being said, be realistic about your goals. You don't need to derive your own estimator to be a good political scientist. But, you should be able to read a regression table. If being able to do that means teaching yourself how to do it (or getting a tutor who works at a slower pace) instead of taking a stats course to learn, then that is what you should do. You can do this. Keep your head up.\n\nGood luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7nt292/math_anxiety/dsqh4zc/"}, "121": {"Subreddit": "PhD", "Author": "rsapolsky", "Date": 1516057824, "Score": 6, "Body": "Congrats :) that’s huge!\n\nThis may be hard but keep in mind that by being invited you already have your foot in the door. And at this point you are interviewing them as much as they are interviewing you. In addition to getting a sense of what the program has to offer in terms of clinical training and research get a sense of what the grad students are like. Do they seem overworked and miserable? Big red flag. What about the faculty? Are they approachable? Bigger scale things include what is the match rate for internship for graduating students (nice gauge of how good the training is). \n\nIt may be tough to keep your energy up all day, but be excited and polite. There are a lot of moving parts for interview day. \n\nLastly, be yourself. Because you are who they invited and wish to meet. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dsqjanp/"}, "122": {"Subreddit": "PhD", "Author": "RupertPhD", "Date": 1516057913, "Score": 2, "Body": "Congrats on recently finishing your PhD. I am in the same situation.  \n  \nIf there is any way you can afford to move out of your parents house, I strongly recommend this as the first small step towards the rest of your life.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o2adt/recovering_after_a_phd_uk/dsqjdmv/"}, "123": {"Subreddit": "PhD", "Author": "RupertPhD", "Date": 1516058113, "Score": 1, "Body": "I used mendeley to keep track of papers i read during my phd.  \n  \nYou mention you are just starting - once you have read and learned enough i expect you will remember the \"definitions\" and \"methods\" you need to know without having to consult a home-built wiki.", "Permalink": "https://www.reddit.com/r/PhD/comments/7nuw47/question_is_there_a_methodprogram_to_keep_track/dsqjkag/"}, "124": {"Subreddit": "PhD", "Author": "RupertPhD", "Date": 1516058508, "Score": 2, "Body": "I accepted that my exercise volume dropped significantly the last year of my PhD. After finishing, the newfound time now means i am exercising much more and building back the fundamental base of fitness.   \nThis worked for me. Once you can see the light at the end of the (PhD) tunnel, focus on what you need to do to get done. Have confidence in your ability to regain your fitness after the task is completed.", "Permalink": "https://www.reddit.com/r/PhD/comments/7q3wza/motivation_to_exercise_in_last_months/dsqjxnb/"}, "125": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1516059184, "Score": 2, "Body": "My old PI was ALL of these things. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qlq6w/red_flags_to_look_for_in_currentpotential_labs/dsqkk0h/"}, "126": {"Subreddit": "PhD", "Author": "mdarlinglove", "Date": 1516065601, "Score": 1, "Body": "Did you stayed in the lab and graduate? If so,  how did you deal with it? I'm always curious to know how people got through it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qlq6w/red_flags_to_look_for_in_currentpotential_labs/dsqqaor/"}, "127": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1516070069, "Score": 2, "Body": "God no! I stayed for a year and when it began to affect my work last month, I left. I joined another lab under a supportive PI who was in my committee and who was excited to have me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qlq6w/red_flags_to_look_for_in_currentpotential_labs/dsqubgg/"}, "128": {"Subreddit": "PhD", "Author": "jletha", "Date": 1516081483, "Score": 1, "Body": "For me I had a lot of time flexibility which was awesome. My advisor stopped by the Lab once a week for meetings but other than that we were on our own. My small lab, 5 people, were close knit and we put in hours but when we came in late/left early/long lunch Etc we had the freedom. \n\nI felt like I gained a more wholistic love for science in grad school as opposed to in undergrad. In undergrad I was very focused on individual classes and chem was separate from physics which was separate from bio. In grad school I would often just grab a text book from the library and read on my own at my own pace. I felt like it was able to put it all together in my brain about how all science in kind of interconnected. I gained a better appreciation of the world in a way. \n\nI certainly had my fair share of doubts and tough times but you get through them, like anything else. Try to stick to a normal schedule if you can. I usually did 8-7pm or so. Got a good nights sleep every night except for maybe 2 in my entire 5 years. My mental stability and happiness are much more important than any experiment. \n\nHonestly it can be fun. Tough but enjoyable when you’re done. Plus if you go to industry you get a fat pay raise when you’re done. If you want to stay in academia well...you’re a masochist or something. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7o8eti/would_love_to_hear_some_good_things/dsr35ve/"}, "129": {"Subreddit": "PhD", "Author": "Jab_91", "Date": 1516099669, "Score": 2, "Body": "Thank you, congratulations to you too.\n\nTo be honest I'm actually feeling a bit better now, it probably helps that I have been able to work on my suggested revisions. I also realised that I have probably been a bit hard on myself about being productive/getting a job.\n\nI don't see myself moving out for a good while yet, I don't see the point in throwing my money away on rent each month. Once I get a job and get settled then I'll start thinking about it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o2adt/recovering_after_a_phd_uk/dsrbpz3/"}, "130": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1516114892, "Score": 2, "Body": "A few questions that frequently get asked are:\n\n\"why do you want to do a phd\"\n\nsometimes followed by..\n\n\"Why do you want to do this phD specifically\". \n\n\"Explain your understanding of the project\" (If there is already a project outline)\n\nMost of the questions they are going to ask you are questions you could easily answer if your mother or father asked you, its all nerves. Once you realise that it becomes a lot easier. \n\nIf youre anxious like me here are a few tips to quell that:\n\nTake a sip of water before asking a question, nothing worse than being told to take a sip of water when you start getting dry mouth and talking too fast. This also gives you time to think briefly.\n\nIf youre in front of a table i sometimes sit on my hands to stop myself rapping my knuckles on the chair or table.\n\nUnless you are naturally funny dont include jokes or gags in your answers as nerves will just make them fall completely flat. I learned this the hard way.\n\nIf you have a shaky voice when speaking, say it to the panel before you start. I was told this piece of advice when i went for my first interview, i told the panel \"im a little bit nervous, sorry in advance if my voice starts to shake\", they were actually very understanding about it and that gave me a lot of confidence, it helped immensely as i wasnt worried about them finding out about me being nervous they already know that you are and its not a point against you, it shows that you want the position and arent just there for interview experience. \n\nRemember that the people interviewing you arent there to catch you out, no one likes to see someone struggle. They are just there to find the best candidate.\n\nMy best piece of advice is to practise your answers to your self out loud in front of the mirror. Your flatmates or family will think you are crazy but this is the best way to practise for public speaking as it allows you to work on your tone of voice, how fast you are speaking, and the content. When it comes to answering the question you wont have to think too much. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dsrkldr/"}, "131": {"Subreddit": "PhD", "Author": "Punjabi_Brothelhood", "Date": 1516116931, "Score": 2, "Body": "TLDW?", "Permalink": "https://www.reddit.com/r/PhD/comments/7qlq6w/red_flags_to_look_for_in_currentpotential_labs/dsrmevn/"}, "132": {"Subreddit": "PhD", "Author": "Nylonknot", "Date": 1516133854, "Score": 2, "Body": "Damn. That’s kind of spot on. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dss3ohc/"}, "133": {"Subreddit": "PhD", "Author": "duckshooter", "Date": 1516136801, "Score": 1, "Body": "Almost looking like a faculty application.  \nNot sure whether a bug or a feature.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dss6sdz/"}, "134": {"Subreddit": "PhD", "Author": "bionic25", "Date": 1516140063, "Score": 1, "Body": "Oh I am so there. I have a two step defence at my university with a close defence with just the jury followed by a few weeks for correction to finaly reach the public defence. I am at the corrections. And it makes me so depressed. I can seam to focus enough. I have to reply to some more questions over and over...the intro is already 50pages what do you want more people! Look for thing up that someone else did almost 10 years ago when the project was started... I am just so drained. It is the last weeks but I find these correction more exhausting and frustrating than finishing the writing of the whole thesis before the deadline. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dssa9u5/"}, "135": {"Subreddit": "PhD", "Author": "mracademic", "Date": 1516145070, "Score": 1, "Body": "This basically sums up my feelings in the run up to, and immediate aftermath of, me leaving my PhD programme to look for something else. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dssf9ji/"}, "136": {"Subreddit": "PhD", "Author": "TotesMessenger", "Date": 1516158631, "Score": 1, "Body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/gradschool] [It is not you, it is me!](https://www.reddit.com/r/GradSchool/comments/7qy0x8/it_is_not_you_it_is_me/)\n\n- [/r/postdoc] [It is not you, it is me!](https://www.reddit.com/r/postdoc/comments/7r21ed/it_is_not_you_it_is_me/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dssriit/"}, "137": {"Subreddit": "PhD", "Author": "CuSetanta", "Date": 1516188522, "Score": 6, "Body": "You sound like the type of PhD student I want to be. It boggles my mind how many hours other PhD students put in, and how they never seem to switch off from the work. I have a shite memory, it takes me hours to put two and two together and figure out how things are related, I am lazy and very easily distracted. Pretty sure everyone knows too, but I can talk my way through a meeting pretty well so that masks my general incomoetance. \n\nI left research once before due to imposter syndrome. I had never heard of it and I couldn't handle the feeling at all really. Now that I am back and a bit older its easier to manage. \n\nIt helps that I have spoken to some very senior professors in a couple places now about it. And they inform me that the feeling never really goes. Knowing that helps me a lot.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r0btf/guiltimpostor_syndrome/dst7kox/"}, "138": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516192477, "Score": 5, "Body": "I hate hate hate imposter syndrome. Hearing that it never goes away makes me really feel bad for myself and worry about how I’ll cope with it. Hang in there OP. I just tell myself to take it one day at a time. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7r0btf/guiltimpostor_syndrome/dst9g0a/"}, "139": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516196684, "Score": 2, "Body": "Sounds like you made a big decision. How are you doing?", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dstc160/"}, "140": {"Subreddit": "PhD", "Author": "mracademic", "Date": 1516197494, "Score": 2, "Body": "I’m doing well. It is such a relief to not be surrounded with journal articles, book, and deadlines anymore. I had been studying law (my field) for five years and I just couldn’t hack another three years of it. I wasn’t getting a lot of money from my institution in terms of scholarship money (I worked it out to be far less than minimum wage in the U.K.) and I wanted to start earning money and doing things with my friends. The PhD, even though I was only doing it for four months, felt like a prison. And I figured that if that’s how I felt about it four months in, it would be stupid to try and persevere with it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dstcmad/"}, "141": {"Subreddit": "PhD", "Author": "bahoo1991", "Date": 1516202518, "Score": 1, "Body": "Hello,\n\nThank you for your feedback. Your suggestions are valid and we will definitely take them into consideration in future surveys/studies. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iq9to/please_help_fellow_phd_students_by_filling_out/dstgvgd/"}, "142": {"Subreddit": "PhD", "Author": "nguyenmackhai", "Date": 1516206042, "Score": 1, "Body": "What part do you \"suck\" at?", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dstkep3/"}, "143": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1516209208, "Score": 2, "Body": "I don't even know what I am terrible at haha, specifically though having trouble with stock solutions and serial solutions at the moment.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dstnqo6/"}, "144": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1516216505, "Score": 4, "Body": "Wrong subreddit. Try r/chemhelp or if that doesn't help r/chemistry.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dstvgnm/"}, "145": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1516226580, "Score": 2, "Body": "I googled practice lab calculations and this looks ok https://www.training.nih.gov/assets/Lab_Math_II_Transcript_-_508.pdf", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dsu64q0/"}, "146": {"Subreddit": "PhD", "Author": "UnspectacularAim", "Date": 1516229242, "Score": 3, "Body": "The only equation you need is C1V1=C2V2", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dsu8x6e/"}, "147": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1516233626, "Score": 2, "Body": "&gt; However, I feel as if I do not do much work compared to others doing a PhD. I do not spend long hours, nor do I obsess about my PhD outside of work.\n\nI struggle to get 20 hours of work a week; what matters is the productivity of your work time, rather than the absolute number of hours. Often (or usually, there have been studies), people who work longer hours are less productive overall than those who work fewer (although probably not down to my level). \n\nJudge by your output: you have three first-author papers, you're doing totally fine.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r0btf/guiltimpostor_syndrome/dsud1ns/"}, "148": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1516234005, "Score": 1, "Body": "Ok thanks, yeah you're right wrong place to post I'll try there.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dsuddiq/"}, "149": {"Subreddit": "PhD", "Author": "Bohemian_Scientist", "Date": 1516243002, "Score": 3, "Body": "I am glad you are doing well now!\nIt is very understandable to leave a PhD program! \nAlthough I got to say that I love science.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dsul6xv/"}, "150": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1516243198, "Score": 5, "Body": "it is just the age old M1V1=M2V2 so if you have a 4M stock of something (M1) and you want the final concentration to be 0.1M (M2) and you want 500 mL (V2) of this new solution you rearrange the equation to solve for the missing variable (V1) so it becomes V1(what you're looking for) = [(0.1M)(500mL)]/4M to give 12.5mL so add 12.5 mL of the 4M original stock to 487.5 of water to make the new solution of 500 mL at 0.1M. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dsulcw7/"}, "151": {"Subreddit": "PhD", "Author": "Doprrr", "Date": 1516248642, "Score": 1, "Body": "Oh, I feel you. Sorry to hear the struggles. \n\nI hope the best and, while i know it means little to someone going through it, there isnt much left to go. Your at the final hurdle. \n\nKeep up the good work and best of luck~ ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ov0g3/comfort_needed/dsupts2/"}, "152": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516250053, "Score": 3, "Body": "I’m glad you’re doing well. It’s really tough to make the hard decisions even though they are the right ones for you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7quxsx/it_is_not_you_it_is_me/dsuqv8c/"}, "153": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1516255899, "Score": 1, "Body": "I think the USA remains a worthwhile target; politics is a consideration, but not significant in my opinion. Apply to Germany in Europe, they have strong PhD programs. Also consider Singapore, which is often overlooked, but is investing in high tech industry.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuuscf/"}, "154": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516259292, "Score": 1, "Body": "Thank you for your suggestion!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuwmg3/"}, "155": {"Subreddit": "PhD", "Author": "dissertationuk01", "Date": 1516261671, "Score": 1, "Body": "If you want to have an online Ph.D. in the UK – then you should remember that this is not an easy way. You have to be hardworking and choose the right online doctoral program for you. It is still required to submit a valid Ph.D. proposal and a Ph.D. thesis to obtain your degree at the end of the program. As there are plenty of options available online, you could get lost. So, you should engage in a bit of research for yourself about your facilities, rates, requirements and what will be provided to you.\n\nThe research project is most times led by the research student, and each Ph.D. student has a monitoring team that is there to provide guidance is projectsdeal.co.uk and reads and comment on the Ph.D. proposal.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pkfxx/is_a_phd_worth_the_effort/dsuxr6y/"}, "156": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516262766, "Score": 2, "Body": "I would consider Germany, the Netherlands, and Switzerland. All three have excellent universities and strong PhD programs, and at the same time, the salary for PhD candidates in these countries is good enough to have a comfortable life and to easily make ends meet.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuy8q4/"}, "157": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516262824, "Score": 2, "Body": "To add: from what I've heard I think Denmark to also be added to this list, although I'm less familiar with Danish universities myself.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuy9ns/"}, "158": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516263198, "Score": 1, "Body": "Never heard about Ph.D options on Nanotechnology in Denmark... But yes I ll search about Danish universities too!!! Thanks for your help!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuyfov/"}, "159": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516263331, "Score": 1, "Body": "Second this. Just make a complete brain dump and write anything that comes to mind at first, even if it is utter bullshit. Then, when reading your turd from start to finish, you'll see some patterns and know what to change to change to make it a little bit better. Now repeat this process of reading and editing until after many iterations finally it is something good. Now you are done.\n\nThe worst productivity killer ever is not starting to write because you don't know anything good to write. It comes from the misconception that good articles are written in one go. Remember that every good paper that you read has been a terrible draft paper at some point.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o1m4q/how_to_get_better_at_writing_papers/dsuyhs6/"}, "160": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516263806, "Score": 2, "Body": "Well... most respected universities (especially universities of technology) have a nanotechnology department somewhere in the university. \n\nJust google \"[university name] + nanotechnology\" will find you those departments. By trying this out for DTU and Aalborg University, two of the most highly respected Danish universities, I found the following department websites:\n\nhttp://www.nanotech.dtu.dk/english\n\nhttp://www.nano.aau.dk/\n\nNow you just need to repeat this for all the universities that you are interested in and find out which of those is currently hiring.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuyp12/"}, "161": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516264137, "Score": 1, "Body": "Oh thank you so much!! \nYes since recent years most of the universities are working something related to Nanotechnology and some universities have exclusive department for the same.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuyu46/"}, "162": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516264991, "Score": 3, "Body": "Since I'm a Duthc guy (working at a Dutch university myself), it was easy for me to make an overview of the nanotechnology labs in the Netherlands. Here you go:\n\nhttps://www.utwente.nl/mesaplus/\n\nhttps://www.tudelft.nl/en/faculty-of-applied-sciences/about-faculty/departments/quantum-nanoscience/14405/\n\nhttps://www.tudelft.nl/ewi/onderzoek/faciliteiten/else-kooi-lab/\n\nhttps://www.tue.nl/en/research/research-institutes/research-institutes/nanolabtue/\n\nhttps://www.rug.nl/research/zernike/research/nanolab_groningen/\n\nhttps://amolf.nl/nanolab\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuz6tn/"}, "163": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516265823, "Score": 1, "Body": "Ok that's a great list.\n I ll check those URLs and I should find out  if I am eligible, like checking the academic criteria and I don't know if they require GRE, TOEFL or any other tests...\n.hoping for the best. Let's see.\nThank you very much for your efforts!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsuzj2z/"}, "164": {"Subreddit": "PhD", "Author": "Every_username_used", "Date": 1516268638, "Score": 2, "Body": "Have you considered Canada?\n\nhttps://uwaterloo.ca/nanotechnology/", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv0mco/"}, "165": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516269005, "Score": 2, "Body": "Yes I have. Infact I am halfway through completing the application for Waterloo University. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv0rh8/"}, "166": {"Subreddit": "PhD", "Author": "replicatorreplicator", "Date": 1516270232, "Score": 2, "Body": "I'd select a university that is in the top 500 in EU or other country that receives most funding for your field. You need to be swimming in grants post phd and there's no point heading to a region, country or uni that doesn't fair well in securing large grants.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv18f0/"}, "167": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516270475, "Score": 1, "Body": "Yeah I ll give a try. But sometimes all this information regarding the grants are not metioned properly which makes it challenging to narrow down the options.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv1boz/"}, "168": {"Subreddit": "PhD", "Author": "Huwbacca", "Date": 1516271135, "Score": 3, "Body": "&gt;6 publications... feel as if I do not do much work.\n\nOh... well I have 0 publications and am expecting to finish this phd with... maybe 1 if I'm lucky and p-hacky.\n\nI'd say you're doing fine :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7r0btf/guiltimpostor_syndrome/dsv1ks6/"}, "169": {"Subreddit": "PhD", "Author": "replicatorreplicator", "Date": 1516271211, "Score": 2, "Body": "Universities love talking about all the funding they receive. If they don't that is something to investigate. Check outside the uni through ARC grants or equivalent grant schemes. You can find out recipients for projects in your field that way. My position is you can do a phd anywhere if you have the right supervisors. I would also select who your superstars are in your field. Superstars meaning most published etc etc. Reach out to them wherever they are in the world. In hindsight, I wish I had also considered my ERC oppurtunities and post doc options at the start of the process. Have fun!! This is actually the best bit as its an exciting new adventure! 😀 (smilie face)", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv1lv2/"}, "170": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516271453, "Score": 2, "Body": "It's hell of a job even to find a Ph.D position 😁. These things don't come easy. Yes I this will be a whole new adventure in my life...\nThanks a lot for your input!!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv1p6j/"}, "171": {"Subreddit": "PhD", "Author": "replicatorreplicator", "Date": 1516272148, "Score": 1, "Body": "This might be an overreach in offering advice, so sorry if it is. Can you put together your own proposal and reach out to potential supervisors direct? I know different fields have different intake procedures. I'm in design/cognitive psych so in a lot of cases potential phd candidates present their proposal to the supervisor for consideration as opposed to responding to an advertised phd position. Although we have those too.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv1yui/"}, "172": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516273100, "Score": 1, "Body": "No no..This is not at all a overreach for offering an advice. It feels I am stuck out, no where to go. So any piece of advice feels like a compass to me.\nTo answer to you, I have reached out to few professors directly. They seldom send a reply. I hardly get any reply from the professsors, and I feel it very awkward to keep reminding them more than twice.\nI know it's a complex process to get into a doctoral study on the area of my own interest, but it is just exhausting even before getting there. \n\nIf it is not too much to ask, can you help me in finding a supervisor who could consider me as his/her doctoral candidate?\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv2c3q/"}, "173": {"Subreddit": "PhD", "Author": "replicatorreplicator", "Date": 1516273822, "Score": 2, "Body": "Okay just keep trying. Great you are in touch with people direct. I am not in your field. I can only offer broad advice about procedural stuff and things I've experienced along the way. Keep persisting though!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv2md1/"}, "174": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516274838, "Score": 1, "Body": "Thanks a lot!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsv31cv/"}, "175": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1516299447, "Score": 2, "Body": "Two of my close friends have just finished. Both have secured short term (3-6 month) contracts to post-doc with their current labs, and both have taken the foot off the gas a little. Working, but in a sustainable way, and not panicking about next steps.\n\nIt just takes time to get over it, really. It's a very stressful time and a huge project.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o2adt/recovering_after_a_phd_uk/dsvn3k7/"}, "176": {"Subreddit": "PhD", "Author": "mrdarksoysauce", "Date": 1516309904, "Score": 5, "Body": "Most of the time, when people say you should never do a PhD without getting into a fully-funded program, they take into account factors such as career prospects after you get your PhD, drop-out rates (so you may not get your PhD), and your overall subjective well-being while writing your dissertation, etc. Honestly, the numbers don’t look very optimistic, so in general, I tend to agree that you should wait for a fully-funded position. Remember, a PhD typically takes 5 years to finish, and those 5 years could’ve been spent on building a very successful career but instead we choose to spend on doing research, writing papers, etc. while getting paid very little, sometimes none at all. \n\nBut there are other considerations to keep in mind too. Do you want to eventually get a job in the academia? If so, your goal should be get into a highly-ranked program, and highly-ranked programs tend to fund you anyway. How much debt do you already have? How much more, if possible, could you bear? If you don’t want to get a job in the academia, how much do you anticipate to make in the industry? How long will it take for you to pay back student loans and live a rather comfortable life?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dsvxz8c/"}, "177": {"Subreddit": "PhD", "Author": "Maraval", "Date": 1516310610, "Score": 2, "Body": "The no-cost option is to have people in your field - hell, in your own department - review your work and make suggestions.  Then you do the same for them.  Like study or reading groups, but for editing and proofreading.  Who else is likelier to understand what you're writing about better than they do?\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7qjbkx/editor/dsvyq9h/"}, "178": {"Subreddit": "PhD", "Author": "Maraval", "Date": 1516310661, "Score": 1, "Body": "Congratulations!", "Permalink": "https://www.reddit.com/r/PhD/comments/7igtxj/i_submitted_my_phd_yesterday_perfect_timing_we/dsvys5z/"}, "179": {"Subreddit": "PhD", "Author": "celt1299", "Date": 1516313200, "Score": 1, "Body": "Those are good points to consider. I finished my undergrad with no debt, so I have that going for me. I don’t expect to pursue a career in academia, but rather as a psychologist in a hospital or other agency, which would enable me to benefit from Public Service Loan Forgiveness or National Health Service Corps. But I can’t be sure those will exist in 6 years, so I’d hesitate to rely on them.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dsw1erm/"}, "180": {"Subreddit": "PhD", "Author": "RupertPhD", "Date": 1516326194, "Score": 1, "Body": "What department are you in? what kind of engineering?  \n  \nIs your project experimental or theoretical?  what kind of data are you collecting? are you not successfully collecting the data you need?\n  \ni recently finished my phd in engineering on a series of experimental projects and i found that sometimes my projects tended to stall at times until i overcame some methodological hurdle that allowed me to get trustworthy data in a reasonable time frame.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7qxmza/stuckness_confusion/dswdekj/"}, "181": {"Subreddit": "PhD", "Author": "ArtDecoBees", "Date": 1516339820, "Score": 3, "Body": "Seriously consider how willing you are to go into debt. You are not going want to work a job (not related to career goals) while doing graduate work. Stipends pay you for work that will eventually be an asset to your career, and your supervisor is usually very understanding of the fact that you have classroom obligations. For instance, I work 15 h a week max (as per my contract), doing laboratory work for my stipend. The lab work will go on my CV, and I am told without a doubt to focus on my school work before my lab work. Very rarely do I work my full 15 hours a week but I still get paid my full stipend. Now think of an outside employer. Will they respect your school obligations? Can you afford to miss work and not be paid? \n\nTaking out loans for living expenses is no joke. Think about it very carefully before you commit. You’re looking at 4-5 years. Is that sustainable to take loans and/or work full or part time and sill meet your school obligations? Will you get partway through your program and have to drop out due to living expenses? Can you take the mental stress of knowing you’re taking living expense loans (that would personally stress me out very much)? \n\nOnly you know what’s best for your situation. I have clinical PsyD program friends and I know how scarce fully funded clinical psych PhD/PsyD programs are. I can appreciate your dilemma. Good luck, my friend \n\nEdit: I should mention I have full tuition reimbursement, healthcare, and stipend. I kind of misread your initial post, where you say you are offered some stipend but little tuition reimbursement. I think my points still matter a bit so I won’t delete this post ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dswo7ol/"}, "182": {"Subreddit": "PhD", "Author": "Jab_91", "Date": 1516358482, "Score": 1, "Body": "Fair enough, thanks for your response. I'm actually feeling a lot more like myself. Have got started on the suggested revisions and also looking at applying for some jobs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7o2adt/recovering_after_a_phd_uk/dswwyes/"}, "183": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1516364464, "Score": 1, "Body": "If you can come up with a specific example eg \"I have x mL of y% ABC solution and I need to make it z%, how do I do it?\", try posting on r/chemistry or even r/homeworkhelp", "Permalink": "https://www.reddit.com/r/PhD/comments/7r20w8/i_suck_at_dilution_chemistry/dswzm0o/"}, "184": {"Subreddit": "PhD", "Author": "_FitzChivalry_", "Date": 1516413807, "Score": 14, "Body": "You are insane.\n\nI am in the final stages of my doctoral candidature (clinical pharmacology), which has now stretched out to 6 years overall (including upgrading from an MPhil and dropping to part-time at the 4-year mark), and it has all but killed me. I'm now in my early 30s and have no money, and have been a perpetual student with part-time jobs living independently from parents for nearly 3/4 of a decade.\n\nI would never do this again; if I had my time again I would get into investments and finance. Money makes money, and no one gives a damn about science in Australia.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsy7zp4/"}, "185": {"Subreddit": "PhD", "Author": "_FitzChivalry_", "Date": 1516413960, "Score": 2, "Body": "Europe - avoid America and Australia.\n\nAustralia has a terrible reputation now for working international students like workhorses, and your supervisor won't help you at all, and expect you to teach yourself everything.\n\nI hear that Switzerland and Germany are the best.", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsy83r6/"}, "186": {"Subreddit": "PhD", "Author": "_FitzChivalry_", "Date": 1516414023, "Score": 1, "Body": "You're being interviewed by clinical psychologists - hopefully they understand anxiety and make you feel comfortable!", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dsy85du/"}, "187": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516417628, "Score": 1, "Body": "Thank you for your suggestion... I ll drop the plan of considering Australia and will look more on to Swiz n Germany!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dsyasmv/"}, "188": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1516418439, "Score": 6, "Body": "I was 43 when I started my doctoral program. One of my cohorts was only a few years younger and travels 3 out of 4 weeks per month (sometimes more) and he finished it a bit before me.   I am a strong proponent of continuing education.  Other than a desire to teach, I had no professional drivers.  My journey was mostly personal and I wanted to prove to myself I could do it.  With that said...\n\nIt is possible to do, but you will need drive and dedication, as well as excellent time management skills to complete it with so much travel.  If you want to chat with someone, pm me and I'll give you my phone number.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsybdh8/"}, "189": {"Subreddit": "PhD", "Author": "fracking-awesome", "Date": 1516418463, "Score": 1, "Body": "similar. almost 50. working at the university I'm doing a phd at. coursework done, starting candidacy. if it's something you want to do, do it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsybe4j/"}, "190": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1516420815, "Score": 2, "Body": "Why the hell not?  I say go for it. I’m 40 and in my 3rd year, working full time with a family. It can be done. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyd30y/"}, "191": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1516431437, "Score": 2, "Body": "One of my colleagues is 40-50, doing a PhD part-time (Australia), and he's really loving it. He's not doing it because he needs to, but because it's something he's always wanted to do and he's at the stage of his life where he's secure enough to do it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyjke0/"}, "192": {"Subreddit": "PhD", "Author": "Nylonknot", "Date": 1516432386, "Score": 3, "Body": "I’m 44 and just started last quarter. It’s exhilarating for me. \n\nIn 5 years you will be 45 whether you go this or not. If you want it, do it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyk06x/"}, "193": {"Subreddit": "PhD", "Author": "SamuraiBrz", "Date": 1516432758, "Score": 13, "Body": "The main problem I see here is wanting to do rigorous research with a PhD online while working.\n\nOk, if you follow that road, I guess you can have a PhD in the end. If that can really be considered a PhD, and if that really prepares you to do rigorous research, are another matter. Many online PhD programs do not have academic recognition and are often considered borderline illegal (more like a scam than a real PhD). I don't know what school you are aiming, but you should really check if the faculty are able to publish in top journals and about the quality of their placement. Be careful to not spend years doing something that is worth nothing. \n\nI'm 44 years old, doing a PhD in Quantitative Marketing, also after an MBA and MS. I did my MBA and my MS while working. I really don't see how a real PhD can be done with quality in your situation. \n\nAnd I don't know about other fields, but in Business I believe any PhD program which is worthy the name has the tuition completely waived and the school will actually pay the student. Because a PhD is like a job, I work for the university. That's the way to learn, working as a newbie researcher. Just the fact that you have to pay for this degree sounds very fishy for a PhD in Business.\n\nJust to give an example, George Washington University has been severely criticized for their online PhD. Only two full-time faculty members for 220 PhD candidates can't really be taken seriously. This is no way to a rigorous research.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyk6ao/"}, "194": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516433560, "Score": -6, "Body": "It's at Texas Tech and is a regional accredited program. You have to pay because you are going to school. People in your situation don't pay because you don't have a job and you work on campus. I will be working full time making a lot of money. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsykjgn/"}, "195": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1516433946, "Score": 2, "Body": "I'm in the last week of my PhD (well, defense is scheduled for next Friday anyway) and nothing you're feeling is out of the ordinary. Engineering students are asked to understand a pretty broad set of material up through their MS up until they start their PhD, then all of a sudden you have to learn one small area of one field so well that you're an expert. That's actually a pretty daunting task.\n\nIt sounds like you're really overthinking things, so try to simplify your work tasks more. What made me successful was following my advisor's advice of simply learning something new everyday. It seems like one thing you can do right away is to read a lot of journal articles. When you find one you like, read it, then summarize it. If you find certain parts of it interesting, explain it in your own words. If the journal article left something to desire, then follow the references. Finally, if you know how to repeat the experiments they performed, and you have the tools, then try to do so yourself.\n\nAlso, how is your research funded? That should also help to give you some guidance at least on where to start. Focus on taking small, consistent steps. You can't have a major breakthrough without some bit of luck and persistence.", "Permalink": "https://www.reddit.com/r/PhD/comments/7qxmza/stuckness_confusion/dsykpo4/"}, "196": {"Subreddit": "PhD", "Author": "SamuraiBrz", "Date": 1516434990, "Score": 3, "Body": "Do you have a list of faculty who might be your advisor if you get accepted for this program? I didn't find it at the website, and that's really one of the most important information to evaluate the program. And the way I see it, a PhD IS a job, you're not really a student anymore. I did have a job, I left it to do a PhD. The coursework is one of the least important things for a PhD. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyl5t4/"}, "197": {"Subreddit": "PhD", "Author": "Bluehusky", "Date": 1516436140, "Score": 3, "Body": "I’m only 28 so I can’t say what life is like at 40. But, I am doing a PhD now. So I would say go for it! Learning is lifelong and a you can make a PhD fun if not enjoyable. Best of luck to you", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsylmji/"}, "198": {"Subreddit": "PhD", "Author": "scruffy_Looking_", "Date": 1516437987, "Score": 1, "Body": "Where are you planning to do your online PhD? I'm also interested in doing one, just finished an MS in systems engineering, and I'm also 40.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsymc87/"}, "199": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1516441939, "Score": 7, "Body": "&gt; You have to pay because you are going to school. People in your situation don't pay because you don't have a job and you work on campus. \n\nWe understand this, but that doesn't make it any less dodgy.\n\nWhile they are called PhD _students_, the vast majority of the work has very little to do with real studying. Being 'good in school' will _help_ (as it will help with anything you do), but it is not nearly as relevant as you seem to think.\n\nBottom line here is; your motivation. On the one hand you want to do it for the personal achievement. That's commendable, don't misunderstand me. But on the other hand you seem to have chosen the most borderline legal PhD program. If you ever mention 'online PhD' nobody with a research PhD will take you seriously. This leads back to your motivation; _why_ do you want to do it? \n\nImagine if your personal motivation is to walk the Appalachian trail. However, instead of walking the trail. You elect to walk a portion and be carried the rest of the way. You can do whatever you please, but at this point are you really living up to your personal motivation or are you indulging in a vanity project?\n\nYour age is not a problem. At all. But your motivation and mentality _might_ be. Of course I'm only a stranger on the internet and I don't really know you, so I could be completely off the mark etc.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsynso5/"}, "200": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1516444967, "Score": 4, "Body": "That sucks! I’m sorry that you’re experiencing a set back. You got this though!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dsyouht/"}, "201": {"Subreddit": "PhD", "Author": "evenlandlocked", "Date": 1516446401, "Score": 4, "Body": "What's your home life look like? You mentioned wife, do you have kids? My husband affectionately refers to me as his GSW (grad school widow) and it's kind of true sometimes. It can be a real time suck, especially when you get to dissertation work. Between that and traveling, I doubt you'll see much of your wife.  If that's something your home life can bear, and it really feels like something you need to do, then best of luck to ya!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsypcd8/"}, "202": {"Subreddit": "PhD", "Author": "overthemoo", "Date": 1516447241, "Score": 7, "Body": "This is good advice. If you don’t know too tier journals in your field, research a little about impact factor. Also, as a 5th year doctoral student, I would not advise anyone to go part time or online for their PhD. It just doesn’t add up. A PhD isn’t a degree that depends on completing coursework. It is a lifestyle change that reshapes how you consider the world. This requires immersion into courses, research in your field / a lab or a research team, hours of reading in your field outside of classes, and travel to conferences in your field to network and learn (4-5 times a year?). I don’t know how you could do all this and work a 9-5. \n\nI’m in education we have something called an ED. Which is like a professional version of a PhD that is less research based and more practical to improving ones practice. Do you have something like that in your field? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsypmtk/"}, "203": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516450786, "Score": 4, "Body": "This is terrible! But you can get there. Considering you’ve pretty much gotten here on your own you have the ability to turn this around in your favor. Also, if you disagree with your advisor’s opinion, don’t be afraid to say it. You are 42 days away from being an independent investigator, gotta stand firm now.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dsyqxex/"}, "204": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516451103, "Score": 2, "Body": "I’m 30 and I just started my PhD. There will always be reasons not to. But you already have people telling you that you shouldn’t. You posted here anyway because you want someone to tell you that you should. \nYou should take a shot at it. If , a few months later, you feel that it’s too much and you can’t handle the stress etc., you can quit. No one can take that what you learned away from you. At this point you have nothing to lose. It’s a fully paid ride, what’s there to think about?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyr1w5/"}, "205": {"Subreddit": "PhD", "Author": "TheAxeC", "Date": 1516451565, "Score": 9, "Body": "A PhD is a job, you work, you do research. \n\nYou sound quite condescending.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyr8ih/"}, "206": {"Subreddit": "PhD", "Author": "abighazard", "Date": 1516453471, "Score": 2, "Body": "I'm the same re the poor memory and short hours (although I am part-time). I don't understand how people can recall and discuss papers so easily - I just can't retain it all, it makes me feel like a fake. But then again, I'm pretty sure nearly every PhD student must experience impostor syndrome, and it sounds like you are doing well with your publications. You are probably being just as productive as the others (as if you weren't, your supervisor would have told you by now)!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r0btf/guiltimpostor_syndrome/dsys2nt/"}, "207": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1516455061, "Score": 2, "Body": "However, if OP is serious about it, he should investigate whether he'll be on the hook for reimbursing costs should he withdraw, or change jobs part way through etc.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsysufs/"}, "208": {"Subreddit": "PhD", "Author": "mdarlinglove", "Date": 1516461278, "Score": 4, "Body": "You can do this! =) Congratulations on your position in Academia.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dsywixp/"}, "209": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516465995, "Score": 1, "Body": "Texas Tech", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyzrz6/"}, "210": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466086, "Score": 2, "Body": "Well I have high school aged kids.  The age where they don't really want to hang around with Dad and what to be out with their friends.  My wife is used to me going to grad school and honestly, she says I am better to be around when I am working on something than when I am bored out of my mind.  :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyzuei/"}, "211": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466215, "Score": 1, "Body": "No, this is exactly right.  If I do it, the worst case is that I find out it is not for me and I have learned a lot while I was doing it.  I guess I am more concerned with the negative aspects of working towards this such as peer impact at work, but that is very specific and I work with a lot of smart people that don't want to think that there are other people smarter than them....", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyzxx8/"}, "212": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466279, "Score": 1, "Body": "Good point and no.  I just finished my MS in December and work paid for the whole thing.  I could have quit the day after graduation and I would not have to reimburse anything.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsyzznd/"}, "213": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466335, "Score": 1, "Body": "Good for you.  The only reason I can't get this whole idea out of my head is that I know that starting at 40 is better than starting at 41, or 45, or 50.  The longer I delay, the longer before I finish.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz014f/"}, "214": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466640, "Score": 1, "Body": "I think that you misunderstand my statement. It is not an attempt at being condescending.  PhD programs are funded for people that do not have a job, nor means to pay for the degree.  That funding is not reserved for people that are working making over $100K.  That would be stupid as the people not working need to financial support to survive while in school whereas the people working do not.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz097l/"}, "215": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466753, "Score": 1, "Body": "Is your comment \"the most borderline legal PhD program\" directed specifically at this program at Texas Tech based on what you saw when you looked into it, or is it just assumed based on my brief description of the program?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz0c4a/"}, "216": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516466938, "Score": 1, "Body": "Is this not that list?\n\nhttps://www.depts.ttu.edu/ieweb/faculty/\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz0gwu/"}, "217": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516467119, "Score": 1, "Body": "What program and at which school?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz0lju/"}, "218": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516467181, "Score": 2, "Body": "This is awesome advice and just the way I am approaching this.  I don't have anything to lose here really, other than time that I spend sitting on my ass watching TV or playing video games.  I will miss that though.  :)\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz0n5v/"}, "219": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1516467969, "Score": 3, "Body": "I usually refer to them by their full name the first time I mention them in a chapter, from that point on I refer to them by their surname for the rest of the chapter.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rpvda/referring_to_scholars_surname_or_full_name/dsz17rn/"}, "220": {"Subreddit": "PhD", "Author": "IIRoachII", "Date": 1516472661, "Score": 12, "Body": "Make a wall or something with 42 Post-Its and rip them down as you go! You’re almost there, just keep pushing! You got this!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dsz4tfa/"}, "221": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1516474327, "Score": 2, "Body": "Purely your description. I am not actually familiar with that specific program/", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz6670/"}, "222": {"Subreddit": "PhD", "Author": "SamuraiBrz", "Date": 1516477898, "Score": 4, "Body": "It seems you are the one misunderstanding here. You really seem to think a PhD is a degree like a MS, where you are a student and so you may try to get financial support because you don't have the means. No. It is a job, as many here are saying. You learn mainly by working, not by studying. And usually you get paid for jobs, it doesn't matter if you need financial support or not. If you get hired for a job, will the firm decide to not pay you a salary just because you have money and have another job? It doesn't make sense to me.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsz91pu/"}, "223": {"Subreddit": "PhD", "Author": "SamuraiBrz", "Date": 1516479235, "Score": 2, "Body": "I don't know. It's a list of the faculty, but I don't know if they are the ones who might be your advisors for this program. If I were in your shoes, I would contact the professor from that list that seems to be most closely related to your research interests and check. Anyway, no matter what you decide to do, you should do a good research about the specific program you have an interest. That's the same for anyone interested in a PhD. I'm not questioning Texas Tech, or its faculty, but the program. There isn't enough information to evaluate this specific program right now, some of the information we have seen so far doesn't look good (it looks more like an MS than a PhD, talking much more about coursework than research). Unless you are fine with a PhD even if it doesn't help with your goals, because you think you have nothing to lose. I'm assuming here that the goal of being able to do rigorous research is important, that's why I'm questioning it a lot. After all, if you want to be rigorous in a research, you should start being rigorous now. I'm not young either, I wouldn't want to spend years with something that doesn't help with my goals, to then have to try again when I'm even older with a program that is really suited for my purposes.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dsza39u/"}, "224": {"Subreddit": "PhD", "Author": "80b", "Date": 1516479320, "Score": 2, "Body": "Congrats. But i think how you recover depends on what's next. Becoming an academic? post-doc? non-academic? Each has it's own concerns.\n\n* /r/Professors \n* /r/postdoc \n* /r/Nonacademics", "Permalink": "https://www.reddit.com/r/PhD/comments/7o2adt/recovering_after_a_phd_uk/dsza5ls/"}, "225": {"Subreddit": "PhD", "Author": "scruffy_Looking_", "Date": 1516480328, "Score": 1, "Body": "Out of curiosity, how did you choose Texas tech? Did you had other candidates in mind? Message me, if you prefer. Want to compare notes.\nThanks", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dszayb3/"}, "226": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516480433, "Score": 1, "Body": "Since you are a PhD student and I'm just exploring options let's assume you know more about it than me. I'm trying to figure things out. Thank you for your input. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dszb17v/"}, "227": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516481879, "Score": 2, "Body": "Thank you ! I love this idea :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszc7mf/"}, "228": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516481908, "Score": 1, "Body": "Thank you for your support or actually means so much !", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszc8il/"}, "229": {"Subreddit": "PhD", "Author": "cate87", "Date": 1516481988, "Score": 2, "Body": "Just do the best you can in the time you have. If you’re confident in everything else, the lit review is not something that will make or break you if you’re able to talk confidently around it in the defence. \n\nHow long will you have between submitting and defending? You can continue to work on the thesis and bring a list of corrections with you. If you feel there are any weaknesses, use the time to come up with as good a defence as you can. You’ll be fine!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszcb07/"}, "230": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516481990, "Score": 1, "Body": "This is true ! I have never been good at standing up for myself but I do know my research. I am going to do a brutal examination of what I have today and put forward a document on what it non negotiable about removing :)\nThank you !", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszcb28/"}, "231": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516482046, "Score": 1, "Body": "Thank you for your support ! Reading everyone’s comments this morning has given me the motivation I need to feel like I can do this !", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszccuj/"}, "232": {"Subreddit": "PhD", "Author": "hollowar1", "Date": 1516482108, "Score": 3, "Body": "What OP said!  From what I read, it is only time. I am in a similar situation. Director at a Fortune 100, 44 this past year, family, MBA, etc, etc, etc. I have a super supportive family!  I have been in my program for a little over 3 years. I can see the light as I am in my dissertation phase. \n\nThis degree checks several boxes off the life list. 1) love learning, 2) dr. 3) enables me to teach grads later in life.  A few of these and more help motivate me. I also can beat both of my parents with their educational achievements. I do not want to be in corporate forever. Consulting and teaching is what I see for that second life.  \n\nTime management is the key. It is more research, skimming, and synthesis. As most people have said, it is a different kind of education. My wife works for an airline, so the retirement plan is teach and travel. This journey has been one of the most stressing yet valuable times in my life. I suspect being in my 40’s helps the context to enable appreciation. Good luck on whatever you choose. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dszcerh/"}, "233": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516482155, "Score": 2, "Body": "That is good advice. I am in Australia so we do not have a defence. We submit our thesis for examination and then we receive comments back from the examiners to address. I am confident that I can address and weaknesses within the research but I like your idea of identifying weak areas now. Thank you :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszcg6u/"}, "234": {"Subreddit": "PhD", "Author": "Nylonknot", "Date": 1516483376, "Score": 1, "Body": "It’s what my wise Mama said to me when I was nervous about going back last year. And that’s all I had to lose too. Haha! Best wishes to you!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dszdhu1/"}, "235": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516494098, "Score": 5, "Body": "True. One big thing that I hate about being in a PhD program is imposter syndrome. I haven’t met anyone (except some douchy people) who doesn’t go through intense self doubt during their PhD. The only advice I can give you is that if you’re going to regret not taking this chance on yourself, then you should take this shot- If the pros outweigh the cons. People will always have something to say. If I had a publication for every person who has commented on my still being in school, I’d be the youngest person to win a Nobel Prize. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dszmh7e/"}, "236": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516494262, "Score": 2, "Body": "You’re welcome! Just to give you fair warning, academics are egomaniacal pricks so tread carefully when you enter that discussion.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszmlvo/"}, "237": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516498567, "Score": 1, "Body": "Haha I am well aware of that at this point !", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszq194/"}, "238": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1516499831, "Score": 3, "Body": "You can absolutely do it. You can do SO MUCH in 42 days. \nYou can do it. You can do it. You can do it. You can do it. You can do it. DO IT. \n\nref: end stage PhD solidarity ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dszr0vw/"}, "239": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1516514503, "Score": 2, "Body": "Depending on the politics of your department and institution, I wonder if you might reach out to a trustworthy senior faculty member and ask for advice on how to proceed. If you've been asking for feedback in good faith for TWO years and they're just not asking you to substantially revise the thing with 42 days left... that's a failure on their part. I wonder what protections might exist for you in the event that they come down hard. \n\nThe best dissertation is a FINISHED dissertation and you're almost there! Remember that in a few months this will all be over.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dt01sqi/"}, "240": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1516517611, "Score": 2, "Body": "What writing style does your school require? MLA, APA?  Each style will have guidelines on how to handle referring or citing an author.  For example, [here](http://blog.apastyle.org/apastyle/author-names/) is a blog talking about referencing a name in APA format.\n\nBtw, I highly recommend a Word or OpenOffice plugin for helping with your styling.  I used one from Reference point Software (I believe it was www.referencepointsoftware.com if you are interested) but there are other ones out there as well.  It really took the formatting stress off and helped me focus on the work.  It also helped at the later stages because I didn't have to go back and reformat everything at the end.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rpvda/referring_to_scholars_surname_or_full_name/dt03jic/"}, "241": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516534861, "Score": 2, "Body": "Thank you ! I needed this :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dt0afqa/"}, "242": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1516534923, "Score": 1, "Body": "I use MLA - never really thought of checking out the style guide on this issue so I will do that! \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7rpvda/referring_to_scholars_surname_or_full_name/dt0aghz/"}, "243": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1516534957, "Score": 1, "Body": "I have thought about talking to the people at the graduate research center but at the same time I just need to get this done and I feel like following up with someone may result in unnecessary drama. But it is good advice and worth considering after I submit so it doesn’t happen to others", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dt0agyd/"}, "244": {"Subreddit": "PhD", "Author": "Regemony", "Date": 1516539094, "Score": 12, "Body": "Hey it's late here so I'll reply tomorrow with some more thoughts. Right now all I can say is this:\n\nDon't compare yourself to others. It's almost impossible but everyone thinks everyone else is bright, especially in their own field.\n\nSecond, a PhD is there to learn how to be  researcher. Don't expect to be an expert a year in. Take every bit of knowledge and technique you can.\n\nI feel the same as you and I've learned some harsh lessons the wrong way  (even burning out and taking a break for 6 months). Best advice is just to do it at your pace, keep to your supervisors expectations and get through your PhD, significant results or not. Maybe afterward you can do what drives your passions. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt0c3ej/"}, "245": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516548201, "Score": 1, "Body": "All too aware, I’m sure. Good luck! Only 42 more days of this!!!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dt0h5pv/"}, "246": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1516551744, "Score": 2, "Body": "Agree with above commenter. Don't compare yourself to other people. \n\nI know that's hard to do and I do it myself. I'm almost finished my PhD now and still feel like an imposter with a really narrow level of expertise. It always seems like everyone else in my general area is so knowledgeable about the wider field than me, but to be honest I don't want to and don't have time to focus on the wider picture right now. And to be honest, I'm pretty sure they feel the exact same about me. I know more about different theories than they do etc. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt0jugl/"}, "247": {"Subreddit": "PhD", "Author": "a4k04", "Date": 1516554753, "Score": 5, "Body": "Feeling like you don't belong and feeling like everybody else is doing 'better' or 'more impressive' work than you is incredibly common in PhD programs across all fields. \n\nOne of the single most important things I've ever learned in my life is that you should never compare your private feelings / work ethic / thoughts / anything to another person's public feelings / work ethic / thoughts / anything. \n\nI can almost guarantee you those people who appear to be extremely knowledgeable in some topic are completely lost in another topic they should know about. Those people who sit there for 14-16 hours 'working' aren't really doing that, they just know how to hide their down time. Of course there's exceptions to this, there are some truly exceptional people out there, but they're rare; we're all humans and very few people can spend 12+ hours a day putting 100% effort into something. \n\n6 months ago I figured out how to find a balance in my life between research / learning / down time and importantly, time to get into the gym and time to sleep. Some people were initially taken aback when I stopped immediately answering emails and started saying no to 'hey I've got this idea, should be quick to test out' (but really a 2 month side project). Not surprisingly, if you give it some thought, my research improved. \n\nIf you've found yourself in a PhD program then some people with a lot of experience judging the academic abilities of thousands of applicants felt you *could* be there. What this means is it's up to you to decide if you *should* be there. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt0mcsc/"}, "248": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1516555855, "Score": 2, "Body": "It sounds like you're pretty set on it. Given your situation, there is no harm in signing up but you should be aware what you're in for. \n\nFor most students, completing a PhD takes 4+ years of full time effort, with no additional professional obligations. Being good at coursework has very little bearing on how you'll perform in a PhD program, since its mostly about doing original research. \n\nAnyway, I get the \"personal satisfaction\" angle since that's more or less why I'm completing my PhD at this point. But just be careful to keep an eye on yourself, since it can really wear a person down over enough years.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt0naor/"}, "249": {"Subreddit": "PhD", "Author": "TheCharmQuark", "Date": 1516559191, "Score": 2, "Body": "I agree with the other commenters. You've done incredible work but it's very common for all of us doing PhDs to start comparing ourselves to others and thinking we don't know as much as they do.\n\nSome practical things:\n\n1. Make a note of all the things that *have* gone well and keep them somewhere you can see it. Or at least look over it regularly. What you did in the first few months deserves to be written across the sky by a plane, because most people have still got no idea what they're doing in the first few months (I'm in the humanities, so my experience may be slightly different).\n\n2. Keep a *realistic* diary of what you expect to do every day. Taking breaks and spending time on your hobbies is GOOD, and HEALTHY. There's this idea in academia that the only way to succeed is to be obsessive and never take breaks and that's the quickest route to burnout.\n\n3. It might be useful to have a chat with your supervisor, or academic pastoral advisor (if you have one). Go over what you have achieved and what you can show when you do your presentation. It might be that what you imagine you have to produce and what they actually expect you to produce are two different things.\n\n4. Does your institution have a counselling service? Or is there somebody you can lay out your progress and ask if it's good or not. Sometimes having an external perspective to remind you that you don't have to save the world in the first month can be really helpful.\n\nFrom what I can read, it sounds like you've made incredible progress in the first year. You've published results, you've published updates to those results, it's okay if you publish fast to have to error correct. PhDs are super frightening (this is my second, and it doesn't actually get much easier), and maybe the boredom and fear is simply because the feeling you're never doing enough is stealing your pleasure in what you do.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt0q8bf/"}, "250": {"Subreddit": "PhD", "Author": "TheCharmQuark", "Date": 1516559577, "Score": 2, "Body": "I reached this point on my first PhD where everything I did for my supervisor was critiqued and I was supposed to change it this way or that way.\n\nIn the end, I submitted, ignoring his last set of suggestions and it was fine. It turned out that what I thought were a set of orders on how my work should be written were just suggestions.\n\nOne thing I did do was hand my thesis over to a fellow PhD who'd just passed her viva. She gave me a few great tips. She also let me take a look at hers. We did totally different things but a reminder of how to write clear, punchy arguments was an awesome thing.\n\nCongratulations on your new position, and I know this is uber hard, but I reckon you can do this. Step back from it, look for some resources that aren't your supervisor to help you along, and you might get a fresh perspective that helps you write it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/dt0qkx2/"}, "251": {"Subreddit": "PhD", "Author": "TheCharmQuark", "Date": 1516559772, "Score": 2, "Body": "If you want to do it for personal achievement, YOU DO THE THING!\n\nI did a PhD in my 20s. I'm doing another one now, and I'll be 40 this year. It hurt like hell but I loved it, so I'm doing it again.\n\nWe have people in our department who've done PhDs while also working. If you are good at planning and time management, it'll be tough but fine.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt0qr87/"}, "252": {"Subreddit": "PhD", "Author": "TheCharmQuark", "Date": 1516560209, "Score": 1, "Body": "I'm going to 40 this year and I'm doing my second PhD, fully-funded. The answer to \"You're still in school?\" is \"HELL YES.\"\n\nEspecially if it's your dream program. I know it's scary, but it is also awesome.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ojpz8/left_my_phd_got_accepted_into_my_dream_program/dt0r59h/"}, "253": {"Subreddit": "PhD", "Author": "jwolstenholme", "Date": 1516581825, "Score": 1, "Body": "You can do a Masters by Research (or an MPhil) which is essentially a one (or two for MPhil) year research project which is like a mini PhD, enabling you to publish and conduct your own project. \n\nConsidering you already have a Masters, this may not be the best choice for you, however it is a good way to introduce research!", "Permalink": "https://www.reddit.com/r/PhD/comments/7s16bz/xpost_rslp_research_outside_phd/dt1cstc/"}, "254": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516586639, "Score": 1, "Body": "What if you already have a job that earns you a lot of money and you wanted to get a PhD for personal accomplishment?  Best of both worlds?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt1hii0/"}, "255": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516586886, "Score": 2, "Body": "This is awesome.  We have a lot in common.  Congratulations on getting this far!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt1hqyd/"}, "256": {"Subreddit": "PhD", "Author": "slightlydainbramaged", "Date": 1516587010, "Score": 1, "Body": "Well, I am in Texas, so I get in-state tuition.  My wife is a Texas Tech alumni, and this program meets my needs.  I don't want to quit my job as my family and I are used to a certain way of living.  This program seems to be able to allow me to keep my job and earn a PhD in a program that interests me.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt1hvbf/"}, "257": {"Subreddit": "PhD", "Author": "_FitzChivalry_", "Date": 1516590133, "Score": 1, "Body": "I would say then, that you have nothing to lose. If the PhD starts affecting your job and personal life, you can guilt-free quit and move on unaffected. \n\nSorry that I'm so negative and jaded; my journey has been less than pleasant.\n\nSunk-cost fallacy has kept me on this track for the most part!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt1ksqe/"}, "258": {"Subreddit": "PhD", "Author": "suusgerritsen", "Date": 1516591592, "Score": 2, "Body": "This is so common. Google ‘impostor syndrome’. Everyone in my department has it ;) (not kidding). Your colleagues, who seem to be brilliant probably do too, Academia is not a very transparent and open world, so not many people might admit it, but everyone deals with insecurities. Promise!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt1m0v6/"}, "259": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1516607586, "Score": 2, "Body": "Slightly late reply, but I think the following list pretty much sums up the best universities of technology in Europe. Probably most of them offer something related to nano.\n\nhttps://en.wikipedia.org/wiki/Conference_of_European_Schools_for_Advanced_Engineering_Education_and_Research", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dt1w6xj/"}, "260": {"Subreddit": "PhD", "Author": "WikiTextBot", "Date": 1516607596, "Score": 2, "Body": "**Conference of European Schools for Advanced Engineering Education and Research**\n\nThe Conference of European Schools for Advanced Engineering Education and Research (CESAER) is a non-profit association of leading engineering universities in Europe. CESAER was set up on May 10, 1990, with headquarters in Leuven, Belgium. The main objectives are to provide high quality engineering education in Europe and to improve links between association members in research, as well as postgraduate and continuing education.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/PhD/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^| [^Donate](https://www.reddit.com/r/WikiTextBot/wiki/donate)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dt1w73f/"}, "261": {"Subreddit": "PhD", "Author": "vijaya27", "Date": 1516608620, "Score": 1, "Body": "Never thought there would be a wiki page for this!! Thank you so much!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7r7och/confusion_over_choosing_a_phd/dt1wmyv/"}, "262": {"Subreddit": "PhD", "Author": "maalbadri", "Date": 1516639386, "Score": -2, "Body": "Would probably be misinterpreted as needy behaviour and discourage them from accepting you. Your conversation with the potential supervisor should have 0 bearing on being accepted. In fact, were it important at all to have investigated possible projects/supervisors, you would've been asked about it during the interview.  Good luck. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2f1dp/"}, "263": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516639581, "Score": 1, "Body": "Thanks for your reply!!\n\n\nThat's what I was thinking too, but I was encouraged by my co-worker (who has been on grad school admissions committee before) to send an email to let them know that... Should I still just send a thank you email without mentioning the potential supervisor?", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2f8jf/"}, "264": {"Subreddit": "PhD", "Author": "maalbadri", "Date": 1516639717, "Score": 0, "Body": "You're welcome. \n\nThank them for what exactly?", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2fdjx/"}, "265": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516639885, "Score": 1, "Body": "Well, for the interview.\n\n\nI was thinking of it as a job interview - as I always sent a \"Thank you for the opportunity to interview for the position...\" email to the prospective employer after the interview.\n\n\nIs it a less common practice for PhD interviews? This is the first time I had to interview with a panel for a graduate program.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2fjs7/"}, "266": {"Subreddit": "PhD", "Author": "maalbadri", "Date": 1516640810, "Score": 1, "Body": "Yeah deffo not the right thing to do, maybe thank them after you're guaranteed a position. You've done all you can now, forget about it all and just wait until you hear back.\n\nOut of interest, what country are you applying in and in what discipline?", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2ghwg/"}, "267": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1516641080, "Score": 0, "Body": "I agree with the other guys! Don't over do it and be yourself", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2grtd/"}, "268": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516641207, "Score": 2, "Body": "Thank you :-) I guess I just have to sit tight and wait.\n\n\nI applied for a PhD program in Population &amp; Public Health in Canada. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2gwjx/"}, "269": {"Subreddit": "PhD", "Author": "maalbadri", "Date": 1516641289, "Score": 2, "Body": "Aha very nice, best of luck! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2gzka/"}, "270": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516641326, "Score": 2, "Body": "I disagree. If you really want to get into this program, you will go above and beyond. Talking to a professor who took the time to talk to you and not only that, you convinced them that you were worth their time. That deserves to be mentioned. \nMost programs will allow a potential supervisor to influence your acceptance into the program and it is always always considered a plus that you have had some sort of a conversation with professors in the program. \nEmail. And phrase it so that you can say you enjoyed speaking with the director as much as you enjoyed speaking with X professor. I also recommend emailing said professor and tell them that your interview is over and that you’re excited and hope to have the opportunity to work with them. Gotta go after the things you want, OP!", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2h0yj/"}, "271": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516641599, "Score": 1, "Body": "Thanks for your feedback!\n\n\nI do understand that I might seem a bit too needy and desperate which is why I am hesitant to send that email. As you suggested, I was also going to send an email to the potential supervisor as well.\n\n\nI am just worried that this will reflect negatively on my application if they think I am trying to unfairly influence their decision by sending them an email after the interview...", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2hb4o/"}, "272": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516641955, "Score": 2, "Body": "Well would it be so bad if they thought that? It shows tenacity and it wouldn’t be unfair, would it? You’re not emailing and just name dropping. You’re going to tell them that you have proactively worked toward this and there is no reason to reject your application. I don’t know that anyone would be rejected over one, follow-up email. \nUltimately, if you don’t send that email, i would regret it if the outcome is not in my favor and I didn’t do everything I could, within reason, to achieve my goal. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2hox7/"}, "273": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516642163, "Score": 2, "Body": "That is very true.\n\nThank you for your help. I will send that email.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2hwun/"}, "274": {"Subreddit": "PhD", "Author": "humdrum_humphrey", "Date": 1516642377, "Score": 2, "Body": "Anytime. I really hope you get in. Good luck ! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2i50l/"}, "275": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1516648574, "Score": 2, "Body": "I would agree with this guy. I mean really all you are doing in adding that you have spoken to and gained the approval of one of their professors is giving them more evidence about your suitability for candidacy at the University. I don't really get how things work in North America with PhD programs but I know for those of use based off the British system we are required to have a potential supervisor *before* we can even submit a formal proposal for PhD research (which encompasses the whole PhD). Kia Kaha e hoa (stay strong my friend) and Good Luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2oux2/"}, "276": {"Subreddit": "PhD", "Author": "icedlatte90", "Date": 1516649334, "Score": 1, "Body": "Thank you very much for your warm wishes :-) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s6opz/phd_interview_followup/dt2poe0/"}, "277": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1516656961, "Score": 4, "Body": "Mine tell me that’s “not part of their job, sorry”", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt2xvgh/"}, "278": {"Subreddit": "PhD", "Author": "dr_shark_bird", "Date": 1516659238, "Score": 1, "Body": "I've seen TT job application materials (from people not far out from their PhDs) that would have been enough for a tenure case 10 years ago. It just keeps getting worse.", "Permalink": "https://www.reddit.com/r/PhD/comments/7pwyom/reddit_what_makes_a_good_phd_application_for_us/dt30cpu/"}, "279": {"Subreddit": "PhD", "Author": "dr_shark_bird", "Date": 1516659506, "Score": 2, "Body": "Not interested in doing UX design and research? That would seem to be a pretty obvious option. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7oswpc/how_to_apply_a_phd_in_industry/dt30mhw/"}, "280": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1516661022, "Score": 7, "Body": "God forbid anyone go above and beyond.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt3257y/"}, "281": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1516664532, "Score": 5, "Body": "Nah, mine sat me down and asked to have a proper discussion about my plans for the future and possible avenues to take. I'm the one who's just like \"can we just focus on getting this thing done first?\"", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt35ig7/"}, "282": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1516666007, "Score": 3, "Body": "So lucky!", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt36v2f/"}, "283": {"Subreddit": "PhD", "Author": "ConfusedPanda90", "Date": 1516671674, "Score": 1, "Body": "Wake up! \nKeep digging, it is not that you lose your motivation but the overwhelming thought scared it away (seniors told me it's common)!\nYou'll feel better if you talk to someone like me, I'm in for 1 year now and still try to find the right direction, still refining research questions even i did an extensive literature review, confusing af still ! \nSee! you're good !", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt3c3x4/"}, "284": {"Subreddit": "PhD", "Author": "Every_username_used", "Date": 1516694404, "Score": 2, "Body": "My advisor is awesome so I can’t complain. But I started reading “the professor is in” and I see a lot of alignment with advice from my advisor. Worth looking into if you haven’t already!", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt3so39/"}, "285": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1516704398, "Score": 2, "Body": "I am an international student, not eligible to work in the country of studies, and not from the same country as my advisor or anyone else here, so there's nothing they can do to help me outside academia, and probably not much within academia either (not that I wouldn't want to apply internationally, I very much would, but it probably won't be possible). Advisors and the personnel of the graduate school here do help the local students with what they can.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt3wnns/"}, "286": {"Subreddit": "PhD", "Author": "LigerZerOJaegaer", "Date": 1516710394, "Score": 2, "Body": "damn, I'm having a VERY similar experience right now :/ \n\nwe can do this bro! we gotta believe ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rx7pu/one_year_in_and_feeling_scared_and_overwhelmed/dt3zdmv/"}, "287": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1516712552, "Score": 1, "Body": "Go for it - but you are insane. \n\nI am 56 and in my second semester of a PhD program. I am also in a similar situation to you, I am a full time employee of the university, and they will pay 100% tuition (I pay assorted fees - works out to be a few hundred a year out of my pocket)\n\nTo be honest, it is stressful, my biggest advantage is that I am basically on campus for work, and my department is pretty flexible with me skipping out for classes/seminars etc. If I working elsewhere I think it would be pretty much impossible.\n\nThere are also a few others in my program that are 50+ , some working full time, others not. Age isn't a barrier, but other responsibilities may make it difficult.\n\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt40ltu/"}, "288": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1516712708, "Score": 1, "Body": "I probably have a sit-down conversation about jobs once a month.\n\nI'm like 2.5 yr out, but I like it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt40p2r/"}, "289": {"Subreddit": "PhD", "Author": "snowball3xz", "Date": 1516720361, "Score": 1, "Body": "Im 2 still very new. But right when I got here and put together my committee, my advisor told me to consider who I want my letters of recommendation written by and those people should go into my committee. \nSo he does make me think about whats beyond, even in my first year.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt46o12/"}, "290": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1516731622, "Score": 2, "Body": "1.  If you want to be a faculty member in computer science, you probably won't get there without at least one degree in computer science.  Same is probably true of most humanities programs.  There may be more wiggle room in interdisciplinary or crossover programs but if you're looking for an academic job in (for example) CS at some point they're going to want people who can teach more than just one interdisciplinary undergrad course.  Fortunately, you can very easily get specific information on this by looking at the CVs/online biographies of the faculty members in the programs you've been considering.\n\n2. Yes, and [here's a study about it](http://advances.sciencemag.org/content/1/1/e1400005).  Ultimately, though, a low-productivity PhD from a famous place is still not going to beat a highly productive one from a less famous place, so make sure you're in an environment where you can be productive.\n\n3. Commutes suck up time and time is often one of the most limited resources in a PhD.  You'll have to figure out just how much time it will cost to commute, if you can practically make good use of your commute time (for working, or as solid down time), and if it makes more sense for you to move or stay.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sg7qh/how_important_is_university_ranking_and/dt4ifel/"}, "291": {"Subreddit": "PhD", "Author": "chrisd234", "Date": 1516754775, "Score": 1, "Body": "So.. I'm 36 and more or less in the same boat. Financially very stable, masters complete, etc. Work has more or less told me i need to do a PhD and personally if I had the time, I'd get a degree in everything. So you're not alone!", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt5627y/"}, "292": {"Subreddit": "PhD", "Author": "salil91", "Date": 1516760397, "Score": 6, "Body": "In engineering departments, typically yes. If you are an RA, most of your work will be related to your thesis.\n\nDon't know about other fields.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sjgij/lab_thesis_possibly_stupid_question/dt5b1mk/"}, "293": {"Subreddit": "PhD", "Author": "moomoomilk_", "Date": 1516760648, "Score": 1, "Body": "Thanks for your reply! With regard to #1, I have a masters in CS, but without a thesis, does that count for very little to nothing in this case, I’m guessing?\n\nAnd great points for 2 and 3. I read somewhere that interdisciplinary programs don’t matter much for ranking but I can see your point. I’m sure there are better resources in higher ranked programs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sg7qh/how_important_is_university_ranking_and/dt5b9ml/"}, "294": {"Subreddit": "PhD", "Author": "mcfluffle", "Date": 1516760670, "Score": 5, "Body": "In my program, you're an RA in your advisor's lab and your thesis/dissertation comes from the work you do there. My understanding is that experimental sciences are typically like this.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sjgij/lab_thesis_possibly_stupid_question/dt5babn/"}, "295": {"Subreddit": "PhD", "Author": "a4k04", "Date": 1516764512, "Score": 1, "Body": "I'd say it's more accurate that your thesis comes from whatever the funding was allocated for. Some people are RAs and spend time working on whatever that money was allocated for (almost always your advisor's work). Some people are TAs and, depending on advisor and program, can do more or less whatever they want (imo, the biggest benefit to a TA position over RA) -- do the work you want to, publish something, get a grant, stop being a TA because now there's funding for your specific work. Others (rare) have NSF/DoD/other fellowships and have the freedom to more or less direct themselves as long as it is remotely related to the original fellowship application. \n\nI personally chose to start out as a TA because I wanted more freedom to choose my own research path instead of being shoehorned into my advisors work as an RA. Some advisors are okay with this, others definitely are not and expect you to do their work if you are their student. How this all works really depends on the program and the advisor. \n\nIn the CS world places like MIT and CMU have the ability to tell each student what they'll be working on, if the student doesn't like it 15 more will happily fill their spot. I don't know how this works elsewhere but it's not how it works with my advisor; he feels part of getting a PhD is figuring out for yourself what you want to work on and why anybody else should care about it. This is one reason why it's important to ask questions of programs / potential advisors before committing somewhere. I don't think I'd be able to stick it out for 4 - 6 years doing work I'm not all that interested in. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7sjgij/lab_thesis_possibly_stupid_question/dt5ercj/"}, "296": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1516801859, "Score": 9, "Body": "Are you given milestones and dates for completion? I'm in Australia so might not be relevant but I'm given a list of key tasks which must be completed (milestones) and dates - which can be negotiated but that's the start point. Research proposal submission for a full-time PhD student is 6 months for us. So yeah, you have plenty of time but it's a document that takes a lot of work. Do you have regular meetings with your supervisors? Are there plans to regularly submit work for feedback?", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt5yilo/"}, "297": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1516812340, "Score": 5, "Body": "I am in a similar position - working full time as a software developer (for the university I am doing the PhD at)\n\nOur rule is that you don't submit your PhD research proposal until after qualifying exams. Different schools/different rules, but I expect that there should be no problem if you haven't submitted the proposal after your first month. One month is barely enough time to do the literature review to see where the gaps are.\n ", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt68e2d/"}, "298": {"Subreddit": "PhD", "Author": "illithid66", "Date": 1516819156, "Score": 1, "Body": "I think it would vary department by department.  Is there any chance of any future overlap?", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt6fmc6/"}, "299": {"Subreddit": "PhD", "Author": "DistressedABD", "Date": 1516840461, "Score": 1, "Body": "We have people in our program doing their PhDs, and they are in their 50s and 60s. 40s is very young to do a PhD if you desire to do so. My mother did her MA and PhD in her 40s, while having a full-time job, husband, taking care of 3 children, and commuting 2 hours a day. She was the one who convinced me to do my PhD when everyone else was telling me not to. She always says how she keeps reaping benefits from her PhD due to various opportunities that she only gets because of her degree. Is there a possibility for you to do it part-time? In my experience, PhD students, who have full-time jobs may take 1-2 years longer to graduate, because they usually study part time. From your description in the original post, I think you will do very well, getting a PhD is all about patience and work, and the more efficient you are, the easier it will be. Especially if the PhD is in the field that you are currently working in, that is a major asset. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt7160c/"}, "300": {"Subreddit": "PhD", "Author": "DistressedABD", "Date": 1516841163, "Score": 1, "Body": "Just to add, yes, PhD can get frustrating, research can be disappointing, and advisors can be absent. It is all about how you deal with it emotionally. I started in my mid-20s (late-20s now), and I notice how just being more grounded and mature emotionally helped me overcome challenges that have come up in my PhD journey. Being in your 40s and having a career, a family, and stability gives you another advantage in pursuing a PhD. I'd say go for it! What is the worst that can happen? :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rn5mw/40_years_old_considering_a_phd/dt71s9e/"}, "301": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1516842161, "Score": 2, "Body": "I'm in the USA and we'd go through a year or two of coursework before a research proposal. I'm also in the humanities, so that may matter. I worked full time throughout my PhD and I'm now defending my dissertation tomorrow. I took 5 years, instead of the regular 4. Try not to sweat it too much. Good luck to you!", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt72nt8/"}, "302": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1516846121, "Score": 1, "Body": "No one is going to care that you don’t have a fleshed out research proposal this early on. At the same time I would never admit a student who is also working full-time so who knows what your standards are like. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt764p1/"}, "303": {"Subreddit": "PhD", "Author": "juniusg", "Date": 1516846617, "Score": 1, "Body": "You can do it, but it will be painful at times. I went from a big tech company in Silicon Valley to a Ph.D. program. I finished my Ph.D. and now I'm back in tech.\n\nA few thoughts:\n\nThere are no free lunches in academia. Adapting to the small stipend of a student is hard even if you've lived frugally while working. I had saved quite a bit and lived well below my means while in industry, but still had to cut my lifestyle as a student. I felt bad spending my savings. \n\nBe prepared to have university faculty treat you like an undergrad even though you have gained experience working as a professional. There's a social hierarchy in academia and grad students are near the bottom.\n\nSometimes it takes a long time to get things done. Universities are more bureaucratic than private companies. When submitting journal papers, timelines for publication can span years. Contrast this to a software company where a release can be pushed out in weeks.\n\nDespite all that I'm happy I finished my Ph.D. I spent my first year as a full-time student, but after my first year I worked part-time to preserve my sanity. I enjoyed doing research and becoming an expert in my field. I did it mostly for the personal satisfaction and to prove to myself that I was capable of doing doctoral level work. I also wanted to open doors to do research professionally. \n\nYour future in academia will depend on your publication record. In technical fields, if you manage to publish a lot and are willing to do a post-doc you likely have a decent shot at a university faculty position. However, academia is tough. Despite the more flexible hours, you will likely have to work longer and harder than in a cushy Silicon Valley job at a big company. Tenure track professors need to obtain grants, run labs, publish papers and teach. You can easily work 60 hours trying to do the minimum.\n\nHaving witnessed how tough a career in academia can be, I've decided to apply my Ph.D. in industry. A Ph.D. can be very stimulating intellectually, but caveat emptor.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt76k8m/"}, "304": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1516853104, "Score": 1, "Body": "Really appreciate your input ! Let me bounce back on your thoughts...\n\nYes the stipend will definitely be tough to adapt. I have a more than comfortable salary and do not really pay much attention to what I am spending. The big difference though is that I am likely to buy a house before starting my studies, so no more rent no mortgage ( just few property taxes to pay ).\n\nWhat was your level of education before joining the phD ?\n\n I have an engineer degree and a master's degree, my undergrad grade in mathematics is really high ( 18/20, European grading system ), but my grades are averages for the 5 years I've been studying to become an engineer. I did preparatory classes ( 2 years before joining the engineer school ) which is known to be one of the toughest path. In those 2 years I barely passed ( 11/20 ) but everyone get really bad grades in those years. Since the average is not included in my report, I am scared to be dissuaded art admission because of this grade. What do you think ? Is the GRE + undergrad math grade more important than master's grades ?\n\nI set up my mind to it, the only obstacle now is really to join one of the school I am investigating now, but looking at my past grades, I am scared the admission jury will just discard me without much interest", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt7c3aa/"}, "305": {"Subreddit": "PhD", "Author": "noodlesandwich123", "Date": 1516878481, "Score": 1, "Body": "How much in terms of data, figures &amp; results do you have? If you're still very early into your PhD I wouldn't worry about conferences not accepting you. It'll get far easier as you progress. \n\n\nYou say your work involves a niche technology - have you been applying to only environmental chemistry conferences? Have you tried looking at sensor/analytical chemistry conferences? Does your technology have sensing or analysis principles that'll apply to those kinds of conferences?\n\n\nDoes your technology involve a novel fabrication method? If so have you looked at engineering/technology research conferences?\n\n\nMy PhD was based in a Chemistry dept. but was on 3D printed microfluidic devices for particle &amp; cell analysis, and during its course I would apply to a wide range of conferences: analytical chemistry, 3D printing, microfluidics, sensors, microfabrication, lab-on-a-chip...\n ", "Permalink": "https://www.reddit.com/r/PhD/comments/7su1m3/cant_find_the_right_conference_for_my_work/dt7pbqa/"}, "306": {"Subreddit": "PhD", "Author": "samclifford", "Date": 1516890941, "Score": 5, "Body": "That sounds rough. If the dean recognises that you've been pressured by Dorian it may be worth seeing if you can transfer to being supervised by Sarah and have that recorded in your university's management system.\n\nIf you're publishing papers from your thesis, can you talk to your dean about how much of a hindrance Dorian has been, show that your own analysis has been done despite his micro-management interfering and argue that he ought to not be included as a co-author?\n\nEven if he ends up being on a few papers of yours, him not getting the recognition as a supervisor is probably the best you could hope for. The best outcome, in my mind, would be for you to finish with a supervisor who's not actively getting in your way, transfer out of the lab with Dorian in it (will Sarah take you on for some research associate work?), and continue to do the research that you want to do with methodologies you can show are correct.\n\nI'm sorry to hear you've had such an awful experience, with one supervisor passing away, and having two others who weren't the right fit. If the PhD is within reach, I'd suggest finishing it, as \"I was in a PhD program for four years but dropped out because I had bad experiences with my supervisors\" is harder to explain than \"I hold a PhD in X field\" when applying for jobs that you'll be applying for _after_ your current opportunity you mention at the end.", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dt7wxh4/"}, "307": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1516893335, "Score": 1, "Body": "Journal of Biomedical Materials Research? IF 2.308", "Permalink": "https://www.reddit.com/r/PhD/comments/7soyr9/looking_for_a_biology_medical_device_journal_to/dt7z55q/"}, "308": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1516895129, "Score": 4, "Body": "You've made it this far - I think it's a good idea to grind out the rest of the PhD with or without your toxic advisor getting credited. Don't take a high minded stance on whether you'd be sending a message, just get the three letters and GTFO.   \n  \nI had a similar situation, with 2 of my advisors leaving midway into my PhD and being left with one who gets very bogged down in minutiae and occasionally hard to work with. He's not making my life hell the way Dorian seems to be for you, but I have been stuck on a project turning its wheels and going nowhere for the last 6 years. At this point my stance, personally, is not to worry about the results or professional integrity or any of that other abstract stuff. I just want to get out with the degree I signed up for.  \n  \nGood luck!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dt80x1g/"}, "309": {"Subreddit": "PhD", "Author": "dwarfboy1717", "Date": 1516895919, "Score": 3, "Body": "This is tough, and I don’t have an answer. \n\nAs an anecdote, I was in a very toxic grad school environment, mastered out at the end of my fifth year, and it was one of the best decisions I’ve ever made—for my physical and mental health, my relationship with my significant other, my financial stability, etc. \n\nNot trying to sway you one way or another, but show you that there some green grass on this side of the fence too, if that’s what you choose. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dt81q17/"}, "310": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516906586, "Score": 1, "Body": "This depends on your field, but in my particular STEM field, I don't know of a single mainstream journal or conference that requires affiliation (except those low-level \"students only\" workshops).  Just leave that line blank in the submission form, or write \"independent researcher\" or something.  \n\nOf course, the work still needs to pass normal peer-review, but the affiliation itself is optional.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dt8dac9/"}, "311": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516909826, "Score": 1, "Body": "That's a normal part of the professional researcher learning curve.  Don't feel bad.  Eventually, many researchers learn to target specific conferences first, and design projects specifically for those conferences.  A project might be a great project, but if its storyline and sexy keywords don't match the conference whose credentials you need, your career is going to lag.\n\nI can't help you with this particular project, except to say keep working on it and rewriting it in different ways, and eventually you *will* find a conference for it.  Don't be worried about the job search, that's a completely different can of worms and unrelated to your current difficulties.  Keep exploring different conferences, no honest professor knows about all the good conferences relevant to one project.  And next time, choose the conference and then design the project to fit ;)", "Permalink": "https://www.reddit.com/r/PhD/comments/7su1m3/cant_find_the_right_conference_for_my_work/dt8gtlp/"}, "312": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516911669, "Score": 2, "Body": "1. Solution: read more publications (journal papers, conference papers).  Read tons of them, dozens, hundreds.  Just skim them, even just read the abstracts.  If papers on a topic seem badly designed or stupid or pointless to you, that's ok, then you know that's not the right field for you.  When you join a PhD program, your entire job is going to be writing papers that are nearly identical to these papers, so make sure you choose a field with papers you like!\n2. It's ok you don't understand, just keep digging and teaching yourself, and eventually you'll understand.  (BTW, when you are a doctoral researcher, you teach yourself anyways, there's no shortcuts like classes on most topics you need.)  But you should have a pretty good understanding before you start a PhD with these folks; you'll be expected to be productive (i.e., publishing) pretty much from the starting gun.\n3. Your time in industry is a slight benefit; your age doesn't matter to any researchers worth working with, also your foreign status.  Your lack of research background may hurt you, but you can remedy this.  Before you commit to a PhD program, you should be fluent in research in the field and able to write papers; you can write a paper or two and publish without affiliation, as preparation for your application.  (It will be hard, as you are learning the process on your own, but it's arguably better than going through the same process (also on your own) with a professor breathing fire at your back threatening to blacklist you from academia if you don't publish soon.)\n4. In the US, it's fine to apply for a professorship at an older age; the department just wants the best-qualified candidate.  But yes, professorships are very competitive, and you might not enjoy the work.  It's totally up to you to design your dream career path.\n5. Your personal finances and expenditures are up to you.  I probably wouldn't worry about giving up the salary; if you had it once, you can probably get a similar job in the future again if you want, as long as you keep a 6-12 month cash emergency fund.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt8it77/"}, "313": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516912641, "Score": 2, "Body": "&gt; do not really pay much attention to what I am spending\n\nThis will handicap you no matter what you decide to do with your life.  Come join us in r/PersonalFinance to get started fixing it!\n\n&gt;I am likely to buy a house\n\nI've seen a number of grad students buy houses (usually in the Midwest or South), and it may or may not reduce your expenses, and it may or may not result in even professors getting offended by your lifestyle being more affluent than theirs (let alone your fellow grad students), which may or may not impede your academic progress.  If you do it, keep it quiet and stay humble.\n\n&gt; I am scared the admission jury will just discard me without much interest\n\nThe most important part is your ability to publish research, which you can prove by having published research.  Grades, previous universities, GRE's, everything else is secondary, *especially for you* since grades were many years ago.  Just focus on literature and publications.\n\nPS:\n\n&gt; Be prepared to have university faculty treat you like an undergrad even though you have gained experience working as a professional. There's a social hierarchy in academia and grad students are near the bottom.\n\nThis.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt8jvgk/"}, "314": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516913427, "Score": 2, "Body": "One point I haven't seen mentioned here: Program funding is not just a matter of personal finance.  It affects the education you receive.  Call it whatever you want, but when you are paying a department, you are a *customer* and they have little skin in the game of your success afterwards.  When you are funded, you are an *employee* and they will whip you into shape and make high demands of you, which are painful but will end up building your career, with benefits that an unfunded student will never experience.\n\nThat's why I advise even trust-fund babies to only accept fully-funded offers, because an unfunded offer usually isn't worth their time.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dt8kq82/"}, "315": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1516917812, "Score": 1, "Body": "&gt; I've seen a number of grad students buy houses (usually in the Midwest or South), and it may or may not reduce your expenses, and it may or may not result in even professors getting offended by your lifestyle being more affluent than theirs (let alone your fellow grad students), which may or may not impede your academic progress. If you do it, keep it quiet and stay humble.\n\nYes I do not plan to rub my lifestyle in the face of my fellows.\n\n&gt;The most important part is your ability to publish research, which you can prove by having published research. Grades, previous universities, GRE's, everything else is secondary, especially for you since grades were many years ago. Just focus on literature and publications.\n\nIsn't this a chicken egg problem ? I have 0 publications because I've been in an industry where publication was not permitted, so how do I prove my ability to have published research ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt8pes5/"}, "316": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1516918226, "Score": 1, "Body": "Thank you for your answer. I must admit that it really discouraged me. I somehow though that the research/getting used to the field/writing papers was done during the phD program and not that I had to do it beforehand. How do undergrad manage to join the program with no research on their back ?\n\nI have some research experience but my company didn't allow publishing, I am also not allowed to publish on my own, I only have one patent I managed to push through a few years back but again this is a different area to what I am interested. ( patent in computer science vs phD in maths )", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt8ptp9/"}, "317": {"Subreddit": "PhD", "Author": "Sled_Pirate_Bobberts", "Date": 1516919775, "Score": 2, "Body": "More than that, every person I know in my cohort to get a good postdoc after their PhD either worked with, or it was arranged by, their supervisor. The one exception to this got their job through their partner.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt8reje/"}, "318": {"Subreddit": "PhD", "Author": "superyelloduck", "Date": 1516921117, "Score": 1, "Body": "Graduate with a BSc and Master's in Neuroscience here. It's hard to say what you really need based on your experience - as you should be aware that neuroscience is such a broad field (despite what most people would think). You need to make sure you understand neuroscience at the cellular level and probably at a systems level. \n\nThe best way to go about this is to look for books that describe cellular physiology - you should get an appreciation of different signalling mechanisms and pathways. Also may be useful to try and learn some rudimentary genetics there too (generally more complex than Mendelian genetics and punnet squares though). \n\nIn terms of at a \"systems\" level, any neuroscience textbook will explain about how we think the brain actually functions. For example, we think that the brain has specific areas for different processes - reasoning and judgement at the front, memory to the sides etc. But it should also explain how we think the brain is connected in order to explain higher cognitive processes like reasoning etc. \n\nI recommend \"Medical Physiology\" and \"Neuroscience: Exploring the Brain\" textbooks if you're intent on getting some SERIOUS reading done. But they're pretty expensive and also HUGE in the case of the former. I can't say how much experience you have with neuroscience so would make sure to try and cover the basics with YouTube videos if books don't work out. \n\nIf you want to read papers, try to find something that interests you in neuroscience - for instance I really like cognitive decline associated with neurodegeneration using imaging and neuropsychological profiling. I'm not so much a fan of things when they get too genetics based. Obviously as a PhD student you should be able to make sense of papers fairly well, but given the context I'm not entirely sure. \n\nSorry for the long splurge but hopefully that helps. Welcome to neuroscience! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7svinm/1st_year_phd_transferring_from_materials_science/dt8ss48/"}, "319": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1516922272, "Score": 2, "Body": "I had a similar supervisor. I actually decided to quit because In the grand scheme of things, I’ll remember how much of my life I spent being sad and anxious but I’ll really regret how little of it I spent being truly happy. \nAnyhow, when I told my committee members and the program coordinator that I’m considering quitting over a really terrible relationship with my supervisor (and that’s affecting my candidacy exams) they moved heaven and earth to make sure I stayed and switched me over to another supervisor who is poles apart from my ex-supervisor. \nThe trigger for them was me having a panic attack in the coordinator’s office and they realized that what I’ve been telling them all this time wasn’t just in my head. I had emails and proof, as I’m sure you do. \nI think you’re going about things the right way by telling your department. You need to also tell another professor that you have a good relationship with, may be Sarah? She could have enough sway to get the department to act on your behalf. \nThe one thing I learnt is that you gotta be honest about what’s happening and you have to tell people that matter. The worst that can happen is that you have to suck it up and suffer the status quo or that Dorian may be more of an ass to you, but you’ve already endured it all. \nThe best that can happen is that you’ll have a more understanding mentor and publish high quality work- which is an important point to make. I also recommend making this a carefully worded email to the director since it looks like they understand your situation and commiserate with you. \n(These are all things I did less than two minutes months ago  so far things worked out)", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dt8ty91/"}, "320": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1516924325, "Score": 1, "Body": "Hi there! It seems like you already pointed out the problem there. If your supervisors don’t get along on a joint project then they will put off any sort of effort into it because it means it will either pull the supervisors together for more discussions or it simply reminds them of the other person. It depends on what kind of a career you want in the future! Are you completing a PhD for self development and this is not your final stage or do you want to be an academic? If it’s the latter you should be concerned about papers. Let me know, I am curious.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dt8vuq7/"}, "321": {"Subreddit": "PhD", "Author": "Sled_Pirate_Bobberts", "Date": 1516924828, "Score": 1, "Body": "I think that's definitely part of it. They aren't joint as far as they are debating on the direction of it, but they keep each other updated. My main supervisor is calling the shots, but has failed to give me enough work for me to feel satisfied in my development and progress. \n\nI'm definitely seeking a career in academia, but I feel like its slipped away - mainly because everybody that I know from my cohort that got a decent postdoc either worked with their PI or was put forward by them. I don't think I can hope for either though. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dt8wapl/"}, "322": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1516925217, "Score": 2, "Body": "Hmm, it’s definitely something at play here. I mean, if they don’t see each other much then I don’t see why he doesn’t put as much effort into your project and give you more work. Do you at least think that you will graduate in time or with ease? Finishing your PhD is at least a primary concern so do you have enough material to write about?", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dt8wn22/"}, "323": {"Subreddit": "PhD", "Author": "TheGadfly_", "Date": 1516932633, "Score": 8, "Body": "This piece of advice was passed on to me by a 4th year doc student. The best dissertation is a completed dissertation. Get it done, then contribute more meaningfully to theory / research later!", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dt93803/"}, "324": {"Subreddit": "PhD", "Author": "hrabove180bpm", "Date": 1516933481, "Score": 2, "Body": "You've sort of got to surrender to the idea that there is a chance there is another researcher working on a project very similar to yours right at this moment. You just don't know it because it's not published obviously. You can never guarantee originality! Just commit to what you have and keep an eye out for new work that might pop up along the way ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dt93z0f/"}, "325": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1516934784, "Score": 1, "Body": "&gt;  though that the research/getting used to the field/writing papers was done during the phD program\n\nSome people do that.  Some of them get yelled at and fired for doing that.  I don't recommend it.\n\nThink of it this way: in a funded program, *they aren't paying you to sit there in class and daydream about subject matter*.  They are paying you to actively and efficiently promote the research interests of the professor and university to the greater community and general public.  If you can't pull your weight, they'll get rid of you; there's plenty more to take your place.\n\n&gt; my company didn't allow publishing\n\nThat's a contract problem, not an industry problem.  In the future, you might consider negotiating your contracts to permit publishing, at least under certain conditions.  Someone with your salary has the necessary leverage to hold out for this.\n\n&gt; have one patent\n\nPatents are arguably not as valuable in academia as papers, because the patent procedure is arguably not as thorough or informed as peer-review.  I'd focus on papers.\n\n&gt; How do undergrad manage to join the program with no research on their back ?\n\nSome students join labs as undergrads, for the research experience.  The expectations are light, but they often get a paper or two.\n\n&amp;nbsp;\n\nOk, so you don't have papers now.  Don't despair.  There's ways to bootstrap yourself in.\n\nOption 1. Read a shitton of papers in your field.  Take notes.  Organize them by notes.  Look up concepts you don't understand.  Draw yourself a graph of how all the topics of the different papers fit together.  Then find a tiny topic that has a place in your graph but has no papers, and do the research and write a paper formatted exactly like the others you read.  Submit to the same journal/conference.  When it gets rejected, see if you got any useful reviewer notes, and otherwise politely ask someone in your field to point out flaws in your paper that should be fixed before you resubmit to another journal. Rinse and repeat.  \n\nOption 2. Skim a bunch of papers until you find some you really like.  Formulate 2-3 thoughtful questions per paper (e.g., \"Why did you demonstrate significance using metric X instead of metric Y?\"; \"I noticed you didn't reference this previous branch of work.  How do you think your work fits in with it, or why did you consider it irrelevant?\").  Politely reach out to the first author of the paper you like and tell them you read their paper and really liked it but are new to the field and were hoping they'd answer a few questions.  You are trying to get a conversation going with them.  Their time is extremely valuable; be respectful.  If you can build one of these relationships with a researcher geographically close to you, eventually maybe you can start doing unofficial research with them and helping them in their lab.  This often leads to papers.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dt955o5/"}, "326": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1516936388, "Score": 6, "Body": "The point of the program is to teach you how to research.  As a mentor once said, the area of research is a barn door.  You are picking a small cm of area that ads to the body of knowledge.  You learn how to research, THEN you go out and solve world hunger, not on your dissertation.\n\nAll research builds on other work.  The more you understand the particular area, the more you will realize that even the big breakthroughs are just a new twist on a previous idea most of the time.  \n\nBesides, if you go out and create a whole new area of research, people will have doubts about your research because you won't be able to show prior proven groundwork.  So don't sweat it.  Just get it down, then try and pursue what you want.  But by then you will probably have a better sense of the process.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dt96jun/"}, "327": {"Subreddit": "PhD", "Author": "Sheltac", "Date": 1516948647, "Score": 1, "Body": "Networking is key.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dt9f6e1/"}, "328": {"Subreddit": "PhD", "Author": "Sled_Pirate_Bobberts", "Date": 1516954555, "Score": 1, "Body": "Sorry for not replying; I fell asleep. I'm thinking the same as you. I'm not concerned about graduating on time necessarily, but I'm worried about having to cobble together a poor quality thesis and not get a job afterwards. For me, finishing my PhD is largely just a formality so that I can start working. For me, it's about my career. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dt9hyjf/"}, "329": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1516961209, "Score": 1, "Body": "In most fields and most departments, the first month is *way* too early for a student to write an independent research proposal. Start by summarizing the literature in your field first.", "Permalink": "https://www.reddit.com/r/PhD/comments/7smyfs/working_full_time_while_doing_a_phd_im_already/dt9ko99/"}, "330": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1516977214, "Score": 6, "Body": "&gt;I don't know how to cope with this. Yes I know about impostor syndrome. Yes I know that getting into a phd and faking it so far is pretty darn good already. I just don't know how else to cope with it.\n\nThe thing is, you don't have anything to cope with. You are doing _fine_.\n\n&gt;I'm in my last year and I'm so embarrassed that I forgot a lot of fundamentals. I had to do a paired t test the other day and the only one I've done the past 5 years was a few Student's t test here and there so I forgot how to do it so \n\nThis happened to you because you are a human being. If you had a more supportive and open prof, they would tell you this too. My professor continuously says that she forgot this and that and that she'll look it up on Khan Academy (no joke) later. Everybody does that. Your supervisor ripping it apart is most likely just them being in hyper-critical mode. That does not reflect your abilities. When my peers always asked me to critic their writing/thesis/report, I did that too. I'd annotate everything I could find that was even slightly dubious or otherwise not fantastic. Even if the reports themselves were fine overall.\n\nOverall though, and bear with me here, but your data;\n\n&gt;landed a job before graduating\n\n.\n\n&gt;I've had publications but it was mostly because I went \"I haven't seen any literature on this... I wonder if I can apply it this way...?\" and just got lucky that the results were good enough to publish.\n\n.\n\n&gt;half the stuff I tried worked\n\nDoes not seem to support your conclusion;\n\n&gt;don't feel like I deserve to graduate\n\nYou're fine, friend. It is all going to be fine.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4rvt/i_dont_think_i_deserve_this_degree/dt9tjhz/"}, "331": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1516977300, "Score": 5, "Body": "This is pretty normal for the first three months, or even the first few years.\n\nImportant part of your doctoral development is the realization of how very little you actually know (and realistically; will ever know).\n\nIf everyone already knew what they were doing it wouldn't 'research'.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4q4v/i_have_no_idea_what_im_doing_and_im_not_really/dt9tm61/"}, "332": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1516977372, "Score": 3, "Body": "Do you know what you call someone with an OK but not groundbreaking dissertation?\n\nYou call them Doctor.\n\nYour adviser says it's fine, it's fine.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dt9tocz/"}, "333": {"Subreddit": "PhD", "Author": "ima767", "Date": 1516980456, "Score": 2, "Body": "Of course you deserve it. Carry on, buddy", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4rvt/i_dont_think_i_deserve_this_degree/dt9whge/"}, "334": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1516993402, "Score": 2, "Body": "#humblebrag", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4rvt/i_dont_think_i_deserve_this_degree/dta9yb6/"}, "335": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1517000080, "Score": 1, "Body": "&gt; Think of it this way: in a funded program, they aren't paying you to sit there in class and daydream about subject matter. They are paying you to actively and efficiently promote the research interests of the professor and university to the greater community and general public. If you can't pull your weight, they'll get rid of you; there's plenty more to take your place.\n\nGot it !\n\n&gt;  In the future, you might consider negotiating your contracts to permit publishing, at least under certain conditions. Someone with your salary has the necessary leverage to hold out for this.\n\nThat's the thing, I already did exactly that and now I am able to publish. Problem is I don't have any time to do so, and second thing is that even if I did it wouldn't be in the field I am interested in working on...\n\n&gt; Option 1. Read a shitton of papers in your field. Take notes. Organize them by notes. Look up concepts you don't understand. Draw yourself a graph of how all the topics of the different papers fit together. Then find a tiny topic that has a place in your graph but has no papers, and do the research and write a paper formatted exactly like the others you read. Submit to the same journal/conference. When it gets rejected, see if you got any useful reviewer notes, and otherwise politely ask someone in your field to point out flaws in your paper that should be fixed before you resubmit to another journal. Rinse and repeat.\n\nThat is part of the problem I have, I don't have any time to do this, I barely have a few hours at night to keep up with the field... I was hopping jumping on a phD program would give me that kind of time.\n\n&gt; Skim a bunch of papers until you find some you really like. Formulate 2-3 thoughtful questions per paper (e.g., \"Why did you demonstrate significance using metric X instead of metric Y?\"; \"I noticed you didn't reference this previous branch of work. How do you think your work fits in with it, or why did you consider it irrelevant?\"). Politely reach out to the first author of the paper you like and tell them you read their paper and really liked it but are new to the field and were hoping they'd answer a few questions. You are trying to get a conversation going with them. Their time is extremely valuable; be respectful. If you can build one of these relationships with a researcher geographically close to you, eventually maybe you can start doing unofficial research with them and helping them in their lab. This often leads to papers.\n\nThat's a really good advice. Thanks for this !\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtagt4y/"}, "336": {"Subreddit": "PhD", "Author": "TheAxeC", "Date": 1517002198, "Score": 2, "Body": "The thing about these questions is that they are badly worded questions.\n\nSo a couple things, first of all, of course there exists a person with a bad GRE that still got into a PhD. There always exist exceptions to the rule. A more correct question would be to ask how likely it is to get into a PhD with a bad GRE. \n\nNext, your application isn't just comprised out of your GRE results. There are your letters of recommendation, your personal statement, your grades, and so on. The question you ask ignores all these elements of the PhD application.\n\nIf you have a bad GRE, try to make the rest of your application better. For the -small amount- of universities I know, there wasn't a cutoff point for the GRE (but there was such a point for your grades).\n\nAnother interesting question would be to ask what the average GRE scores are. But you don't give any information about your field of interest or your location (US, UK, Germany, India, ...) . Different fields have different averages.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t6u3x/worst_gre_score_but_admitted_to_phd/dtaix9b/"}, "337": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1517002795, "Score": 1, "Body": "0 :D I didn't take GRE - my institution/department had given up on absolutely requiring GRE for PhD about a year before my admission - we aren't in the US so they don't have to, and they figured out GRE isn't a great measure of research ability. (They do still take good GRE scores as a plus and expect them of students for whom they don't have other \"assurance of quality\".)", "Permalink": "https://www.reddit.com/r/PhD/comments/7t6u3x/worst_gre_score_but_admitted_to_phd/dtajix2/"}, "338": {"Subreddit": "PhD", "Author": "KrebGerfson", "Date": 1517012545, "Score": 3, "Body": "Disagree with /u/fishnoguns. This is not good. Do something about it. Meet with your advisor. Make a to-do list. Make a lofty goal and start working backwards to figure out what you need to do tomorrow, next week, next month, etc. to get there. Get training in the methods you'll be using. Talk to people about what they are doing and try to bounce ideas off of them. Don't try to look busy, BE busy. Do something!", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4q4v/i_have_no_idea_what_im_doing_and_im_not_really/dtas1mx/"}, "339": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1517012611, "Score": 1, "Body": "Yeah that is no good, you need a progress meeting or whatever with supervisors to get lots of ideas on stuff you could do next (Im sure there is a lot!)", "Permalink": "https://www.reddit.com/r/PhD/comments/7t4q4v/i_have_no_idea_what_im_doing_and_im_not_really/dtas3jf/"}, "340": {"Subreddit": "PhD", "Author": "ErinTheTree", "Date": 1517015917, "Score": 4, "Body": "Congrats on being so close to the finish! I think we all have to deal with some amount of stress/anxiety/depression throughout the PhD process. Your mental health is just as important (if not more important) as you PhD. If you need a day to yourself to relax and unwind, take it. If you think therapy will help, do it. Get a pet, practice a hobby, remember there's more to life than your thesis. Sometimes a break is what you need to be productive. Hope this helps :) you're so close, don't give up, and good luck", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dtaup62/"}, "341": {"Subreddit": "PhD", "Author": "sloth1sloth", "Date": 1517016251, "Score": 1, "Body": "What's a good answer to 'why do you want to do a PhD?'", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dtauyhq/"}, "342": {"Subreddit": "PhD", "Author": "Doprrr", "Date": 1517031513, "Score": 2, "Body": "I dont know what I could do other than to wise you luck and to congratulate you on getting so far!\n\nAll the best. Just know that you are not alone in this struggle and that its normal (or so i hear). ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dtb5t1o/"}, "343": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1517033015, "Score": 3, "Body": "Thank you :) I know I must really force myself to go for some walks or even do some running over the next few weeks. \n\nThe time is flying really quickly so at least I know it will be done soon!", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dtb6nof/"}, "344": {"Subreddit": "PhD", "Author": "PurrPrinThom", "Date": 1517052830, "Score": 3, "Body": "There's nothing silly about being prepared. That being said, I wouldn't go into a meeting with your professors empty-handed. Do a bit of research about programs and funding opportunities, this will help answer some of your questions, but will also undoubtedly give you questions that cannot be answered through looking online. \n\nShowing up and saying \"how do I get into a program and how do I get funding\" likely won't end in a fruitful conversation, as program requirements vary, as does the application process, and funding also depends on where you are, where you're looking and what you hope to do.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tc31o/is_it_silly_to_ask_for_advice_during_undergrad/dtbezii/"}, "345": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1517053279, "Score": 2, "Body": "Now is a good time to start thinking about it. Your professors may be able to point you to research internships for your summer holidays that will help with getting a PhD.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tc31o/is_it_silly_to_ask_for_advice_during_undergrad/dtbf5tl/"}, "346": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1517064626, "Score": 2, "Body": "I did my masters in a very small program where part of our unit was a small research project (1 year part time), usually assisting a PhD student with a section of their research. From there, the PhD student supervisor I had asked me if I wanted paid research assistant work. I got a good reputation and other PhD students offered me paid work, with authorship on their publications.\n\nThe research helped me enormously. I got approached to do the PhD from a supervisor I was keen to work with, on a project I'm so interested in. I got contacts. Fellow PhD students who saw me as a peer rather than a masters student, who were so willing to offer advice. I got experience, so helpful for the PhD process and applying for entry. And just having a general idea about different types of research, the pros and cons for each so I sort of knew what I needed to know for my own research. I got a publication, which got me a scholarship worth almost $100k.\n\nNow, when I talk to the new masters intakes, I tell them to come and talk to PhD students whose research they are interested in. Ask us questions. We love talking about our research! If you're considering a PhD, say that you're keen for research experience. We might even have funding to pay you. I'm only second year and already have a masters student keen to work for me when I need. Are there any PhD students in your department who you know well enough to approach for a coffee and chat? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7tc31o/is_it_silly_to_ask_for_advice_during_undergrad/dtbkqlv/"}, "347": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1517067020, "Score": 2, "Body": "What does your supervisor say?", "Permalink": "https://www.reddit.com/r/PhD/comments/7tcgb0/my_department_purposefully_delayed_my_viva_and/dtbmg4a/"}, "348": {"Subreddit": "PhD", "Author": "TakeMySoul2Hell", "Date": 1517073034, "Score": 1, "Body": "Master's degrees + personal connections ", "Permalink": "https://www.reddit.com/r/PhD/comments/7tde0f/how_many_british_students_get_a_phd_in_the_us_and/dtbra5w/"}, "349": {"Subreddit": "PhD", "Author": "PurrPrinThom", "Date": 1517075801, "Score": 2, "Body": "I'm not sure you'd be able to find an accurate number - I can't think of any self-reporting programs (like a census) that would record that information, and it's not as if you could peruse visa applications.\n\nAssuming 'what they have' means, what sort of qualifications, that will largely vary based on school and program.\n\nGenerally, it won't be all that different from getting into a PhD program in the UK: excellent grades, great letters of recommendation and a solid CV. \n\nDependent on the program/school, they might need a master's already, and they'll certainly need competitive GRE scores.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tde0f/how_many_british_students_get_a_phd_in_the_us_and/dtbtme8/"}, "350": {"Subreddit": "PhD", "Author": "ProudSession", "Date": 1517087828, "Score": 1, "Body": "My supervisor is currently on sabbatical leave and out of college", "Permalink": "https://www.reddit.com/r/PhD/comments/7tcgb0/my_department_purposefully_delayed_my_viva_and/dtc3ydg/"}, "351": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1517089256, "Score": 2, "Body": "Another thing to remember is that if you’ve gotten this far, it means you will also get through the rest. Your committee didn’t bring you up to this point to fail you. It is their job to poke holes in your thesis and if they didn’t, then they wouldn’t be a very good committee. \n\nAs a fellow, international PhD student, I think that you’re being hard on yourself and that is a great quality in a future Doctor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dtc560b/"}, "352": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1517094919, "Score": 1, "Body": "I am looking for a PhD program and this is very motivating and uplifting! You made my day for sure. Thank you and all the best with your future job!!!! :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7teaox/its_not_all_toil_and_trouble_well_mostly_and_it/dtc9vqk/"}, "353": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1517110631, "Score": 1, "Body": "Great stuff OP, thanks for sharing!", "Permalink": "https://www.reddit.com/r/PhD/comments/7teaox/its_not_all_toil_and_trouble_well_mostly_and_it/dtcm8ux/"}, "354": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517161653, "Score": 1, "Body": "&gt; was hoping jumping on a phD program would give me that kind of time\n\nWhy would a PhD program pay you to spend time exploring literature that other productive students are already familiar with?  They'll have plenty of other tasks for your time, like teaching, assisting with grant applications, working on unrelated research projects for other professors, managing student recruitment and department visitors and events, let alone keeping up with currently-published lit on your already-chosen dissertation topic.\n\n&gt; it wouldn't be in the field I am interested in working on\n\nNo no, the idea is you can do your own independent research, not necessarily the topic of your work projects.  Although, actually, even papers in other fields will help you gain admission to a PhD program (but you should also have publications in your own field).\n\n&gt; time\n\n&gt; time\n\nDoes your immigration status allow you freedom of career?  If not, fair enough, you're stuck with either your employer or a university breathing down your neck.  Otherwise, why not restructure your time-management or choice-of-job? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtde929/"}, "355": {"Subreddit": "PhD", "Author": "NormalCriticism", "Date": 1517166852, "Score": 5, "Body": "My wife recently graduated and totally rocked her PhD. She can't find a job. She is also being somewhat picky about what she does. How broad is your search?", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtditum/"}, "356": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1517167052, "Score": 1, "Body": "Would you say her biggest challenge so far has been that she is picky? Is there some other factor influencing her getting the job she wants?", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtdj0b7/"}, "357": {"Subreddit": "PhD", "Author": "Unladenswallow0", "Date": 1517167327, "Score": 2, "Body": "It depends really on the type of PhD you are being offered. The general response to wanting to do a PhD is usually because you enjoyed the work you did on your project (masters or undergraduate or whatever) and want to continue further into academia. Usually also they will look for someone who is enthusiastic, because its pretty hard to be enthusiastic about being effectively a poorly paid researcher who has to devote 3-4 years of their life to a single project. You have to make them believe that you not only are interested in the project but are enthused by its direction and its implications for real world problems etc. There are probably other answers to this question but these are the ones that worked for me, although i will say it took me about 4 attempts to land a phD so take that with a pinch of salt, haha. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dtdj94h/"}, "358": {"Subreddit": "PhD", "Author": "NormalCriticism", "Date": 1517168497, "Score": 5, "Body": "Probably just that. Her degree is in molecular biology and her research is very useful for pharma so.... Yes.\n\nShe applies to a few jobs per month but there are far, far more out there that would take her. \n\nIf you want to be picky, do it as long as you can stand to. I'm very supportive of her looking for a job she feels passionate about. I just have no illusions about why she can't find one.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtdkand/"}, "359": {"Subreddit": "PhD", "Author": "maalbadri", "Date": 1517191079, "Score": 1, "Body": "Amazon has a cloud HPC service that's free (I think) for students, check out https://aws.amazon.com/about-aws/whats-new/2015/05/aws-educate-students-and-educators-can-access-aws-technology-cloud-courses-training-and-collaboration-tools/", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dte4hoo/"}, "360": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1517202398, "Score": 5, "Body": "I started applying for jobs at the end of October. One unsuccessful interview so far. But there is a bit of a lull over Christmas... so... I guess all the offers will come pouring in any day now right?\n\nHow are you going?", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtedqpb/"}, "361": {"Subreddit": "PhD", "Author": "sallymander_56", "Date": 1517219132, "Score": 1, "Body": "Our University care only whether undergraduates get jobs as it goes on a leader board somewhere, e.g. we had over 85% get full time jobs within 6 months of graduating. There is not statistic for PhD's so... they don't care. They have companies come in and encourage undergraduates to apply with them. Once we've published our papers with them they care nothing about our futures.", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dtellgb/"}, "362": {"Subreddit": "PhD", "Author": "aritra91", "Date": 1517224453, "Score": 1, "Body": "There’s this hpc cluster called XSEDE in Texas which give account to perform simulations.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dtenjfr/"}, "363": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1517227698, "Score": 2, "Body": "I found it impossible to get permanent work, just a couple short-term contracts mainly due to my prior work in industry (I had my PhD after working in oil and gas for a while, and did the PhD in welding). I ended up starting my own company and go after short-term contracts as a full time occupation. It's not ideal, but I make enough to live on (based in the EU around 50k USD p.a.)", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dteowjt/"}, "364": {"Subreddit": "PhD", "Author": "Stroopcat", "Date": 1517233036, "Score": 2, "Body": "UK based, Humanities, graduated autumn 2017.\n\nI had no issue finding *a* job - I'm bilingual so very quickly got a job in an outsourced customer service centre.\n\nI do, however, have issues finding an academic job. I have a handful of publications forthcoming, teaching and research experience, and I specialised in a *sexy* subfield, so I'm getting interviews. Just no actual jobs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dterv63/"}, "365": {"Subreddit": "PhD", "Author": "DistressedABD", "Date": 1517241338, "Score": 1, "Body": "Thank you all for the valuable food for thought! Indeed, the best dissertation is a written one, since my committee is fine with the way things are going, I should concentrate more on writing and less on worrying about it. I will do more original work once this milestone is complete. Thank you all! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0tqv/constantly_worrying_about_the_originality_of_the/dteyq62/"}, "366": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517243604, "Score": 2, "Body": "PhD offers very specialized knowledge with very few practical skills.  Even postdocs have trouble finding jobs, maybe even more trouble than we do depending on field.\n\nWhat projects have you worked on outside of lab/academia?  That is a good place to start.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtf0zev/"}, "367": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517243737, "Score": 1, "Body": "She should be applying to several jobs a day (and all over the country), not a few a month.  Did she do a postdoc?  Many pharma companies won't even look at you without one.\n\nSeriously, science careers are a pain in the ass, even in industry now.  That's why I got the hell out of it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtf1490/"}, "368": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517243859, "Score": 1, "Body": "Yep.  The world doesn't need PhDs, it needs people with skills.  The \"academy\" is so out of touch it's sad.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtf18n2/"}, "369": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517247496, "Score": 0, "Body": "Typically, you will be doing your own research in a PhD.  Your work is what you come up with to do.  I'm not recognizing this concept of being given work.\n\nIf you know the aims of the project, why are you being assigned work?", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dtf51n2/"}, "370": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1517248030, "Score": 1, "Body": "Long term; plant.\n\nRegenerative Medicine sounds awesome, but the current dominant approaches are not exactly delivering on the lofty promises of the field and it is not sure if they ever will. I have a MSc in this field.\n\nPlants on the other hand are going to be useful basically forever. I assume you meant something in the area of plant genetics and not general botany.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tthik/what_topic_to_chose_for_phd/dtf5m9v/"}, "371": {"Subreddit": "PhD", "Author": "lsilvam", "Date": 1517248751, "Score": 1, "Body": "can you elaborate?\nMy background and MSc is on biological engineering, so both areas are appealing to me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7tthik/what_topic_to_chose_for_phd/dtf6ehj/"}, "372": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1517251262, "Score": 1, "Body": "Thanks for your answer.\n&gt; Why would a PhD program pay you to spend time exploring literature that other productive students are already familiar with?\nI was inferring that the time I will spend working on the actual phD program will be in my specific field of interest ( since I will try to narrow down which university and also as I understood, I might be able to make a case for it )\n\n&gt; Does your immigration status allow you freedom of career? If not, fair enough, you're stuck with either your employer or a university breathing down your neck. Otherwise, why not restructure your time-management or choice-of-job?\n\nI have a green card, I was considering doing consulting also. I would like to join a phD program because I could consider it as a job ( my own independent research is a different story... ) and also to have the added benefit of a degree at the end.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtf96jk/"}, "373": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517258587, "Score": 1, "Body": "Whoops, I probably didn't explain myself clearly.  I meant, of course you can join a PhD program, but perhaps you would consider changing your career for 6-12 months before you apply for a PhD program.  The idea would be to switch to a less-demanding job so you can get caught up on literature and publishing in your free time.\n\nEasier said than done, of course ;) but so is learning this stuff under pressure in a PhD program with the clock ticking.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtfh1ay/"}, "374": {"Subreddit": "PhD", "Author": "Sled_Pirate_Bobberts", "Date": 1517258835, "Score": 1, "Body": "This goes without saying, hence my not saying it. Obvious troll post is obvious. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dtfhaxr/"}, "375": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1517260970, "Score": 1, "Body": "Oh I see !\nI completely understand. I think the trouble of moving out, finding a less demanding job, and research/publish on my free time would not be a wise decision on my part. If it takes me years to catch up with the literature and publish that's not something I am willing to wait for, also the fact that working part time will not be optimal. If it takes 6/12 months for me to catch up/publish on a less demanding job, that would mean I can basically do the same in less time if I join a phD program in my opinion. What do you think ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtfjkyv/"}, "376": {"Subreddit": "PhD", "Author": "celt1299", "Date": 1517261285, "Score": 1, "Body": "What if they are paying me a stipend and reducing tuition, but not completely covering fees or remitting tuition? Would they have more buy-in to my success than a program that doesn’t fund at all?", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dtfjxf8/"}, "377": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517262476, "Score": 1, "Body": "&gt; would not be a wise decision on my part\n\nTotally possible.  Each person works differently, and it's a hard call either way.\n\n&gt; do the same in less time if I join a phD program\n\nWell, remember, you are going to be reading lit and publishing in your PhD program as a side activity, too!  Your main daily tasks will be things like helping your professors apply for their grants, and teaching.  You may be faster if you can get a work-free fellowship, but for some reason (in my observation) those folks never seem to publish much faster either.\n\n&gt; takes me years to catch up with the literature and publish that's not something I am willing to wait for\n\nWell, consider the motivations of your math department.  They have one set of motivations for admitting you into the PhD program, and another set of motivations for allowing you to graduate with your PhD.\n\nWhen they admit someone as a grad student, they have just gained a highly-educated, very-low-cost employee they can use to teach undergrad classes, bringing in department income and freeing up professors' time for more important activities.\n\nThey are only motivated to permit someone to graduate with a PhD when the candidate's research record (number, quality, speed) will bring honor and glory to the department.\n\nA high number of PhD students are never allowed to graduate.\n\nAre you willing to be welcomed into a math PhD program even if you are unable to accumulate a graduatable publication record, just for the honor of being a low-paid undergrad course teacher for a few years?", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtfl6zl/"}, "378": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517262583, "Score": 1, "Body": "Except that OP complained about not being given enough work.  Which is it: you are given work, or you make work?", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dtflb56/"}, "379": {"Subreddit": "PhD", "Author": "Sled_Pirate_Bobberts", "Date": 1517263154, "Score": 1, "Body": "I'm told by my PI that he wants to be involved and be in control of the project. He does discuss things with me, and accepts my input, but ultimately, won't allow me to do as much work as I feel I need to progress in a satisfactory manner. \n\nHow was this unclear from the original post? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t0h2i/convincing_myself_that_its_all_in_my_head_keeps/dtflwpz/"}, "380": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517263322, "Score": 2, "Body": "Well, the proper way to determine this answer is to calculate what the department is truly making from or spending on you.  Of course, this number is completely unrelated to the numbers they publicize in \"tuition cost\" and \"stipend\", etc.\n\nOne good university I know, they pay a stipend equal to fulltime minimum wage job ($20K), a full tuition waver ($30K), but they don't cover university fees ($1500/yr), so in that case, they are spending significant money on you, it's a job.\n\nBut other universities make a practice of paying some stipend and providing a partial tuition waiver so tuition is reduced from \"$55K\" to \"$23K\".  In my eyes, that's no waiver, that's just a publicity stunt, you are just a normal customer buying a degree from them, because you are still ultimately a source of income for them.", "Permalink": "https://www.reddit.com/r/PhD/comments/7rb5h5/should_i_wait_for_a_fullyfunded_program/dtfm2xb/"}, "381": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1517268332, "Score": 1, "Body": "&gt; Are you willing to be welcomed into a math PhD program even if you are unable to accumulate a graduatable publication record, just for the honor of being a low-paid undergrad course teacher for a few years?\n\nOf course not ! I can see that I had many wrong assumption about the whole process. I thought that by going down the road of a phD, I would spend most of my time at the office thinking about the subject of the thesis. I have never imagined that actually sitting down and working on that would be a side activity and that the full time position is teaching/helping.\n\nCan you give me an estimate on the time spent doing actuarial research compared to teaching and other things ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtfr0f0/"}, "382": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517272720, "Score": 1, "Body": "&gt; an estimate on the time\n\nIt varies widely.  Officially, you'll probably be expected to spend half time (20hrs) on teaching/grants/etc and the remainder on your progress, but many folks end up spending 40 hrs or more on teaching/etc.  Also, \"your progress\" may include classtime and classwork for any graduate courses that you are expected to take, which may or may not help you or be related to your research, and which may actually be a funding scheme run by your department to avoid more onerous work of undergrad courses.  I knew one professor who forced all his grad students to take a full load of grad classes all the way until the semester they'd graduate or leave, because it gained him brownie points in the department for funding reasons.  His students had a very hard time finding time to publish.\n\nWhen you say \"actual research\", there's many different research scenarios:\n\n* research (pilot studies and lit reviews) to support your professor's grant applications, on their choice of topics\n* light research as part of grad coursework projects\n* research (publishable work) from working as a research assistant on a professor's project that is unrelated to your own topic\n* research (publishable work) in the form of a collaboration with researchers from another institution, that your professor asks you to do to improve the professor's reputation for collaboration.  Their choice of topic, not yours.\n* Finding a professor who wants to hire you as a research assistant for their work that is the same topic as your topic is your best bet\n* Otherwise, if you want to do any of your own research on department time, you'll probably have to design a proposal and convince your professor that it will lead quickly to high-impact publications.  Depending how convincing your proposal, they might agree to give you part or halftime to work on it.  You are also free to plan collaboration with other researchers at the same or other institutions, which may increase the quality of your proposal.  To build relationships to enable such collaboration, you want to attend as many external talks, conferences, and events as possible, carefully chatting up other researchers.  This travel time will also probably come out of your \"progress time\".\n\n&gt; I have never imagined [...] that the full time position is teaching/helping\n\nAcademia is a career and industry like any other.  You've gotta make money, and if you don't, someone else will take your place  :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtfv98e/"}, "383": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1517296451, "Score": 1, "Body": "&gt; Finding a professor who wants to hire you as a research assistant for their work that is the same topic as your topic is your best bet\n\nI don't know why, but I was thinking since the beginning to do that. I understand it is not always possible, but I wanted to either :\n- Find a university/advisor whose interests align with mine\n- Have a compromise to work on something that doesn't align 100% with my interest but is enough of interest to me to spend 5+ years working on it.\n\nI have the freedom of moving anywhere in the US so I though this wouldn't be an issue ( compared to student stuck in their home city of birth )\n\n&gt; Otherwise, if you want to do any of your own research on department time, you'll probably have to design a proposal and convince your professor\n\nI was thinking of that too, but considering my knowledge in the field this would be highly improbable.\n\nLet me just expand a little bit on how I pictured the whole process to go and maybe you can correct me along the way.\n\n\n- First I would look for a location and school where I can see some of my research interests align with the school.\n\n\n- Then I would pass all the required tests that the school ask ( GRE, TOEFL etc ... ), and submit my application following the school guidelines\n\n\n- If I get accepted, I would start moving out in the city where the school is and start looking for a house to buy.\n\n\n- I will then proceed the follow some of the requirement for a phD submission which are in most case following some grad-level courses, passing multitude of exams to assess my math level and finally choose an advisor and draft a proposal ( or accept one from the advisor )\n\n\n- Then the following years are a mix of research, teaching, helping professors, publishing etc ( this I won't be able to know the ratio of time unless I ask students already enrolled in the program, which I am planning to do following your comments )\n\n\n- Toward the end of the scholarship, I will have to graduate by finalizing my dissertation and  finally have an oral hearing in front of a panel.\n\n\nMy goal here is mainly that I don't mind teaching at all, I actually love explaining. Being in academia also allow me to stay in this work related mindset that I don't have at my job anymore ( doing mostly the D in R&amp;D ). And of course ultimately, work hard on a problem, do math full time ( or quasi-full time ).\n\nIs that too far from reality ? It is pretty tough to find students experience online to be able to relate. do you have any piece I could read about other people experience ?\n\nAgain, you are very kind spending time on me ! Can't return the favor enough.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dtgdlqd/"}, "384": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1517296664, "Score": 3, "Body": "Everyone who has a PhD that doesn't have immediately recognizable skillsets within an organization or business will have a hard time finding a job (like my field of neuroscience, which has very few directly-related industry jobs out there).\n\nIf she does have skillsets that are valued directly, it's very likely she's competing with a ton of other people who may have more relevant skills to the product or pipeline, or possibly prior industry experience. Molecular bio or related wet lab work is especially competitive since so many research fields use these skillsets.  So you may need to size up the potential competition and figure out how to stand out - either in developing new skills, or in getting to know the right people.\n\nIt helps to broaden your perspective, if you've been focusing on only one type of job, or only one industry.  Also, networking!", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dtgdpeq/"}, "385": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1517297106, "Score": 1, "Body": "Definitely don't wait for support within your university structure or necessarily from your thesis supervisors.  For the most part, no one within academic systems are particularly incentivized to assist graduate students or postdocs with finding jobs.  It's not necessarily malicious; just a fact of life.\n\nIf you're worried about the job search, you're definitely not alone.  But don't listen to the \"worry about graduating first\" line - yes, finish your thesis and project, but do not fall into the \"I'm graduating next month, I need a job\" boat if you can help it.  The job hunt for the average person is typically a 6 month - 1 year process, depending on your current skillsets and the kind of job you're aiming for.   Generally, the earlier you start making moves to help yourself find your next step, the better off you'll be.  \n\nFeel free to PM me if you'd like a friendly ear; I've been counseling fellow PhDs since my own days in grad school. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7s92ke/does_your_phd_supervisors_also_go_completely_deaf/dtgdx2i/"}, "386": {"Subreddit": "PhD", "Author": "Aswad44", "Date": 1517311967, "Score": 1, "Body": "McGill or INSEAD or IESE. NEVER HEC MONTREAL", "Permalink": "https://www.reddit.com/r/PhD/comments/7p05le/phd_degree_in_business/dtgk1v2/"}, "387": {"Subreddit": "PhD", "Author": "tryingmyhardest88", "Date": 1517317092, "Score": 1, "Body": "Fought a kangaroo? [Was this you?](https://i.imgur.com/vFrsDnf.mp4)", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dtgmppe/"}, "388": {"Subreddit": "PhD", "Author": "numinelia", "Date": 1517329086, "Score": 1, "Body": "hi , thank you very much for your reply but I just wanted to know if it's possible for an international student to have an XSEDE account because I am not an american phd student if not do you please know about other suggestions for international students. sorry if I bother you and thank you very much for your help\nCordially. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dtgx1z0/"}, "389": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1517338604, "Score": 1, "Body": "I'm really glad to hear that it worked out for you and that the department was on your side. Unfortunately, there doesn't seem to be a lot that the department can (or wants to?) do. I've already talked to them all, and have broken down in front of them all. I've had to go to the doctor at work, since at one point I was sick for a long period of time. Even he had heard about Dorian and wasn't very surprised. I guess the problem probably is that I am on a project that John, Dorian and my previous supervisor have written together. John passed away and Dorian is the better of two evils when considering my previous supervisor. Changing at this point would probably mean starting from scratch. This would be fine... Would it not be that in my country you can get the statute related to a 4 year scholarship for a PhD only once. This means I would now be more expensive and since I don't have any publications as a first author so far, it would probably be hard to find a professor to make that kind of commitment for me to get a PhD. \n\nOn the bright side, I did have my first meeting with Sarah and some people of her team. It was more constructive than previous meetings with Dorian alone. Surprisingly, Dorian actually suggested to use the more strict threshold for a part of the data. He was still explaining all the results (although it is quite clear that he doesn't really understand the theory), without ever asking me (or anyone else) about our thoughts, but luckily Sarah and her team did. For the first time since long, I feel that there might be a small chance that my PhD can actually progress instead of standing still.\n\nI am very happy to hear that your department was so supportive though. It often annoys me more that there is an entire system allowing me and others to be treated in this way, than it does that there are people like Dorian treating others in this way. I am glad to hear that it isn't always that way. There may be hope for academia still.", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dth78y1/"}, "390": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1517340334, "Score": 1, "Body": "Thanks. I hope it works out for you and you can get out.\n\nIt's not necessarily about sending a message for me. It just angries me to the point where it's hard to focus on actually doing the work. Apart from that, I've tried just sucking it up and doing exactly has he says. That only led to regressing and having to do all the work again and again and again.\n\nAh well, I hope the inclusion of Sarah and her team can bring some prospects. I guess I should be patient, but it's hard after 4 years of the same mess over and over again.", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dth941v/"}, "391": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1517349735, "Score": 1, "Body": "I agree that it would be the best that I can hope for that he doesn't get recognized as my supervisor. However, I'm afraid that it is not entirely possible to drop him (for reasons I've explained in another comment).\n\nI do agree that it is better for future job applications to finish my PhD. This is probably one of the reasons I still haven't given up yet.\n\nI've had a meeting with Dorian, Sarah and some people from her lab that went surprisingly well (as I explain some more in another comment). Maybe this setup will be somewhat doable to progress in my PhD (instead of regress). It still annoys me that Dorian doesn't have to carry any real consequences for his behavior. One of my colleagues was an incredibly good researcher. Thanks to his experience with Dorian, he never wants to work in academia again (on top of suffering long-term effects on his health due to chronic stress). And this just gets to continue PhD student after PhD student. On the other hand, I'm not sure whether there is anything anyone could do to make Dorian realize that he is responsible. His abilities to deceive himself into thinking he's the most awesome professor ever are incredible. I remember an instance where me and another colleague were helping a third colleague who was inexperienced in our methodology. Dorian is always there the first hours of running a new experiment. There was something wrong in the code. Dorian was going to fix it. Both me and the other colleague had clearly said two or three times that we thought the problem was X. Half an hour later, Dorian \"finds\" that the problem is indeed X and starts bragging about how everyone always needs Dorian when things go wrong. As a matter of fact, now that I come to think about it there have been some consequences for him. He submitted a proposal to prolong the project that I (amongst others) am working on, and it got declined. He submitted an appeal against the decision and just told me last week that he's very convinced that they will still get the prolongation (ha!). Honestly, there's probably nothing anyone could say or do to make this guy take up his responsibilities. The best I can probably hope for is that Sarah can give enough counterweight so he doesn't get to control what goes into my PhD thesis anymore.", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dthjder/"}, "392": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1517350341, "Score": 2, "Body": "I don't think there would be any shame in quitting. In fact, I often think that at this point quitting would be a much bolder and stronger move than continuing. I'm definitely sure that my physical and mental health, and my relationship would greatly benefit. My bf has been telling me to quit for 2 years.\n\nI've been asking myself for so long why I really want to continue. For a long time it was because I was convinced that I wouldn't find another research job if I didn't continue. Then I found another research job... It's still somehow hard to let go of the PhD though. Sometimes I wonder whether it's just because I don't want my pride getting hurt (e.g. by having to explain for the rest of my life why I wasn't able to finish my PhD).", "Permalink": "https://www.reddit.com/r/PhD/comments/7svd0n/should_be_at_the_end_but_abusive_supervisor_has/dthk03v/"}, "393": {"Subreddit": "PhD", "Author": "becoming_better_", "Date": 1517350949, "Score": 3, "Body": "Yep, this.  Neuro PhD here and almost all skills I learned in school had zero comercial value.  I only have the job I have now because I refused to follow the \"have no other jobs\" rule during the PhD and obtained skillsets with market value.\n\nWhile my peers were slaving away in lab and complaining about my absenteeism, I was gaining relevant work experience far from campus and ignoring my advisor's emails.  Unfortunately it seems thats what it takes.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tl3lx/is_anyone_having_a_hard_time_finding_a_job_after/dthkmrb/"}, "394": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1517353448, "Score": 13, "Body": "LOL online university, online PhD\n\n+1LOL Online Engineering PhD", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dthn4rv/"}, "395": {"Subreddit": "PhD", "Author": "GoodbyeEarl", "Date": 1517355414, "Score": 3, "Body": "Engineering and Business Administration are two entirely separate fields. You should pick the one that you like better and go from there.", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dthoze6/"}, "396": {"Subreddit": "PhD", "Author": "sloth1sloth", "Date": 1517359010, "Score": 2, "Body": "Thank you so much. I actually has an interview today and it was okay... although they suggested I do an MRes (master of research) before the PhD... although I'm currently doing an MSc ... it was an odd experience. If I don't get this PhD I don't know whether to keep plugging for one! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qnr8m/anxiety_about_interviewsapplications/dths9i1/"}, "397": {"Subreddit": "PhD", "Author": "enpaix", "Date": 1517360713, "Score": 7, "Body": "Hahaha, I don’t think you actually understand what a PhD is.\n\nIf you’re actually serious, you need to start looking at scholarships and supervisors. A PhD shouldn’t cost you financially... (mental costs though are pretty steep)", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dthts5d/"}, "398": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517369447, "Score": 1, "Body": "&gt; I was thinking since the beginning to do that\n\nWell, many grad students try to do this.  It works out for some of them.\n\nLet's discuss what you'll be looking for in an advisor:\n\nNon-negotiable:\n\n* good at bringing in funding (even if you had enough saved up not to be too worried about this, a professor with little funding is a professor at the bottom of the totem pole and is getting shit from their colleagues, and probably won't be fun to work for)\n* willing to allow you to graduate (a surprising number of professors are control freaks and block their students from progressing, just for petty personal reasons)\n* happy at their job (many aren't, and may suddenly quit or transfer, forcing you to make tough decisions partway thru your degree)\n\nNegotiable:\n\n* researches the exact topic you are interested in  (there's probably 1-4 prof's in the US who qualify, if you've narrowed down your interests enough to publish)\n* researches a topic you approve of and respect\n* researches a topic that is close enough to your chosen topic that they have academic credibility to supervise and graduate you\n* good publication record in the last 4 years (if they aren't publishing, you won't be, either)\n* similar perspective on their research as you\n* similar perspective on academia as you\n* similar perspective on research publicity as you (if they are giving radio interviews and you want to crawl into a cave for 4 years, that's probably a bad match)\n* great research lab/group/community that you will join when you go to work for them\n\n&amp;nbsp;\n\n&gt; my research interests align with the school\n\nNope, you need to be picking an advisor or maybe an advisor plus a couple collaborators, not the school.  The school is just a publicity department to lobby for the prestige of their brand.\n\nHow to pick an advisor?  Back to reading literature.  Find a few papers you love, and figure out which of the authors are professors and are still researching that topic.\n\nNext step: Reach out to that professor, and try to get a conversation going.  There's no point at passing all your tests, paying the application fee, gathering references, etc, if your chosen professor is actually a jerk or is retiring next year or just got a grant to majorly change research topics.  Also, if they get to know you and like you, you'll find it is surprisingly easy to get accepted into the program ;-)\n\n&gt; start looking for a house to buy\n\nLook, you can totally do this.  But you're going to have much bigger problems to worry about than housing, so if it's enough trouble to be worth listing on your to-do list, maybe you should think twice.  \nPM me if you have more questions, this is all I can post.\n\n&gt; Toward the end of the scholarship, I will have to graduate by finalizing my dissertation and finally have an oral hearing in front of a panel.\n\nOne more factor: You'll need a \"committee\" that is the voting audience for your oral defense.  It will probably take you years of careful politics to assemble 3-6 professors that will agree not to argue with eachother and to respect eachother's research areas for evaluating your thesis, and who like you enough to work with you, for your committee.  Depending on your particular university's rules, some of these professors may be at different universities, or must research certain topics, etc.\n\nAlso:\n\n&gt; but considering my knowledge in the field this would be highly improbable\n\nEven if you manage to be one of those grad students who slips through the system without being able to write research proposals, you should know that your degree will not be much value to you afterwards without this skill.  Research when someone else designs it is a minimum wage job.  It's designing and positioning the research within the field that makes you valuable as a research expert.\n\nHope this helps :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dti2m9z/"}, "399": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1517371238, "Score": 15, "Body": "Since the other answers are jokes, here's a serious reply:\n\n* Online PhD programs are scams.\n* A real PhD program at a university is often tuition-free and pays you a basic wage for your research work. (\"fully-funded\")\n* A critical concept is that you spend thousands of hours face-to-face in-person working with other researchers and getting closely integrated into the research community.  That's why it can't be done online.\n* Also, just fyi, you don't take (many) classes for a PhD.  Instead, you read vast amounts of research publications and then design and execute similar research.", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dti4ftv/"}, "400": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1517371371, "Score": 3, "Body": "There are quite a few \"traditional\" schools that offer online doctorates.  I am not sure what each school offers, but off the top of my head there are many schools moving online.  Harvard extension, University of Penn, Penn State, University of North Dakota, Texas A&amp;M, Princeton, to name a few.  Look at schools you would normally look to for campus based degrees and you may find some online.  Of course there are some that really cannot be taught online and some that require longer residency.  I doubt you will find an enginerringg one online, but business degrees are often a good fit. Most schools will be offering some form of graduate degree online in the next 10 years.  It is simply too strong of a push to ignore.\n\nSo ignore the people putting down online degrees.  I doubt anyone will care if you got a degree online from MIT.  It is more about the school and if the topic can be taught using distance learning.  \n\nCost is something different.  If you are lucky enough to have someone else pay for your degree, you will be working it off.  They are not doing this out of the kindness of their hearts.  This is something every doctorate student should understand before they start the program.  You WILL work off the cost of the education, usually in research.  But, you will often be limited in topics as to what the school or your supervisor wants.  If you pay for your own way you will have more options for your research and often finish the degree faster since you are not working off your tuition.\n\nThere are definate advantages to having your way paid, but I have seen many people drop out from the stress or the fact that their supervisors keep holding them back so they can get more work out of the student.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dti4k8s/"}, "401": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1517400120, "Score": 6, "Body": "Hi! I can understand that it's difficult for you to grasp new things. Having a shitty supervisor is not of any help either.\nYou could ask the other people in the lab to take a look at the procedure when you are doing it so that they might be able to offer you some tips on how you might be able to do it better. \nYou should read much more even if you don't feel like it and try to understand the concepts. You will begin to feel more confident as you get to understand the topic better.\nHave you done your Masters? If so, then it'll easier for you to grasp the concepts. \nAll that being said, don't let anyone or anything pull you down. You have sacrificed and struggled a lot to get here. Make sure you don't let anyone take it away from you.\nGive it everything you've got.\nAll the best!", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtijgr6/"}, "402": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517400387, "Score": 2, "Body": "Thanks for the reply. \n\nI did a masters several years ago, but due to various screwups it was more computational than lab based. \n\nI’ve had people check the procedure repeatedly, they have small suggestions but most are happy enough with it. That everyone except my boss is happy is part of my problem. \n\nAnd you’re right about the reading, I do try but finding time is quite difficult in the lab. Thinking of doing it last thing at night after my partner has gone to sleep. \n\nBut despite working so hard to get here it doesn’t feel worth the trouble. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtijlbq/"}, "403": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1517400398, "Score": 3, "Body": "Hi! Sure sounds like a bad situation. I'm thinking of doing a PhD but this has got me thinking. I hope things improve for you.", "Permalink": "https://www.reddit.com/r/PhD/comments/7u8kow/writing_down_my_frustration/dtijliv/"}, "404": {"Subreddit": "PhD", "Author": "aritra91", "Date": 1517401911, "Score": 1, "Body": "Let me check", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dtikdlw/"}, "405": {"Subreddit": "PhD", "Author": "botany4", "Date": 1517403489, "Score": 2, "Body": "hi fluffy \ndont get dishearted from my experience but the thing i tell everyone asking me is take time to research where you do your phd and its not a shame to quit after 3 months if you notice its nothing for you.\n\nAlso think about if you need one for what your are planning to do in your life. I always wanted to be in science but now after experiencing it first hand with all its fraud, corruption and egomanics its kind of gone for me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u8kow/writing_down_my_frustration/dtila9q/"}, "406": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1517406488, "Score": 4, "Body": "Hey man, I think the root of your problem is your supervisor maybe. I suggest trying to reason with them and set up consistent, manageable weekly/ monthly goals. Otherwise, they are going to continue working you into the ground.\n\nIf this isn't possible, I think you are justified in finding another lab/advisor. It's not worth being miserable for such a long time. PIs make or break the experience for you. You deserve a mentor that is responsive and willing to back you up. Not one that makes you feel the way you are feeling", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtinb9t/"}, "407": {"Subreddit": "PhD", "Author": "nondifferentiable", "Date": 1517409102, "Score": 3, "Body": "I always set aside time for reading as the first thing in the morning after I get to my lab. I've found that I can perform experiments in the afternoon but I'm not focused enough (at least not as much as I'd want to be) to read papers.", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtipe1l/"}, "408": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517409344, "Score": 2, "Body": "Reasonable idea. I usually prefer to get my experiments done first thing Incase another chore/task turns up. Maybe I should try that instead. I try to get to the lab early every day, so perhaps I can set aside time early morning? Or depends on the day. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtiplhn/"}, "409": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1517409597, "Score": 4, "Body": "I try to hang out with friends at least three times per week. Thrice is enough for me to feel like I'm emotionally 'topped up'.\n\nThere's also the issue of getting used to the sense that you're behind the 8-ball. It's okay. Let go of that feeling and just do your best. Then I think PhD becomes more enjoyable!", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtipt5d/"}, "410": {"Subreddit": "PhD", "Author": "tends2forgetstuff", "Date": 1517413658, "Score": 10, "Body": "I am now a PhD candidate in dissertation phase. I am learning to take scheduled breaks - especially taking a weekend off from any work or school. I work full time so this is a challenge as it is so easy to feel behind. I kept comparing myself to my peer group as well which was driving me nuts as I would feel incompetent or again, very behind. It may sound odd but another thing I do to make myself feel better is just research. I don't necessarily take a bunch of notes and stress over, I just research what is out there in my topic so I feel like I have a better handle on the knowledge/research depth out there. That seems to help a lot. \n\nEat the elephant one bite at a time, decide what to prioritize including yourself and time to relax - which means no thinking about school work. Redirect thoughts if you have to or even redirect yourself physically to an activity you enjoy. I have a tendency right now to choose mindless stuff like games or binging on certain television programs. I think its because too much is going on in the brain and we tire out - we need to recharge.\nI also have a PhD buddy - we started together in our first class and now are in year three dissertation. He was so much support during comps and now in writing. It might help to find one for yourself. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtitlok/"}, "411": {"Subreddit": "PhD", "Author": "radicaldreamer05", "Date": 1517418250, "Score": 2, "Body": "Great advice. Thank you! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtiydiq/"}, "412": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517420396, "Score": 3, "Body": "My supervisor is universally acknowledged as a bully and worse. He isn’t generally open to reason, he’s all about tough love I suppose, not the supportive mentoring type. \n\nAnd as I said before: I struggled so hard to get anywhere in this field, I think I got 34 failed interviews over 2 years. Maybe I’d do better now that I’ve been in the lab for a while, but apart from my supervisor I actually like it here. \n\nI’d prefer not to leave if I can avoid it. I’d rather try to just survive day by day for a few more years. Being long term unemployed and desperate isn’t something I want again. And no guarantee I won’t find another one in my next job. Better the devil you know I suppose. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj0olh/"}, "413": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1517420687, "Score": 3, "Body": "That sounds rough, man. Well, I hope you can muscle through it.\n\nWhat works for me is that I vent to other students in my lab about stuff. It seems like a lot of people know your supervisor is tough love. Maybe talk to them about it? Also, maybe contact past students that were in his lab and ask how they got through?\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj0zz7/"}, "414": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517421217, "Score": 3, "Body": "The other students here are very supportive, but I try not to bother them with my problems. Part of that problem I suppose is that I’m just inexperienced enough in the lab to take his criticisms without much initial confidence. Difficult to learn if your efforts are endlessly criticised, especially when no one else sees the problem. \n\nAs for past students, I’m tempted but since I don’t know them, this seems to me a bit too personal/inappropriate to ask about. But perhaps I should try. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj1kvk/"}, "415": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1517421938, "Score": 5, "Body": "Yeah, definitely. The way I would tackle that issue is to plan a lab event or get together. Maybe go out to see a movie and have some dinner with everyone (or as many people you can get). I go out with the only other grad student in my lab almost weekly, and talking about life and work stuff really takes the stress off. If you're anything like me, sometimes just having someone to talk to relieves stress.\n\nFor the past students, I think you should definitely contact them. Invite them to coffee if they are close by. \"Hey, I'm a student in so and so's lab, just wanted to meet up and see if you had any advice for me!\" If someone contacted me about that, I would definitely meet up with them. People love to feel needed and useful.\n\nAnother thing to consider is getting mental help. Check to see if your school has a counseling center. Make an appointment and go talk to someone, even if you don't feel your problems are important enough: trust me, they are. Take advantage of those resources. You deserve to be happy, or at the least, comfortable in what will be the next 3-5 years of your life. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj2cf7/"}, "416": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517424633, "Score": 3, "Body": "That’s an interesting idea, worth thinking about. My colleagues all like going out sometimes together, we could invite any nearby students. \n\nAs for the mental health counselling, I’d prefer not. I don’t think I’d have time and it seems like a waste. I feel I should learn to handle it if I can. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj58sy/"}, "417": {"Subreddit": "PhD", "Author": "bblunted", "Date": 1517425869, "Score": 4, "Body": "Yes, I totally get it. I am a big ball of nervous energy with too many deadlines on my mind. To help, I enrolled in a meditation course at my university, I use J&amp;J baby nighttime bubble bath (for bath and shower gel),try to play a short boardgame with partner when I can't calm down (this helps me use my nervous energy in a fun way), and I hate to admit it but I do a meal delivery service so I eat some what healthy. The meal plan service is really great because I don't have to think about dinner just spend 30 mins cooking. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtj6kjy/"}, "418": {"Subreddit": "PhD", "Author": "funnyprofessor", "Date": 1517426526, "Score": 2, "Body": "I'm at the same point with mine. I just keep plugging away every day even if it's just for a couple of hours. Just make sure to take breaks when you need them, and try to keep some sort of routine. Also, see the doc if you need some meds to bring you out of the funk. There's no shame in seeking medical help.", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dtj79hv/"}, "419": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1517427172, "Score": 1, "Body": "Well, best of luck to you :)\n\nCheck out /r/GradSchool too for more emotional support haha", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj7y28/"}, "420": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517427862, "Score": 1, "Body": "Thanks, I really do appreciate the advice. When I have slightly more energy I'll probably eat my words and do it anyway!", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/dtj8oyr/"}, "421": {"Subreddit": "PhD", "Author": "snacq", "Date": 1517428018, "Score": 8, "Body": "Drink enough water, eat (somewhat) healthy, work out, don't work when you get home (you will always have more to do... accept that your work ends when you leave), and learn when to say 'fuck it, i did my best, and that is all i can do'\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtj8ush/"}, "422": {"Subreddit": "PhD", "Author": "snacq", "Date": 1517428057, "Score": 6, "Body": "The most important is having a scheduled work day rather than always kind of working", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtj8w9o/"}, "423": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1517430483, "Score": 1, "Body": "I've thrown myself into sport in my 'spare' time. I play rugby twice a week which helps keep me socially same and allows me to burn off steam. Also the gym helps me processes things if I can't stare at a screen for another minute longer", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtjbi22/"}, "424": {"Subreddit": "PhD", "Author": "aritra91", "Date": 1517431096, "Score": 1, "Body": "XSEDE probably does not allow non US university students. What I found with a bit of searching is that generally accessing such hpc clusters needs a PI’s name , university and then a student name. Some are less strict than others in giving access to other university students. I suggest you look for universities in your country that have hpc cluster and mail their support requesting access. \nHopefully this helps!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dtjc74g/"}, "425": {"Subreddit": "PhD", "Author": "GoodbyeEarl", "Date": 1517434448, "Score": 2, "Body": "I do not work when I go home for the day, or on weekends. Really important for my mentality. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtjfxfg/"}}