{"0": {"Subreddit": "PhD", "Author": "Netcat2", "Date": 1509499151, "Score": 1, "Body": "One of my supervisors did his PhD in a connected area to mind yet from talking with him he doesn’t seem to have a great understanding of the topic. I’m currently doing a side project with another Dr. who despite assuring me knows the area well, absolutely doesn’t. \n\nPhDs seem to be very good at acting like they are smarter than they are. The contribution you need to make doesn’t need to be huge, and I’m more or less convinced most thesis’s are nothing more than polished turds that are sold well.\n\nFind a problem, apply a bandaid and sell your polished turd.\n\nAlso don’t quit, you’re only not good enough for a PhD when they forcibly remove you from the university. ", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp65k5r/"}, "1": {"Subreddit": "PhD", "Author": "mowkiemowkie", "Date": 1509508409, "Score": 1, "Body": "It is very common to do a PhD in France after an engineering school. My relatives and I did not have much trouble finding one (in France, UK and Germany after engineering schools in France). Maybe you just need to find the right place, the right project and the right supervisor. Maybe you're also applying at a not ideal period (most people I know applied between April and August to start between October and November, and there were lots of offers between April and August).\n\nThere is a French website called Association Bernard Gregory (ABG) with PhD offers in France, in Luxembourg, in Switzerland and in the UK, mostly in French but sometimes also in English. You should check it out! ", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dp6cq60/"}, "2": {"Subreddit": "PhD", "Author": "2xw", "Date": 1509526476, "Score": 1, "Body": "We had a talk from the UKRC people and the funding will be guaranteed. That's if brexit even happens anyway. ", "Permalink": "https://www.reddit.com/r/PhD/comments/6y6elm/how_will_brexit_affect_my_studentship_funding_in/dp6k615/"}, "3": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1509609460, "Score": 6, "Body": "Scholarships are separate from admissions, you're right about that. I think I found out about APA which us now RTP in December or January. I found out about admissions straight away because I applied to start straight away. Our PhDs can start whenever you want them to. If you applied for first semester though, I wouldn't count on finding out before the end of January. You can email them to see how it's progressing though.\n\nEdit: just realised you could be masters. I assume you'd find out about that by the end of January as well.", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dp8b916/"}, "4": {"Subreddit": "PhD", "Author": "msidari", "Date": 1509620962, "Score": 2, "Body": "Just checked my email from last year - I got my RTP scholarship on December 16th. Conditional offer for admission was on November 18th and unconditional offer was on December 14th.\n\nMine was for Q1 this year. It might vary by university though! I go to University of Queensland, for reference.\n\nGood luck! :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dp8fcli/"}, "5": {"Subreddit": "PhD", "Author": "Becca-Reyna", "Date": 1509621135, "Score": 1, "Body": "Usually your university should be able to recommend a place to get it hard or soft bound. Failing that, Google bookbinders in your local area, or look for bookbinders online who would be able to do it. It might also be worth checking out r/bookbinding (sorry for  formatting, am on mobile).\n\nGood luck with the defense! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7a8m7i/where_to_get_my_thesis_bound/dp8ffd2/"}, "6": {"Subreddit": "PhD", "Author": "therealsutano", "Date": 1509624553, "Score": 1, "Body": "https://www.lulu.com\n\nYou can go through the process as if you're going to sell it then only buy author copies and not release it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7a8m7i/where_to_get_my_thesis_bound/dp8h5uh/"}, "7": {"Subreddit": "PhD", "Author": "smoukje", "Date": 1509625445, "Score": 1, "Body": "I’m in the exact same state of mind. Actually quite happy to see these questions reflected here!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dp8hosg/"}, "8": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1509632127, "Score": 1, "Body": "Do you have any information about how many PhD students does Australia give scholarship to every year ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dp8mour/"}, "9": {"Subreddit": "PhD", "Author": "ColdInNewYork", "Date": 1509657143, "Score": 1, "Body": "Don't do your PhD in Japan...there is a reason most people come to the US to study economics. And you will have a much harder time finding a job in the US afterwards.", "Permalink": "https://www.reddit.com/r/PhD/comments/79dxor/econ_ma_soon_to_be_but_want_to_go_abroad/dp9bmm5/"}, "10": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1509676858, "Score": 1, "Body": "What sort of time delay was there between applying and hearing back for admission alone? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dp9sifk/"}, "11": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1509678051, "Score": 1, "Body": "For me it was very fast but I was not applying when everyone else was (I applied in September), I had just been a student at the university and I'm a citizen. So I think I heard back within a week or two.", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dp9tiuw/"}, "12": {"Subreddit": "PhD", "Author": "DickBrownballs", "Date": 1509699474, "Score": 5, "Body": "As a Brit I can't say if you will be disadvantaged on return to the US, but I can partially explain why so many Europeans (specficially in science) travel to the US for a PhD or post-doc. On the path to becoming an academic here, having experience working abroad is considered a major plus on the CV, some would say it is even mandatory, because it shows an ability to get used to different working environments. The US is popular because for non-English speakers it shows you can work in the English language which most science is conducted in, and it's considered a shorthand way or saying you will but in the 70 hour weeks that many academics do, which appear to be more common in US grad school than European ones.\n\nIn my niche field of analytical chemistry, French institutions are probably the world leaders, and many US post grads and post docs travel to France, in order to go back to academic positions in the US, but just as many French academics will have had PhDs/postdocs in the US even at second tier US institutions because it shows on your CV that you've got good English skills and a willingness to work the long hours. It could be output driven based on publication and reputation of the institution as well, but certainly in my field that isn't the main reason.", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpa4gvj/"}, "13": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1509706552, "Score": 2, "Body": "This is actually a fair representation of my slacking off. I know I need to write buuut video games.", "Permalink": "https://www.reddit.com/r/PhD/comments/7acips/where_im_heading/dpa7239/"}, "14": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1509710019, "Score": 3, "Body": "Top schools, not only top American schools. Big papers are coming as well from Oxford, Cambridge, UCL, ETH, EPFL, etc. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpa8pjr/"}, "15": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1509710169, "Score": 6, "Body": "It's not an American thing only. There are many international students at the university in Europe where I am located (about 6000 international students, +-50% of the student population), and they also say that they came here for better education.\n\nIn fact, if you look at this map showing where the universities with the highest percentages of foreign students are located, you see that there are many more European than American universities in the list of most international universities:\n\nhttps://www.timeshighereducation.com/sites/default/files/web_map.jpg", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpa8sdx/"}, "16": {"Subreddit": "PhD", "Author": "MrsPickles90", "Date": 1509729025, "Score": 1, "Body": "And the temptations are so much harder to resist on cold, autumny evenings", "Permalink": "https://www.reddit.com/r/PhD/comments/7acips/where_im_heading/dpapfzj/"}, "17": {"Subreddit": "PhD", "Author": "rarles", "Date": 1509738957, "Score": 1, "Body": "Because they often pay especially for a Ph.D. \n\nIn Europe you can get a Ph.D. quickly and amazingly cheaply but good luck getting funding. In the Netherlands, Ph.D. study is even free. But what are you going to live on?\n\nIn the U.S., regardless of nationality, if you are accepted into a Ph.D. program they will often fund your time there  ( grants or teaching or combo) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpazbax/"}, "18": {"Subreddit": "PhD", "Author": "TheAxeC", "Date": 1509746967, "Score": 3, "Body": "In Europe (especially Netherlands and Belgium), unfunded PhD's are pretty much unheard of (at least for EU nationals). \n\nFunding can be arranged in multiple ways.\nThe professor might pay you with grant money (~60% of all students)\nTA's are another way, though much more rare.\nFinally there are multiple funding agencies, but they are very competitive.\n\nThe funding even pays a lot more compared to the US. \nI often read here how PhD students are often paid about minimum wage.\nPhD students in the Netherlands are considered employees and thus have all advantages (vacation etc).\nThe pay is slightly less compared to industry (for STEM) =&gt; in Belgium, in Netherlands the pay is worse.", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpb6p9m/"}, "19": {"Subreddit": "PhD", "Author": "cephalord", "Date": 1509747343, "Score": 5, "Body": "&gt; In Europe you can get a Ph.D. quickly and \n\nEuropean PhD programs are typically one or two years shorter than their US equivalents. This is offset by the fact that a Master's degree is typically required to enroll in one.\n\n&gt;In the Netherlands, Ph.D. study is even free. But what are you going to live on?\n\nIn the Netherlands, PhD candidates are university employees and get a salary and benefits. The pay is not _good_ relative to the level of education required, but it is easily sufficient to comfortably live on.", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpb70pb/"}, "20": {"Subreddit": "PhD", "Author": "handsignals4theblind", "Date": 1509842336, "Score": 1, "Body": "Actually more interesting than an actual game of football or soccer to you Yanks eh", "Permalink": "https://www.reddit.com/r/PhD/comments/7auhzk/philosophers_football_monty_pythons_fliegender/dpcw5c2/"}, "21": {"Subreddit": "PhD", "Author": "NewJerseyRed", "Date": 1509856302, "Score": 1, "Body": "As an international student myself I would definitely say the academic environment in the USA is way better than back home(India). American programs are definitely more rigorous, well structured and really make you apply yourself a lot more than the Graduate programs in India. A lot of Indian Universities don't update the syllabus or give professors any leeway to teach the way they want. The universities usually come under a central University that sets the syllabus and exams. I am talking about Master's programs here though. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpd6qcj/"}, "22": {"Subreddit": "PhD", "Author": "icecoolsushobhan", "Date": 1509922155, "Score": 4, "Body": "Typically, a recommendation letter *for grad school* should talk about your academic background, because that's the most relevant thing. Therefore, I'd say stick to letters from professors. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpecpyo/"}, "23": {"Subreddit": "PhD", "Author": "CaprockJack", "Date": 1509922699, "Score": 1, "Body": "Thank you. I figured as much, but didn't think it hurt to ask. Much appreciated!", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dped88r/"}, "24": {"Subreddit": "PhD", "Author": "MrsPickles90", "Date": 1509929544, "Score": 2, "Body": "Do they not tell you? I know for me I was asked to submit 2 from an education background and 1 from employer ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpej9ui/"}, "25": {"Subreddit": "PhD", "Author": "CaprockJack", "Date": 1509931479, "Score": 1, "Body": "The two schools that I'm looking into so far don't specify exactly, they have only said \"three letters of recommendation\".  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpekv09/"}, "26": {"Subreddit": "PhD", "Author": "MrsPickles90", "Date": 1509932704, "Score": 2, "Body": "If you want to be certain which one you need contact their admissions office, they should be able to confirm ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpelw1t/"}, "27": {"Subreddit": "PhD", "Author": "oh_wuttt", "Date": 1509933845, "Score": 4, "Body": "This is the best piece of advice for any application-related questions. Don’t be afraid to ask them.", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpemudl/"}, "28": {"Subreddit": "PhD", "Author": "CaprockJack", "Date": 1509935413, "Score": 1, "Body": "I'll do that. Thank you all! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpeo78x/"}, "29": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1509935443, "Score": 2, "Body": "What field? A PhD is a research degree so usually your letters should come from academics. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpeo86p/"}, "30": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1509956247, "Score": 3, "Body": "It depends on the type of work you did for the employers: was it research related?  If so, it would be okay since they can speak to your relevant skill sets. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b0um3/phd_recommendation_letter_question/dpf0z9z/"}, "31": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1509989102, "Score": 1, "Body": "I guess you're based at University college London?", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpfl9km/"}, "32": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1509989552, "Score": 2, "Body": "Nope, not located in the UK.", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpflq1e/"}, "33": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1509990125, "Score": 1, "Body": "Woops my bad!", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpfmavc/"}, "34": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1510005119, "Score": 3, "Body": "I'd advise not going with #3. Advisers who don't show interest in working with you and being there as a mentor can make your experience an awful one.\n\nBetween the other two, it's a little harder. I'm not sure what research you're into, but funding is definitely a huge priority. You can probably branch out to other areas of your interest if you work with #2 so long as she has the means to support you. Between #1 and #2, I'd go with the person who can help you gain the skills you want to learn (not necessarily the one who studies your exact research interests; so long as you think you'll enjoy the areas you'll be working in, I think you can go with either). It's also important to have a good relationship with your mentor; there, go with your gut. Who do you think will be constructive and supportive that you could go to in a crisis and work with you on the problem?\n\nHope that helps!\n\nEdit: As an additional note,going into uncharted territory with #1 isn't necessarily a bad thing. If you work well together and he can get the funding, it could be incredibly fun and challenging. And you may get the chance to travel to learn techniques he isn't set up to teach, depending on your area of research.", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dpg124b/"}, "35": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1510021748, "Score": 1, "Body": "Unless you're planning to work in academia, then forget the PhD. Looking at your background, perhaps a MBA with a focus on international risk and security analysis. Another avenue might be working for one of the think tanks in DC. Finally, there's always the UN if you are interested in staying in the international field.", "Permalink": "https://www.reddit.com/r/PhD/comments/77p67n/been_considering_a_phd_or_2nd_ma_for_7_years/dpgfhvd/"}, "36": {"Subreddit": "PhD", "Author": "StayinOutOfMiceChief", "Date": 1510034791, "Score": 1, "Body": "Thanks!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dpgovvq/"}, "37": {"Subreddit": "PhD", "Author": "sxpx00", "Date": 1510042221, "Score": 2, "Body": "I think the answer depends on your field. But on first take, I would definitely say 2. Though you have different research  interests you are at such an early stage and it is likely these will change and grow as you move along in the program. Having someone well connected on your team is never a bad thing. Also, I would avoid 1 at all costs. Experienced supervisors bring a lot to the table - they know how to supervise.AND get a student through to completion in a timely manner. From what I've witnessed- advisors with minimal experience (even if they are tenured already)  tend to micro manage rather than let your project grow organically so that it is your own. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dpgs3ay/"}, "38": {"Subreddit": "PhD", "Author": "williamarbour", "Date": 1510045061, "Score": 5, "Body": "Can you have #2 as main advisor and #1 as co-advisor? Seems like a good combination to me! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dpgt3fn/"}, "39": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1510055675, "Score": 2, "Body": "It was a decent guess though, from what I've seen UCL has similar numbers of students and international students.", "Permalink": "https://www.reddit.com/r/PhD/comments/7aehds/why_are_american_graduate_schools_highly_sought/dpgwvm0/"}, "40": {"Subreddit": "PhD", "Author": "StayinOutOfMiceChief", "Date": 1510061586, "Score": 2, "Body": "The good thing about #1 is that he recognizes the down falls in his inexperience. He has never want to be my sole advisor. He has always wanted to co-advise me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dph03qv/"}, "41": {"Subreddit": "PhD", "Author": "sxpx00", "Date": 1510069152, "Score": 1, "Body": "Well then I think you know the answer to your own question ", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dph6dzo/"}, "42": {"Subreddit": "PhD", "Author": "jinqianhan", "Date": 1510090917, "Score": 1, "Body": "Industry postdoc here:\nNot normal to be depressed all the time, and unless you take specified action to prepare for what comes after the PhD, things will not be better when it's over (depending on what field of study you're in, if you're in the sciences, you're going to be pigeon holed into a postdoc unless you know you want to leave academia and make the connections/skill development early; if you're in statistics, cs, AI, then I'm surprised people aren't already bidding for you). \n\nSeek help asap, find support groups, and make sure you have an end game in mind, otherwise you're going to just get more depressed after you graduate.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/dphsa5m/"}, "43": {"Subreddit": "PhD", "Author": "Invyz", "Date": 1510099368, "Score": 10, "Body": "Tax cuts for the rich and then give a hefty tax increase on my barely livable 20k a year. wtf. I sincerely hope the university system does something to fight or at a bare minimum account for this in stipends....", "Permalink": "https://www.reddit.com/r/PhD/comments/7bgq67/the_gop_tax_bill_could_be_a_disaster_for_phd/dphzvoy/"}, "44": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1510103874, "Score": 7, "Body": "I have a 3D-printed bulbasaur!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpi3s4g/"}, "45": {"Subreddit": "PhD", "Author": "thomasare", "Date": 1510105665, "Score": 3, "Body": "I have a color-changing LED skull light, a bat skeleton, and a trilobite fossil in my lab!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpi5bja/"}, "46": {"Subreddit": "PhD", "Author": "maelstromscientist", "Date": 1510107267, "Score": 3, "Body": "My university still hasn’t addressed the issue even after some grad students raised hell.  Given that they cared very little about grad student salaries as it is, I’m not very hopeful that my department will do anything.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bgq67/the_gop_tax_bill_could_be_a_disaster_for_phd/dpi6p92/"}, "47": {"Subreddit": "PhD", "Author": "yoshidrivesacar", "Date": 1510115986, "Score": 3, "Body": "I have a couple cross stitches I've made; one says \"Hang in there\" because I might quit otherwise. Also a Bob Belcher keychain!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpidtzn/"}, "48": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1510124428, "Score": 2, "Body": "Female #1 young guy #2. Personally would rely on sometime who's had years of experience plus resources/connections. Although it comes down to your PhD above all else. Assessing, supporting etc", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dpiioeq/"}, "49": {"Subreddit": "PhD", "Author": "manicmuncher", "Date": 1510131195, "Score": 3, "Body": "We have an open office with no assigned desks so no decorating. It super sucks. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpilg5b/"}, "50": {"Subreddit": "PhD", "Author": "laurtood2", "Date": 1510145090, "Score": 1, "Body": "I have a little notepad with science memes on it I got from the wholesome memes Reddit exchange. They're hilarious, and I try to rotate them occasionally. I've also got mini dragon eggs. But I'm in a shared office so just stuff on my desk :-/ ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpiqzdl/"}, "51": {"Subreddit": "PhD", "Author": "here_for_cooking", "Date": 1510160352, "Score": 14, "Body": "This will depend a lot on your institution. Usually, MA dissertations are marked by two different academic staff and the average is then submitted as a mark. So your first step would be to find out if there is a big discrepancy between what the first marker gave you and what the second marker gave you.\n\nIt also seems as if you had a \"First\" as a projected mark for your MA. You can use that as well to strengthen your case since the final mark did change because of that.\n\nNow when you have collected this information, you can start to work on an appeal. Most universities in the UK have a formal procedure for this, including specific deadlines. However, they still mostly use this procedure to get rid of complaints. \n\nYou CANNOT challenge \"academic judgment\" of your examiners. That is a hopeless endeavour because any institution would be flooded by complaints if they allowed that. So they just say that academic judgment is final. This is harsh and unfair but also a good representation of life in academia. \n\nInstead, you have two options: Either Option 1: extraordinary hardship or Option 2: evidence of prejudice or bias.\n\nFor Option 1, you will need some kind of documentation that you were ill. Also, it would have been better to submit that documentation to your institution while you were ill, but it is obviously too late for that. Gather all documents that are available that describe your illness.\n\nOption 2 will be much harder to document. I assume that your supervisor has been careful not to bully you in writing or in front of anyone else. I do not think that appealing on those grounds will be successful. But if it is, the second marker's opinion will be essential for this.\n\nYou need to sit down and create a battle plan because the odds are not in your favour. \n\nFirst, find out what the appeal procedure is in your institution. That will give you an idea of what you can use as an argument for a better mark. \n\nSecond, speak to an academic tutor you can trust if you have one. Do not speak to them if you suspect them to gossip about you. If your supervisor finds out about this, they will want to avoid damage to their career that is inevitable if bias on their part is documented. \n\nThird, speak to support services in the student's union, they are on your side and might have dealt with this in the past. \n\nApart from that, have your recommendation letters in order. Do not ask her for a recommendation letter. Just go to the lecturers that you clicked with and where you had the best marks (compared to other students). But you should be aware that academia is small and people depend on each other. If you want to succeed in the same field as your supervisor, you will now have someone who does not want to work with you.\n\nGood luck.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dpj3qc5/"}, "52": {"Subreddit": "PhD", "Author": "ExsquiteInformation", "Date": 1510161849, "Score": 1, "Body": "Thank you so much for this advice, you have really given me hope that I can do something. Been a hard day so nice to receive some support as my family are not in academia themselves and also have no idea what to do. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dpj598b/"}, "53": {"Subreddit": "PhD", "Author": "Stroopcat", "Date": 1510166842, "Score": 3, "Body": "Seconding all of this. Also speak to your Department to see whether your dissertation marking was externally moderated and if so, by whom. If it wasn't moderated, contact the Board of Examiners or a similar party and request it be moderated. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dpjaf8f/"}, "54": {"Subreddit": "PhD", "Author": "actual_ghost", "Date": 1510176337, "Score": 4, "Body": "An empty champagne bottle from when I passed my qualifying exam, my collection of magnets that come in DNA isolation kits,  and I hung up a beaded bracelet my little cousin made for me", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpjjusn/"}, "55": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1510181601, "Score": 1, "Body": "Wow that's quick. It's been a week and a half since the deadline closed and over three weeks since I applied, so I'm starting to get a bit nervous. I'm a citizen, but haven't studied at the university in question before :/", "Permalink": "https://www.reddit.com/r/PhD/comments/7a9l1a/when_do_you_find_out_about_australian_admissions/dpjoqdm/"}, "56": {"Subreddit": "PhD", "Author": "ExsquiteInformation", "Date": 1510184155, "Score": 2, "Body": "Thanks for the advice. Will be acting upon all this info once my department has responded to my call and email! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dpjqxfk/"}, "57": {"Subreddit": "PhD", "Author": "gallanon", "Date": 1510208019, "Score": 1, "Body": "I just gave this a try and it's amazing! Thanks for sharing.", "Permalink": "https://www.reddit.com/r/PhD/comments/7a52wm/i_just_found_this_tool_which_uses_machine/dpk8l03/"}, "58": {"Subreddit": "PhD", "Author": "rsapolsky", "Date": 1510239603, "Score": 10, "Body": "That sucks and the environment you’re in seems toxic (you shouldn’t be called names). Before you quit, talk to someone else to gain some perspective, be it another faculty, student, therapist, etc. Also, if you can, try to walk away with a masters from your program. \n\nHang in there. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpknr9b/"}, "59": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1510242921, "Score": 1, "Body": "Don't be ashamed of quitting. I was in the same situation you are now, and I didn't quitted, and now I don't feel any better than if I hadn't stayed.\n\nIs up to you to decide if it worth to keep fighting or not, but if it gets so hard that you cannot stand it anymore don't let anyone judge you and just leave. Life is too short to spend it suffering. Just remember: if you take that option, never feel ashamed of it. You did the right thing and nobody who hasn't been in your situation really knows how hard it is. Do the best for yourself.\n\nWhatever you do: good luck and my best wishes for you. I know how much you need it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpkqr0y/"}, "60": {"Subreddit": "PhD", "Author": "democraticwhre", "Date": 1510243038, "Score": 2, "Body": "This is awesome. Now I need an \"academic rationale\" to print one at the university library. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpkqv0b/"}, "61": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1510244008, "Score": 22, "Body": "Can I ask how far along your are and what your requirements are for defending? I ask because you may simply be able to take a short leave to clear your head and come back to it. At the university I attended, we were required to write 4 \"publishable\" chapters and pass both candidacy and comprehensive exams. By year 5, most are considered \"all but done\" (ABD)...and are mostly just writing up their various chapters/results.  Meaning, that is a lot of work to get through to throw in the towel.\n\nI will tell you this. First, not every study works. Not every machine works. Not every result is a good one. Advisors should understand this. There were many in my department, including myself that had at least one chapter that basically said \"this is what we tried to do, and it didn't work....but we still learned something...\".  Talk to your advisor and others in your department about options. It may seem hopeless, but I GUARANTEE  that every single PhD student goes through this. I remember utter despondency/despair around year 4 when I realized the insurmountable mountain of work in front of me and the lack of motivation to chip away at it. I remember spending two full months barely sleeping and eating fruit loops and drinking coffee. I am a runner and for two months I didn't run a single step as I finally forced myself to write. It was awful and I wouldn't wish it on anyone....BUT, everyone goes through it. A PhD is incredibly difficult, and not one Doc out there will tell you that the final year of their PhD was enjoyable. Nevermind that you are also expected to start looking for post-docs and jobs while writing and prepping for your final defense. \n\nPlease take some personal time to center yourself. I can tell you for certain that if you walk away completely, it will be an order of magnitude more difficult to come back later. I spent 7 years working after my undergrad and it was almost impossible to get back into grad school when I applied. I knew if I walked away, I would never go back.\n\nIt can seem hopeless, but if you do still love the actual research or area of study, it's worth the short period of misery to get through it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpkrsv8/"}, "62": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1510244279, "Score": 1, "Body": "Check with your University bookstore or if there's a printing group right on campus. Depending on the size of your university, you may be able to get it bound directly...and then have your school emblem on the cover. At my University, if we printed the pages ourselves, and brought them to the printing group, they would send them off to a contracted company and you'd get it back in 2 weeks. It was much cheaper if you printed your pages...so I used my departmental printer to print first. It think it was about 50-75 bucks per bound copy. I made one for myself and one for my advisor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7a8m7i/where_to_get_my_thesis_bound/dpks2a3/"}, "63": {"Subreddit": "PhD", "Author": "marx051", "Date": 1510245190, "Score": 2, "Body": "I took a year off between 4 and 5. You may need a break too, see if you can also your timeline and just push things back.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpksycj/"}, "64": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1510249492, "Score": 8, "Body": "I’m not the OP, nor am I quite at the stage OP is re wanting to quit, but I REALLY needed to read this today. Thank you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpkx6mf/"}, "65": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1510256238, "Score": 2, "Body": "Think hard and evaluate how far you have come and if its plausible to make it work, talk to your supervisor. If the PhD is taking a toll on your mental health , quit. Your life is far more important than a PhD. Health and well-being comes before any degree. Take care.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpl3y3u/"}, "66": {"Subreddit": "PhD", "Author": "Z10201Z", "Date": 1510267253, "Score": 2, "Body": "I had the same problem... I was tired of the politics and I didn't had a good impression of most people of the lab. Moreover, my supervisor was having problems and was becoming very difficult to work with him.\n\nI had job offers outside academia and I simply took the best one and left. When I did this, my co-supervisor had a serious talks with my main supervisor and other professors got involved... The funny thing is that it improved my life a lot INSIDE and OUTSIDE the university. \n\nI don't know how you are perceived by your department/peers, but sometimes hard decisions can lead to the easiest paths. Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dplemo6/"}, "67": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1510279491, "Score": 3, "Body": "I don't know where you are, but in Australia you're entitled to 12 weeks medical leave which extend your candidature; you may have access to something similar which can be really helpful when you're feeling burnt out.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dploluy/"}, "68": {"Subreddit": "PhD", "Author": "DryLabRebel", "Date": 1510281054, "Score": 3, "Body": "Some stuff we all need to hear every now and again...\n\nRelax, you're doing more than you think!", "Permalink": "https://www.reddit.com/r/PhD/comments/7by9r5/7_reasons_youre_feeling_needlessly_unproductive/dplpypo/"}, "69": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1510281462, "Score": 4, "Body": "I have a sign on my door saying \"This laboratory has worked xx days without accidentally creating GLaDOS or Ultron\". I'm in computer/electrical/biomed engineering, I don't even know what I do really.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dplqb0h/"}, "70": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1510294943, "Score": 2, "Body": "I'm only in my second year, but I almost quit, too. I've been struggling with anxiety and depression. My significant other is sick, and it feels pointless to be here studying instead of back in our home country making memories with him. But after I shared my issues with my supervisor, she convinced me to just work toward my qualification exam, since I'm really close, and then take a leave of absence to spend time at home and figure where I really want to be. My guidance counselor suggested roughly the same, though she is leaning more toward me going home, while my supervisor is leaning toward me coming back some day. I hope you get help and can figure out the right step for you to take.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dplzvdg/"}, "71": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1510302475, "Score": 1, "Body": "I'm not sure how dropping a class will turn out for you but I'm a 2nd year doctoral student and I'm learning to saying NO to extra activities is very important. Make your priority list and stick to it. In my 1st year I wasted a lot of time on unnecessary activities ..", "Permalink": "https://www.reddit.com/r/PhD/comments/7bzh6m/drop_a_class_withdraw/dpm393b/"}, "72": {"Subreddit": "PhD", "Author": "Xavner", "Date": 1510303209, "Score": 1, "Body": "hey man, it's ok to make mistakes especially since it's your first year in the US. I believe that you're trying your best, and I'm sure your advisor or department would understand if you didn't score high in this semester/year. Just keep trying and don't be afraid to fail!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bzh6m/drop_a_class_withdraw/dpm3j77/"}, "73": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1510305977, "Score": 1, "Body": "Something written in elvish on the white board, thats been there for years. A molecules drawn in crayon with \"daniel aged 24\" signed at the bottom, again it's been there for years. On my desk I have a toy plush neutron, a 3d printed asteroid and some useful equations", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpm4jx4/"}, "74": {"Subreddit": "PhD", "Author": "wanderin_walrus", "Date": 1510316858, "Score": 1, "Body": "When you take the class later and get an A because you're better prepared... I don't think anyone will give a shit that you had a W. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bzh6m/drop_a_class_withdraw/dpm8qkr/"}, "75": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1510324361, "Score": 1, "Body": "This is a very good thing to learn. I'm a \"say yes to opportunities\" person but it's biting me now because I had all these deadlines that I can't meet, even doing 50 hour weeks as a part time student. I got offered more teaching for a semester and it's the first time I've ever said no. The guilt and regret were almost as overwhelming as the relief when the \"no\" was accepted without comment.\n\nSix hours later I got an email inviting me to write a semi-relevant paper and I actually considered it, then mentally slapped myself. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bzh6m/drop_a_class_withdraw/dpmdgxu/"}, "76": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1510330318, "Score": 2, "Body": "I have 2 publications and just enough for 2 more chapters (one of which is pending publication). I just felt so useless... There's so many people who seem to have this idea that I'm a worthless pos and I started feeling like that. It really sucks. I needed this data to see if my data was reproducible after a while but suddenly the machine wouldn't work even though I changed nothing. I'm supervising an undergrad who's friends with this PhD bully and she just keeps rolling her eyes at me every time I tell her I don't know how to fix the problem. I felt so defeated and just... Upset which is why I posted this. I think you're right I need a break and come back to it. I don't want to throw away 4-5 years especially how I'm so close. I know I shouldn't put so much emphasis on how people see me but it really sucks. I'm no angel but I do enjoy helping people when I can and I hate that they sullied my reputation by calling me stupid, retarded, lazy, and an egomaniac and people eat it up and started avoiding me. I've seeked counselling, reported clear harassments but it really went nowhere.\n\n\nI guess I just really have to keep my head low and try my best to push through this and not care.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpminm5/"}, "77": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1510349447, "Score": 2, "Body": "This does sound like a unhealthy environment for sure and I'm not sure I'm the right person to offer you any type of real wisdom as I don't know the specifics. But please remember to reassure yourself despite what people say....that you wouldn't have peer-reviewed publications, and you wouldn't be where you are if you didn't know what you were doing.\n\n...and for the record, most of us really don't fully know what we're doing. We're all kind of stumbling our way through things.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpn0ndj/"}, "78": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1510356790, "Score": 2, "Body": "I got a cool poster of a space mission from NASA!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpn6qb5/"}, "79": {"Subreddit": "PhD", "Author": "milikan2", "Date": 1510357117, "Score": 1, "Body": "What area op?", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn6zke/"}, "80": {"Subreddit": "PhD", "Author": "milikan2", "Date": 1510357191, "Score": 1, "Body": "You know now?", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn71m6/"}, "81": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1510357213, "Score": 1, "Body": "Computer science", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn7261/"}, "82": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1510357322, "Score": 1, "Body": "Not a clue: right now I'm just in the mindset that I want this PhD over with, and I guess I'll decide what to do afterwards when I've finally finished.", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn75a7/"}, "83": {"Subreddit": "PhD", "Author": "milikan2", "Date": 1510357434, "Score": 1, "Body": "What are you doing now?", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn78bh/"}, "84": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1510357526, "Score": 1, "Body": "Why? :)", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn7aru/"}, "85": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1510358189, "Score": 1, "Body": "Still some work with my last group, thinking about the future anyway", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpn7sw6/"}, "86": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1510370477, "Score": 2, "Body": "This could have a direct effect on those currently working towards their doctorate.  If they lose their funding we may have most of our doctorate students suddenly vanish.  \n\nEven if the legislation does not take effect immediately it would affect the number of doctorate students in the future and university research would take  a big hit.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpngmy7/"}, "87": {"Subreddit": "PhD", "Author": "milikan2", "Date": 1510395493, "Score": 1, "Body": "After completing PhD?", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpns8sc/"}, "88": {"Subreddit": "PhD", "Author": "milikan2", "Date": 1510395517, "Score": 1, "Body": "So, you are going to industry?", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpns92k/"}, "89": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1510400020, "Score": 6, "Body": "Depends on the country, the field, the funding you might already have, the professor, the ... ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpntozn/"}, "90": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1510404710, "Score": 3, "Body": "Why don't you ask one of your lecturers if you can do a research project with them? I'm doing the same", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpnvg9a/"}, "91": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1510410901, "Score": 1, "Body": "Already completed, now taking some time while I continue to collaborate with my former group, and thinking about what to do. Ideas, projects, I don't know. Let's see.", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dpnynju/"}, "92": {"Subreddit": "PhD", "Author": "MrsPickles90", "Date": 1510415161, "Score": 1, "Body": "This answer, above. I didn't have any, it was all based on my BA/MA results, references and most importantly, the proposal (from UK), this can vary a lot though. Best thing to do is speak with admissions team, or better yet if you have a director of studies/supervisor already picked out discuss it with them. This information should also be under the eligibility criteria of the websites.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpo1hef/"}, "93": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1510415449, "Score": 3, "Body": "I am currently pursuing my PhD and I am not too concerned about this, and here is why:\n- if my understanding is correct i will have to pay a couple of thousands $ per year more in taxes. It sucks but i can manage.\n- if it sticks, schools will adjust by raising the stipend by the appropriate amount.\n- also once I am done and  get out, I have a reason to ask more in terms of compensation.\n\nIn other words, the market will adjust itself.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpo1ovp/"}, "94": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1510429063, "Score": 1, "Body": "I mean...do you want to give us any more information so we can help? In some fields you could be ok, in others it’ll be near impossible. Funding matters as well of course. At the moment I’d give you a  \nG out of 231 chance...", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpocmv8/"}, "95": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1510435917, "Score": 2, "Body": "Pens with something absurd(ly cute) on the other end, such as a plastic/cloth flower, smiley face, candy, duck... I usually don't care about decorations which don't also have a practical purpose, but pens are always good to have. I also write exams with these (and take a few extra for anyone who forgot a pen) - it may help my fellow students relax.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dpoi8p2/"}, "96": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1510445674, "Score": 1, "Body": "For science in Australia, you need at least an Honours degree, which requires research. Without knowing where you are or what you're studying, though, can't really give any more info.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpopzvs/"}, "97": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1510461723, "Score": 1, "Body": "I have fairly good grades, and am in the field of biology.... interested in cancer immunotherapy, so I'd like to do a PhD in that area. I'm currently working on a thesis which is required for my post graduate degree. Would that count as research? Doesn't have any associated lab work as such. More of compilation of data and it's interpretation.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpp2cqw/"}, "98": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1510461763, "Score": 1, "Body": "I have fairly good grades, and am in the field of biology.... interested in cancer immunotherapy, so I'd like to do a PhD in that area. I'm currently working on a thesis which is required for my post graduate degree. Would that count as research? Doesn't have any associated lab work as such. More of compilation of data and it's interpretation.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpp2dpd/"}, "99": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1510461849, "Score": 1, "Body": "I'd like to do my PhD program from Europe or the US. I'm currently in India.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpp2fra/"}, "100": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1510473473, "Score": 2, "Body": "Computational research, such as doing statistical analysis of data the others obtained and interpreting it, if no-one had done the same before, counts (of course more for computational PhDs than for wet lab PhDs). Something like just writing a literature review usually doesn't. If your university has no research options, look into options for summer research programs and other forms of short research stays at academic institutions which do. Although honestly you should have done something like that as an undergraduate, if you are in master's it may be too late.\n\nI mean, you probably can get into *some* PhD without research experience even in biology, but it almost certainly won't be funded, you will need to pay for it, and you probably can't afford that and it's not worth it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpp8f5a/"}, "101": {"Subreddit": "PhDStress", "Author": "J_Doremus_Hawley", "Date": 1510502199, "Score": 1, "Body": "Don't. Just, don't.\n\nTake a long, serious, uncompromising look at yourself. Ask yourself if you are truly aware of and prepared to make all the sacrifices that academic life demands. Do you have the fortitude to devote yourself every day for six+ years to a task that will, in all likelihood, end in absolutely no success on the job market regardless of how brilliant your work is or how well received? Are you willing to defer having a real paycheck--a salary commensurate with your education--until well into your 30s, and in all likelihood even longer, since upon graduation you will find yourself with literally no marketable skills and an academic pedigree that will make you, perversely, too qualified for prospective employers to consider you for even entry level positions? Are you strong enough to deal with the crushing loneliness of being the only person in every room you enter who has any idea what you study or why it matters? Have you truly considered the ramifications of six years of graduate study on your or your partner's biological clock, in terms of when and if it is possible and financially prudent to start a family? Are you able to endure the crippling insecurity that comes with specialized knowledge, where you literally always feel like you know absolutely nothing about a subject, even when by all objective measures you are a world expert? The perpetual state of impostor syndrome, where you never know if you've learned anything until you've finished, and even then, are wary of congratulating yourself too much because the truly intelligent person knows how little he knows. Are you willing to face the fact--not the possibility, but the fact--that you have virtually no choice in where your first posting (or any posting, if you're that lucky) will be? Is your romantic partner willing and/or able to move with you so that you can follow your career? Can you genuinely, truly, honestly, without lying to yourself, say that there is literally no other career on earth that could possibly ever make you happy? If so, then by all means, apply, and I wish you the best of luck. But if any of this gives you the slightest hesitation, run.", "Permalink": "https://www.reddit.com/r/PhDStress/comments/773ke5/phd_students_what_advice_would_you_give_to_a/dppkpra/"}, "102": {"Subreddit": "PhDStress", "Author": "J_Doremus_Hawley", "Date": 1510505447, "Score": 2, "Body": "Bourbon and self-loathing", "Permalink": "https://www.reddit.com/r/PhDStress/comments/6p2gwa/motivation/dppn5og/"}, "103": {"Subreddit": "PhD", "Author": "j-m-", "Date": 1510506628, "Score": 2, "Body": "I know in the UK you can apply for a PhD after a BSc degree.  Given that you say your completing your thesis for a postgraduate degree, you should be ale to apply for a PhD now. What was your undergraduate degree? What is your thesis subject? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dppo3u1/"}, "104": {"Subreddit": "PhD", "Author": "j-m-", "Date": 1510507050, "Score": 1, "Body": "I have a Conan the barbarian poster, some Lego and a Rubix Cube \n\nEdit: and a Bonsai Tree ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dppog8q/"}, "105": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1510510767, "Score": 1, "Body": "Look through some other theses. Your college might have a structure guide that they would like you to follow, so maybe check out those if they have them?", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpprms1/"}, "106": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1510510820, "Score": 1, "Body": "Thank you :) hopefully I can find one that runs along the same vein as my own. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpprokh/"}, "107": {"Subreddit": "PhD", "Author": "Celestial-92", "Date": 1510512151, "Score": 1, "Body": "The advice I've been given (sciences) is that your introductory chapter should cover all the theory that you've used in the remaining chapters and all of that should be cited (lit review).\n\nHope it helps! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dppswwq/"}, "108": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1510512285, "Score": 1, "Body": "Yes, I agree with sadmoody. I have had so many questions answered simply by skimming through the last 10 dissertations that came out of my department. So easy to download the PDFs from our library website.", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dppt1mr/"}, "109": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1510512332, "Score": 1, "Body": "Thanks :) \n\nAlso, gahhh, cause I use so many different theories :( ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dppt3az/"}, "110": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1510512528, "Score": 2, "Body": "wow, actually useful. I realized a year ago I'm totally guilty of killing myself working hard on goals that actually don't make me graduate. So I try and cut those out of my todo list - PhD is not that long and so many things can be put aside for that time. And no more useless favors!", "Permalink": "https://www.reddit.com/r/PhD/comments/7by9r5/7_reasons_youre_feeling_needlessly_unproductive/dppta4d/"}, "111": {"Subreddit": "PhD", "Author": "Celestial-92", "Date": 1510512674, "Score": 2, "Body": "I've also been advised to not put in anything I'm not willing to defend in my viva. \n\nThesis writing is terrifying! Good luck :) \n\nEdit: grammar", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpptez7/"}, "112": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1510512731, "Score": 2, "Body": "Haha, that means nothing then :P \n\nThank you for the advice! Can't wait to be rid of it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpptgyb/"}, "113": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1510512791, "Score": 3, "Body": "Realize that your entire worldview is being driven by the &lt;5 people you see every day. You're not worthless, you have publications! You're just surrounded by negative people. If you branch out and surround yourself with people who support you instead, you will be doing the same work, moving towards your defense date, and happy instead of frustrated. I did this because my lab group is kind of antisocial and petty, and so at least once a week I go and discuss school and research with my friends from the department who are in other lab groups. It really keeps me going.", "Permalink": "https://www.reddit.com/r/PhD/comments/7btq39/im_quitting/dpptj0s/"}, "114": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1510519800, "Score": 3, "Body": "http://libguides.usc.edu/writingguide", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpq0bqq/"}, "115": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1510519876, "Score": 1, "Body": "Thank you, this is really helpful!", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpq0eh5/"}, "116": {"Subreddit": "PhD", "Author": "nadaanpakoray", "Date": 1510519953, "Score": 1, "Body": "You're welcome! Barring any special instructions from a professor, I follow this guide rather religiously!", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpq0h3t/"}, "117": {"Subreddit": "PhD", "Author": "r02625050", "Date": 1510522214, "Score": 1, "Body": "Thank you all!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bzh6m/drop_a_class_withdraw/dpq2nz8/"}, "118": {"Subreddit": "PhD", "Author": "DryLabRebel", "Date": 1510523654, "Score": 2, "Body": "Hey thanks for reading, I'm so glad you liked it.\n\nGreat points too.\n\n- Yes, other people will totally suck you dry if you let them (not on purpose, we're just inherently a little selfish... so you have to be too!)\n\nDon't forget to share it with anyone else you know who might need a little encouragement (which is all of us isn't it really?)", "Permalink": "https://www.reddit.com/r/PhD/comments/7by9r5/7_reasons_youre_feeling_needlessly_unproductive/dpq3z5f/"}, "119": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1510541598, "Score": 2, "Body": "Brilliant GOP! Lets tax fake \"money\" that never changes hands - a tuition waiver - but give huge discounts to corporations that can easily afford it and are trading in real money. The easy solution would be for schools to make the official tuition zero for supported students, but of course that will never happen because in the bureaucratic nightmare of universities somehow its \"impossible\" because of how tuition waivers are used as part of the ridiculous shuffling of money between departments and the central school. My question: if no real money or physical assets change hands, how can it be taxed?\n\n\"Hey son, I'll give you a ride to school today. Hop in!\" GOP: \"We need to tax the value of that ride to school, the market value would have been $7.29 if you had hired a car.\"", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpqjbu2/"}, "120": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1510543302, "Score": 1, "Body": "No study has been done on the my thesis topic in this part of the country.... I'm collecting cases and am going to analyze the efficacy of different diagnostic tests.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpqkpc9/"}, "121": {"Subreddit": "PhD", "Author": "lilyflower32", "Date": 1510547362, "Score": 1, "Body": "I am in the middle of writing my lit review for my intro. I went back and looked at old dissertations to see how they structured it. Your advisor should also be able to help you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpqnrpn/"}, "122": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1510549670, "Score": 4, "Body": "I️ feel that almost everyone struggles and feels inadequate at this stage of the PhD. From what you have said, worst case scenario is that your defense gets pushed back, which isn’t the end of the world. I️ had a jerk on my committee that pushed my defense an entire semester. I️ have friends who had theirs pushed a year. I️ know that doesn’t sound ideal, however, the end goal is finishing. You will grow stronger from that feedback and improve your work. Stay strong, this is an extreme low, but I️ promise if you can push through it, being a Doctor is worth it. Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ckveg/feeling_anxious_and_uncertain_if_i_can_pass_my/dpqpa8d/"}, "123": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1510549862, "Score": 2, "Body": "If this is something which if done well can result in a publication in a legitimate, non-predatory, peer-reviewed journal, then it is research and can help you to get into a PhD. If you are doing it with a mentor who knows how to do research (and preferably has a PhD or a similar research-based degree) and if you take care that it really does result in such a publication, it can help you a lot to get into a good PhD. But it also depends on what exactly is your field and degree... if it is a master's in something like molecular biology, this sounds like a weak type of research, students in such research-oriented fields in developed countries do much more research so it'll be difficult for you to compete with them for funded PhD spots (unless you can get a scholarship from your country). If you are doing a degree in medicine (or nursing, or some other professional degree where main focus is on obtaining a profession and isn't usual to do research), this sounds like a normal type of research at pre-PhD level, maybe even strong if done well, and you should be eligible for funded PhD(-MD) programs in your field.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpqpek4/"}, "124": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1510551888, "Score": 2, "Body": "I just don't know if I can last a whole year. My prof is hiring this old phd exchange student as my postdoc in february. The same guy who assaulted me and she knew.\n\n\nI'm so nervous I don't think I'll last. I can't handle this amount of stress anymore I'm near my breaking point. This is already my 3rd meltdown in a week. I'm trying to get a break in but I still have TAing and and undergrad thesis project to supervise so I can't even think about taking a break til January. I'm so lost. Things just keep happening and piling up that I'm so exhausted. I thought I could do it after I took a week off in September but I can't. Maybe I'm not cut out for this. I don't know how others can do it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ckveg/feeling_anxious_and_uncertain_if_i_can_pass_my/dpqqmbs/"}, "125": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1510552738, "Score": 1, "Body": "Thank you", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dpqr3mc/"}, "126": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1510562164, "Score": 3, "Body": "I'm sorry to hear you're having a hard time. I'd say all of the usual things about how everyone feels nervous, lots of people feel unworthy and you know your PhD better than anyone... But it really sounds like you're at a low point where those words won't make much difference. If you want to chat, sincerely, feel free to PM me. I had a really rough time in my PhD and somehow made it out the other side, so I know what it's like. If I'm in a similar field to you I might even be able to help, but if not maybe an understanding ear could be useful. But if not that's ok too - just remember you are strong for making it this far, and you are the expert even if you don't always feel like it. It will get better!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ckveg/feeling_anxious_and_uncertain_if_i_can_pass_my/dpqvffg/"}, "127": {"Subreddit": "PhD", "Author": "Gondwanalandia", "Date": 1510566535, "Score": 2, "Body": "In short, yes, though the process may be different.  You may have to apply for a separate scholarship round just for international applicants, which is likely more competitive. If you are successful it would likely come with a tuition waiver and stipend. In Europe and Australia, stem phds are usually 3 years, research only, no teaching component and usually no coursework either, although you might have the opportunity to pursue these if you wish. \n\nNote that I can only speak for my experience- other stem fields may be totally different, I don't know. Someone else can correct me if I'm wrong. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dpqx117/"}, "128": {"Subreddit": "PhD", "Author": "DoctorAC", "Date": 1510575724, "Score": 3, "Body": "It sounds like you should talk with a counselor or therapist. I️ did when things got rough and it helped a lot. Also, assault?!? This seems extremely serious and something you definitely need to talk to someone about.\n ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ckveg/feeling_anxious_and_uncertain_if_i_can_pass_my/dpr0k47/"}, "129": {"Subreddit": "PhD", "Author": "NilsTillander", "Date": 1510577374, "Score": 5, "Body": "Here in Norway, PhD students are not actually considered students but early career researchers and paid accordingly : no tuition and a salary of 3200USD/month after taxes/healthcare/everything.\nContracts are 3 years without teaching or 4 years with 25% teaching (usually requires you to speak Norwegian for that format).\nYou have to take the equivalent of a semester of full time studies spread in the 3 years.\n\nThese specifications are somehow similar in other European countries as far as I know, with variations on the student status/salary (UK is weird, but that's nothing new).", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dpr1dsn/"}, "130": {"Subreddit": "PhD", "Author": "Daynjazone", "Date": 1510586589, "Score": 2, "Body": "Is there a reason schools use a tuition waiver rather than saying the tuition for PhD students is $0? It seems like that would be an easy way to circumvent these changes. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpr7ugg/"}, "131": {"Subreddit": "PhD", "Author": "dgusain", "Date": 1510587429, "Score": 4, "Body": "In the Netherlands, it is similar to that of Norway as mentioned before. You are seen as a early career researcher and considered more of an employee than a student. You get the benefits of both students (like student discounts) and employees (like holiday pay, end of year bonus etc.). they pay around 2000 EUR a month after tax which increases year on year. The contract is generally for 4 years which involves teaching as well as courses (professional development and personal development).", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dpr8l7z/"}, "132": {"Subreddit": "PhD", "Author": "blue_cinos", "Date": 1510590923, "Score": 4, "Body": "Usually fully funded in the U.K., I would be worried if not. My stipend is about £14500 which in real terms is rapidly going through the floor compared to the dollar/euro. In the U.K. however it translates to a good graduate salary where you have the option of earning extra through teaching labs. 3-4 years long and 100% research.", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dprbwos/"}, "133": {"Subreddit": "PhD", "Author": "pmoe94", "Date": 1510591077, "Score": 2, "Body": "I'm not a 100% sure, but muy understanding is that the colleges also recieve tax breaks for doing so", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dprc2el/"}, "134": {"Subreddit": "PhD", "Author": "pmoe94", "Date": 1510591243, "Score": 1, "Body": "I'm currently in the process of applying for PhD programs and with this coming into the picture, I've had to go back and consider the programs I'm applying for. On the plus side though, the Senate proposal brings back the old verbiage, so this is definitely not the end of it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dprc8hy/"}, "135": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1510593195, "Score": 1, "Body": "In the UK lots of Phd programs which are funded are for Uk citizens or European citizens only unless you self fund.", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dpre6jw/"}, "136": {"Subreddit": "PhD", "Author": "Tcw7468", "Date": 1510599579, "Score": 1, "Body": "I'm not entirely sure if this applies to every case, but in my case the tuition still exists but is still charged to my advisor's pool of grant money. The university still receives the tuition and there is a flow of money to the university, just not from me.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dprkq82/"}, "137": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1510612000, "Score": 13, "Body": "Apparently only 60% of students who enroll in a phd ever submit a thesis. I was told this by a graduate research officer at my uni. it's obviously not a stat that they advertise too widely. Of those that do submit, something like 97% pass. \nI was told that basically, they don't enroll people who can't do it. Everyone enrolled in a phd has been judged as capable of finishing. The 40% who don't finish, generally leave because of things happening in their lives outside their phds.\nSo yeah you're likely to pass, if you submit.", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dprxr8s/"}, "138": {"Subreddit": "PhD", "Author": "nellynomates", "Date": 1510612744, "Score": 1, "Body": "A different issue than just finishing, is when you finish and the timescale for any funding you receive and fees you'll pay. You can be at the mercy of your supervisor to decide when you have enough to submit.", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dpryhb6/"}, "139": {"Subreddit": "PhD", "Author": "Z10201Z", "Date": 1510616406, "Score": 3, "Body": "You are either being too naive or working with low rank professors. If your supervisor just needs a completed PhD supervision on his CV, your life should be fairly easy. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dps1wd7/"}, "140": {"Subreddit": "PhD", "Author": "Daynjazone", "Date": 1510625397, "Score": 1, "Body": "That's interesting. I'm pretty sure it's at the graduate school level for us, or maybe at the departmental level. I could see that varying school to school. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dps9y5p/"}, "141": {"Subreddit": "PhD", "Author": "lilyflower32", "Date": 1510641037, "Score": 1, "Body": "I have seen people fail out of the program. Not many, but it is possible. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dpsm2ie/"}, "142": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1510667289, "Score": 1, "Body": "That's a phenomenal resource, thank you for sharing it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7cgpkw/introduction_structure/dpsxuoe/"}, "143": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1510726547, "Score": 2, "Body": "Most major US University PhD programs have an exam early on (usually in the first 2 years) that is meant as a way to measure a student's feasibility as a doctoral student. At my University this was called the \"Candidacy\" exam, but at other schools it may be called something else. This serves not just as an assessment of the student, but in a way as an \"out\" for the University. If you aren't up to the challenge of becoming a true PhD candidate, you will probably fail that exam. At my University (Major Big10 school) and program (Geoscience), about 30% failed their candidacy. Failing the exam was a clean break from the University, as if you failed, you were out of the program. The exam was brutal. You had to write two full proposals that posed valid scientific hypothesis, discussing how you would test them. Then your committee could ask you anything they wanted to see how you respond to scientific questioning in your subject area and how you react under duress. I was asked to derive first-principles equations on the board on the fly from memory...it sucked. I eeked out a passing grade. The honest truth is that while some students may have good entrance scores and look ideal as a PhD student on paper, they just aren't cut out for it.\n\nWith that said, if you've made it all the way to your dissertation defense, it's very unlikely that your committee will fail you as they have, as you said, invested probably upwards of 5 years on you. It's possible to butcher a defense, but I know in my program it was quite rare for someone not to pass their defense. I feel that if you are in danger of failing, your advisor should have let you know that months prior.\n\nAt any rate...that's my 2c", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dpugu76/"}, "144": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1510783632, "Score": 1, "Body": "In Austria, you would have to pay €363 per semester in tuition while getting your MSc. Then you can try getting a PhD position which is typically paid (although the exact amount varies a lot).", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dpvnaj9/"}, "145": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1510826078, "Score": 3, "Body": "Good for you! I hope you are much happier now and find your true calling!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwgye9/"}, "146": {"Subreddit": "PhD", "Author": "wtfizhappnin7", "Date": 1510826665, "Score": 3, "Body": "I'm jealous , wish i had the guts to do that!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwh62k/"}, "147": {"Subreddit": "PhD", "Author": "bachs_kocillus", "Date": 1510833962, "Score": 18, "Body": "I'm genuinely happy for you, internet stranger! Go on and enjoy your life!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwk210/"}, "148": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1510840622, "Score": 7, "Body": "Thank you for sharing this. \n\nI've failed my PhD, and I think I'm failing the MPhil as well, - anxiety, depression, single parenthood and whole shebang. I don't even remember why I started all this. \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwo1dk/"}, "149": {"Subreddit": "PhD", "Author": "admiralackbartrap", "Date": 1510841544, "Score": 8, "Body": "I am going through some mental struggles as well, I am starting the 3rd year of my PhD.\n\nI found my university to be very understanding especially re: mental health problems and they have a policy where you can interrupt your program for up to 24 months without having to start over. Don't need a medical note, a therapists note is just as valid. I just applied for a one semester break and it was approved without issue. I also have a great supervisor that I am on great terms with and knows my background. That helps immensely.\n\nIt is better to pause than to feel like you are a huge failure making the problem worse. Use your universities resources, do not be afraid to ask for help.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwoqak/"}, "150": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1510841961, "Score": 7, "Body": "They've been incredibly supportive, but I'm on a scholarship in a foreign country, and taking a leave of absence would curtail my visa and leave me without money.  I'm thinking about looking for a job and switching to another type of visa, but I have no idea if it's even possible.\n\nThank you. \nGood luck!\n\nPS. Why are we doing this to ourselves? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpwp24u/"}, "151": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1510854893, "Score": 2, "Body": "It sounds like you needed to do this. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpx1nv9/"}, "152": {"Subreddit": "PhD", "Author": "macevii", "Date": 1510858799, "Score": 2, "Body": "Hello there,\nDoes your PhD program require a specific research proposal as part of the application? Or are you asking just FYI for the future? In my experience (finishing up first semester of PhD program in educational policy) the applications need to have areas of interest and potential research but not a fully developed research proposal. Things such as a \"template for a research proposal\" will be reviewed and discussed at length in your research-focused courses.\n\nRegarding contacting faculty, I have heard a wide variety of opinions on that... I did do this during the application phase but only some of them responded and I do not know if it helped. It is *definitely* important to be familiar with faculty research interests for the department. Hope that helps some.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dbnmj/personal_statement_and_research_proposal/dpx5sb9/"}, "153": {"Subreddit": "PhD", "Author": "Orest_Mercator", "Date": 1510863478, "Score": 5, "Body": "Good on you man. Hope you find joy, peace, and fulfillment", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxam7n/"}, "154": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1510871038, "Score": 2, "Body": "I'm feeling the same way with my mechanical engineering degree. I love research and want to do my PhD but I don't have no social life at all 😂", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxi3fa/"}, "155": {"Subreddit": "PhD", "Author": "ZyonCross", "Date": 1510871575, "Score": 3, "Body": "No matter what happens, it won't be the end of you. Life will continue and there will be happiness for you and your kid.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxikvv/"}, "156": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1510874615, "Score": 6, "Body": "I am also very stressed. About to finish, still kinda feel ok about the topic and the writing process but more annoyed about my uni. \n\nWe are basically seen as cheap labour while they don’t care about our career development, financial struggles or future job search. That sometimes pisses me off.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxl6u2/"}, "157": {"Subreddit": "PhD", "Author": "ZyonCross", "Date": 1510874970, "Score": 2, "Body": "Well PhD students *ARE* cheap labour if that is any consolation ☺\n\nAlso read https://www.nature.com/news/many-junior-scientists-need-to-take-a-hard-look-at-their-job-prospects-1.22879", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxlhfd/"}, "158": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1510875177, "Score": 3, "Body": "Well yeah but they also have these weird policies of reducing the hourly teaching rate (£18 per hour while its £45-£50 ph outside London) and reducing the number of hours on our contracts (but the amount of work stays same). Sure, we all want the work experience but maybe don’t make it so obvious that we are idiots :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxlnps/"}, "159": {"Subreddit": "PhD", "Author": "SurgicalStraw9", "Date": 1510877828, "Score": 2, "Body": "Universities in our country are slowly promoting different career skills and inviting commercial preps to talks, but yeah, on personal level; absolutely no professor or supervisor wants to give up their cheap workforce away. \n\nI'm having same feelings as OP, andI hate my own supervisor for not even once being willing to talk about my own career plans after two years. My phd topic is just a side project to her and she knew I was looking for actual job before she contacted me and offered one year contract directly. Once done with the degree, I try hardest to get in industry, and leave her wondering why I won't continue the dead-end project\n\nEDIT: typing", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxnwp6/"}, "160": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1510884149, "Score": 5, "Body": "I’m doing a PhD in Australia so I get stress and kangaroos. Win!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dpxtcbz/"}, "161": {"Subreddit": "PhD", "Author": "kimbabs", "Date": 1510895887, "Score": 1, "Body": "Schools have much less incentive to take on more grad students if they have to compensate for the tax increase.\n\nIf the burden is placed on us, I will not be able to finish my degree as I simply won't be able to afford living expenses after taxes. Rent and utilities alone would be 90% of the leftover money. I have loans as well, interest for which I will not be receiving a tax break for as well should this come to pass.\n\nWe cannot let this pass. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpy3bm8/"}, "162": {"Subreddit": "PhD", "Author": "kimbabs", "Date": 1510896102, "Score": 3, "Body": "Schools would have much less incentive to take on graduate students as each suddenly has become 6000-7000 more an year. How do you know for sure your school won't cut your funding? What compensation are you requesting from whom? \n\nWhat guarantees that the market will adjust itself? I don't understand where your confidence is coming from. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpy3grm/"}, "163": {"Subreddit": "PhD", "Author": "kimbabs", "Date": 1510896445, "Score": 1, "Body": "Looks like this has passed the house...\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7bgq67/the_gop_tax_bill_could_be_a_disaster_for_phd/dpy3oxi/"}, "164": {"Subreddit": "PhD", "Author": "intothedeep9", "Date": 1510897676, "Score": 1, "Body": "Hey,\n\nI am applying to PhD programs in four universities, two of them do require research proposals, and the others don't.\n\nThanks for your response. I suppose it would be better if I write to my potential faculty guides in advance.\n\nAnother doubt I had, while mentioning my research experience in my application, should I only mention the research work done in the field of study I am applying for PhD, or should I mention all of the researh work I have done. A lot of my research work was done during graduate coursework.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dbnmj/personal_statement_and_research_proposal/dpy4ggm/"}, "165": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1510927690, "Score": 1, "Body": "Shit... Can I have the source? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bgq67/the_gop_tax_bill_could_be_a_disaster_for_phd/dpyik9z/"}, "166": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1510944356, "Score": 13, "Body": "This is unreadable for someone on reddit, let alone for a professor that is short on time. \n\nAlso, I just got to the first line and saw that you called the professor Mr. and not Dr. I'm pretty sure that if he had started reading the email, he'd stop right then and there.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpyy1fz/"}, "167": {"Subreddit": "PhD", "Author": "thedinnerclub", "Date": 1510952239, "Score": 5, "Body": "email him to set up a meeting. keep it short (2/3 lines). definitely refer to him as Dr as well", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpz5hrb/"}, "168": {"Subreddit": "PhD", "Author": "timezone_bot", "Date": 1510952889, "Score": -1, "Body": "1pm EST happens when this comment is 20 hours and 51 minutes old.\n\nYou can find the live countdown here: https://countle.com/PJ8W101315\n\n---\n\nI'm a bot, if you want to send feedback, please comment below or send a PM.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dpz62z9/"}, "169": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1510952971, "Score": 2, "Body": "I know a ton of graduate students that will be hurt by \"a couple thousand\" more a year. And our school will definitely not raise our stipends. This is not a good reason to not be worried. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dpz65mc/"}, "170": {"Subreddit": "PhD", "Author": "zabamoon", "Date": 1510953011, "Score": 2, "Body": "I don’t live in the country where i’d like to do the phd. A meeting it’d be quite difficult :/ \nWhat do you suggest to me then? (I live in Italy and the professor is in the Netherlands) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpz66wv/"}, "171": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1510953074, "Score": 1, "Body": "1pm Est for Nov. 27th, that's not for another week and some. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dpz692g/"}, "172": {"Subreddit": "PhD", "Author": "macevii", "Date": 1510957225, "Score": 1, "Body": "I think mentioning other academic research experiences is absolutely valuable, especially if you are able to show connections between what you learned (not necessarily the content though) and what you would be doing in the PhD program.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dbnmj/personal_statement_and_research_proposal/dpz9wr7/"}, "173": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1510957288, "Score": 9, "Body": "Yeah walking out of my lab is only going to negatively impact my work and piss off my boss. It won’t bring attention to anything. Calling your senator will have a much greater impact. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dpz9yob/"}, "174": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1510957575, "Score": 1, "Body": "Well hopefully it will create awareness and people will call. Don't walk out if it will affect you negatively. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dpza7bk/"}, "175": {"Subreddit": "PhD", "Author": "kimbabs", "Date": 1510959096, "Score": 1, "Body": "https://www.nytimes.com/2017/11/16/us/politics/house-tax-overhaul-bill.html\n\nWe are pretty fucked.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bgq67/the_gop_tax_bill_could_be_a_disaster_for_phd/dpzbhrv/"}, "176": {"Subreddit": "PhD", "Author": "Prophetic_Hobo", "Date": 1510965571, "Score": 3, "Body": "Hopefully your boss is supportive given that if this tax plan passes they are going to have a much harder time recruiting the best possible students. \n\nWalking out brings attention.  Calling Congresspeople is also important. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dpzgfi8/"}, "177": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1510967021, "Score": 5, "Body": "Phone call or Skype ? I agree though, keep it very short, ask if they are even accepting students, ask for  a meeting (phone call in this case), customize the email for each Professor, and attach your  CV. All in all, probably three - four lines.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzhh5c/"}, "178": {"Subreddit": "PhD", "Author": "thedinnerclub", "Date": 1510967336, "Score": 2, "Body": "I'd recommend a phone interview. Say something like Hello Dr. x, I'm writing to you bc I'd like to further my ling studies at your university. I'm interested in x, and my resume is below (make sure to attach resume). Let me know what days/times you're available to discuss openings.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzhpa6/"}, "179": {"Subreddit": "PhD", "Author": "illithid66", "Date": 1510976680, "Score": 1, "Body": "Naive", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dpzo5sr/"}, "180": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1510978300, "Score": 3, "Body": "You definitely want a shorter email, something like:\n\nDear Dr/Prof *name*,\n\nI found your profile on *university* website, and am interested in your work. I have a Masters in Linguistics from the University of Bologna, and am interested in undertaking a PhD in *subject*.\n\nAs I live in Italy, would you be available for a short Skype conversation next week? I'm available *your availability*.\n\nThank you for your time,\n\n*name*", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzp6m2/"}, "181": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1510978500, "Score": 1, "Body": "Regardless of the exact format, academics like emails that are short, and to the point: they get a lot of them, so if they need to read more than 2-3 sentences, they'll give up on it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzpayi/"}, "182": {"Subreddit": "PhD", "Author": "zabamoon", "Date": 1510993094, "Score": 1, "Body": "Okay! I thought it worked differently but i will follow your advice! Thank you! :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzwaww/"}, "183": {"Subreddit": "PhD", "Author": "zabamoon", "Date": 1510993294, "Score": 1, "Body": "Alright! Thank you so much everyone for your advices! :) I’ll definitely follow them ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dpzwdj9/"}, "184": {"Subreddit": "PhD", "Author": "Nicocys", "Date": 1510994393, "Score": 3, "Body": "Depends on what you mean by \"cited PhD student work\". Is it citing a paper, or using unpublished results? First option doesn't really warrant authorship, second option might. Then office politics get in the way, syay away from that stuff as much as possible ;)\n\nAbout not using the work in the thesis, I smell bullshit. It might make sense if they plan to submit a patent, but as the paper will be published by then, that's out of the way. And work carried by multiple people can of course go to their respective theses, just make clear what was your specific contribution. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7drf2y/are_we_being_ripped_off/dpzwrqh/"}, "185": {"Subreddit": "PhD", "Author": "throwAwayCBP", "Date": 1511004919, "Score": 1, "Body": "I cited the arxiv version. Btw, can different sections of a paper go into different thesis (in Biology; specifically in Metabolic networks area)? I thought that was not allowed!", "Permalink": "https://www.reddit.com/r/PhD/comments/7drf2y/are_we_being_ripped_off/dq007qw/"}, "186": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1511006496, "Score": 1, "Body": "Everyone can only use in their thesis exactly what they did themselves, it doesn't matter whether others' contributions are in the same paper or not. If you for example did an experiment and C is going to describe it in their thesis that is plagiarism. That situation is what log books are for and it doesn't matter what a professor says.", "Permalink": "https://www.reddit.com/r/PhD/comments/7drf2y/are_we_being_ripped_off/dq00rcq/"}, "187": {"Subreddit": "PhD", "Author": "w4ck05", "Date": 1511007028, "Score": 2, "Body": "I'm so happy for you and hope you'll find mental peace and serenity. \nIf i shouldn't pay bills at the end of the month probably i'll leave my PhD, for the same reasons.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dq00y7h/"}, "188": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1511029373, "Score": 1, "Body": "This is how people miss time-points!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq0fmj7/"}, "189": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1511030703, "Score": 2, "Body": "Not everyone has to do it! Just spreading the word. However, this bill will also make it so some people will never have the chance to get time-points at all. I hope people will understand that this is going to be a huge problem if it pases. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq0gpgi/"}, "190": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1511030822, "Score": 4, "Body": "The fact that people think their bosses will not be supportive is a sign of the problem I think. No one is willing to fight for us. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq0gsw5/"}, "191": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1511031592, "Score": 2, "Body": "Just a joke, friend.\n\nI definitely am in the same boat, and very much support the cause. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq0het0/"}, "192": {"Subreddit": "PhD", "Author": "Nicocys", "Date": 1511032018, "Score": 1, "Body": "Different sections of a paper in different thesis ? That depends on the format of the thesis. If you have to write it \"fully\", then use your own words, don't copy-paste, and explain what you yourself did.\nThe format used at my university (in Sweden) is slightly different, we have what is called a thesis by publication. What you write specifically for the thesis is a kind of detailed introduction to the topic, and you present what you did, but not necessarily extremely detailed. Then you just directly includes your published articles (see https://en.wikipedia.org/wiki/Thesis_by_publication ).\nAbout the authorship issue: definitively office politics there, don't insist too much, you'll get in trouble for no result, you have no power at this level...", "Permalink": "https://www.reddit.com/r/PhD/comments/7drf2y/are_we_being_ripped_off/dq0hrbg/"}, "193": {"Subreddit": "PhD", "Author": "WikiTextBot", "Date": 1511032021, "Score": 1, "Body": "**Thesis by publication**\n\nA thesis by publication, also known as an article thesis, is a doctoral dissertation that, as opposed to a coherent monograph, is a collection of research papers with an introductory section consisting of summary chapters. It comprises already-published journal articles, conference papers and book chapters, and occasional not yet published manuscripts. A thesis by publication is a form of compilation thesis (a term used in Nordic countries). Another form of compilation thesis is an essay thesis, comprising previously unpublished independent essays.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&amp;message=Excludeme&amp;subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/PhD/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^| [^Donate](https://www.reddit.com/r/WikiTextBot/wiki/donate)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "Permalink": "https://www.reddit.com/r/PhD/comments/7drf2y/are_we_being_ripped_off/dq0hrep/"}, "194": {"Subreddit": "PhD", "Author": "jsredemption", "Date": 1511032314, "Score": 1, "Body": "Bad bot", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq0hzww/"}, "195": {"Subreddit": "PhD", "Author": "DonLaFontainesGhost", "Date": 1511047819, "Score": 1, "Body": "Remember that a lot of schools pay stipends from endowments, which are fixed amounts. They don't have the flexibility to just \"throw more cash at grad students.\" If they *do* increase stipends to compensate, they will almost definitely cut the number of slots available. \n\nThis is going to hurt US grad students everywhere. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7c3bbb/grad_students_are_freaking_out_about_the_gop_tax/dq0uaby/"}, "196": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1511058928, "Score": 2, "Body": "Oh, shit, sorry. People in /gradschool are very upset with this idea and think it's useless, I also got banned from the subreddit for 24 hrs. Idk what's their problem because there are a ton of posts about the bill, but doing something I guess isn't ok??", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq12l37/"}, "197": {"Subreddit": "PhD", "Author": "Yapudetofu", "Date": 1511067765, "Score": 5, "Body": "1. Don’t give up. You don’t seem to far!\n\n2. Everyone has it’s own journey, don’t torture yourself by comparing yourself. \n\n3. I know simpler said than done but you gotta look in yourself for validation and approbation. Not so much in others. If the work is important to you, it should be also good for your self worth. \n\n4. Maybe if you are tired and exhausted it would be a good idea to take a bit of time off to take a deep breath and also reassess the situation. \n\nHope that helps, hang in there!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq18mil/"}, "198": {"Subreddit": "PhD", "Author": "oh_wuttt", "Date": 1511080339, "Score": 1, "Body": "Thank you for sharing this.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dylif/how_to_lobby_against_gradstudenttax/dq1emc9/"}, "199": {"Subreddit": "PhD", "Author": "SurgicalStraw9", "Date": 1511083350, "Score": 5, "Body": "2nd year PhD, and I can relate on the fact that in universities publishing seems to be main driver than doing actual science\n\nPerhaps you should take the math out off the thesis (if you can), and focus getting the degree first. I feel that, If you haven't managed to turn you professor's head around in 5 years, you aren't doing in next 5 either. So f*ck then. Seriously, get your degree,  look at your idea and try to find another research team who might be interested working with your equations as a post-doc project (how can it be applied ect.). Be it in another university,  industry or abroad. \n\nI'm personally bitter that university just uses phd students as cheap labor, and not care student's personal careers. So take this advice with caution since I'm sick of currect academia on my end\n\nEdit; spelling, harder to type on mobile. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq1foau/"}, "200": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1511092296, "Score": 2, "Body": "What, that's crazy. Hopefully the mods at least justified themselves. Not that I can imagine much of one myself.\n\n\nYeah well, hopefully they won't regret their inaction come tax time next year.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq1ilt2/"}, "201": {"Subreddit": "PhD", "Author": "untamedbooobykins", "Date": 1511105529, "Score": 1, "Body": "They said that I attempted to persuade users to one side of this issue without providing the facts..... Total BS", "Permalink": "https://www.reddit.com/r/PhD/comments/7dnzrz/grad_tax_walkout_nov_27th_1pm_est_10am_pst/dq1or4l/"}, "202": {"Subreddit": "PhD", "Author": "notcreativecat", "Date": 1511109344, "Score": 2, "Body": "I'm not a PhD student, but I entered a double master's with a tough language component more than four years ago. \n\nI struggled with depression due to being in a foreign country long term, ambitiously taking on a thesis that has many barriers to completion, growing to hate one of the disciplines,  and now being late on graduation. \n\nYou absolutely have to take care of yourself first. Seek counseling and medication if necessary. Work out, sleep enough, eat as well as you can, and create space to figure out how to help yourself. \n\nIt's difficult to reassess your project but I would definitely suggest doing so. I was very very passionate about my original thesis but the difficulty of getting access to the necessary information put me in a place where I felt like I didn't want to finish if it couldn't be this project. Finally I changed my thesis subject entirely just to catch a glimpse of the finish line. \n\nI wish you the best and I want you to know you are not alone. \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq1rh4e/"}, "203": {"Subreddit": "PhD", "Author": "geekysis", "Date": 1511109520, "Score": 2, "Body": "Take a break and reset yourself. It seems like you really believe in what you're doing so keep at it but if you know where you want to be next, seek out people in those positions and ask for their advice. To build something of substance and high impact, it takes awhile. And a PhD is definitely not a trivial pursuit. When I get down about science I usually go listen to some lectures by people that do the kind of science I see myself doing. First and foremost though your mental health should come first. Exercising everyday helped me a lot when I was going through something similar. And tea. And lists. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq1rly4/"}, "204": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1511122650, "Score": 5, "Body": "This is not the stage to be a purist. Whether you like it or not, you have to play the game until they call you doctor. Smile, yes sir yes mam, get your degree, and then go do science how you want. The world is not a place that will suddenly realize that it was wrong the whole time and you were right. It will simply write you off and pass you by. Get good at the game, beat the game, and then go change the game. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq23379/"}, "205": {"Subreddit": "PhD", "Author": "Matthew94", "Date": 1511125726, "Score": -1, "Body": "If you need 19 tweets to make your point, you shouldn't be posting it on twitter.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dylif/how_to_lobby_against_gradstudenttax/dq262ip/"}, "206": {"Subreddit": "PhD", "Author": "les_mort", "Date": 1511135487, "Score": 1, "Body": "Mostly Star trek and NASA related stuff. Trying to motivate myself", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dq2exf8/"}, "207": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1511144816, "Score": 2, "Body": "dissertation is not a pinnacle of your career.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq2mot2/"}, "208": {"Subreddit": "PhD", "Author": "BlueEmpathy", "Date": 1511163742, "Score": 8, "Body": "Some sport. Running, hiking would be ideal because they put you outside in nature.", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq2zkjr/"}, "209": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1511173505, "Score": 1, "Body": "A musical instrument?", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq33cc8/"}, "210": {"Subreddit": "PhD", "Author": "Astro_Biscuit", "Date": 1511174516, "Score": 1, "Body": "I took up embroidery! It's a cheap hobby, creative so it counteracts the science overload, I can make Christmas gifts for family and friends, and it's small and portable so I can do it when/wherever I like! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq33pn8/"}, "211": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511180900, "Score": 2, "Body": "Similar but hyperelastic materials. Cauchy's law is just reduced Navier-Stokes. I am quite into the core. Yeah, working on journal papers now.. Hopefully can publish.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq36bbo/"}, "212": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511180977, "Score": 1, "Body": "Yeah, only knowing that thru hard way. Gonna change the game once I graduate", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq36cnq/"}, "213": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511181139, "Score": 1, "Body": "nah. I know it isn't. Just feel like when you can publish easily, it loses rigor. I wonder did my friends who publish on PLSR and Finite Element Method understand the theory, and hence correct usage of them..", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq36fer/"}, "214": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511181393, "Score": 2, "Body": "Cool! Thanks for the advice. You are right that because we are driven by passion to address a subject, we can lose sight. We dig deeper but we also sink deeper. By the time we have to climb back up, it makes the finishing journey painful. I tried to convince myself that before I am 30, when I am still creative and daring and energetic, I should go after my dreams.. Ah, dreams they are, indeed. Dreams.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq36jz1/"}, "215": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511183063, "Score": 1, "Body": "Yeah, reality is always depressing. Maths is, somehow, a drug for me to escape that.. to realise the universe is beautiful, it comforts my little soul. In fact, I pursue my PhD because of my love of the elegance of computational mechanics. In finite terms, we explore an infinite world. From theory, we seek for deeper truth and hopefully a cure for diseases. That is my world of bioengineering. We seek, we help, we cure. But so damn ironically, I can't help my sorry ass. I just cry and laugh myself to sleep every night..\n\nRegarding universities treating us as slave labour, I am thinking of starting a union to combat that. It is just wrong for them to withhold us with little stipends although we deserve to graduate! Shame of them!\n\nYeah, so here I am.. still wondering around in curiosity, but hides in corner at night. Isolated. Unsure of where the light is, and how high to climb to the shoulder of this giant.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq37fc3/"}, "216": {"Subreddit": "PhD", "Author": "blek_blek", "Date": 1511183196, "Score": 2, "Body": "Hey, thanks for your advice. Will take short breaks! ☺", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq37hxl/"}, "217": {"Subreddit": "PhD", "Author": "rip_the_rip", "Date": 1511194090, "Score": 2, "Body": "This was so helpful", "Permalink": "https://www.reddit.com/r/PhD/comments/7by9r5/7_reasons_youre_feeling_needlessly_unproductive/dq3fqrn/"}, "218": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1511196464, "Score": 2, "Body": "I like going for a one hour walk whilst listening to podcasts every day, at least forces you to move for a good while and something to listen to. Not science podcasts, comedy radio programs really help me unwind and take my mind off it. It helps my thoughts coagulate into order too, at the start I'm thinking about them a lot but after a while they finish churning away and I can actually listen to something funny.", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq3i03h/"}, "219": {"Subreddit": "PhD", "Author": "SurgicalStraw9", "Date": 1511207178, "Score": 1, "Body": "Tell me about it. \n\nIt's a hash dog-eat-dog world, especially in our country, where you aren't even given stipends, and you usually have to find 1-3 year grant on your own, or in my case was offered one year contract and extended until end of current year. I wouldn't have gotten it unless one year's funds were promised. Now I have only one waiting grant application waiting response from my dozens of declined pleads. \n\nOur national universities here are getting less and less money each year, and their cutting  down staff and research while demanding increase on teaching/graduating. It's crazy, and it's ruining our university's quality. Fundamental research, like my phd project on adolescence auditory development, isn't supported since hearing research isn't priority research topic -even though that's not the ultimate point of my topic, but neural network development etc. Biology and neuroscience has always fascinated me, but the work is not worth doing at the cost of my own sanity.\n\nFurthermore, grad students aren't doing well either -both you and me included- Lonely work is expected of us, and it's \"publish-or-perish\" mentality all around. Hard work with little reward. Perhaps they divided us so we can't pull together. Our supervisor's  PhD-group did start helping each others at the beginning, but now we're too busy with our own works and labs. We are also competing each other in the end, so that's not good either. None of us knows what to do next after our PhD's or are too afraid to weaken their position for the ~~post-grad~~ post-doc. Is this how we do science? Madness", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq3sk5s/"}, "220": {"Subreddit": "PhD", "Author": "rainbow-armada", "Date": 1511209432, "Score": 3, "Body": "Embracing it? :-) Sometimes being in the bubble helps getting into flow. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq3ushz/"}, "221": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1511211898, "Score": 5, "Body": "Get yourself a good pair of headphones and get lost in music. It's a great outlet ☺️", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq3x8dy/"}, "222": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1511212053, "Score": 2, "Body": "I started running again (having not run since high school x-country). It was incredibly rewarding and has led to a passion I didn't even know I had. Plus, on longer runs, I found it really cleared all the minutiae away and allowed me to figure out some of the lingering questions I was stuck on that particular day regarding my dissertation. I answered many a nagging thesis problem while out on runs.  As an side, trail running was much more relaxing and rewarding than road runs...but both were therapeutic in their own way.", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq3xdxq/"}, "223": {"Subreddit": "PhD", "Author": "DryLabRebel", "Date": 1511220818, "Score": 1, "Body": "Very glad to hear it.\n\nThanks so much for reading.", "Permalink": "https://www.reddit.com/r/PhD/comments/7by9r5/7_reasons_youre_feeling_needlessly_unproductive/dq45lm3/"}, "224": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1511236515, "Score": 1, "Body": "What do you mean when you say non predatory journals? In what way are they predatory?", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dq4j6xm/"}, "225": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1511250250, "Score": 2, "Body": "Predatory journals are these which publish anything whose authors are willing to pay (lots of) money, without proper review (evaluation) process.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dq4rivs/"}, "226": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1511262438, "Score": 1, "Body": "I started taking a lot of walks. I would just walk out the door and wander my city for two or so hours. Good luck! You'll do great. :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq4w4ll/"}, "227": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1511263454, "Score": 5, "Body": "Sounds similar to what happened to me during my MSc at a top UK university. My chosen supervisor became very toxic and by the end started making comments like \"You'll pass but not do very well.\" She made me cry several times by being very verbally abusive. I ended up getting a 68 on my dissertation (2 points shy of that distinction and I'm pretty sure it was because of her that I didn't get it) and passing the degree with a Merit. After she made me reprint my masters dissertation for a third time (three weeks after it was due) and I handed it in, a different professor pulled me aside. It turns out the entire teaching staff had been well aware of the abuse but done nothing to stop it. Instead, he just said \"We're sorry. That shouldn't have happened to you.\"\n\nI ended up not asking her for a recommendation for my PhD application. I was accepted somewhere else quite easily and her abuse, honestly, prepared me for my PhD. Don't give up on your future plans. And while I just took what I was given since it honestly wasn't worth it to argue, I think you should follow the advice the other commenters have given you. I hope that you can take this bad experience and turn it into a piece of armor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dq4wil9/"}, "228": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1511263611, "Score": 2, "Body": "I know (where I am) some supervisors delay the applicants a year or so and have them do an RA to gain some experience. So it is possible, it just may take longer.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dq4wku7/"}, "229": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1511264098, "Score": 1, "Body": "At conferences you should try to make connections with research groups that do things similar to you. Sometimes you can get an unadvertised post-doc that way. The position I've just been provisionally offered for after my PhD finishes was unadvertised and I got it through a network (it's in my area but not on my exact topic). Also, my other PhD friends often cold emailed labs or research groups that were doing something similar. I know two people that got post-doc offers that way. Good luck! It's really scary at when you are at this point! I know because I'm right there with you. Just keep working hard!", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/dq4wrvn/"}, "230": {"Subreddit": "PhD", "Author": "ExsquiteInformation", "Date": 1511264165, "Score": 1, "Body": "Thank you friend for your kind words. Really helping. I am currently beginning the appeal process. The University was apprehensive at first trying to stop any appeal from happening but eventually I managed to convince a hearing which is good. I hope your future is positive too now, I am looking for a PhD still but my top options are now a little out of reach ", "Permalink": "https://www.reddit.com/r/PhD/comments/7bmca3/help_my_professor_sabotaged_me/dq4wsv8/"}, "231": {"Subreddit": "PhD", "Author": "buttfacedmiscreant11", "Date": 1511278502, "Score": 2, "Body": "A long bath listening to a podcast relaxes me and gives me a break from PhD thoughts!", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq568j4/"}, "232": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1511286383, "Score": 2, "Body": "Absolutely! I am the opposite of OP, I want to be in the flow of writing and not get distracted every two mins. This sunday for example, I was supposed to write half a chapter. Instead I procrastinated by working on my CV for 6 hours. I didn't even make the CV, I just spent 6 hours working on the LaTeX class file to format it. I wish I had OP's problem", "Permalink": "https://www.reddit.com/r/PhD/comments/7e666t/ive_started_writing_my_thesis_and_i_feel_like_i/dq5dzpf/"}, "233": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1511288109, "Score": 1, "Body": "So I am an international student in a US PhD program. There's basically 4 ways to get out of paying tuition. Here it is ordered according to preference:\n\n\n* 1) Get a fellowship that pays for tuition and gets you a stipend (ex. [fulbright](http://www.scholars4dev.com/2876/usa-fulbright-scholarships-for-international-students/) ). These are rare and very competitive. Check your country's fellowship programs as well, they may require you to come back immediately after graduation however (for example [DaaD](https://www.daad.org/en/study-research-in-the-usa/)). This is the most preferable option.\n\n* 2) Get a research assistant-ship (RA) with a Professor. You will have to email Professor's that work in your field. Set up an interview and they may chose to fund you through an RA. Remember that this funding is through their projects and may not extend until you finish your PhD. Your Professor may be able to win another grant and continue funding you, or you may have to find a TA after your RA gets over (or pay your tuition yourself). You're basically under the mercy of your Professor, he/she can fire you at any time, and you have to perform research that supports the project you're being paid from. Still it's preferable since your funding directly complements your future dissertation. Additionally, you may be funded full time or half time. Half time gives you half the stipend and covers half the tuition. You may be able to get a half time RA and a half time TA (see next) to completely fund your PhD.\n\n* 3) Get a teaching assistant-ship (TA). You can apply to be a TA through your department after getting accepted to a US academic institution. A TA may have to teach a class, teach a lab, perform grading, take remedial classes, etc. TA's are very competitive but your Professor may recommend your candidature to give you a bump (this is mostly done through unofficial channels, like a private email to the grad chair). The good thing is that this funding is through the department so you may be able to follow your own research goals (instead of it being dictated by the project as in an RA and your adviser). However, your adviser may arm twist you into following whatever research goals are of interest to him/her. The bad news is that you have to spend a considerable amount of time preparing, teaching, grading etc, this is time taken away from your research. And believe me when I tell you, undergrad students are a HANDFUL. You may be a half time TA or a full time TA (depending on how much funding your department has). Remember that the department wants to save these positions for their senior PhD students to push them out.\n\n* 4) Get a graduate assistantship (GA). This is basically some sort of work available through certain channels in your university (almost definitely outside your department). This varies a lot, and I can't quite describe it well. A good example is paid position through the University Graduate Student professional associations. The good news is that the funding mechanisms is the same as RA and TA, and your adviser will probably have no control over it, which means you can do whatever the hell you want during your PhD. The bad news is that your responsibilities will be so outside your PhD expertise that it may distract you from your PhD. However, that may not be a bug, instead a feature in your case, if those responsibilities help bolster your CV. However, these positions are very rare and very competitive. Please note, these are very different from paid hourly positions. Paid hourly position (such as working on campus, or at the cafeteria) does not come with tuition or health insurance benefits. They basically only pay you by the hour and provide no other benefits. Also, when in the US on an F-1 student visa, you CAN NOT work outside the academic campus (no independent consulting services, tutoring services, domestic services etc.) your pay check HAS to come from the university, and you CAN NOT work more than 20 hours a week (on paper) except under certain circumstances. You will be in violation of your student visa.\n\n\n\nEven with all these funding mechanisms, they only cover your tuition and probably your health insurance. You will still have to pay University fees (stupid scammy fees like sports fees). Expect your school fees to be around $500-$1000 per semester if you're funded full time. Expect your stipend to be around $500 - 1000 /month if you're half time funded, or about $1200 - $1800 /month if you're full time funded. Also, one final addition, your funding will most probably only cover fall and spring semesters. There's a very good chance you wont find any sort of funding for the summer semester (good time to go home!), so get an apartment lease accordingly.", "Permalink": "https://www.reddit.com/r/PhD/comments/7clxrd/getting_a_stem_phd_abroad/dq5fqg1/"}, "234": {"Subreddit": "PhD", "Author": "idothingsheren", "Date": 1511303726, "Score": 1, "Body": "My TA evaluations :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dq5vnwx/"}, "235": {"Subreddit": "PhD", "Author": "Thorngs", "Date": 1511306525, "Score": 2, "Body": "This is very nice to read. All the best to you ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dq5y64e/"}, "236": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1511327809, "Score": 4, "Body": "Thanks for posting, I hope it takes off! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq6eotg/"}, "237": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511340654, "Score": 1, "Body": "Thanks for your positive reply, it means a lot. I am looking forward to your participation! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq6kypz/"}, "238": {"Subreddit": "PhD", "Author": "Fluffypinkcandi", "Date": 1511348406, "Score": 1, "Body": "I see.", "Permalink": "https://www.reddit.com/r/PhD/comments/7c7wul/what_are_my_chances/dq6nvg7/"}, "239": {"Subreddit": "PhD", "Author": "TotesMessenger", "Date": 1511371095, "Score": 1, "Body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/journal_club] [Maybe we could build a worldwide journal club together...](https://www.reddit.com/r/Journal_Club/comments/7esj9c/maybe_we_could_build_a_worldwide_journal_club/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq740ni/"}, "240": {"Subreddit": "PhD", "Author": "BlueEmpathy", "Date": 1511383129, "Score": 1, "Body": "That's very interesting!", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq7fb59/"}, "241": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511387897, "Score": 1, "Body": "Thanks! If you have some ideas, please let me know then we can add it in the next version!", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq7jo8e/"}, "242": {"Subreddit": "PhD", "Author": "unico51", "Date": 1511441288, "Score": 1, "Body": "But will it be much different from https://pubpeer.com/ ?", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq8ezx2/"}, "243": {"Subreddit": "PhD", "Author": "Yapudetofu", "Date": 1511442306, "Score": 6, "Body": "Congrats on starting this great adventure that is a PhD! \n\nMy supervisor also got me to read a lot of articles and write a review. Depending on how familiar you are with the field, I think that reading other published reviews can help get an overall picture. For more details, I would look first at the papers from successful research groups in your field. \n\nAlso, pay attention to difficulties or aspects of the research that caused problems, if you can solve the problem or improve upon the research, chances are you have a good foundation for a project that could lead to a publication!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dq8fgl6/"}, "244": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511445971, "Score": 1, "Body": "Ya, I could say much different and thanks for asking. We found some features lacking there, then we put our selves back to the period for PhD degrees, and refine the process and the logic for reviews giving and reading, also enhanced the user interface. While you are using Crinetic, you will notice our care for both \"commenters\" and \"readers\". The core idea is \"Here you can expect more\". We don't want readers just stopping in checking comments, instead, \"suggesting reading\" can guide you further. And for commenters, you can choose to leave \"praise\" and \"criticism\" to clarify your statement in a shorter time. It's a new innovation for a commenting platform. Of course we do need your contribution for its growth, and we are listening your demands. If you have any suggestions, please just let me know and we would put it on our to-do list. But first, may I ask you to try it and...if possible, please give a comment :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq8hdqb/"}, "245": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511448775, "Score": 1, "Body": "There is one thing in common, we all try to make academia better, that's for sure!", "Permalink": "https://www.reddit.com/r/PhD/comments/7eljx0/im_still_remembering_i_was_dreaming_of_a/dq8j4yr/"}, "246": {"Subreddit": "PhD", "Author": "svkumar", "Date": 1511449255, "Score": 4, "Body": "Congratulations!!\nI second the comment  above but also would like to add a few things. When writing a review it’s difficult to keep a track of all the articles you have read. It is helpful to create research evidence tables. You may have already heard about this. If yes then this would be just repetition. It always helps to create a excel spreadsheet where you divide your research in two or more sections. The main section where you find articles  relevant to your research. I suggest you catalogue articles  year wise and then briefly touch about their methods and results . Add a small note in your own words about the pros and cons about each article. If you find articles that are not relevant but are related to your research in some other aspect , I would suggest you list them in a separate sheet and write a few points about why In your opinion this article is useful for your  research . This way when you finally write an article you can rely on the notes on the spreadsheet  and  put the pieces together. I hope this helps!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dq8jgnw/"}, "247": {"Subreddit": "PhD", "Author": "vanquishSilver", "Date": 1511469822, "Score": 1, "Body": "Sorry to hear you're having trouble. It can be a real pain when your supervisor lets you down or leads you down the wrong path. But I agree that for now getting the PhD should be your priority, I'm sure you'll have plenty of chances to apply later.\n\nHowever, you can make a lot of difference by yourself. Basically, the postdoc does not have to be in exactly the topic what you're doing right now. Mostly, research groups ask their postdocs to come up.with new ideas and expand the group's expertise. If there is a field or research group that you like, you can email them asking about positions or apply to positions which sound interesting to you. Your main selling point would be that you have knowledge that none of the other people have in that team. These sort of ideas can open up exciting research pathways. \nIn fact, this is exactly how I got my postdoc I wasn't exactly qualified for the job but I offered knowledge from outside their comfort zone. \n\nAlso, at conferences or meetings, apart from speaking to possible people who might employ you, get to know people socially. You'd be surprised at how many people get offers because they were friendly and made a good impression to someone that the employer knows. \n\nI'm sure you'll get through this and you'll get a great position after your defence! Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/dq8zsnw/"}, "248": {"Subreddit": "PhD", "Author": "petitcrocodile", "Date": 1511476641, "Score": 2, "Body": "I’m doing the same!! I’m not going to lie, it was super frustrating because it was going to be my first first author paper and I didn’t exactly feel like an expert.  At the same time, it was extremely useful and I feel like I’ve had emerged from this process  with a deeper understanding of the topic.  As of last week, my advisor says that everything is there but I just need to make it more “like a story” and “own my statements” (I feel like this might be due to the fact that I don’t feel like an expert so I avoid sounding like one).  It’s a long process...but it gets better.  \n\nI’m almost done with a set of experiments, so I’ve been writing that manuscript (and found that much easier!).  I had a chat with my advisor and we decided that the data paper is more important right now, as long as I keep working on the review and get it published.\n\nGood luck with your review!!!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dq94wel/"}, "249": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1511520506, "Score": 2, "Body": "I can relate to your stories a lot. To explain my situation shortly, my supervisors always pushed me to handle the data in ways that I know were unethical. A few months before the end of my PhD, I discovered that one of my supervisors had made a huge mistake handling the data, meaning that all my analyses had to be rerun. After everything they had put me through before, this was the point were I couldn't take it anymore. I stayed at home with a burnout for a month (which wasn't enough tbh). I knew I hadn't been feeling well for years, but when I finally stayed home I started to feel really bad (a lot of physical complaints, anxiety attacks etc). Btw, I'm a psychology grad student, so I really feel what you're saying about the irony of not being able to help yourself.\n\nLuckily, this was also a turning point for me. I found another (part-time) job as a researcher outside of academia. I now work at a university college (not sure whether this is a 'correct' translation, it's a bit hard to understand how our national system compares to others) which is less academic and more practice-based. I do miss being able to do more experimental work, but this job has given me so many things that I've missed during my PhD. I'm also still trying to finish my PhD part-time, but with the stark contrast with my other job, the academic environment disgusts me more and more.\n\nThe advice I would give you is: you do you. You say you're stubborn. I relate to that. My boyfriend has been telling me for years that I should quit my PhD and I would just get mad 'cause 'he doesn't understand what it means to me'. The more and more people gave me advice, the more insecure I got about what to do. What helped for me was to get some other things to focus on (like the other job), get some distance. Maybe it will work for you as well? Ask yourself why you really want to finish this PhD? I still haven't resolved whether I want to finish, but I do feel a lot better having other things to focus on. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dq9t4fn/"}, "250": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1511527848, "Score": 2, "Body": "Maybe you are lucky to be in a really good program for you and/or a less anxiety-prone person. In a sufficiently, securely funded PhD program with a sufficiently reasonable PhD advisor and other superiors and collaborators, and without major life setbacks, for a not-bad PhD student there is usually indeed no need to worry about *if* you will graduate, but there's still usually lots to worry about in what position you will be when you graduate - if you will have what you need for the desired career (e.g., outstanding publications for research-focused academic career, teaching experience for a lecturer career, or specific high-level skills for some other career), or you will have nowhere to go.", "Permalink": "https://www.reddit.com/r/PhD/comments/7cqs59/what_is_there_to_worry_about/dq9vrxl/"}, "251": {"Subreddit": "PhD", "Author": "ughcrymore", "Date": 1511545152, "Score": 13, "Body": "Therapy makes a big difference for me. Check with any campus resources you have to see if there's an option the school provides, or if they can give you more information about your insurance coverage.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqa71z5/"}, "252": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511551363, "Score": 1, "Body": "mh...that's a good question. I guess probably you desire some short-term sparks more than long-term rewards. There is no right or wrong, just you have to adjust yourself to the PhD study. It's a job you wouldn't get fun everyday, but if you don't do that, end up you get nothing. Try to change your mindset and make a big picture of your longer future. Every boring day may suddenly changes :) Just remember, you are no alone. I understand the feeling especially while I got stuck in a always-failing situation. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqac0ys/"}, "253": {"Subreddit": "PhD", "Author": "blue_cinos", "Date": 1511555544, "Score": 7, "Body": "I have to remember that it's alright for me to not enjoy it sometimes. What you're going through sounds a little more involved, it's probably a good idea for you to look into getting help - your university is likely to provide resources.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqaffal/"}, "254": {"Subreddit": "PhD", "Author": "minveertig", "Date": 1511560227, "Score": 16, "Body": "Quit. Walk away while you still can. If your work doesn't bring you happiness, what's keeping you there? I really mean it. If you're halfway in and you haven't found any joy in your work, you should be doing something else.\n\nSometimes the only winning move is not to play.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqaj5h7/"}, "255": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1511560878, "Score": 9, "Body": "Sunk-cost may be a fallacy but it's a powerful motivator. I was two years into my three year PhD when I realised I was extremely unhappy and by that point I decided it was worth carrying on regardless. Leaving a PhD early gives you nothing, I can totally understand why people \"put up\" with it and perhaps feel trapped. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqajnpo/"}, "256": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1511567397, "Score": 10, "Body": "Same here, by the time I was in year 2, massive depression hit. But  I was at the verge of a breakthrough. Now one and half years later, I'm still not happy with my work but I'm at the finish line and I know it's going to make me immensely happy that I went through the process. Just saying quit! Is poor advice in my opinion. Therapy is good advice, it helped me. I think the poster should reevaluate his options, his dissertation topic, his research  approach and style, talk to his adviser and counsellor, include some non-research activities in their daily routine, and if they continue to feel their current pain is not worth the end goal then maybe consider quitting.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqaok0p/"}, "257": {"Subreddit": "PhD", "Author": "Aleaj", "Date": 1511569139, "Score": 4, "Body": "Get some hobbies to lift your mood up when you feel down. Try a new sport, during which practices you don’t think about your PhD at all. Eventually, you might feel better mentally because you’ll look forward to your hobby once you get out of the office, and the days will seem to pass by quicker. \nGet social, see your friends / coworkers for an after work pint (one. Not all evening long). Something to keep your mind away from the thesis once the day is over basically. \nAs mentioned earlier, seeking help from therapist can be of great value. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqapu6j/"}, "258": {"Subreddit": "PhD", "Author": "ABCDEAD", "Date": 1511570597, "Score": 4, "Body": "If you don't want to quit, read. Start with the keyword you like. Build from there. In the era of search engines, I'm sure you can find something you like. Start from there. Build interest, knowledge and skills throughout your time. You only have these few years opportunity to be there. Appreciate it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqaqwh3/"}, "259": {"Subreddit": "PhD", "Author": "schlaf518", "Date": 1511588383, "Score": 5, "Body": "Care for your body. Without good physical health you won’t be able to do anything (PhD or other). It’s hard to break the depression cycle so therapy might help. Do things in small achievable steps.. find an activity you enjoy in a place you enjoy like biking, walking, jogging, yoga, whatever it is. Take the time to explore what it is that you like. Start by doing that a couple of times a week consistently and slowly pick up pace. The endorphins are real and will help lift your mood. And knowing that you’re caring about yourself (before your job) will also make you feel better by realizing what’s more important. Care about yourself. That’s my best advice. No one else will care the same way. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqb2sgm/"}, "260": {"Subreddit": "PhD", "Author": "halimaiqbal00", "Date": 1511600889, "Score": 4, "Body": "Some excellent suggestions here. I started a month and half ago and have had terrible anxiety because I expected far too much from myself. Speaking to my supervisor and other PhD students helped me immensely so realise and accept that the journey is a marathon and not a sprint.\n\nI lift weights a few times a week so that’s definitely helped boost my mood. I’m also attending weekly councilling sessions offered by my university which is also a great help.  Try it. You are not alone.  I felt better just knowing that a lot of students feel this way throughout the phd but just need to find/learn coping mechanisms to get them through it.\n\nAll the best - you got this! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqb85vk/"}, "261": {"Subreddit": "PhD", "Author": "MistahKertz", "Date": 1511621329, "Score": 5, "Body": "Look, there are some useful suggestions here, but unfortunately I think there's no quick and dirty answer that a forum can provide that will be what you're looking for/need. Without lazily providing suggestions, I'd ask why you're doing the doctorate in the first place (is it necessary for your professional interests? is it a personal challenge or desire? etc.) and consider your current feelings in relation to the answer to that question. Have your ambitions changed but you're caught in the desire to complete a phd/don't want to deal with the perceived shame of leaving? Has the general culture of academic and institutional life disenfranchised you? Are you getting adequate supervision and are you supported by the school? Are you doing the intellectual project that you want to do? Or is it just high pressure, and you're looking for strategies to make it more manageable, like advice on conducting lit. reviews, analyses, etc.? There's nothing wrong with feeling anxious towards the project, but the challenge is to make that anxiety manageable (rather than non-existent, which is an impossible expectation). More practically, I think these are discussions that your supervisors or your postgraduate convenor (if you have one) are more appropriately positioned to have with you and advise you on given they'll know you're situation more intimately (if you trust them, of course). \n\nI assist a number of students with similar reservations at my uni, but their reasons for needing help and what advice they find useful is always different and based on their individual circumstances. (This is why I'm trying to tease out your circumstances.) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqbg6ie/"}, "262": {"Subreddit": "PhD", "Author": "rip_the_rip", "Date": 1511631041, "Score": 3, "Body": "Congrats on starting your PhD! I'm working on a systematic review right now while finishing my master's, hoping to start a PhD next year, and one thing I found very helpful was to work with a librarian to make sure that my search was as comprehensive as possible. If you're doing a narrative review that's maybe not as important, but you might consider meeting with a librarian nonetheless. They are the experts on finding information, so don't be afraid to make use of that expertise! Your department may have a dedicated research librarian, as mine does.  \n\nFull disclosure, I am the child of 2 librarians so I may be biased haha.\n\nI'm in the same boat as you in that I've never published before and I feel like I don't really know what I'm doing! It's a daunting process for sure. Best of luck!  \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqbngwn/"}, "263": {"Subreddit": "PhD", "Author": "pastasaladsnuts", "Date": 1511633301, "Score": 2, "Body": "Hi guys, thanks very much for so many constructive suggestions! I have read through all of them, and I do appreciate your help. Hope these post can help more people.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqbpe4r/"}, "264": {"Subreddit": "PhD", "Author": "drarch", "Date": 1511633340, "Score": 4, "Body": "Three things that worked for me. YMMV:\n\n1. Having a significant other _you can talk to_. My wife is in law school while I get a PhD. So while we both work and study a lot, we have each other to vent to and be each other’s support every single day.\n\n2. Find a community in the real world. My PhD is likely very different than yours (architecture), but I too would be miserable if I was always in an office. Find a community of people that you can interact with on a regular basis, and could care less about your PhD. Maybe it’s a place of worship, maybe a sports league, maybe just a bunch of friends that host each other for dinner or get coffee. But I’ve found having a shared communal network can reduce my personal stress and anxiety when I return to work. \n\n3. Assuming you don't already have kids, and only if you can financially swing it, get a pet. Having a one year old puppy, which I got in the middle of my PhD, has forced me to take walks, go to the dog park, and stick to an early morning schedule. It's also a good way to relieve anxiety, because at the end of the day, they'll love you no matter what. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqbpfbl/"}, "265": {"Subreddit": "PhD", "Author": "pastasaladsnuts", "Date": 1511633961, "Score": 1, "Body": "Yeah, you are right. Thanks for your advice.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqbpyi1/"}, "266": {"Subreddit": "PhD", "Author": "Ferdinand-Wu", "Date": 1511639713, "Score": 1, "Body": "Grey town?? Hey, I am from Denmark.... I can survive, so do you :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqbusk4/"}, "267": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1511646522, "Score": 2, "Body": "I did this when I started. I read lots of articles at the start, then went to my supervisors with an outline. We refined the outline and they suggested some major stuff to make the article better, like summaries of information from previous work. Read the reviews in your research field and look at how each of them is good/bad and apply that to your writing. For example, the use of headings helped with getting citations (if that's important to you), I think. Headings help you find what you need when you're writing.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc0bhm/"}, "268": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1511646974, "Score": 2, "Body": "My closest attempt at an academic career (so far) is by presenting myself as a much cheaper alternative for teaching. The other option is to get an Associate Professor paid casually. Best case is they'll give me casual hours teaching. Hahaha dis lyf", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dqc0odg/"}, "269": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511647360, "Score": 1, "Body": "By headings you just mean subdivisons in your own text?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc0zdw/"}, "270": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1511647364, "Score": 1, "Body": "I became really anxious in my second year and decided to seek help. I talked to a counselor in uni and while it's not really very reassuring, my main takeaway was not to see completing a PhD as the only positive outcome. I always thought that failing means my world will come crashing down and I've put a lot of pressure on myself to \"finish on time\". It helps to commiserate with fellow students about hardships, etc so you don't feel alone.  \n\nOf course you're in this to get a PhD but how about all the good stuff you've acquired on this journey? You've learned a lot, stretched your abilities a great deal, made the world slightly better. It helps to acknowledge small wins and steps toward making progress.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqc0zix/"}, "271": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511647482, "Score": 2, "Body": "Thanks!\n\nThe review is supposed to combine two topics that have not really been studied together a lot, and the idea is to make as strong as possible a case as to why they should be in the future.. as such I'm looking at very different sources, making the lit review more voluminous and boring than usual I think :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc12vs/"}, "272": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511647533, "Score": 1, "Body": "What did you do at the beginning, how did you start? And how long did it take, how large of a project did it end up being? (# of words, # of sources etc?)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc147k/"}, "273": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1511647550, "Score": 2, "Body": "Yup! If your article allows for subdivisions, yeah. Those help me when I refer to a good hefty review and want to just find a certain piece of information.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc14ow/"}, "274": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511647585, "Score": 1, "Body": "I like to think I'm fairly proficient at obtaining sources, my problem right now is that I have too many and need to filter the ones that are *really* relevant, but I'll keep your suggestion in mind if I run into a deadlock later.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc15o5/"}, "275": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511647721, "Score": 1, "Body": "I've made a few so far, very preliminary, and I already noticed they help me categorize the sources I find based on where I can use them, and every time I come back to the draft they make it easier to get back to the core of what I was supposed to be doing.\n\nIt looks like I might aim for 6000-8000 words which seems to be typical for medium reviews in this field.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqc19it/"}, "276": {"Subreddit": "PhD", "Author": "pastasaladsnuts", "Date": 1511712822, "Score": 1, "Body": "Thanks for your encouragement!", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqd2j14/"}, "277": {"Subreddit": "PhD", "Author": "pastasaladsnuts", "Date": 1511712997, "Score": 1, "Body": "Thank you for your advice!", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqd2nmp/"}, "278": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1511803769, "Score": 1, "Body": "Coffee OR beer", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqevkj1/"}, "279": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1511810933, "Score": 1, "Body": "A few options:\n\n1. Using the search-and-replace hotkey in your LaTeX source.\n\n2. Insisting that your advisor not edit your source and then:\n\n    a. Using the difftex package (available on UNIX systems)\n\n    b. Kill trees by printing out both versions\n\n3. Tell your advisor that you're the first author, and it will be a lot easier if they don't try to bog you down with unnecessary edit requests.\n\nHonestly, #3 is how I view your problem if your advisor is only suggesting edits such as changing time derivatives from the \"full version\" to dots over the variable.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqf2oed/"}, "280": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511810959, "Score": 1, "Body": "I would advise you to consider a PRISMA Systematic Review :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqf2pbu/"}, "281": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511811111, "Score": 1, "Body": "Fuck yes. Doing a Systematic Review rn and god  bless this librarian dude", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqf2uw1/"}, "282": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511811139, "Score": 1, "Body": "&gt; PRISMA Systematic Review\n\nI'll look into it, thanks!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqf2vvw/"}, "283": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511811199, "Score": 1, "Body": "In a Systematic Review you first need to write a protocol to be followed. Go and read on cochrane guide for Systematic Review and the Prisma checklist for more information.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqf2y25/"}, "284": {"Subreddit": "PhD", "Author": "thisisenfield", "Date": 1511811401, "Score": 1, "Body": "Just to clarify, the corrections are annotated on pdf, and not in my source.\n\nI guess the problem is somewhere between your summary and me being sloppy. When I originally write a document, it all makes sense to me, and they're are few inconsistencies. Over a few iterations, when I give in to his recommendations, inconsistencies creep up.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqf35ci/"}, "285": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511811522, "Score": 2, "Body": "Keep this as a draft in case in a future you need it for a motivation letter ;)", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dqf39qw/"}, "286": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1511811666, "Score": 1, "Body": "I think you'll have to make a decision as to whether you'll abide by your advisor's recommendations or not.\n\nI hope you have used good version control because you might need to go back to the first draft and follow the corrections more carefully.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqf3exr/"}, "287": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511811889, "Score": 1, "Body": "This", "Permalink": "https://www.reddit.com/r/PhD/comments/7b8ern/help_choosing_an_advisor/dqf3n03/"}, "288": {"Subreddit": "PhD", "Author": "Doeido", "Date": 1511812261, "Score": 1, "Body": "+1", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dqf40e4/"}, "289": {"Subreddit": "PhD", "Author": "zabamoon", "Date": 1511813846, "Score": 1, "Body": "I’ll certainly do it! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dmj20/email_to_present_yourself_to_a_suitable_supervisor/dqf5lm8/"}, "290": {"Subreddit": "PhD", "Author": "srcyball", "Date": 1511816154, "Score": 3, "Body": "Completely different field but I have four supervisors so keeping track of changes is hell. I keep an excel spreadsheet with my original text, the recommended change, the actual change made and then, if necessary, a comment about why I ignored/amended their recommendation etc. I start with all the requested changes in one column and then work backwards from there. Its slow but when I go back and read through I am not looking for whether I made the edit, as I know I did, but now Im looking for consistency, flow etc. It really helped. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqf7xe6/"}, "291": {"Subreddit": "PhD", "Author": "thisisenfield", "Date": 1511819668, "Score": 2, "Body": "I like this! I will need to see how I can incorporate this into a paper which has a lot of equations.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqfbggk/"}, "292": {"Subreddit": "PhD", "Author": "petitcrocodile", "Date": 1511828458, "Score": 2, "Body": "I started reading reviews because I had no idea of what to start looking into.  Then I did a preliminary skeleton including all the things I needed to read-write about.  EndNote was/is my best friend for organizing all my papers into those categories. Then I mapped my headings, subheadings, sections etc.  At this stage I ran it through my advisor just to make sure I was following the right path.  Then I just started writing.  One of the things that made it heaps easier was citing as I was writing (if I wasn’t sure of the reference I just wrote *find reference* and did it later).  It took me like 3 months to get the first draft (but I was also doing other stuff).  Right now it is around 5500 words long, with two tables and a figure, 156 references cited.  I’m trying to make it shorter now, but this will depend on what journal you want to publish it :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqfjfk1/"}, "293": {"Subreddit": "PhD", "Author": "Castim", "Date": 1511829633, "Score": 3, "Body": "I struggled with that in the beginning and now I have a file:\nmyNotations.sty\n\nIn there I write something like:\n\n    % Define symbols\n    \\newcommand{\\timeSymb}{t}\n    \\newcommand{\\freqSymb}{f}\n    \\newcommand{\\inputSymb}{x}\n    \\newcommand{\\outputSymb}{y}\n    \n    % Command that you would actually use\n    \\newcommand{\\time}[0]{\\timeSymb}\n    \\newcommand{\\freq}[0]{\\freqSymb}\n    \\newcommand{\\input}[2]{\\inputSymb[#1,#2]}\n    \\newcommand{\\output}[2]{\\outputSymb[#1,#2]}\n\nObviously, I end up with a pretty long .sty file, differentiating between scalars, matrices, vectors... But in the end you just add \\usepackage{myNotations} and in your tex file:\n\n    The input at time $\\time$ and frequency $\\freq$ is denoted by $\\input{\\freq}{\\time}$ so\n    the output at time $\\time=0$ and frequency $\\freq=\\pi$ is $\\output{\\pi}{0}$.\n\nFor me it becomes easier to type as I then dont have to remember which symbol denotes what. It worth taking some time to think about how to differentiate everything, when to use uppercase or not...\n\nIn the end it becomes easy to change notations through a whole document.\nYou can as well redefine existing commands with:\n\\renewcommand\n\nAt least for me it was helpful. But to be efficient it has to be consistent so it is a problem if you copy paste formulas from old papers, you have to make everything use your style for it to be useful.\n\nEDIT: Some formatting. To piggyback on other comments, I use git for my tex code. It may seem silly for something as simple as tex and where you work mostly alone but it is nice to have a tool which lists your changes.\n\n\n\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqfkfck/"}, "294": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1511830734, "Score": 10, "Body": "It’s very important. I wouldn’t take a PhD student without meeting them prior or, at the very least, talking on skype. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqflcqq/"}, "295": {"Subreddit": "PhD", "Author": "kashiman290", "Date": 1511833377, "Score": 3, "Body": "For the professors that have not contacted me, should i continue to email them after the deadline? Or is it safe to expect that they will email me first if they are considering my application?", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqfnpms/"}, "296": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1511833523, "Score": 2, "Body": "They would have contacted you if they were taking students or were interested. I don’t think there’s any need to contact them again. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqfnujo/"}, "297": {"Subreddit": "PhD", "Author": "thisisenfield", "Date": 1511837813, "Score": 2, "Body": "This is wonderful advice! I think this will surely solve a lot of my issues! Thanks!", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqfrtub/"}, "298": {"Subreddit": "PhD", "Author": "mowkiemowkie", "Date": 1511850406, "Score": 5, "Body": "If you wrote just once, I think you could write again to enquire. Sometimes people, especially supervisors, are just busy and need a little help to be reminded on the applicants. I personally had to email back before getting any answer, then I had to email back after each interview, and then it worked. I don't think anyone would hold it on you to send a second email if you're motivated and they haven't replied to the first one. But write it nicely :-) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqg0ukr/"}, "299": {"Subreddit": "PhD", "Author": "sokratesz", "Date": 1511855185, "Score": 2, "Body": "That sounds a lot like what I'm doing and planning to do :))) thanks", "Permalink": "https://www.reddit.com/r/PhD/comments/7ezax1/im_starting_out_my_project_by_writing_a_review/dqg35p5/"}, "300": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1511856850, "Score": 2, "Body": "Is that not usual? I have four supervisors as well. Just one principal supervisor who helps with the overall PhD. But then I have the head of my department who insists on being named as a supervisor, an expert in my field who has contacts and provides me with information/data etc, and another supervisor who does absolutely nothing but supervisor 2 insisted he was added to my supervisory panel.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqg3v5h/"}, "301": {"Subreddit": "PhD", "Author": "Stroopcat", "Date": 1511891282, "Score": 2, "Body": "You may want to specify that you're looking for US-only respondents.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g5qxp/i_want_to_know_your_story_takes_just_5_minutes/dqgpch9/"}, "302": {"Subreddit": "PhD", "Author": "greyfriar", "Date": 1511900261, "Score": 3, "Body": "'Atkin's Molecules' is pretty cool. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g6mrg/helping_my_parents_understand_my_degree/dqgyp05/"}, "303": {"Subreddit": "PhD", "Author": "ElphabaTheGood", "Date": 1511914143, "Score": 1, "Body": "Hello. All of that sounds very frustrating. I can relate, but the reason I'm posting is to suggest Cognitive Behavioral Therapy. Personally, I feel that when my head is on straight, I can deal with all of the other decisions, frustrations, and choices much better. CBT is more effective than medicine in many cases, and might be relevant for you because of (1) the depression you mention, (2) the valid challenges you're facing, and (3) deciding how to move forward. Good luck! \n\nOne source: Cognitive Behavioral Therapy for Mood Disorders: Efficacy, Moderators and Mediators, \nDOI: 10.1016/j.psc.2010.04.005", "Permalink": "https://www.reddit.com/r/PhD/comments/7dy8md/depression_and_confusion/dqhcgpr/"}, "304": {"Subreddit": "PhD", "Author": "petitcrocodile", "Date": 1511915218, "Score": 13, "Body": "I’ve never been in your position so I wouldn’t really know, but I suggest you don’t meet with her, just based on the fact that she’s giving you such a short notice (regardless if she’s rude or not).  I mean, as a PhD student I am aware that I can’t just expect my supervisor to drop everything he’s doing to cater to my needs when I want to.  But do talk to her because I’m sure you don’t want any drama, let her know that you are happy to help but that she needs to let you in advance.  Happy birthday by the way :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhdf3t/"}, "305": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1511915658, "Score": 32, "Body": "I'm not taking into account that she is in a bullying group. I'm assuming she's just another student. Yo can extrapolate to your situation. \n\nIf any student asks me for something like that with less than 24 hours margin, it is an automatic no. No discussion. I can do it as a great favor for someone who deserves it, but not for a normal student. I have my own planificación, and you cannot just come here and expect me to change everything for you. In fact, to me is the same if you cannot because you're busy working, or because you want to see a film. Your personal time is also your time, and it's yours to decide how to spend it.\n\nSo... I think a polite negative is what you should do, stating clearly that she should have asked for this with more time. I've had issues with people like these many times in the past, always delaying everything to the last moment and, at the very end, wanting everybody to stop the world and become the center of attention. And I can tell you that the times I agreeded to do it it wasn't worth, and they just gave them the chance to be late the next time, as they know they'll get your attention when they want. If you stop it at the beginning you won't regret it later. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhdtaz/"}, "306": {"Subreddit": "PhD", "Author": "Obsessivefrugality", "Date": 1511916143, "Score": 9, "Body": "It would be a hard no from me. Even without any of the past treatment, she needs to respect your time and schedule. I assume you are a pretty busy person with a full schedule, they need to understand that 12 hour notice is not sufficient for you to adjust your entire schedule.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhe8qm/"}, "307": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1511917522, "Score": 2, "Body": "Thanks :) I just needed some feedback since I was fearing I was being too mean. I was told by another graduate student that he would have done it for the student and I have been told before that so-and-so would have been a \"good\" supervisor and go early in the morning for them on last notice and I wasn't being nice. I even edited her poster until midnight the night before it was due because she sent it at 10pm and I couldn't even finish it before morning and sent it back to her &gt;&lt; she didn't even acknowledge me in her poster except another graduate student in our lab (I don't even know why since that grad student graduated last year)... I guess I felt a bit iffed by that which is why I don't know if I went too far by saying no to her", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhffdt/"}, "308": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1511918388, "Score": 5, "Body": "Even if you had not had the first few sentences, I would give you the same advice.  Part of education is learning to manage your time.  If she is unable to manage her time, it does not constitute an emergency on your part, birthday or not.  She should have planned on this prior to that day and arranged a mutually acceptable time.  When she gets out of school, people are not going to be as accommodating to her poor planning. \n\nAnd on a side note, she should probably learn she reaps what she sews, so I would not even hold it against you for being more stringent with her than had she not been previously abusive.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhg6z4/"}, "309": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1511918572, "Score": 1, "Body": "I'm also in Kangarooland. To be fair, I would class at least two of my supervisors as \"advisory committee\" rather than supervisors but there you are. Two of them don't even want to be listed as authors on papers because they don't have the time to dedicate to that. I just call them up when I need a hand with something specific to their field.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqhgct8/"}, "310": {"Subreddit": "PhD", "Author": "oh_wuttt", "Date": 1511927198, "Score": 2, "Body": "I think everyone else covered it really well. Even without the bullying bit, I would give a hard no. I haven’t been in this exact situation but I’ve definitely served as a professional mentor and there are those that have their shit together (“If you have the time, would it be possible for you to review my CV within the next couple of weeks?” And they send along a job description summary and make it super easy for me) and there are those that don’t have any foresight (“Sorry, this is super last minute, but can you run me through some interview questions, my interview is tomorrow. Oh, no? Then what do you think I can anticipate? Oh, no on that too? Then can you just help calm me down?”)\n\nI’ve found that with those that do not have their shit together, if you give them an inch, they’ll take a mile out of it. I had to pretty bluntly tell one person to stop contacting me for any sort of help because it was unprofessional and my helping this person only enabled them and enforced their idea that if they pester someone enough, they’ll get their way.\n\nDon’t feel bad about it for even one second. Go enjoy your birthday and fuck 8 AM meetings!", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqhnxhz/"}, "311": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1511929034, "Score": 1, "Body": "It helps, but you should prepare well. Read their research, research the institution, and follow up with gratitude afterwards.", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqhpdt0/"}, "312": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1511960321, "Score": 1, "Body": "With that short of notice it’s an easy no. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqi4s9j/"}, "313": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1511960706, "Score": 4, "Body": "Regarding the poster thing : like someone else said, I would not have done that.\nExcept for my supervisor, a friend or someone I think deserves it, there's no way I change my evening plan for a colleague if I'm not totally willing to do it. Even if I don't have anything planned after work, no way I disrupt my personal life because somebody else didn't manage its time correctly.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqi50p6/"}, "314": {"Subreddit": "PhD", "Author": "TotesMessenger", "Date": 1511984211, "Score": 1, "Body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/gradschool] [How not to feel guilty about leaving a PhD (mainly for health issues)?](https://www.reddit.com/r/GradSchool/comments/7gfyks/how_not_to_feel_guilty_about_leaving_a_phd_mainly/)\n\n- [/r/labrats] [How not to feel guilty about leaving a PhD (mainly for health issues)?](https://www.reddit.com/r/labrats/comments/7ggbzw/how_not_to_feel_guilty_about_leaving_a_phd_mainly/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqirixd/"}, "315": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1511992043, "Score": 11, "Body": "I don't like the sound of this university it sounds like they weren't treating you well.\n\nYou are still the smart, determined, talented person that you were before you started. You must have been successful at undergrad/masters to have been chosen, and many other employers will be able to see that and will want you to work for them. You're very unlucky to have such an illness, but it isn't a terminal illness that could kill you, so it might take some time to get better then you will. Maybe this illness would have occurred anyway, or with a different stressful job, there is no way of knowing.\n\nSo let yourself get better (I know it is difficult to think about that but the most important thing you own is your own body and mind so you have to look after them), then be ready to come out fighting for the next great opportunity that will come your way!", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqj020q/"}, "316": {"Subreddit": "PhD", "Author": "floretine", "Date": 1511993289, "Score": 4, "Body": "Thank you for your comment and support! :)\nwell, in my case it is not just joints and skin, but I have mainly kidneys affected - it is the less visible and painful thing about it, but the most dangerous - doctors are acting because they are afraid that I could develop end stage renal disease and will need a transplant......I understand all this, about that health is priority but for some irrational reason I am very dissapointed how it ended and have no idea how to cope with that :( everyone is telling me that I should consider some less demanding career", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqj1eq1/"}, "317": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1511997315, "Score": 1, "Body": "If it's less than a day's notice, the number of hours notice = number of minutes I'll set aside for her. If it's any other night you can be more lenient but since you have plans it's really an easy choice to turn her down. She could've framed it as a friend favor (a stretch) but then it doesn't look like you're that close.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqj5a99/"}, "318": {"Subreddit": "PhD", "Author": "caterpillarmoustache", "Date": 1512009730, "Score": 3, "Body": "You can't do science if you are not well. As you know, science requires long hours as well as mental fortitude. You were dealt a bad card, and you must put your health first. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqjg1b2/"}, "319": {"Subreddit": "PhD", "Author": "Vaperator", "Date": 1512014910, "Score": 4, "Body": "Just leave, dont give it a second thought.  It's your life and you only get one.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqjke2u/"}, "320": {"Subreddit": "PhD", "Author": "TheBelleOfTheBrawl", "Date": 1512026977, "Score": 2, "Body": "While far less serious, the stress of my first year in a phd program lead to my chronic migraines coming out of remission (meaning I went from getting them once every few months to 1-3 a week like I did growing up).  My arthritis and skin disease also came out of remission, but this was more manageable. In addition i discovered I had previously gotten by on being smart versus being a ‘good student’,  Meaning I was completely unprepared for managing the requirements of such a rigorous program at full health let alone working around debilitating migraines. Couple that with my dad having passed the year before, a medication triggering what I now realize were manic episodes, and an anxiety disorder with panic attacks, my mental health deteriorated completely, and I slid into a depression. I stopped sleeping for days at a time, stopped caring for myself (think hygiene etc) or my living space, and would call my mom sobbing regularly because I would sit down to write a paper and literally be unable to write a single sentence. I failed two classes my second semester (C), and almost failed two others.  And because I expected my professors to treat me like a malfunctioning robot instead of a human being, I didn’t say a word to anyone until after my grades started rolling in. In my program, three C’s gets you kicked out. \n\nThe way I describe that time now is I was in near constant pain, and was completely out of my god damn mind.\n\nAs soon as I finished my short summer semester, I traveled back to where the doctors who’d originally helped me with my headaches were located. Obviously after meeting with them they identified all the other issues I listed above (and here I thought the problem was just headaches and a poor work ethic!).  I enrolled in some serious therapy along with the medical interventions, and before I knew it, my program was two weeks away from starting. \n\nI panicked. I realized I was in no way ready to go back yet. I had just begun to make progress in treatment, and knew I still wasn’t myself. Getting into this kind of program had been my goal since I was eight years old. Eighteen years later my dream was a reality and i knew I was inches from throwing it all away. What would people think?  Would they let me take time off?  How could I make sure I was physically and mentally ready to return?  How could I return with all my classmates and professors knowing I’d failed?  How could I go back now knowing I’d been acting like a crazy person for months (like asking nonsense questions in class etc/wearing the same dirty clothes to all that weeks classes)? I felt so ashamed. \n\nSo I applied for a medical leave of absence. Which was terrifying in its own right because I did not want to have to tell my University the details behind why I needed the time off. Thankfully they aren’t allowed to ask, but I didn’t know that initially.  Anyway, making that decision was awful, and those who disagreed certainly didn’t.  \n\nOur situations are different for many reasons, while health triggered the problems, by the time I sought help the issue was far more mental than physical.  My only goal (well obviously other than improving my own well being) was getting myself to a place where I could return to my program successfully. In the end four of us from my cohort had to take leaves of absence for various reasons, I was the only one who returned. And I’ve been kicking ass at the program ever since, even though this is the hardest thing I’ve ever done in my life. I still get migraines, I spent six months depressed without realizing it again, but I took the time off that I needed to be able to handle my program and my life. \n\nYour health is your first priority. If this is your dream, it’ll still be there when your ready for it.  And if you can’t meet the requirements due to your health, you’ll find another way. When I got arthritis I was a ten year old competitive swimmer with dreams of the olympics (so unrealistic lol but it was my goal), and was suddenly told that I would never be able to swim without pain again (I lost complete use of my left shoulder/arm bc of the pain). So I found different ways to be in the water, and am still so grateful my arthritis went into remission after ten long years of literally constant, sometimes excruciating pain.  \n\nWe don’t get to choose the things that happen to us health wise (for the most part). I am so sorry you have to go through this. And again, while our circumstances are vastly different regarding severity, I say with confidence that the person you will be on the other side of all this will be stronger than who you are today in ways no one can predict. We don’t grow when things are all sunshine and rainbows, it takes a storm. I wish you didn’t have to go through such a tempest, but I wish you the best. \n\nI keep a quote on my door, I read it every day as I leave the house, good ole Winston Churchill, “success is just going from failure to failure without a loss of enthusiasm.” ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqjrt9z/"}, "321": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512039481, "Score": 2, "Body": "I think you should get out and don't feel bad about it! There are tons of stories of people out there who quit and are so much happier after they are comfortable in a great job, 1-2 years later. Also, since you've been in your program a while, can you leave with a coursework master's so your time isn't totally wasted? In most schools in the USA that is the fate of people who quit after completing two years.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqjwkyk/"}, "322": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512039841, "Score": 1, "Body": "Well, getting up at noon is a recipe for depression. I have tried treating it like a job - force myself to get there by 9 and guiltlessly leave at 6 and enjoy the evening. 9 hours of work a day is way more than your current output, even if you take weekends off! You can later ramp it up if you're feeling better.", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqjwpol/"}, "323": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512040025, "Score": 1, "Body": "If she's asking for favors without a 24-48 hour advance notice, you can guiltlessly say no. The bullying part doesn't matter.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqjws3g/"}, "324": {"Subreddit": "PhD", "Author": "floretine", "Date": 1512043862, "Score": 2, "Body": "I already have a masters degree, because in Europe system is that first you get masters and then you apply for PhD position. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqjyclm/"}, "325": {"Subreddit": "PhD", "Author": "buttfacedmiscreant11", "Date": 1512045589, "Score": 6, "Body": "Could you run a power calculation that would demonstrate that your sample size is still adequate? \n\nFailing that, look in the literature for similar studies for yours and their sample size - you could cite them as justification for your sample size. Especially if your research design is quite complicated and has a relatively big burden on the participant - it might not wash for survey based research, but I know for interviews small sample sizes are common, or for experiments where the participant is required to do quite a lot. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dqjz77b/"}, "326": {"Subreddit": "PhD", "Author": "Dr_Jerkoff", "Date": 1512049956, "Score": 6, "Body": "As mentioned by the other comment, you can do a power calculation to justify your numbers. However, that depends on having an idea of effect size, and this is really hard to estimate in practice. \n\nWithout a power calculation, one way to sell your project is to describe it as a pilot study. Since you don't know if your approach/hypothesis is going to be valid, you can say you're doing this study to see if there's something worth pursuing. You can also cite budgetary/logistic constraints as reasons (off the record since that probably can't be put in print).", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dqk1ukv/"}, "327": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1512052500, "Score": 2, "Body": "Your health is the priority. You're an amazing guy and would love to get to know more of you ✊😎\n\nHope you have a fast recovery ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqk3ss7/"}, "328": {"Subreddit": "PhD", "Author": "Vaperator", "Date": 1512053599, "Score": 1, "Body": "Weed", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqk4qf4/"}, "329": {"Subreddit": "PhD", "Author": "floretine", "Date": 1512060723, "Score": 1, "Body": "...I am trying to persuade myself that everything will be fine and I have a time for everything, I just had 23th Bday month ago, so it should be fine....\nOther thing is that as I am a girl, doctors do not want to give me all treatments that are available - they are quite agressive and could impair my fertility in long term, so I really do not know how much time it will take for me to get back to normal...\nI am very thankful for your support, I hope things will be more clear for me with time", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqkbs1y/"}, "330": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1512061052, "Score": 1, "Body": "Yes I think it's important for you to consider what's your priority. I know someone who left their PhD in America and came back to the UK and planning to do another one!\n\nIf you need to chat feel free to message me :) I'd like to know more about your academia 😎\n there's not many people that can do a PhD and what's happening to you is not your fault ✊ you'll just have to give it your all and keep yourself focused..", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/dqkc4qi/"}, "331": {"Subreddit": "PhD", "Author": "pastasaladsnuts", "Date": 1512067545, "Score": 1, "Body": "Thank you! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqkiyh6/"}, "332": {"Subreddit": "PhD", "Author": "R3D0053R", "Date": 1512070941, "Score": 1, "Body": "Credible Hulk poster and Dilbert comic on the door, a few more posters from the kangaroo chronicles inside the office, star wars Lego and a monkey that screams loudly when u press it!", "Permalink": "https://www.reddit.com/r/PhD/comments/7bh2zi/graduate_student_researchers_what_decorations_do/dqkmgt4/"}, "333": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1512073352, "Score": 4, "Body": "Obviously the two are important. But I have seen people giving up on academia just because of their - assholes - supervisors. It will be 3-4 years of work - so make sure that you want to work with the same person that long. Is there anyway that you can get to know the second guy first? Like, can’t you send any email to people that used to work with him?", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkox4q/"}, "334": {"Subreddit": "PhD", "Author": "suverenia", "Date": 1512073810, "Score": 1, "Body": "Unfortunately, he's new in the game, and I don't know anyone that knows him. But I know that his research field is full of arrogant asshole. I'm not saying that he is! But you should see why I'm nervous of choosing wrong.\n\nIf I'm lucky, he will call me in for a meeting if he sees me as a potential candidate, at which point I can judge the situation rationally. Until then I'm left with confusion.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkpe53/"}, "335": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1512074315, "Score": 3, "Body": "Yeah, it isn’t an easy decision. But if the other guy isn’t new into the game, even if his interests don’t completely overlap yours, he may know how to supervise properly. Remember that the point of the PhD is that you grow up as a fully autonomous researcher (at least in my field). For instance, my supervisor only overlaps exactly 50% with me but he is such a good scientist that it doesn’t really make a difference. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkpwft/"}, "336": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512074446, "Score": 2, "Body": "After my horrendous (and ongoing) experience with an incompetent and abusive advisor, I would take the one you know will support you. But even this \"supportive\" advisor could be bad - will he let you define your own research directions and support you even if you disagree some times? Or will he force you to work on his own interests? That is not really support. Each PhD project is so specialized, 50% overlap means you can find a project that is within both of your interests quite easily, as long as your advisor is cool when you inevitably branch a little outside of his domain.\n\nNot sure your field, but in experimental science having a new professor means you'll be the one ordering, setting up equipment, and doing process development. Whereas when you join an established group that is functioning properly you basically save yourself a year of effort by being taught the techniques by senior students.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkq1a5/"}, "337": {"Subreddit": "PhD", "Author": "suverenia", "Date": 1512075067, "Score": 1, "Body": "Thanks for your good point! What do you study, my friend?\n\nWhen I think about it, I'd be fine with some semi-boring research as long as the supervisor is good. On the other hand, if the research are is good but the supervisor is bad, I'd obviously be suffering quite alot.\n\nWhat I'm afraid of is that I will be confined, or \"lock myself\", in a certain area of research because of specialization that I'd bother spending the rest of my life on. I could see myself in it for some years, but definitely not forever. This is my main concern with the good supervisor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkqo0v/"}, "338": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512075479, "Score": 5, "Body": "This really helped me mentally to say, definitely, that my advisor's behavior is abusive and controlling and inappropriate. Instead of second guessing myself all the time and feeling like a failure, I can instead say, no, I am depressed and in this bad situation due to abuse and not because I am a worthless researcher. Its helping me move forward and hopefully still finish.\n\nSometimes I look back and, just based on listing the actions, its like my advisor was sabotaging me on purpose, to try and make me fail. This includes forcing me to change projects every four months and never publish, telling me my results are not publishable (and then I go on to publish them in respectable journals), withholding financial support and using it to control me, isolating me from my committee and from any other professor, telling me I'm not allowed to discuss my research with anyone unless I carefully consult with him first, and the list goes on. He's also told some female colleagues that they need to choose between their boyfriends and a phd, though he never says that to the guys, and told our new postdoc she is in charge of keeping the lab clean because she's a woman. He's always saying my research ideas are bad, low impact, and not worth pursuing, and then like a year and a half later a paper comes out in ACS Nano with the exact project I wanted to do - so guess what my ideas are not bad. He made me throw my first three years of research into the trash and totally change fields, because I was starting to associate more with another professor and he was losing control of me. He always gives life advice that is best for him and totally against the interest of his students - like telling a student to forego the TA stipend and tuition and instead work full time at a community college, so that the professor doesn't look as bad to the department that all of his students and post docs are department supported since he hasn't won a grant in five years, despite writing them constantly.\n\nIn summary, fuck this guy and I should have changed advisors first or second year but I'm going to finish anyway soon, and a big part of me being able to finish is recognizing that his behavior IS abusive and unacceptable so that I can calmly set boundaries, protect myself emotionally, and make choices that I know are best for my degree and self.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gpgek/great_summary_of_abusive_advisor_behaviors_to/dqkr3c0/"}, "339": {"Subreddit": "PhD", "Author": "suverenia", "Date": 1512075510, "Score": 1, "Body": "That's a really good point there!\n\nNow that you mention experimental science, I guess I could tell you this: I'm a medicinal chemist specialized in organic synthesis and homogeneous transition metal catalysis. My interest is organic chemistry and biology/biochemistry.\n\nThe good professor is specialized in inorganic (not organic) synthesis and characterization of hetereogeneous catalysts, and nanotechnology. On occasions, if the developed catalyst shows some promise, he will apply it to organic reactions... which is my expertise.\n\nThe unknown professor with the huge overlap is specialized in chemical biology. He spends his research on organic synthesis of small molecules which can be applied on biological systems in the development of regulators of proteins and such.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkr4hx/"}, "340": {"Subreddit": "PhD", "Author": "BlueEmpathy", "Date": 1512075552, "Score": 2, "Body": "Honestly it's a lot better to know that you have a nice person as a supervisor. Many people abandoned their PhD and had their mental health ruined because of a shitty and toxic work environment.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkr62s/"}, "341": {"Subreddit": "PhD", "Author": "suverenia", "Date": 1512075807, "Score": 2, "Body": "This is exactly what I'm afraid of :(\n\nMy master thesis was just like this in the end. It was psychological terror, and I ended up without publications and with a low self-esteem. I actually ended up giving up on dreams and denying my flaming interest in chemistry for six months before I realized that he was an asshole.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkrfe7/"}, "342": {"Subreddit": "PhD", "Author": "the_train_sleeper", "Date": 1512076868, "Score": 1, "Body": "I'm in evolutionary biology, so in our area the PhD is mostly an open door for academia.\n\nYeah, doing something that you don't like can be quite bad too. Is this a project that you are applying for? Because in my PhD, I'm pretty much free to do research in whatever I want (I'm theoretician, which makes things a bit easier). My funding just requires that I finish the PhD, but that's it. If that's your case too, you could use the nice guy facilities to do your own thing (unless the equipment/facilities/resources aren't the same).\n\nI guess you should try to see how the other guy is. The good side of him being new is that he is less likely to be an arrogant asshole, since he might not have enough experience to feed his ego. But yeah, you should get to know him, somehow (although I know that isn't an easy thing to do). It looks like the second option would be the best for your interests, of course, so you should try to explore, as much as possible, that option. If the guy seems to be a dick, then at least you have a back up. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkshq9/"}, "343": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1512080294, "Score": 1, "Body": "I'd go with the nice, established guy. At least you have a feel for what it would be like. Also, if the other guy is new to running a lab, he might not be the best supervisor. Also, I imagine setting up a lab comes with a lot of additional work so might reduce the amount of time he has to supervise you. Even if the PhD topic is slightly off centre for what you want to do, you can always try and steer the research in the direction you want and, if not, you can always choose a postdoc in a more suitable area. Its better to finish a slightly off topic PhD happy than not finish one at all because your supervisor is useless. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqkvw41/"}, "344": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1512082415, "Score": 2, "Body": "It really sucks to hear your story and how abusive your advisor is. I really do hope you will be able to finish and I definitely believe you have the ability to do so.\n\nI've been with several abusive supervisors throughout my PhD. The problem for me is that I'm not on my own project, and I don't have anything to say about the research when it comes down to it. My current supervisor has pushed me to do things that I know aren't in line with ethical practices. Since it's not my project, I'm not allowed to publish without him. On top of that, we've discovered a mistake that he made, which means all my studies have to re-analysed and re-written (a few months before finishing). I'm still figuring out how to find a way to finish something that I can at least put my name on without being ashamed.\n\nIt infuriates me to know how little rights we have and how much power a supervisor has. No matter how good you are, or how hard you work, they can complete block your career. Because of several incompetent supervisors, I haven't got any publications after 4 years in academia.\n\nWhen I was looking for a PhD position, I remember some random old guy on the bus started talking to me. I told him I was applying for a PhD position and it turned out he was a retired professor. He told me about his PhD supervisor and that he didn't agree with his ideas. During his defense, he completely went against his supervisor's ideas. At that point, I felt very inspired by that man's passion. After being in academia for some time, it mostly strikes me that at the end of his career, he still remembered the tense relationship with his supervisor. Nevertheless, I hope you get to be like this guy! Prove your supervisor wrong! Spread your ideas, have an amazing career and inspire young aspiring PhD students!", "Permalink": "https://www.reddit.com/r/PhD/comments/7gpgek/great_summary_of_abusive_advisor_behaviors_to/dqkxvw7/"}, "345": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1512082956, "Score": 2, "Body": "I totally agree with this. I often feel like students think we're just sitting around, waiting for them to give us work. We have our own work to get done, which is often already more than enough to handle. Students need to be prepared for the job market. They need to learn that no supervisor can drop everything whenever they want to. Imagine that they would behave like this to their boss.\n\nHope you had a great birthday btw!", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqkydu6/"}}