{"0": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483251094, "Score": 1, "Body": "Maybe look into astrobiology? ", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "1": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483263711, "Score": 2, "Body": "I looked around the wikipedia article for astrobiology and it definitely seems very similar to what I'm looking for. [Xenobiology](https://en.m.wikipedia.org/wiki/Xenobiology) in particular looks promising. Also found that NASA has an active astrobiology program. Thanks for the pointer, dude!", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "2": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483264215, "Score": 1, "Body": "No problem! I work in something *somewhat* related to this, so just an FYI - There's not a ton of funding for this type of research, so the career options are limited. It strikes me as a field where only the very high achieving scientists really thrive and get to carry out the research they want. If you have a very high work ethic and don't mind anticipating a busy future, then shoot for the stars, but if this is something that you're unsure of, I would give it a lot of thought. You aren't going to work for NASA making six figures as an doctoral astrobiologist by working 40 hours a week.\n\nprevious related thread: https://www.reddit.com/r/Astrobiology/comments/3iyava/positions_in_astrobiology/", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "3": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1483265086, "Score": 1, "Body": "For a fun little example of the topic you could read up on the controversy around (and subsequent disproving of) an [arsenic-based lifeform](http://www.nature.com/news/arsenic-life-bacterium-prefers-phosphorus-after-all-1.11520) a few years ago.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "4": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483267288, "Score": 1, "Body": "That was just poorly done research that slipped through the cracks of peer-review.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "5": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483275208, "Score": 1, "Body": "I'll check it out. Thanks for the pointer. It looks like a really interesting topic from what I've read so far.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "6": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483275395, "Score": 1, "Body": "Is NASA the only funder of this kind of research? Or are there universities out there that are at the cutting edge of the field? \n\nOn a sidenote, what do you work in?", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "7": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1483288494, "Score": 1, "Body": "I'm considering the same thing, but in a different area.  As others have said, there are a lot of factors to consider.  I work for a US R1 school and know many people who either have a PhD, or are pursuing it and in different degrees.  \n\nSome things I've picked up on: make sure you love your topic.  As I've been told, even if you love your topic going into it, you may hate it by the time you are done as working on the same data can get old.  So, make sure you go into loving it.  \n\nKnow your goals (which is sounds like you do).  In the US, it can sometimes be hard to get into academia on a tenure track position, but not so hard to get a teaching position or maybe not as hard to get a non-academic job that uses your credentials.  \n\nin the end, though, if you love your topic and feel this may be a right path for you, give it a try.  You will regret it otherwise.  At least that's what I'm telling myself--I found a topic I love and am currently doing research, but am not sure I can keep up with the demands of a PhD with a family.  So, I decided to take one class as a test.  I know this is a luxury not all have, but I do since I work for the University.  But, I'm going to try it and see how it goes.  At least I won't be left wondering. \n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_5l4nt6.json"}, "8": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1483288619, "Score": 2, "Body": "I think self-doubt is always normal.  But, remember, they would not have given you a full scholarship if they didn't think you could do it.  Have faith in yourself, think of past accomplishments to give yourself courage, and take things one step at a time.  I'm sure you can do this!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "9": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483300951, "Score": 1, "Body": "I work in environmental microbiology and environmental engineering - the vast majority of microbial life on our own planet hasn't yet been described, so a lot of my job is to make sense of what is deemed 'microbial dark matter'. For instance, a recent effort in my field just vastly expanded the tree of life (see below). I've also worked alongside people funded by NASA for related things.\n\nhttp://www.nature.com/nature/journal/v523/n7559/full/nature14486.html\n\nThere are also professors in xenobiology/astrobiology, but the departments and positions are very limited. Generally speaking, it is tough to become a professor in anything (a quick google search should reinforce this; only a small percentage of Ph.D. graduates make it in academia, even fewer make it to research level 1 or 2 institutions where a higher availability of funds allow you to adequately pursue your interests). It will be much more difficult in a niche field where there aren't really any private sector jobs, except maybe a few (SpaceX in the future?), because the overall supply of jobs is low.\n\nYou could do it, but I just wanted to point out that you won't have a 40 hour work week, and that a high level of interest and dedication will be needed to steer you through considerable challenges. I put in 10 hours of work yesterday... on a Saturday.... on New Years Eve. But I love what I do and I wouldn't trade it for anything.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "10": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483301562, "Score": 1, "Body": "Microbiology in general seems really cool, although I'd rather something more chemistry focused. The wikipedia article proposes some applications for xenobiology so hopefully industry starts investing in some of those in the future.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "11": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483302079, "Score": 1, "Body": "Environmental microbiology (which I'm distinguishing from applied microbiology) and biogeochemistry are intrinsically linked. I study it myself for biogeochemistry relevant questions, e.g., how do microbial processes shape our atmosphere? There are a lot of open questions that require new theories to push the field forward.\n\nOne way to get a leg up would be to apply for a NASA fellowship to fund your Ph.D. while applying for graduate programs. They cover tuition, provide you $30,000/year salary, and the recognition will follow you throughout your career and make NASA and university positions easier to obtain. The NSF GRFP is another good one - I believe it pays $34,000/year, and is also very highly recognized. Don't go into a program without funding, either from one of these opportunities or from a a TA/RA arrangement.\n\nAlso, if biogeochemistry sounds interesting to you, there are probably more academic opportunities in this field.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "12": {"Subreddit": "PhD", "Author": "Ximoquim", "Date": 1483303719, "Score": 1, "Body": "Thanks for the tips! I'll have to look into environmental microbiology. Definetely peaked my interest.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "13": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483306268, "Score": 1, "Body": "No problem at all. Also look into 'geomicrobiology' for information that will probably be more specific to your interests.", "Permalink": "https://www.reddit.com/by_id/t3_5laca0.json"}, "14": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1483325949, "Score": 1, "Body": "Thanks!! ", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "15": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1483375581, "Score": 1, "Body": "I'm gonna go! Thanks for all the input. ", "Permalink": "https://www.reddit.com/by_id/t3_5jqjgh.json"}, "16": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1483458817, "Score": 7, "Body": "I'm okay. Today is my day off, so I'm only annotating two articles. It's nice to take a break", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "17": {"Subreddit": "PhD", "Author": "llllamapajamas", "Date": 1483463390, "Score": 4, "Body": "Anxious about the new semester. How are you doing?", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "18": {"Subreddit": "PhD", "Author": "StringerBell9", "Date": 1483472712, "Score": 3, "Body": "I'm good. Started the semester today. Started the next set of experiments and a new side project. Can't complain. ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "19": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483476208, "Score": 2, "Body": "I'm energised and ready to get to work, but nervous too. I put a lot of work into a new method of organising my notes, so I'm hoping for less mayhem in 2017. I also read the Scientists Guide to Writing (Stephen Heard) over Christmas and found it enormously useful. I'm feeling good. ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "20": {"Subreddit": "PhD", "Author": "troymcfont", "Date": 1483525893, "Score": 1, "Body": "Spending some holidays with my friends. But still, somehow, troubled by coding errors and failed simulations I left hanging before taking my break -.-", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "21": {"Subreddit": "PhD", "Author": "elfradlschneck", "Date": 1483530864, "Score": 1, "Body": "Thanks for asking. I'm sick, felt like shit the past days but it's getting better now. \n\nNeed to revise a paper which came back from review with a minor revision decision. This will be my second first author journal paper and I need three in total so I'm quite happy.", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "22": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483531537, "Score": 1, "Body": "You're smashing it! Good for you! ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "23": {"Subreddit": "PhD", "Author": "cloudleopard92", "Date": 1483541555, "Score": 1, "Body": "Really poorly (cross-post from r/GradSchool).  Long story short, I switched labs because the first one was a terrible fit, found out 6 months later my new PI decided to move to a university 1600 miles away, we worked out an agreement where she's supposed to cover my stipend for a year while I switch into a collaborator's lab at the current university but keep working on mostly the same projects.  Found out yesterday (3 months after this agreement was reached), she decided she didn't like the long distance mentorship thing and isn't going to keep funding me and has given me 2 months to figure out something else.  Since it's January, every lab looking to take a student will have just taken a first year and won't be looking to take on a third year problem child, leaving me with very few viable options. I hope everyone else's year is off to a better start.", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "24": {"Subreddit": "PhD", "Author": "Iluspfloufz", "Date": 1483557705, "Score": 1, "Body": "........no", "Permalink": "https://www.reddit.com/by_id/t3_5lyih8.json"}, "25": {"Subreddit": "PhD", "Author": "rondar11", "Date": 1483574008, "Score": 1, "Body": "Great reply! Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_5juebn.json"}, "26": {"Subreddit": "PhD", "Author": "sharkbaitohhaahaa", "Date": 1483602168, "Score": 2, "Body": "Move to Canada and work with Harold Gibson / Matt Leybourne.  We just got a HUGE metal earth grant and they're very well known in those fields :P...", "Permalink": "https://www.reddit.com/by_id/t3_5l19xb.json"}, "27": {"Subreddit": "PhD", "Author": "Cibex", "Date": 1483603772, "Score": 2, "Body": "Suspending my studies for 3 months after an intense few months of 65+ hour weeks and a really bad bout of stress and anxiety. Supervisor has been really understanding  (although they were quite the slave driver). ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "28": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483608879, "Score": 1, "Body": "Unfortunately I don't have experience defending a dissertation, but I want to encourage you to back yourself. Focus on the outcome you need, which is to get your degree in time to start your PhD. You don't need to set the world on fire with this thing, you just need to do well enough to get through. If the examiners know that you need to get through then will probably work out for you. \n \nTry to focus on the fact that you have made some kind of novel contribution to the understanding of your topic, and have gone about it in a sensible way (or at the very least you are aware of the limitations) as that is what they are looking for. All the best!", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "29": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483609003, "Score": 2, "Body": "Wow, that is rough. Hoping things work out for you.", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "30": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483609064, "Score": 1, "Body": "Sounds like you need a break. Glad to hear your supervisor is supportive. ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "31": {"Subreddit": "PhD", "Author": "Knirkefri", "Date": 1483616449, "Score": 3, "Body": "Having been on several MA committees with oral defense, I'll recommend this: Don't linger on the problems you describe here. The committee will want to know if you're a decent scientist, and a decent scientist has made active choices and tried to mitigate problems. He says things like \"I had to choose between A and B, and chose A, despite B possibly containing a solution to problems C and D, and in retrospect I see that I could have chosen differently, but I stand by my decision to do A, which seemed the best option at the time\". Don't make excuses during your defense, and definitely do not bring up time constraints. Acknowledge your mistakes that were within your control, but don't blame the circumstances. Remember that it is a defense: You're supposed to defend the product you have created, not throw it to the wolves by saying that circumstances turned it into something you didn't want it to be. That doesn't make the product any better, it just leaves it defenseless.", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "32": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1483617451, "Score": 1, "Body": "Try to remember your examiner probably doesn't want to fail you either! Think of it as a conversation, this will be probably your only chance to talk about your work with someone who has read it in such depth. So try to enjoy it! A good tip I got for my phd defence (that I admittedly didn't end up using as I was too adrenaline-filled at the time) was to bring a pencil and paper in. When you get asked a question, make notes on it as they talk, and then read it to yourself before answering. If you can't think of an answer right away, you can ask for a second to look at your notes and think about your answer. Might or might not work for you! But good luck anyway, I'm sure you don't need it! Admitting the shortcomings as well as the positives of your work is the sign of a good academic, nothing is ever perfect :)", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "33": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483634308, "Score": 1, "Body": "I did this for 3 months while waiting for a stipend to kick in so I can't say what I did was going to be sustainable. I would work 8-4:30pm and then I would go to campus 5-10pm, Monday-friday. In those evenings I did lab work. I would do all writing stuff on the weekends because I found it too hard after work.\n\nHonestly though, it was pretty draining. Plus noone in my life outside of work and uni understood why I was so busy and couldn't hangout or help them out. If you're planning on doing your whole degree this way, speak to some on campus services now. They can help you navigate a lot of the issues you will encounter.", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "34": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1483635878, "Score": 1, "Body": "I'm 3 months in doing this. I've tried timetabling regular study time but it just never works out. Currently just interchanging between work and study as best as I can. Fortunately my job is flexible and in the same area as my PhD so it's not too difficult. Finding time to read though is a struggle. Stress levels are quite high working at 150% so I'm trying to offset that with exercise. Tried pomodoro and that kind of helps. My PhD work seems to be driven by regular supervisor meetings, so I'll commit more time to my PhD in the few days before a meeting so I have some progress to talk about. One of the main pressures is that there are research method classes and other compulsory workshops / symposiums that eat up my time - basically putting me on a full time PhD schedule for the first year - so things should ease off after the first 9 months and I can just focus on my project around my job.", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "35": {"Subreddit": "PhD", "Author": "Poly_blue_6", "Date": 1483637155, "Score": 3, "Body": "First accept that you are not going to make the same progress as students who don't work. Second plan, plan, plan. Making yearly, semester, and weekly plans are crucial. \n\n\nMy typical schedule is set up in blocks, work, research, writing, household chores, sleep, eating, gym, and rest/relaxation .\n\n\nThings that make life easier:\n\n\nBuy separates for work and every Sunday put each days clothes on a hanger.  Plan every meal for the week, breakfasts and lunches should be prepackaged on Sunday.  Pack your satchel/ bag the night before.  Use your commute for reading time (buses, train rides).  Get yourself on a good sleep schedule, going to bed late and or not getting enough sleep can ruin your whole day and then you get behind.  Finally write or do research everyday. A tiny bit of progress is better than no progress at all. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "36": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1483643545, "Score": 1, "Body": "I have been doing this for a year and a half.  I alternate between taking 1 and 2 courses/semester.  I am not in a hard sciences program so lab work is not required.  My work is in academics so I have some flexibility during my day to get school work done.  I don't work well at night, so I tend to get some done in the mornings, and on the weekends.  The first semester was incredibly stressful, but since I have had no trouble.  My biggest piece of advice is do not procrastinate.  Get a little done each day and don't let things pile up and get overwhelmed.  ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "37": {"Subreddit": "PhD", "Author": "cloudleopard92", "Date": 1483644807, "Score": 1, "Body": "Thanks. Me too.", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "38": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1483648384, "Score": 3, "Body": "It's been a year and a half now and I'm doing okay up to now. My PhD research is linked to my work so it makes it easier. I will confess though that I use about a day a week on the job to do PhD related stuff but at the same time it informs my practice at the same time. I don't take real lunch breaks also, so I'm gaining 5 hours a week for the job. \n\nWeekends are tougher though. I need to put at least 5 hours of work on average every weekend.  \nMy boss is great. He let's me go to my seminars (usually 2 days a week every 3 weeks) and count it as professional development, no need to take vacations. My PhD is course intensive with 27 course credits to be done before the thesis. \n\nI am a curriculum design specialist in a Canadian university. I'm doing my PhD in education. Topic: quality assurance and enhancement of a continuous improvement culture amongst Faculty. ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "39": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1483650120, "Score": 1, "Body": "Thank you. I have pretty intense anxiety that causes me to procrastinate but I'm  going to see a counsellor to help with that. I'm  glad other people are making it work - it makes me feel like it can be done. ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "40": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1483650208, "Score": 2, "Body": "These are all great ideas my work is also research heavy so taking the thinking out of that sort of stuff would make it all a lot easier. Is there anything you do to help make the switch from work to study?", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "41": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1483650539, "Score": 1, "Body": "Have you looked at SurveyMonkey?  ", "Permalink": "https://www.reddit.com/by_id/t3_5ltrr0.json"}, "42": {"Subreddit": "PhD", "Author": "Poly_blue_6", "Date": 1483650862, "Score": 4, "Body": "To ease the transition I generally schedule a meal or work out between them. Doing something that doesn't require a lot of brain power kind of refreshes my brain a bit.", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "43": {"Subreddit": "WitchPhD", "Author": "Modernishlife", "Date": 1483652064, "Score": 1, "Body": "you are \"he says in best deep magic mirror voice\"", "Permalink": "https://www.reddit.com/by_id/t3_5m97qi.json"}, "44": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1483652706, "Score": 1, "Body": "Present your work confidently and stand by it, that's all that matters. Negativity only makes you look weak and puts doubt in people's minds. Prepare well for your defense, the only person who will understand your thesis and the idea behind is it is your advisor, no one else will be able to understand all the nuances so make sure your advisor is happy with what you have written as his opinion will matter the most.", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "45": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483657379, "Score": 2, "Body": "Not really sure, but I'm imagining it should be structured similarly to a non-teaching tt position. ~half the time being devoted to 'what I have accomplished thus far' and the other half being dedicated to 'my vision of teaching for the future'. 1-1.5 minutes per slide. Sorry can't offer more help.\n\nCongrats on the interview straight out of Ph.D.. Good luck with it.", "Permalink": "https://www.reddit.com/by_id/t3_5m9i8b.json"}, "46": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1483662235, "Score": 2, "Body": "I also have pretty intense anxiety, so if I can do it you can too", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "47": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1483665104, "Score": 3, "Body": "Congrats on starting your PhD! I'd start reading blogs for ideas on what might be tricky for you. From what you've written, it sounds like you'll cope well with the actual research, but the challenge might lie in other areas. Try the Thesis Whisperers blog (Inger Mewburn from ACU). At a guess, without actually knowing you and your situation, the hardest part might be the isolation and self-time management and motivation. You don't have a set group of 'classmates' or peers anymore, and if you've had that in your study so far, it might be a challenge to be without it. Best of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_5ma66j.json"}, "48": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1483669271, "Score": 1, "Body": "Your boss sounds awesome. I do get 3 hours of study leave a week so I should make sure to use it every week. It is adjacent to what I'm  researching (i work in the museum part of an Archive) so I might be able to use  some of the events as professional development. Thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "49": {"Subreddit": "WitchPhD", "Author": "Whohasathrowaway", "Date": 1483669389, "Score": 2, "Body": "So beautiful! ", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "50": {"Subreddit": "WitchPhD", "Author": "exmo801", "Date": 1483681431, "Score": 1, "Body": "Gorgeous!", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "51": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1483689226, "Score": 1, "Body": "OP, just adding to this comment, consider increasing your scope of 'the overall idea' to include three studies thereabouts. This is the norm within social science PhD projects, to have publications roughly segmented within a broader thesis question. The big question then informs the smaller questions. It makes a project much much easier to explain when you do it that way! ", "Permalink": "https://www.reddit.com/by_id/t3_5ma66j.json"}, "52": {"Subreddit": "PhD", "Author": "drarch", "Date": 1483696229, "Score": 2, "Body": "10pm - 5am sleep. Wake up. Coffee. Study from 5am-9am. Check my email for the first time at 9am, and begin working. That block of quiet time helps, when no one has a question or project or meeting for you, and it's just time for you to focus on what you need to get done. ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "53": {"Subreddit": "PhD", "Author": "my_final_answer", "Date": 1483702547, "Score": 1, "Body": "Keep your articles well organized and easily accessible. Comes in very handy when you work on your eventual dissertation. ", "Permalink": "https://www.reddit.com/by_id/t3_5ma66j.json"}, "54": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1483707484, "Score": 1, "Body": "Use Zotero or Mandeley", "Permalink": "https://www.reddit.com/by_id/t3_5ma66j.json"}, "55": {"Subreddit": "WitchPhD", "Author": "thedude0121", "Date": 1483711035, "Score": 1, "Body": "Tease me please me ", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "56": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483729349, "Score": 1, "Body": "Yep. You cannot be well prepared enough for the huge amount of reading that is ahead of you. I have now arrived at what I consider to be my ultimate publication management system. This is what I do: \n  \nBefore I print the paper, load it into Zotero \n \nWhile reading the paper, scribble things onto a hardcopy Cornell note template, because my brain doesn't work without a pen in my hand\n \nAfter reading the paper, complete Cornell notes. Instead of a summary at the bottom I put a section called \"Thesis ready text\" where I write exactly what I am going to write in my literature review/thesis about the paper I just read. \"Authors X and Y (2016) sought to better understand... [brief explanation of study and its conclusion in my own words]\"  \n  \nThere is also a bonus section on my template called \"questions arising from my reading of this paper\" - your critical response to the literature is the real gold, and after reading so many papers it becomes difficult to keep track of who said what, and what I thought. I'm interested in how others manage this... \n  \nThen I PDF my Cornell notes, link them to the paper in Zotero and move on with my life.\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5ma66j.json"}, "57": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1483744602, "Score": 1, "Body": "Mine's just a piece of paper, which came rolled up into a cardboard tube.", "Permalink": "https://www.reddit.com/by_id/t3_5mglay.json"}, "58": {"Subreddit": "WitchPhD", "Author": "Carefultheretotoro", "Date": 1483750362, "Score": 1, "Body": "Absolutely lovely.", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "59": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483750729, "Score": 1, "Body": "It's given to us framed at our graduation at my uni. Not sure what happens if it's mailed though.", "Permalink": "https://www.reddit.com/by_id/t3_5mglay.json"}, "60": {"Subreddit": "WitchPhD", "Author": "sullima2014", "Date": 1483751146, "Score": 2, "Body": "to be fair, I doubt her complexion costs much...", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "61": {"Subreddit": "WitchPhD", "Author": "skip_hunter", "Date": 1483752895, "Score": 1, "Body": "Spanksafe! ", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "62": {"Subreddit": "WitchPhD", "Author": "Etheostoma", "Date": 1483754897, "Score": 2, "Body": "*fair. good call.", "Permalink": "https://www.reddit.com/by_id/t3_5gqbkc.json"}, "63": {"Subreddit": "WitchPhD", "Author": "steveninja", "Date": 1483806917, "Score": 2, "Body": "The combination of the design and your ink is mesmerising, and as always your milky curves delight and entice. Thank you for sharing.", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "64": {"Subreddit": "PhD", "Author": "R3D0053R", "Date": 1483810973, "Score": 1, "Body": "So-so, suffering a little from imposter syndrome, everything seems like it's nothing at all, even though we just got a state of the art report  accepted at an important conference. Only third of twelve authors though, strengthens imposter syndrome ;)", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "65": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1483811384, "Score": 4, "Body": "PhD student here in last semester.  Tbh, I have no idea what you're asking.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "66": {"Subreddit": "PhD", "Author": "mythaone", "Date": 1483812024, "Score": 1, "Body": "I'm interested in what exactly some student needs to do in specific period of time to satisfy their PhD progress. For example: student has to publish at least 2 papers in journals in first 2 years. ", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "67": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1483812355, "Score": 2, "Body": "Third is better than 10th, especially for a PhD student. When I'm doubting myself I like to think what would happen if a random person was grabbed from the street and asked to carry on my research. I bet a random person couldn't do what you do - take pride in that!! ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "68": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1483813528, "Score": 2, "Body": "This is highly different depending on your graduate school and your field.   \n\nIn my field (structural biology), it's near-impossible to publish before your last year simply due to the time the research takes, and most research projects are high risk high reward. \n  \nMost people publish in their last year or even after they graduated, though my PI makes sure everyone gets at least one publication. I know of other groups when students graduate without publications, even though it is an exception and unlikely to help you with an academic career, but that's another topic. \n  \nSlightly off-topic, but it made me laugh that people think it's so easy to publish that you can need *at least* 2 papers published in your first 2 years to graduate ;)", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "69": {"Subreddit": "PhD", "Author": "mythaone", "Date": 1483814542, "Score": 1, "Body": "Tnx for replying. The part on publications was just a bad example xD even though in some fields it is not so hard to publish. I come from computer science field and I have already one paper in springer and I am still a master degree student.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "70": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1483815444, "Score": 1, "Body": "Of course, it's very different depending on your field. Can you focus on a specific field (yours?) in your assignment? Because requirements would also be different for a law PhD or a social science PhD I imagine. In my case, I also had to spend 20% of my time teaching, follow a certain amount of courses and present my research at conferences. ", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "71": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1483818052, "Score": 1, "Body": "Cry. Lots.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "72": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1483818559, "Score": 1, "Body": "Break your fist against a wall. Then your director will accept anything.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "73": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1483819652, "Score": 1, "Body": "First 2 years: Take all doctoral courses needed to achieve PhD candidacy.  \nThen take comprehensive exam that proves you know the material needed to get your PhD. This is a pass/fail exam, if you fail you are kicked out (after given a chance to rewrite it)\n  \nThen the next x years (usually 3), are spent doing original research. Then you propose and defend your dissertation. If you defend your dissertation successfully, you have officially earned your PhD.  \nThis is roughly the process, with some idiosyncrasies depending on specific field.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "74": {"Subreddit": "PhD", "Author": "Private_Mandella", "Date": 1483819986, "Score": 1, "Body": "Every graduate school is different and every advisor is different like /u/coindepth mentioned. In my department, in addition to ~40 hours of class work and finding an actual advisor, the official list of requirements:\n\n1. Oral qualifying exam\n2. Oral and written preliminary exam\n3. Oral and written thesis defense\n\nThere might be some unofficial rules depending on the advisor, like 3-5 published papers. I've found that the younger professors are much more likely to require 3-5 papers than older professors. Younger professors (especially ones still trying to get tenure) need papers published, and your thesis is essentially your papers bound together. Older advisors seem to prefer a thesis with papers published after graduation based on the completed thesis.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "75": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483823250, "Score": 6, "Body": "Every job worth having is going to have the potential for wasting funds by making a mistake. It sounds predominantly like a psychological issue that you need to reign in. Have you sought professional help (therapist, psychiatrist, etc.)? There are usually many resources for this available to grad students.\n\nMaybe focus your second semester on trying to address this before making a final decision? One other thing though - the Ph.D. usually gets much more stressful over time (or at least peaks a few years in), so if you give it a good shot and can't reel in the anxiety, it may be best to quit early.", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "76": {"Subreddit": "PhD", "Author": "Ais1993", "Date": 1483824703, "Score": 1, "Body": "Thank you for your advice. Yes I have gone to my universities counsellor regarding these issues. I am aware that further down the line things will get a lot tougher but am wondering if I can get over my issue of low self confidence and anxiety and actually feel like I deserve to be there, would things get better for me and would I be able for it. But I also don't want to waste peoples time and money if I realise further in that this is not for me which is why I am thinking  I need to leave sooner rather than later. I am looking for jobs at the moment in case I decide to leave. I am wondering should I let my supervisors know that I am thinking of leaving subtly. Thanks", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "77": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483825264, "Score": 2, "Body": "If you are close to making a decision or have already made one, I would keep in mind that you may be at a critical time of the year. They have probably set aside funds for you for Spring 2017. Maybe either tell them right now so they can cancel your assistantship for the semester, or take the rest of the Spring semester to make a final decision. There's no right or wrong between those two decisions, it really comes down to what you want to do, and how close to a decision you are. But yeah, you'll obviously need to inform your advisor eventually.\n\nAs far as 'not feeling like you deserve to be there', look into 'imposter syndrome' - it's something that most grad students feel at some point in their career, and many times the feeling is unwarranted. Grad students are allowed to flail around and make mistakes for the first couple of years - it's part of the process.", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "78": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1483827322, "Score": 3, "Body": "It is personal, but consider the following:\n\n1) funding - how much funding does each university offer overall, and how much do they offer for conferences etc?\n\n2) prestige - is the university known as a top tier in this research field? Does the department have a lot of publications under its name? Are professors attached to large charity/NGO/science grants? \n\n3) will you have people to help you - if you haven't chosen a supervisor ahead of time, do you have a few options of people who can lead you through the comps and dissertation process?\n\n4) what have the majority of each university's graduates in tour department gone off to do? Are they teaching, researchers, working in government or elsewhere? What purpose are you doing your PhD for and where might you ultimate where to go?\n\nAs for personal/social, my husband and family is really understanding about my PhD work so I try to attend 2 conferences/year (one local, one international), and work on a publication/year too as a grad sudent. So far, I've been incredibly lucky to manage this plus being on two extracurricular committees, volunteering, and tutoring on the side on top of being a TA.\n\nYou should consider what you want to do on top of school and your research and how long your program is. You can't manage the same workload I carry if the program you choose wants you to finish in 4 years whereas mine is okay with 5+. The length of the program and its intensity should also be considered when thinking about your social life. Don't neglect it! :)\n\nI hope this helps some as my thoughts on the matter. ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "79": {"Subreddit": "PhD", "Author": "Tinky91", "Date": 1483838177, "Score": 2, "Body": "I think most people feel a bit (or very) lost and that their experiments won't work at the start of things, but as you continue, and get more successful sequencing runs back, you will gain more confidence in yourself. Try not to worry about progress at 5 months, you're still learning stuff, it'll take a while for everything to start to come together. \n\nBut if you're really not interested in it anymore, you can always leave. Sooner is usually better than later, especially when it comes to jobs etc, don't know if your uni offers the option of turning it into a masters or something like that. Having dragged myself through a PhD that wasn't what I expected, it's really tough. Have you got a postgraduate adviser that you could talk to? Getting advice from outside your supervisory team is sometimes helpful, too.\n\nIf you seriously want to continue you're going to have to find a coping strategy, or get help for your OCD. It's not worth making yourself ill over this. (I apologise if I've just repeated things you already know.)", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "80": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1483840494, "Score": 2, "Body": "To be honest if you are having major doubts 5 months in, it's totally fine to leave it. A friend of mine got about 9 months in and quit, just wasn't for him, I think it's reasonably common for people to find this a short way in. It's when you get even deeper that it becomes a problem. For me I've had certain problems which lead me to almost quit, and I'm almost at write up stage, aka too far to give up now. Whereas 5 months is no sweat, just have a good long think, talk to your supervisors etc and yeah, I don't think you'd lose much sleep over 5 months of work. Also I think it's unlikely you'd regret it actually, because I think you would have to almost uniquely hate it enough to want to back out, if that makes sense. Best of luck to you!", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "81": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1483841109, "Score": 2, "Body": "Make sure to think about where you want to live, average cost of living could be good to check in about, just in case.", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "82": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1483843413, "Score": 1, "Body": "Better get out now. What do you believe to be your prospects? Find an occupation that's actually in demand.", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "83": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483844173, "Score": 1, "Body": "In my own case, I applied to 4 schools and got into 3. All 3 offered to have me visit in February (or something like this) for an informational session - it was a few weeks before they wanted students to make a final decision. If they offer something like this, take advantage of it and stay for a few days if possible. Even if they don't offer it, maybe it's worthwhile to check them out on your own anyways? The Ph.D. is a big life decision, so I'd say it's worth it, even if it is just for your top 2 picks. Try to get a feel for the location and the school. In my own case, I had the opportunity to talk with other grad students and ask them questions. Some of these visits were in stark contrast to one another, and definitely helped me make a more confident decision.\n\nAlso, like someone else mentioned. How are you going to get funded? Have you reached out to potential academic advisors yet? If you've narrowed down potential advisors, does one have research projects that you're more interested in? Part of my decision was based on the fact that my current advisor did research in something I was most interested in and had a seemingly unlimited amount of funds (literally millions) available to research  it.", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "84": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1483845812, "Score": 1, "Body": "I've received funding packages from the places I've heard from so far. And I spoke with faculty before applying to decide if the program was right for me. Which meant I only applied to programs I loved, which is why it's so stinking hard to choose. ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "85": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483854848, "Score": 2, "Body": "Well congrats on all that, looks like you have your stuff in order. Have you had a chance to visit the schools or do you plan to? I did this for the 2 schools I narrowed it down to, and afterwards, the answer was obvious.", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "86": {"Subreddit": "PhD", "Author": "R3D0053R", "Date": 1483862432, "Score": 1, "Body": "That's actually true, thank you for the kind words :)", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "87": {"Subreddit": "PhD", "Author": "R3D0053R", "Date": 1483879834, "Score": 1, "Body": "3rd year here, possibly graduating this year or next year. Still doing lots of gaming (that is several hours per day). Just because I love it ;)", "Permalink": "https://www.reddit.com/by_id/t3_5jxc14.json"}, "88": {"Subreddit": "PhD", "Author": "Ais1993", "Date": 1483882783, "Score": 2, "Body": "Thank you very much for your advice. I know every PhD is completely different but I was just wondering how you felt in and around 5 months in to your PhD if you don't mind me asking? I just feel completely run down and disheartened at the moment. I am constantly anxious and worried all the time to the point that I feel physically sick every morning before going into the lab. I just feel I have no confidence in what I do. I'm wondering is it just my anxiety and OCD issues that are doing this to me and that if I can overcome that will I actually be able for this.", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "89": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483885995, "Score": 1, "Body": "It's important that you specify this is for North American PhDs if you go with this OP. I'm from Australia and I don't think anywhere other than Canada and the US does the 5 year PhD with coursework. Ours are 3 years and theirs no course work. So a lot happens in the first couple of years haha. The only thing we nail down is to pass candidacy in the first six months (become ABD). We also don't have qualifying exams.", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "90": {"Subreddit": "WitchPhD", "Author": "NotZappBranniganSir", "Date": 1483893300, "Score": 1, "Body": "Wow", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "91": {"Subreddit": "PhD", "Author": "vanderloomin", "Date": 1483893474, "Score": 2, "Body": "If there is a University you'd like to work at after graduating, then don't choose that University! That is maybe the best way to eliminate options. ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "92": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1483897129, "Score": 1, "Body": "Really? There's a few professors I work with that stayed on as faculty after earning their PhD. I realize this is not super common but would they really outright deny a good applicant simply because they applying to work where they studied?", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "93": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1483899996, "Score": 8, "Body": "All journals I know of have clear word length requirements. Look at the journals you're aiming to publish with for guidance. This should be the first stage anyways. ", "Permalink": "https://www.reddit.com/by_id/t3_5mrr2r.json"}, "94": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1483901768, "Score": 5, "Body": "And if the journal by some chance *doesn't* have a word length requirement, then go open the last 20 review papers they've published and note down the page lengths to get an idea of what they expect.", "Permalink": "https://www.reddit.com/by_id/t3_5mrr2r.json"}, "95": {"Subreddit": "PhD", "Author": "kaswing", "Date": 1483906894, "Score": 1, "Body": "Go to a few schools that have programs you are interested in and see if they have their requirements listed. My program makes the \"PhD handbook\" publicly available-- it lists all the requirements and gives a general sense of timeline. For specific information expectations (like how many papers to publish) check out discipline specific grad student boards. GL", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "96": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1483908684, "Score": 1, "Body": "I can relate anxiety wise, I had trouble with anxiety and depression and I can fully sympathize with zero confidence, dreading going in. This happened to me over half way in though, and latterly through therapy I have learned that it wasn't really brought on by the PhD itself, but I guess the pressure maybe exacerbated it a little bit. \n\nSo yeah 5 months in I was alright, still getting used to stuff I suppose, a bit unsure of myself, but definitely wanted to keep going. If you're having trouble with anxiety then I reckon it would be worth seeing what support is available. Telling my supervisors about my problems helped a lot, they were very understanding, and it felt better to kind of have it all on the table. Universities have in house counselling available usually, so you could maybe see if that's something you want to try out? Hang in there alright :)", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "97": {"Subreddit": "PhD", "Author": "reddit_joanna", "Date": 1483909807, "Score": 1, "Body": "Hi, are you doing your PhD in the UK by any chance? If so, there is always an option to quit after 9 months with the MPhil title. I am doing my PhD in analytical chemistry in the UK. Feel free to PM me if you want to talk.", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "98": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1483912149, "Score": 1, "Body": "I'm having a bit of trouble in that department. It's looking like 500$ plane tickets to go and I'd like to bring my spouse along as he'd be living in the area too. But 1000$ per school in just flights to get out there is way out of my budget. ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "99": {"Subreddit": "PhD", "Author": "Ais1993", "Date": 1483912866, "Score": 1, "Body": "Thank you. Ya I have started seeing a counselor about these issues. I don't know if I could talk to my supervisors about these issues though, I'm not sure they would understand or how they would react but I guess I could consider talking to them. Thanks very much for all your advice. It's very much appreciated", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "100": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1483913230, "Score": 2, "Body": "https://phdtalk.blogspot.com/2011/01/overcoming-fear.html", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "101": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1483915699, "Score": 2, "Body": "Just a suggestion, pick the university with the best professors in your field of study.", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "102": {"Subreddit": "PhD", "Author": "vanderloomin", "Date": 1483916499, "Score": 2, "Body": "In my field it is rare to come on at a University you graduated from. They typically want diversity. Maybe It is a good question for your someone in your field. ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "103": {"Subreddit": "PhD", "Author": "bladesman393", "Date": 1483923142, "Score": 1, "Body": "That's quite alright, feel free to send me a pm if you want to talk about anything, us PhD students have to look out for each other!", "Permalink": "https://www.reddit.com/by_id/t3_5mmmlc.json"}, "104": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1483929283, "Score": 1, "Body": "http://www.inc.com/kevin-daum/how-to-teach-anything-to-anyone.html\n", "Permalink": "https://www.reddit.com/by_id/t3_5jrgpm.json"}, "105": {"Subreddit": "PhD", "Author": "nellasbean", "Date": 1483949164, "Score": 2, "Body": "Most financial websites I've seen recommend 3-6 months of full expenses saved up for emergencies. This will differ for everyone, so do the math and figure out what you'd need based on your lifestyle.\n\nMint is a good app for tracking your expenses, if that's something you need.\n\nWhat I have done, because I'm in debt from undergrad, is throw as much as you can in your savings account until you've hit the 3-6 month expense amount. After you finish that, throw 90% of your leftover money at the end of the month at your debts, save 10%. Vary the percentages how you want, but that little extra at the end is yours to play with. :)\n\nOne more thing: set up a $25 auto transfer from checking to savings once a month. Something small enough that you won't feel it, but it will add up over time if you can't save on your own.\n\nSaving is a really good habit to get into. Once you have an emergency fund, do NOT touch it! Another recommendation is, if you have trouble not touching it, to get a savings account that has withdrawal limits so they will penalize you with fees if you try withdrawing more than their allotted amount. ", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "106": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483950843, "Score": 3, "Body": "This is pretty situation dependant. Maybe try r/finance. Not sure if there's a personal finance version. I bought a house a month before starting my PhD so I essentially had no savings but I had a stipend, no debt, no dependents and no fees.\n\nIn addition to this, I don't think you should be paying for your own conferences. If it's not a part of you're position funding, apply for bursaries and grants.", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "107": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1483951093, "Score": 1, "Body": "By study plan do you mean a timeline of when you will complete things? Is it for a specific grant or to achieve candidacy?\n\nI had to submit a timeline for candidacy and have to submit and updated one every year for my unis annual reporting. I'm pretty sure it's just so that they can make sure that your planned project is not too long or too short for a PhD and then that you're keeping up to date. I do use mine to keep myself on track though.", "Permalink": "https://www.reddit.com/by_id/t3_5mpl0u.json"}, "108": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1483976053, "Score": 1, "Body": "There is, it's called /r/personalfinance funnily enough. ;)", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "109": {"Subreddit": "PhD", "Author": "everythingfeelsblack", "Date": 1483978693, "Score": 2, "Body": "Thank you! This is very helpful. I will definitely do this. ", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "110": {"Subreddit": "PhD", "Author": "everythingfeelsblack", "Date": 1483978708, "Score": 1, "Body": "I really like this idea! Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_5m561u.json"}, "111": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1483980517, "Score": 1, "Body": "I went into my PhD with 7k saved up and had to take out a personal loan in the first semester anyways to cover the costs of moving across the country and some other odds and ends I didn't expect. Just save what you can, and as a final resort you can take out a govt. loan.", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "112": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1483982483, "Score": 1, "Body": "&gt; In addition to this, I don't think you should be paying for your own conferences. If it's not a part of you're position funding, apply for bursaries and grants.\n\n100% agreed\n\n\n/u/sarahsc061 : if that's reassuring to you, I've got 790€ in my savings account and am in the first half of my final (4th) year. ", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "113": {"Subreddit": "PhD", "Author": "sarahsc061", "Date": 1483983820, "Score": 1, "Body": "Good note on the conferences. I don't start applying until August and don't know a ton about how everything is going to work, so I could definitely be wrong on that statement. If it helps at all, in going in straight from undergrad, 21 years old, and will most likely be sharing an apartment with one other person. There's also the cost of living to take in account, but I'm only going to choose a school if their stipend reflects that. ", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "114": {"Subreddit": "PhD", "Author": "wehaveatent", "Date": 1483999987, "Score": 1, "Body": "Did you write a proposal as well or only the study plan? ", "Permalink": "https://www.reddit.com/by_id/t3_5mpl0u.json"}, "115": {"Subreddit": "PhD", "Author": "wehaveatent", "Date": 1484000122, "Score": 1, "Body": "Couldn't agree more ", "Permalink": "https://www.reddit.com/by_id/t3_5mn1i2.json"}, "116": {"Subreddit": "PhD", "Author": "wehaveatent", "Date": 1484000448, "Score": 1, "Body": "Excited &amp; a little anxious- today I supposed to take the proficiency exam but it it is postponed to next week ", "Permalink": "https://www.reddit.com/by_id/t3_5lsb2w.json"}, "117": {"Subreddit": "PhD", "Author": "culturecouture", "Date": 1484002663, "Score": 3, "Body": "Full time job, full time student, &amp; TA. \n\nI rely on the [panic monster](http://waitbutwhy.com/2013/10/why-procrastinators-procrastinate.html) to help me get everything done. It's definitely not a plan I recommend!\n\n[Or you can watch Tim Urban's Ted Talk on procrastination.] (https://www.youtube.com/watch?v=arj7oStGLkU)\n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "118": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1484023740, "Score": 2, "Body": "Research assistantships usually pay enough for rent, groceries, required transportation, and alcohol to drown your sorrows in.", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "119": {"Subreddit": "PhD", "Author": "sarahsc061", "Date": 1484023862, "Score": 1, "Body": "Then I'll be golden!", "Permalink": "https://www.reddit.com/by_id/t3_5mvv1c.json"}, "120": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484027579, "Score": 2, "Body": "One of the tips my supervisor gave me was to focus on your figures. Some panellists will skim through and \"look at the pictures\" so you need to know everything about them.\n\nIf you find any errors, typos or whatever, it's not a big issue but write them down. You can choose to draw their attention to them right at the start and correct them if you'd like.", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "121": {"Subreddit": "PhD", "Author": "dvoted", "Date": 1484027713, "Score": 2, "Body": "I am working full time and I am essentially doing a MPhil/PhD in Law (Philosophy) Full Time. That is, my Thesis for my MPhil looks to be upgraded to a PhD either after I finished my MPhil or during the course.\n\nI have written about 37k words in about 6 months which isn't too bad I guess. Whenever I get free time I just read during work hours and write up note. After work I would go home and read and work some more. I make sure I do a little bit everyday. \n\nGenerally what helps is when I experience \"writers block\" - I send my draft chapter to my supervisors and ask \"what am I missing\" - they usually guide me and I repeat. Research, write...", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "122": {"Subreddit": "PhD", "Author": "dvoted", "Date": 1484027921, "Score": 1, "Body": "Law MPhil/PhD student here - There is no mandatory publishing/teaching that I am aware of down here in Australia. However, I have submitted a journal article to Yale University and awaiting acceptance or decline. \n\nI've also present at two universities and awaiting approval for two more I have requested to present at. ", "Permalink": "https://www.reddit.com/by_id/t3_5ml7or.json"}, "123": {"Subreddit": "PhD", "Author": "arbab01", "Date": 1484029849, "Score": 2, "Body": "Try to publish something from your research. It's hard for any examiner to criticize published data. ", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "124": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1484030713, "Score": 1, "Body": "Woah, i feel like I'm  reading my life story but the tactics to overcome it are great. Thank you for sharing.  ", "Permalink": "https://www.reddit.com/by_id/t3_5m6gtw.json"}, "125": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1484032074, "Score": 1, "Body": "Thank you, unfortunately my work features novel drug candidates that for the moment the designer would prefer not revealed so I have limited scope for publication at the moment. ", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "126": {"Subreddit": "PhD", "Author": "Adeus_Valcross", "Date": 1484032226, "Score": 1, "Body": "Those are good ideas, thank you. I've never heard about some people go through just figures. \nI haven't really gone through my thesis since it was bound but I'm sure there will be some typos despite my supervisor and i having independently gone through the thesis with a fine toothed comb. ", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "127": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1484063524, "Score": 1, "Body": "You could always elaborate on the methodology that you employed, it's pros and cons, I think people would be interested in publishing it as it would provide future doctoral students many pointers about how to approach a question similar to yours. ", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "128": {"Subreddit": "PhD", "Author": "HarrietJonesFormerPM", "Date": 1484109577, "Score": 1, "Body": "I do like/enjoy my work though. Maybe I'm just second guessing myself. I suppose I dont have to make a decision today, and maybe getting back into the groove after the holidays has been rough and is making me question things?", "Permalink": "https://www.reddit.com/by_id/t3_5n9d9b.json"}, "129": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1484110262, "Score": 2, "Body": "If you're feeling doubts this early in your program, my advice is to get out while you can. There's nothing wrong with realizing that academic research isn't for you, but there's not much utility in a PhD outside of research. You can always come back later if you change your mind after working in industry for a few years.", "Permalink": "https://www.reddit.com/by_id/t3_5n9d9b.json"}, "130": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1484111691, "Score": 2, "Body": "I felt this way about that far into it. My undergrad was computer systems engineering, and my PhD is computer systems mixed with traffic and statistics. My thesis is due in a month and a half. I've been pretty miserable for the last couple of years when it comes to my study and seeing all my friends from undergrad surpass me while I feel like I'm staying exactly where I am.\n\nNot sure what I'd do if I was given the option whether or not to do a PhD again. But I definitely didn't know what I was getting myself into. I'll be jumping out of academia as soon as I can.\n\nIf you stay on your path, there is a chance you'll never fall in love with your topic, and you'll have to be ok with feeling this way for the next few years. Can you handle that? Will it be worth it?\n\nAlternatively, most schools let you downgrade from a PhD to a Masters and finish up early with the work that you've already got. Does that sound appealing?", "Permalink": "https://www.reddit.com/by_id/t3_5n9d9b.json"}, "131": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1484122516, "Score": 3, "Body": "Sample size is what you determine when you actually reach that stage of your research. As far as I know expecting you to provide a very specific sample size at the proposal stage is a bit too much. Research proposals are the beginning of the journey and by the time you submit your final proposal it may not even be the same proposal that you applied with. Perhaps, the interviewers were just gauging your understanding of the topic that you want to undertake research in and how you would approach it. \n\nEDIT: You can enrol yourself in research methodology workshops. Coursera has a brilliant research methods course as well and to show your research capacities in action you may wanna present some papers at conferences and try to get them published. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "132": {"Subreddit": "PhD", "Author": "isntballs", "Date": 1484141303, "Score": 0, "Body": "(biostatistics PhD student here)\nOne of the biggest challenges in my field is showing researchers in other areas how useful and necessary the roll of a biostatistician is! For any research study, sample size (and many other parts of the analysis) must be justified before the study begins.  There are formulas for determining appropriate sample size for your study based upon how much statistical power you need, your alpha level, the estimated/anticipated effect size, etc.  Please reach out to a statistician to help you with this, they will be willing and happy to help! \n\nIf you have no access to a statistician, consider reading up on sample size calculation.  It is relatively straight forward in this type of situation and a basic knowledge of statistics should be enough for you to understand. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "133": {"Subreddit": "PhD", "Author": "FidelSpasstro", "Date": 1484142977, "Score": 2, "Body": "I don't doubt biostatisticians have something to offer qualitative sociological researchers. \n\nHowever, stating that it is absolutely vital for people in other fields to get right what your specialism offers is probably an exaggeration. I'm sure there are a lot of epistemologists who would similarly stress the importance of getting your epistemological, ontological and methodological positions in check before you even start doing research, but it is false to assume that this is of so much importance to biostatistics dissertations. \n\nI think the first comment has it right: give an idea of sample size now, but figure it out at the appropriate stage of research. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "134": {"Subreddit": "PhD", "Author": "mietze", "Date": 1484145911, "Score": 2, "Body": "Thank you for your input. I did these kinds of calculations in my statistics class. I guess it is not applicable in my case since I am doing qualitative research. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "135": {"Subreddit": "PhD", "Author": "isntballs", "Date": 1484150916, "Score": 2, "Body": "Well I didn't even come close to suggesting that it was \"absolutely vital\" and perhaps u/booffy is correct that in the area of qualitative sociology sample size is more flexible with respect to the application of a narrative result.  I suggested using a mathematical method of determining an appropriate sample size and even offered that OP might be capable of learning it his/herself.  If in qualitative sociology studies this is not appropriate then so be it, but it is still a valid mathematical consideration for most research and as Booffy agrees, it should be determined in the design phase of the study.   ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "136": {"Subreddit": "WitchPhD", "Author": "more_isms", "Date": 1484153224, "Score": 1, "Body": "marry me", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "137": {"Subreddit": "PhD", "Author": "FidelSpasstro", "Date": 1484158974, "Score": 1, "Body": "And my argument is that not all research is statistics, despite yours being \"statistically speaking\" a valid point :)\n\nEdit: so yes we agree", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "138": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1484165895, "Score": 3, "Body": "You do a power analysis to determine sample size. Whenever I submit a grant proposing to do research that involved human subjects, the grant reviewers (this is biomedical research for the NIH in the US) always want to see that I have approval from an ethics panel and the ethics panel always wants to see the sample size I'm used as determined using a power analysis before any of the work is executed. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "139": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1484175525, "Score": 3, "Body": "have you worked with G*Power?\n\nhttp://www.gpower.hhu.de\n\nAlso- your research methodology, power, and research questions will drive your sample size.", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "140": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1484178118, "Score": 2, "Body": "That's what I was wondering... obviously if you're doing quantitative research, then you would do a power analysis. However, if you're doing qualitative research, then it most likely depends on your targeted population. For instance, if you're investigating African american adolescents whose fathers are recurring federal offenders, your sample won't necessarily be that large. However, if you're investigating middle-school children who have witnessed bullying at school, then you would have a larger sample.", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "141": {"Subreddit": "PhD", "Author": "mietze", "Date": 1484205214, "Score": 2, "Body": "I guess what they wanted to know during the interview was whether my plans are feasible. When I told them how many interviews I thought I could do during the field work it seemed that my number was too high. ", "Permalink": "https://www.reddit.com/by_id/t3_5nawna.json"}, "142": {"Subreddit": "WitchPhD", "Author": "zuggles", "Date": 1484262194, "Score": 1, "Body": "haha. wow, ok... yeah, you definitely pull this off.", "Permalink": "https://www.reddit.com/by_id/t3_5hgn68.json"}, "143": {"Subreddit": "WitchPhD", "Author": "BringerOfRain13", "Date": 1484263466, "Score": 2, "Body": "Love this girl truly one of my favs!!", "Permalink": "https://www.reddit.com/by_id/t3_5nmd95.json"}, "144": {"Subreddit": "WitchPhD", "Author": "tiagogarridoferreira", "Date": 1484263484, "Score": 2, "Body": "Wow...you are perfect from every angle...", "Permalink": "https://www.reddit.com/by_id/t3_5nmd95.json"}, "145": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1484265542, "Score": 2, "Body": "Wat?", "Permalink": "https://www.reddit.com/by_id/t3_5nlgii.json"}, "146": {"Subreddit": "WitchPhD", "Author": "Chugachoo", "Date": 1484267730, "Score": 2, "Body": "I really enjoy this set.  The many states of areolas on large breasts has always been intriguing.  Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "147": {"Subreddit": "PhD", "Author": "HarrietJonesFormerPM", "Date": 1484268538, "Score": 2, "Body": "Thanks, this is excellent advice.", "Permalink": "https://www.reddit.com/by_id/t3_5n9d9b.json"}, "148": {"Subreddit": "PhD", "Author": "nemesis18082", "Date": 1484276379, "Score": 2, "Body": "For US institutions, generally PI has secured grants for funding students on specific projects. There are external fellowships which fund the student specifically. These are generally quite competitive, but offer the student more freedom in their projects.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "149": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1484294339, "Score": 1, "Body": "I would relax a bit first, you have earned it! Find out the process at your uni, but in my case I received my examiners comments a few weeks before the viva. Once you have them, you can get a better feel for how much preparation you will need to do. All I did was write out responses to each comment and re read my thesis. If your examiner has serious concerns you may need to do more, but also remember this is a rare chance to discuss your research with someone who has read it, so try to enjoy it! ", "Permalink": "https://www.reddit.com/by_id/t3_5n1eth.json"}, "150": {"Subreddit": "PhD", "Author": "Playful_PhD", "Date": 1484300163, "Score": 5, "Body": "I think its normal to preapply, at least in the US. I did when I was nearing the end and got a job offer bc they knew I'd be finishing in about 4 months time. Added bonus- it finally pushed my boss to organize the defense, finalize the write-ups and let me go. Who knows how long I'd have stayed on if I *didn't* have the job as a reason to go!", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "151": {"Subreddit": "WitchPhD", "Author": "edperson", "Date": 1484319488, "Score": 2, "Body": "Welp... I just found a new subreddit to subscribe to.", "Permalink": "https://www.reddit.com/by_id/t3_5nmd95.json"}, "152": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1484322991, "Score": 3, "Body": "I think it makes perfect sense to plan ahead and send out inquiries in advance. This is actually expected (applying for a PD before you defend). I'd just make sure to be up front about the timeline involved, and the fact that you don't have a date yet for your defense. ", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "153": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1484326220, "Score": -1, "Body": "Yes. It is even generally advised, so the new PI has time to put some grants/money together.", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "154": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1484330917, "Score": 6, "Body": "Post-docs can vary quite significantly between disciplines. However, they are (these days) considered nearly mandatory for obtaining a faculty position at institutions ranging from R1's to SLAC's. The reason for this is that a PhD involves training in how to do research, how to write papers, and how to write (usually smaller) grant proposals. However, there is little to no training in managing budgets or managing students (beyond undergrad workiers) and dissertation research training is fairly niche. Going through a post-doc will allow for more independent research to be conducted at a higher volume and with greater responsibility than a doctoral program allows or is intended to provide. Post-docs are given greater responsibility in student training, managing budgets and projects, and idea formation/actualization. Additionally, a post-doc provides an opportunity to learn new skills and move beyond their very niche dissertation topics, which will allow them to come up with better and bigger ideas to bring in those NSF/NIH grants that will be necessary for tenure at R1/2's or to provide better depth for what would be possible in terms of research productivity at a SLAC. These will become invaluable to a faculty member who will be running their own lab. This is even true at SLAC's, as there will often be fewer resources and less support for research than one would find at an R1 or R2 institution.\n\nPost-docs are also often popular for those wanting to get into industry as dissertations are often quite theoretical and industry positions are quite practical. A post-doc may allow a student to get more and better experience at practical research skills before becoming a better fit for an industry position. There are arguments on the validity of this claim, however, and if industry is your goal, I would suggest networking and simply asking employers what skills they are looking for.\n\nThat being said, I am finishing my PhD and am not going to be doing a post-doc position. This is because I am not interested in continuing on in research and am looking for a teaching position at a community college or teaching institution where publication is not required for tenure promotion (or simply does not have a tenure system in place). I also have some colleagues who are going into medical writing or science communication or government work who are not planning on doing post-docs, because in reality post-docs are generally applicable only to academic positions (and some industry).\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "155": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1484335405, "Score": 1, "Body": "I'd suggest applying or at least inquiring now, since it may take some time for them to read over your application material, interview you, do the paperwork, for you to apply for a visa, etc.  I moved to new countries for my PhD and for my postdoc - although not to the US - and in both cases this process took at least a few months (6 months, in the case of the postdoc job).\n\nAlso, you may want to make a point of clarifying what \"defending\" means for your timeline in your country's academic system.  Are you effectively finished some months before your defense?  Or could you be given revisions that could require you to work for some months after the defense?", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "156": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1484340937, "Score": 2, "Body": "This is very helpful, thank you! Especially because I feel like there is a lot of necessary training that is needed for faculty positions that I don't sense will be provided in my current program. More specifically, pedagogy and intensive grant writing support. They don't even allow us to teach as PhD students which seems ludicrous to me. ", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "157": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1484341380, "Score": 1, "Body": "Yes, unfortunately unless you go out of your way to gain it, the majority of research faculty never get any kind of pedagogy training. I happened to know that I wanted to primarily teach when I entered my PhD program, so I have been able to take a few courses in pedagogy and gain some extra experience. However, many graduate students (especially those that don't get a masters before a PhD) don't realize that they would have wanted more training or experience in teaching until their in the depths of dissertating. ", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "158": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1484349686, "Score": 1, "Body": "I have some time, I will keep searching for good opportunities thank you!", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "159": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1484350385, "Score": 18, "Body": "There is no such thing as an online PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_5nty9v.json"}, "160": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1484360888, "Score": 5, "Body": "\"Decent\" online PhD. Lol. ", "Permalink": "https://www.reddit.com/by_id/t3_5nty9v.json"}, "161": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1484362414, "Score": 4, "Body": "Why?  PhD in Finance is not even remotely similar to the MBA in Finance.  Are you sure you know what you're getting into?", "Permalink": "https://www.reddit.com/by_id/t3_5nty9v.json"}, "162": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1484374201, "Score": 4, "Body": "The point of a postdoc, traditionally, is to prepare a young investigator to lead their own research program/lab.  Today, frankly speaking, a postdoc is often the default holding pattern position while a person figures out how competitive they think they'll be applying for a faculty position.  Many people use their postdoc experience to decide if they want to continue in academic research (apply for a faculty position) or change directions after the postdoc (find a job outside academia) based on how their research goes and if they get grants.  Unfortunately, many people neglect career development opportunities during their postdoc, which can seriously hurt and demoralize them if they decide (as the majority of PhDs do these days) to leave academic research afterwards.\n\nWhat field are you in?  Consider what kind of career you're interested in after your training, as postdoctoral fellowships are essentially trainee positions, and may be either essential for your career, or a colossal waste of time.  All depends on what you're studying, and where you'd like to be and do in life.\n\nGiven the unforgiving funding and academic hiring situation in many countries today, it's beneficial for most people in academic research trainee positions to pause and consider if they're spending at least some of their time on a Plan B or C on a regular basis.\n\nAlso a note: don't only take the word of those in your PhD program; many if not most faculty do not communicate with those outside academia and have very different priorities than you may wish to adopt for your own career development.", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "163": {"Subreddit": "WitchPhD", "Author": "Snowkid1", "Date": 1484374300, "Score": 1, "Body": "So beautiful.   Love that you are natural.  Only way to be. And the tatts. You are perfect.  Selling panties still?  Joeoasis@hotmail.com. Email me please ", "Permalink": "https://www.reddit.com/by_id/t3_5nmd95.json"}, "164": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1484377282, "Score": 2, "Body": "Ultimately you want to make a living based on something you know or do.  Decide if a PhD, or as already suggested, a Masters or other degree, would serve you better, objectively speaking, for your future career.\n\nRemember that it's very easy to second guess your gut feeling when you're surrounded by others plugging away at their PhDs.  It feels lonely to seem like the only one who's not \"cut out\" for the degree.  Just know that this is an environmental feeling; outside of academia, the assumptions and pressures can be very different.  \n\nI suggest talking to some people with careers that you think would be interesting to you, and find out if this is something you enjoy.  Think and look broadly; your skillsets may apply to a wide range of future work that you may find rewarding in many ways, regardless of your terminal degree.  \n\nTL;DR: Given you started your PhD and are doubting your path relatively early into it (which is very common!), and are not in dire need of a decision tomorrow, take the time to feel out your next step by doing some personal research to inform your decision of leaving or staying.", "Permalink": "https://www.reddit.com/by_id/t3_5n9d9b.json"}, "165": {"Subreddit": "WitchPhD", "Author": "Frankc009", "Date": 1484379838, "Score": 2, "Body": "My new favorite poster an honest thanks is in order. ", "Permalink": "https://www.reddit.com/by_id/t3_5map4o.json"}, "166": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1484394493, "Score": 6, "Body": "An online PhD? Do you know what a PhD is?", "Permalink": "https://www.reddit.com/by_id/t3_5nty9v.json"}, "167": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484411257, "Score": 1, "Body": "Think of it as a job interview and gear those questions towards the position you are applying for. They may ask you to give examples of how you have over come difficulties in the lab for instance. Or they may ask you about something in your application and ask you to expand on it (to explain your experience in a certain position). We don't have interviews in my country but this is what I think would be relevant. You can try r/gradadmissions too. Searching that sub would probably give you a tonne of responses to this question.", "Permalink": "https://www.reddit.com/by_id/t3_5npy6g.json"}, "168": {"Subreddit": "PhD", "Author": "WithMyHoodieOn", "Date": 1484421274, "Score": 1, "Body": "Don't get discouraged by the hater comments here. Google for distance learning forums and ask the question there.  Especially the UK's approach to PhD studies (almost no coursework) could work for you. Just stay away from US for profit schools. Overall expect to pay a minimum of $20k at state schools. In case you don't want to go full in on the research part, a DBA could also be an option for you.", "Permalink": "https://www.reddit.com/by_id/t3_5nty9v.json"}, "169": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1484437748, "Score": 1, "Body": "I'm in communication science and disorders. I would like to stay closely linked to the clinical side of the field but it also stems into linguistics, cognitive science, and developmental psychology. My program is actually pretty removed from the clinical side so my thought would be to do a post-doc in a program with more connections to clinical research. ", "Permalink": "https://www.reddit.com/by_id/t3_5ns32y.json"}, "170": {"Subreddit": "PhD", "Author": "Shuklitto", "Date": 1484466281, "Score": 1, "Body": "This helps. I'll go through my undergrad and postgrad research and work experience. Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_5npy6g.json"}, "171": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1484477097, "Score": 1, "Body": "That's good advice. Thank you !", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "172": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1484477129, "Score": 1, "Body": "Thanks. Yes indeed I'll make sure to explain the specifics!", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "173": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1484477142, "Score": 1, "Body": "Thanks. Yes indeed I'll make sure to explain the specifics!\n", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "174": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1484497076, "Score": 3, "Body": "Contact the doctoral student life department of your Uni and ask them how you should proceed regarding changing your supervisor and also inform them that your current supervisor has asked you to meet. \nAnd yes, asking you to do work for his research is totally uncalled for when you have explicitly made it clear that you do not have the time to do what he was asking you to do. \nHonestly, if my supervisor did that I would have approached the DSL department that very moment. ", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "175": {"Subreddit": "PhD", "Author": "inomchips", "Date": 1484497407, "Score": 1, "Body": "Thanks for the advice. I see what your saying, I didn't want to piss him off, really, which is why I've just tried to get my head down and work through it. I'd also heard PhDs were a nightmare generally, and thought maybe I was just experiencing the same as everyone else. Cheers again.", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "176": {"Subreddit": "PhD", "Author": "emzzie43", "Date": 1484498479, "Score": 2, "Body": "In the process of building house... Hope it works out ok. Even if I take up postdoc elsewhere, it would be just few years we can just rent out and rent where we live. Mortgage is scary though :(", "Permalink": "https://www.reddit.com/by_id/t3_5o4ikg.json"}, "177": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484504589, "Score": 1, "Body": "My partner and I bought a house in the same week as I started my PhD. We are still in our home town but intend to move overseas when I graduate. We plan on renting it out when we move overseas, I don't think we will sell it in the foreseeable future as we see property as long term investment.\n\nI will say that you need to be organised during the settlement period. My partner only has Sundays off work so he was very little help and people wanted something from me all day every day. ", "Permalink": "https://www.reddit.com/by_id/t3_5o4ikg.json"}, "178": {"Subreddit": "PhD", "Author": "BertMacklins", "Date": 1484517664, "Score": 3, "Body": "12 is good, 11 at a push. \n\nIf you flood the page with small text, your reader is going to get bored quickly. White space between paragraphs will also do wonders for breaking up a pstatement. \n\nPeople never really give enough credit to presentation imo. I like to stick with \" a bad idea presented well, is better than a good idea presented poorly\" when it comes to things like this. Maybe it's just me, but it's worked out so far. ", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "179": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1484517778, "Score": 2, "Body": "As far as beefing up your application, there are a few things that can be really helpful, but unfortunately usually take some time. Having published work is always a big plus on an application. Also, presenting at conferences helps. You having already connected with faculty is an important factor. Some factors you can't change like your past grades and scores, but some factors are absolutely under your control. For example, an extremely strong statement of purpose, a well-written writing sample, and good letters of rec from faculty in your MSc program can all significantly lean admissions boards in your direction. I had to become really familiar with the application process because I applied to 7 Ph.D. programs after finishing my MA (some accepted, some not). It worked out and I'm fully funded with TA and lecturer positions in my Ph.D. program in the humanities, but the whole application process was a nightmare. I had similar grades (undergrad 3.15, grad 3.95) and GRE scores (160v 149q; 4.5w), and was accepted to multiple programs, so I think you'll be fine. Just make sure the statement of purpose, writing sample, and letters of rec are on point, as well as whatever honors, achievements, published works, conference presentations, etc. are also listed on your CV. Hope that helps a little. Good luck on your app!", "Permalink": "https://www.reddit.com/by_id/t3_5o62lz.json"}, "180": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1484518528, "Score": 1, "Body": "Hi there! I'm a scientist and your typical good girl-next-door, until I want to be a little naughty ;) Wearing panties knowing that someone else will soon be enjoying my scent is such a turn on. It makes my days of research so much more exciting! \n\nAny panties shown on this page are still up for grabs; just message me if a pair catches your eye! ", "Permalink": "https://www.reddit.com/by_id/t3_5o6qzo.json"}, "181": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1484520226, "Score": 5, "Body": "Also consider that best in field does not necessarily equate to best PhD supervisor that has the ability to guide you to a successful completion.\n\nDon't think your not cut out for academia - its a challenging environment for most of us at the start, and don't work over things like Christmas breaks, part of successfully completing a PhD from my experience is getting a work / life balance, you need down time to relax and recuperate, and yes occasionally you'll be doing 14+ hr days.\n\nI'd be strongly inclined to find a new supervisor that understands this and also doesn't treat you as slave labor for their lab work.", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "182": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1484521107, "Score": 2, "Body": "12", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "183": {"Subreddit": "PhD", "Author": "SocInTheMaking", "Date": 1484523927, "Score": 2, "Body": "Thanks for your support. And yes, it helps quite a bit. At this point I have submitted most of my applications, including to the program that I most want! I think that I have hit all of the marks that you recommended and I am now at the \"WTF\" anxiety point. I have one last day to make any final adjustments though. I really appreciate your response - and I will post back here with any updates about my acceptances/rejections. :) ", "Permalink": "https://www.reddit.com/by_id/t3_5o62lz.json"}, "184": {"Subreddit": "PhD", "Author": "peterthebigfatcat", "Date": 1484524433, "Score": 2, "Body": "12 . A personal statement is not the place to try bending rules to your benefit. Would you want to read 2 pages of size 8 font with 0 margins? Neither do the people reading the statement. ", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "185": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1484528111, "Score": 1, "Body": "I read things and use my brain to remember what I want. You can use that strategy if you'd like. ", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "186": {"Subreddit": "PhD", "Author": "DougFunny-Mayonnaise", "Date": 1484536057, "Score": 1, "Body": "That \"WTF\" anxiety point you mentioned is for sure one of the worst parts about the app process. I was constantly on Grad Cafe, which has a forum where other applicants add if they've been accepted or rejected to the institutions they applied for, it's http://thegradcafe.com/survey/index.php. You just input the institution you're looking for in the search bar and a list of posts by other applicants indicates if/when they got notice about their apps. I would check daily to see if anyone else had been notified of acceptance/rejection. It actually made the anxiety a little worse sometimes, but I found it impossible to resist checking constantly if others had received notice before me. Good to hear you hit all the marks I mentioned! Good luck and I'll be interested to hear how it all works out.", "Permalink": "https://www.reddit.com/by_id/t3_5o62lz.json"}, "187": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1484538713, "Score": 7, "Body": "Let me get this straight: you want to read things and not retain anything? Why read at all? Mission accomplished. You are welcome.", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "188": {"Subreddit": "PhD", "Author": "a4k04", "Date": 1484546729, "Score": 3, "Body": "The biggest red flag here, to me, seems to be that you're going to put 3-6 years of your life into a field you don't have a strong interest in. I'd strongly advise you not to pursue a PhD in a field you don't love. This is not an easy thing to accomplish, it's a huge time commitment, and it's significantly harder to do well when you don't love what you're working on. My advice is always to fix the base problem first and work your way up; to me it seems the basic problem right now is working towards a PhD in a field you're not passionate about. \n\nYou don't love the field and your advisor sounds abysmal, I'd find somebody working on research you're interested in ASAP and have a sit down with them and see if they have room for another student. ", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "189": {"Subreddit": "PhD", "Author": "skididdle", "Date": 1484553145, "Score": 3, "Body": "Wow, so much snark in response to your post. I don't see a problem with speed reading, it's hard to keep on top of the literature anyway and anything that helps you keep up with it could be a real asset. I don't use any technique (knowingly). But the reference manager qiqqa (which is awesome for many reasons) has a speed reading function that is useful for me sometimes when I just want to skim through a paper. ", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "190": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1484556304, "Score": 1, "Body": "Do NOT continue a PhD in something you aren't passionate about. Self-motivation is hard as is, how is it going to be with something you're lukewarm about? \n\nAlso, when you switch, ask about staff member completion rates. We have a number of people in my department who are incredibly self centred with regards to their research and so have a number of non completions on their record. You need someone who will support your research and guide you through the process as well as the shitstorm that is academic politics.", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "191": {"Subreddit": "PhD", "Author": "Redditmis", "Date": 1484567785, "Score": 0, "Body": "fuck off", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "192": {"Subreddit": "PhD", "Author": "Redditmis", "Date": 1484567833, "Score": 0, "Body": "Thanks for your reply, I'll try skimming ", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "193": {"Subreddit": "PhD", "Author": "Natvika", "Date": 1484577171, "Score": 2, "Body": "That's a good point, thank you", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "194": {"Subreddit": "PhD", "Author": "Natvika", "Date": 1484577178, "Score": 1, "Body": "I'll stick to 12, thank you", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "195": {"Subreddit": "PhD", "Author": "peterthebigfatcat", "Date": 1484578115, "Score": 2, "Body": "np, we've all been there and considered doing the same thing. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5o6n36.json"}, "196": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1484587011, "Score": 1, "Body": "I'm in the process of starting a blog, and I am in the exact same situation as you are.\nI think you can write that without any plagiarism problem, like you said it's public research. But I'd really like to hear from some more knowledgeable people on that subject.", "Permalink": "https://www.reddit.com/by_id/t3_5ob9pc.json"}, "197": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1484587048, "Score": 6, "Body": "Publish the papers first and then add a disclaimer to the blog entries that says they are a simplified version of your paper, hyperlink the DOI of the paper. \n\nAFAIK, if you use your own published or previously done work in a new work you have to cite yourself otherwise it will be considered plagiarism that's what I was taught by my research methodology instructor. ", "Permalink": "https://www.reddit.com/by_id/t3_5ob9pc.json"}, "198": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1484621427, "Score": 3, "Body": "Not sure how this line of thinking will help change anything, to be honest. If you've found your passion, good on you! Just apply and see what happens. You can't change your grades. Publications are very cool to PhD applications, because it shows you have what it takes to publish. It'll likely be a mix of factors that gets you in, so don't worry purely about grades. ", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "199": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1484621887, "Score": 2, "Body": "Thanks for your response. Mostly I'm wondering if I really need to study more and re-take the GRE, but I'm already not the greatest with state tests and it costs $200 to take it so I'd rather not. ", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "200": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1484625269, "Score": 2, "Body": "No worries! Hey, it sounds like you're already leaning towards one option - just applying with what you have. I suspect you're just nervous about not having done enough to make yourself competitive. I think us on reddit can only help encourage you, but ultimately I think you need to just do it. What do you think? ", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "201": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1484626280, "Score": 1, "Body": "That's exactly what I'm nervous about! I think I probably will just apply with what I have, but unfortunately I don't have a plan B for if I don't get in. I also think I'm a pretty solid candidate *except* for my GRE scores, and I'm not sure how important those scores are for acceptance.", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "202": {"Subreddit": "PhD", "Author": "UnicornStatistician", "Date": 1484658335, "Score": 2, "Body": "Could it be that anxiety is a contributing factor in your retention issue? When I am under a lot of stress or anxiety I find that I retain next to nothing in my long term memory. I have been practicing mindfulness through meditation along with using the pomodoro method while working. These two things have reduced my anxiety quite a bit.", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "203": {"Subreddit": "PhD", "Author": "Paloma_91", "Date": 1484665408, "Score": 2, "Body": "It certainly could be a factor. I will admit that this is the first time in my life that I have not felt competent in the academic sphere. That ego-crush has led to some serious self-doubt/fear that I've not yet learned to handle. I use the pomodoro method already, but perhaps practicing mindfulness of some sort might help. Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "204": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1484666522, "Score": 4, "Body": "This is probably not going to help (in that it's hard for this to be actionable advice) but I agree with your advisor, that when you start to see the big picture (with regards to the seminar courses), and see how each article fits in, that the readings will get a lot easier. If you're getting bogged down by methods/research design in the seminar course, that will also hinder your comprehension, and to ease that, it's simply a matter of putting in the hours... that is, it'll get easier, you just have to stick with it. Nowadays, reading an article in my area takes me about 20-30 minutes. When I first started, it would take me 4-5 hours. I'm in my last semester of my PhD btw.  \n  \nRegarding the stats course, you just have to work hard and stick with it. We *all* struggle with stats, it's just a matter of putting in the work and trying your best to understand it. However, given that it's the first week or two of classes, is it possible that the huge chunk of multivariate stats that was assigned was supposed to just be review? It's quite common for professors to give a huge reading list in the first week, with it mainly being review, so they don't expect it to big that big of a workload.", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "205": {"Subreddit": "PhD", "Author": "gatsbysaurus", "Date": 1484670978, "Score": 1, "Body": "Most schools aren't going to place that much weight on your GRE scores at the PhD level. As long as you're profile as a whole tells a coherent story and says that you are ready for a PhD (I.e. Focused, building the skills that you need, etc.) you should be good. It sounds like you're in the right track. \nFit with the professor is also essential. Make sure you pick an advisor who really matches your research interests. \n\nSource: PhD student in Psych", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "206": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1484677961, "Score": 1, "Body": "Well this makes me feel better. Thanks :)", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "207": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1484680744, "Score": 2, "Body": "You're probably not doing anything wrong. I've never been a part of a seminar that didn't assign too much material. I was in a similar boat during my first year. I had just finished an MA and thought I knew what grad school was all about. Got to my PhD program and learned a whole new brand of reading pain. \n\nI'm in a different field, so I'm not sure if my reading tips would be of much use. But just know, it's probably impossible for you to read all of it word for word. Part of the training is learning how to move through large amounts of material efficiently and effectively. So, it makes sense that new students struggle with this. \n\nCan you speak with people in your field that are further along in the program to see how they managed the reading load? When I was a first year, second and third year students really helped out with stuff like this. \n\nJust remember, this is supposed to be a demanding process. Particularly in your first year. Yes, feeling like you're drowning is unfortunately pretty normal. Keep at it, and you'll find a method that works best for you. ", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "208": {"Subreddit": "PhD", "Author": "UnicornStatistician", "Date": 1484682621, "Score": 1, "Body": "Self doubt is a soul crusher and only in your mind :) trust me, I am an expert, adaptive thinking to change that belief is going to be important on your journey ", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "209": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1484700213, "Score": 1, "Body": "I don't:(", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "210": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1484705981, "Score": 10, "Body": "It's called the art of skimming. During my Master's program I had a fantastic professor who told me that most PhD programs will assign too much reading as a test to see if you are smart enough to devise a way to finish the readings in the small allotment of time you are given. He enlightened me as to how to navigate articles properly so as to not have to read them word for word. 1. Read intro 2. Find supporting body paragraph that directly relates to the article's thesis, this skipping some of the setup and literature review that are present in basically all academic texts 3. Find one more interesting paragraph or section to read that gives a broader sense of the article's larger applications 4. Read the paragraph right before the conclusion where the author solidifies their claim (conclusions are generally useless because they tend to only restate the intro and thesis). This is the formula I have been following for two years now and I usually have much more relevant comments in class than those who were up all night trying to read every word. Getting a PhD is ostensibly a test to see who is the best bullshitter in a room full of well trained bullshitters. It's as much a game as it is an endurance test. But I've got my PhD candidacy exams this weekend so I best get back to studying. Hope some of this helps.", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "211": {"Subreddit": "PhD", "Author": "jweezy61", "Date": 1484708444, "Score": 1, "Body": "As a senior PhD student (and someone who now sits on graduate student admission committees), we don't focus much on GRE scores unless they are very high or very low. We accept students generally on the following (and in this order): 1 - If a faculty member wants to work with that candidate, they almost always get accepted; 2 - previous research experience; 3 - personal statements/recommendation letters/interviews.\n\nLong story short, I would stress too much about your GRE scores. I know my scores were very average when I applied, and I had no problems getting in to my program. If you choose to apply to some PhD programs, I don't think you would have any trouble. Cheers!", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "212": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1484714453, "Score": 5, "Body": "Talk to the GPD or chair of your department. They could assign a faculty member who is either really new/really old that can serve as a namesake advisor who can help you graduate. It can be helpful if you have some portion of your dissertation written, as it will show that you are on track to complete. This happens in academia all the time. The new professors are looking for students to pad their resumes by acting as academic advisors. The old professors who have tenure track but don't really do a lot in the department will do it just to show that they are still relevant. ", "Permalink": "https://www.reddit.com/by_id/t3_5omsjn.json"}, "213": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484734306, "Score": 1, "Body": "I'm not in the US so I don't really get your system but you could try r/gradadmissions if people here haven't convinced you yet. My advice would probably be to apply to a couple more programs with the $200 rather than take the test again. If you apply to some safeties all the way up to ones you don't think you have a chance in then you'll probably be fine.", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "214": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1484756120, "Score": 1, "Body": "Find a software that reads to you, free or paid. Obviously, free won't be as good. Just shop around first to make sure what you get meets your needs.", "Permalink": "https://www.reddit.com/by_id/t3_5ohr0h.json"}, "215": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1484761662, "Score": 1, "Body": "Thank you for your input! I will focus my efforts on researching faculty I want to work with. ", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "216": {"Subreddit": "PhD", "Author": "queenpri", "Date": 1484761675, "Score": 1, "Body": "I didn't even know that subreddit existed! Thanks so much.", "Permalink": "https://www.reddit.com/by_id/t3_5of0sk.json"}, "217": {"Subreddit": "PhD", "Author": "ursath", "Date": 1484779791, "Score": 3, "Body": "You should not ask people on reddit but rather\n\n1. Someone in your department you get on well with\n\n2. Your supervisor\n\n3. Possibly look at academia.stackexchange for similar questions.\n\n4. Read point 1 again. Seriously. Wayy to many people asking for help on the internet when there are actual people who will likely know you, your work, your field, your problem.\n\nUsually the best way to go forward is to acknowledge whatever flaws there are. You can: point at flawed data and introduce an alternative; point at flawed data but make an argument why it's still useful in some ways, point at an argument and use the data anecdotally. \nBut that depends on the field, the type of flaw, how much of your chapter is based on it, etc etc. (see point 1)", "Permalink": "https://www.reddit.com/by_id/t3_5osf6m.json"}, "218": {"Subreddit": "PhD", "Author": "Akropop", "Date": 1484779805, "Score": 4, "Body": "I would argue a prospective student that never asks is a chump and the advisor may take advantage of them or at least question their judgement. ", "Permalink": "https://www.reddit.com/by_id/t3_5osfx6.json"}, "219": {"Subreddit": "PhD", "Author": "mrtechphile", "Date": 1484805055, "Score": 1, "Body": "Great question. Have you used [Evernote](https://evernote.com/)? You can clip things and categorize them for subsequent review if needed. \n", "Permalink": "https://www.reddit.com/by_id/t3_5o78ba.json"}, "220": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1484808150, "Score": 2, "Body": "I hesitated to ask and it almost cost me a year of life because I found myself in the position where I cannot stay in the program after a year because there is no more funding. I assumed there was, they assumed I knew there wasn't.\nFind out EVERYTHING you can about every single detail before accepting a spot in a PhD program. You dont want to be in a situation where you have to worry about money in addition to the rest.", "Permalink": "https://www.reddit.com/by_id/t3_5osfx6.json"}, "221": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1484837824, "Score": 7, "Body": "Don't give up. The night is darkest before the dawn - a lot of PhDs like us stumble at the 3 year mark. I'm starting my fourth year with a topic/project change. It's not the best feeling, and scholarship money is running out, but I will not give up. \n\nYou know why? Because I am a finisher. You are too. And even if you feel like this isn't where you're going to work, smash it out. Then with this chapter of your life satisfactorily closed, look ahead. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "222": {"Subreddit": "PhD", "Author": "pterodicktyl", "Date": 1484846306, "Score": 2, "Body": "I feel like I could have written this myself. I think it's a common feeling, and I would take solace in that. Just stick with it, and it will be worth it in the end.", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "223": {"Subreddit": "PhD", "Author": "throwawaysiesphd", "Date": 1484850078, "Score": 1, "Body": "I'm in the same boat as you, just a few months ahead. The situation is so similar it makes me wonder if we're from the same country, well at least probably in Europe. My scholarship actually did run out, and while I had no publications related to my thesis, I had a few results and was on the cusp of getting more. What I did was use my network to move to a different supervisor in a different country while working on the same stuff. She managed to find me some funding that I can survive on, so in that sense I got lucky. I also had some money in reserve. We're now co-authoring papers and have a few more lined up. \n\nI guess in the end it all depends on your circumstances. If 3 years of full-time work on your PhD didn't get it done I think you'll have a hard time doing it in your \"spare\" time while juggling a full-time job. That's why I continued. I don't know what part-time work would be available that could make use of your education but if anyone knows I am interested. If your parents are so horrified by you dropping it maybe they should pitch in or at least give you free rent.\n\nAlso, in my experience, if your supervisors like you or feel you are a worthy investment, they will find money for you from projects. I've seen this happen to other students and it also happened to me on two separate occasions. On the other hand I've also been in situations where some people were happy to have me work for them while they put nothing on the table. Can't explain the latter situation but I guess it's case by case.", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "224": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1484852377, "Score": 2, "Body": "&gt;Is is considered bad taste to email the person who's decided to take me on and ask if it's possible to see the possible funding package before deciding?\n\nNo. It is 'bad taste' for an advisor to have a Ph.D. student work for them without funding. Depending on your field, you will also need resources to conduct research. If there isn't enough funding to take you on as a research assistant, then there isn't enough money to adequately fund your project. Do not go into a Ph.D. unfunded, bottom line.", "Permalink": "https://www.reddit.com/by_id/t3_5osfx6.json"}, "225": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1484854829, "Score": -1, "Body": "Drop it.  It isn't worth it. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "226": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1484861967, "Score": 2, "Body": "What field were you in and what made you quit?", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "227": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1484862003, "Score": 2, "Body": "I notice a lot of your posts are like that, what's your deal?", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "228": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1484864630, "Score": 5, "Body": "if everyone understands that online PhD is worthless, it will stay worthless.", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "229": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1484865907, "Score": 6, "Body": "Congrats bro, it's nice to know that I could quit it'd be ok.", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "230": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1484866446, "Score": 16, "Body": "Good for you - a much better choice than swimming farther out into deeper water when you are already miserable with stress and anxiety. As strange as it sounds, sometimes it takes strength to know when to turn back from something like this.", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "231": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1484867008, "Score": 1, "Body": "My issue is that they still get to put a phd after their name. People don't understand that it was online rather than at a university. They should get a different title. ", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "232": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484867985, "Score": 2, "Body": "Not everyone is in research that requires lab work. A lot of people that do humanities based PhDs are always going to be working completely digitally. I know people who have done this while in email contact with supervisors. Many industry based PhDs are 100% off campus too. These two groups are still doing research and publishing though so maybe you're talking about a different program that we don't have in Australia.", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "233": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1484870353, "Score": 3, "Body": "If you think that letters after your name is what adds value after a PhD, you are doing it wrong.", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "234": {"Subreddit": "PhD", "Author": "AWeezer1", "Date": 1484873876, "Score": 2, "Body": "PhDs are the highest academic merit for a reason, but life will go on outside if you choose to quit. Do you think you have the data you need to write a thesis? It doesn't have to be perfect, as long as you can defend any conclusions you do make and your methodology is robust.\n\nIf you can think clearly and write out what conclusions you can make, your thesis will start to take shape. Ask your supervisor for a meeting to go through this list and ask them what they honestly think. Once you know this much you'll be in a much better position to make a decision.\n\nUltimately a PhD is just a trophy for your CV. Without it you'll probably do fine, especially if you plan to leave academia, but it would be foolish to quit now without giving it due consideration and removing emotion from the equation, at least for now.", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "235": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1484876883, "Score": 2, "Body": "It means nothing where a PhD matters most, academia. No R1 (or even a lower tier school) would accept someone who got a PhD online.\n\nIf you're worried about what everyone else outside academia thinks, I'd suggest an MBA, far higher earnings potential.", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "236": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1484877039, "Score": 1, "Body": "It's 4-6 years of your life. You need funding, and you need it in writing.\n\nAlso a school that doesn't financially support you is also less likely to show support in other ways.", "Permalink": "https://www.reddit.com/by_id/t3_5osfx6.json"}, "237": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1484883287, "Score": 3, "Body": "Good on you for putting your health and wellbeing first. I don't know that I'd be brave enough to make the same decision if I needed to. ", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "238": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1484884892, "Score": 1, "Body": "Giving honest advice. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "239": {"Subreddit": "PhD", "Author": "import_social-wit", "Date": 1484895983, "Score": 2, "Body": "I'm in CS, but generally 8000/month or more not including relocation/housing is what people in my lab usually get offered.", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "240": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1484898737, "Score": 2, "Body": "&gt; chronic anxiety and stress\n\nAlso, probably,\n\n&gt; slave driver of a supervisor", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "241": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1484905613, "Score": 2, "Body": "What's your story that you're discouraging everyone from academia?", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "242": {"Subreddit": "PhD", "Author": "Cibex", "Date": 1484914608, "Score": 1, "Body": "Yeah I was interdisciplinary between ecology and engineering looking at energetics of animal movement at altitude. ", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "243": {"Subreddit": "PhD", "Author": "Cibex", "Date": 1484914634, "Score": 2, "Body": "I feel so much better and have actually had a decent night sleep for the first time in months. ", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "244": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1484919199, "Score": 2, "Body": "I have a job in physics as a PhD candidate and my full time salary for 2 months would be $8142 USD.", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "245": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1484921349, "Score": 1, "Body": "I am pretty sure an Online PhD is a scam... ", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "246": {"Subreddit": "PhD", "Author": "FidelSpasstro", "Date": 1484928250, "Score": 5, "Body": "What area are you in?\n\nThis is probably somewhat common and down to bad luck. ", "Permalink": "https://www.reddit.com/by_id/t3_5p47lm.json"}, "247": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1484931623, "Score": 3, "Body": "It should be your advisor's role to gently nudge you towards originality. Thank being said, you got it right with your title. Second year isn't easy. \n\nWhen you read these articles that are in your subject area, continually ask yourself if you agree with them. If you don't, start collecting your objections. This will help you position yourself in... well in my area we call it historiography, but whatever the intellectual debates in your field are called. \n\nEarning a PhD is not easy. There are plenty of times I've wondered what I've gotten myself into. But I realized that persevering through the down times have delivered me to some pretty amazing places, not just in my work, but in my life too. \n\nBest of luck. ", "Permalink": "https://www.reddit.com/by_id/t3_5p47lm.json"}, "248": {"Subreddit": "PhD", "Author": "haffi112", "Date": 1484936812, "Score": 3, "Body": "I can only echo what /u/FreebaseMcGee says: try to talk more with your supervisor. He is somewhat responsible for helping you understand what are the open problems in your area or the topics which people in your field care about.\n\nIf you feel that you are repeatedly running into things which have already been done before then at least you are heading for the boundary of knowledge where you can, finally, contribute.", "Permalink": "https://www.reddit.com/by_id/t3_5p47lm.json"}, "249": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1484947491, "Score": 1, "Body": "My story is that I'm a useless fuck.  Not very interesting. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "250": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1484947658, "Score": 2, "Body": "So why is a useless fuck discouraging others from realizing their ambitions?", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "251": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1484948231, "Score": 1, "Body": "Maybe it will help someone avoid the mistakes I made, that's all.  If OP doesn't find it useful, they can ignore it. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "252": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1484978860, "Score": 1, "Body": "Not if you're a provider of some kind. Clients/patients don't ask about the phd. They see it after your name and in your profile on the website and trust you with treatment options. That's what's frustrating me. I'm giving up a salary to pursue higher education. But when I graduate I'll look very similar to my colleagues who got their degrees online. We will have the same credentials.  ", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "253": {"Subreddit": "PhD", "Author": "rainonrock", "Date": 1484989000, "Score": 1, "Body": "I agree that the biggest red flag is that you're not passionate about what you are doing. I'm there, about to start my 4th year in my PhD, and I don't really care too much about my main topic. My past 3 years have been depressing, to say the very least. \nGood luck!!", "Permalink": "https://www.reddit.com/by_id/t3_5o47qd.json"}, "254": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1484995637, "Score": 3, "Body": "What happened?", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "255": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1485006078, "Score": 1, "Body": "Where in the world are you from? I have never seen nonsense like this in the US", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "256": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1485014935, "Score": 2, "Body": "Can't you resit? And if you're being funded then how have you spent 100k$? ", "Permalink": "https://www.reddit.com/by_id/t3_5p9mel.json"}, "257": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1485020525, "Score": 1, "Body": "The debt is from undergraduate and masters degrees. And there is an option to retake it, but it's after the application deadline for teaching positions for next year, which means I'd have to at least pay for one year out of pocket and that is far out of my price range. In retrospect, I was panicking quite a bit yesterday when I made this post and failing a section of the exam is not as dire as I initially thought it was, but it's still not ideal by any means. There is actually still a chance I could pass because they do take in to account the pressure we're under when taking the exam, and one historical mishap like the one I made may not be seen as enough of a demerit to give that section of the exam a failing grade. Just have to keep my fingers crossed that I get an understanding reader.", "Permalink": "https://www.reddit.com/by_id/t3_5p9mel.json"}, "258": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1485022848, "Score": 1, "Body": "I wish you luck for your result and all future endeavours. PhD sure can be quite demanding, both mentally as well as in terms of resources. Post here how it went, would love to hear the feedback you got. ", "Permalink": "https://www.reddit.com/by_id/t3_5p9mel.json"}, "259": {"Subreddit": "PhD", "Author": "Gauss-Legendre", "Date": 1485031721, "Score": 1, "Body": "Many astronomy graduate programs do not assume that you have an undergraduate background in astronomy, however astronomy and astrophysics or astrophysics programs typically require that you have an undergraduate degree in physics.\n\nMinoring in astronomy and/or doing astronomy research with a BS in computer science should be more than adequate for admission into an MS or PhD in Astronomy. However, it's important to know that in academic fields such as astronomy and astrophysics it can be considered detrimental to take a gap between academic study and admission into a graduate program especially if the work done during that gap is unrelated to the intended field of study, whereas in computer science and software engineering work experience is typically beneficial.\n\nFor more concrete information on requirements for programs you should look into the admission requirements of prospective schools and talk with the adviser for your physics department or whichever department manages the astronomy minor.", "Permalink": "https://www.reddit.com/by_id/t3_5oh3kh.json"}, "260": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1485038705, "Score": -2, "Body": "tl;dr: dont pursue a PhD ins a demandless area", "Permalink": "https://www.reddit.com/by_id/t3_5p9mel.json"}, "261": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1485119274, "Score": 1, "Body": "I've just updated the photos of panties I currently have. Also, anything that's listed on my subreddit is still available. Message me if any pair catches your eye!", "Permalink": "https://www.reddit.com/by_id/t3_5ne53n.json"}, "262": {"Subreddit": "PhD", "Author": "fnasfnar", "Date": 1485123916, "Score": 1, "Body": "Are your notes searchable? Can you export only your notes from all your documents? I think this is the feature I am ultimately looking for.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5h0id9.json"}, "263": {"Subreddit": "PhD", "Author": "ImInTheFutureAlso", "Date": 1485142464, "Score": 5, "Body": "Thank you. Not OP, but I came here for comments like this. I feel so overwhelmed and unhappy. Major third year blues. I'm behind in my thesis, things keep piling up. I'm trying to wade through but don't see the end in sight. I don't want to quit, but I feel really depressed. \n\nThis helped. This helped a lot. Thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "264": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1485143642, "Score": 1, "Body": "No worries, my fellow journeyman/woman. PM me if you need someone to talk to!", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "265": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1485203550, "Score": 5, "Body": "Wow. Very vague question. But. Take margin notes for each. Identify main theme and concepts on first page. Rate them all (from 1 to 4 stars). Put them in order of interest or in a logical order. Isolate interesting  quotations and write them down on a word document, in order. Try to see a structure and fill the blanks between quotations. Do not make any statement in your document not backed by research or quotations. And good luck to you.", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "266": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485203693, "Score": 1, "Body": "thankyou! and sorry for the vagueness. i'm on mobile", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "267": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1485206075, "Score": 2, "Body": "My work is in STEM, so it may be a little different depending on your field. But, in general, your job is not to condense, but to extract the thread of argument. What are the greater themes that have been motivating the authors. What are the relationships between the papers? E.g. \"Henderson says that such and such is impossible, but Johnson shows that it is possible if you solve the second part first\". In the lit review you trying to draw a donut, to set the scene and context fir the hole in the middle, which is where your work will fit. E.g. Grosvenor studied cases with small numbers of x and no y, this gas the benefit that ... but lacks clarity on ... Samuel's studies cases with large y and no x. This is an easier sample to collect but has limited statistical merit. In my work (see chap 3) I study large x and y to give stronger results\". ", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "268": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1485207419, "Score": 2, "Body": "No problemo. Ps: do you use Zotero or Endnote? If not, you should. Have a look at Zotero: it can highlight specific quotations from pdf and save it to so that referencing is done seamlessly in documents you write. \n\nOh! And you could classify your documents with as many keywords as you want. ", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "269": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485208406, "Score": 2, "Body": "thankyou for this! am also STEM so totally applicable. the doughnut analogy is a great way of visualising what i need to do ", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "270": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1485209331, "Score": 7, "Body": "My supervisor is pretty on the ball with this. [I've found a recorded lecture he gave on the subject here.](https://www.youtube.com/watch?v=frYooEN360Q)\n\nI'm submitting my literature review for publication on Thursday so it's all hands on deck right now. Good luck, friend!", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "271": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485209716, "Score": 2, "Body": "congrats on your publication! and thanks for the link ", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "272": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1485210123, "Score": 1, "Body": "Ahh, I'm just submitting it. It's not accepted yet!\n\nI find the best advice to give with a literature review is to find a nice fitting classification of the subject. For example, if you have 50 papers they might fall into four categories. Each category might have a few sub-categories. If you look at this paper [here](http://cs.swan.ac.uk/~csbob/research/star/science/lipsa12visualization.pdf) you'll see a survey of the physical sciences. The classification is nice a simple, splitting the papers by subject (Astronomy, Chemisry, Earth Sciences, and Physics). And then by the type of visualisation (2D or 3D), which is in turn split static and time dependant. \n\nIf you can find a nice classification for your literature then you'll always have stuff to say about the trends in the literature. ", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "273": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1485214247, "Score": 1, "Body": "I would start an annotated bibliography.  Also, Zotero.  Please use Zotero.  It will save your life with organizing research and writing papers.", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "274": {"Subreddit": "PhD", "Author": "Jollyhrothgar", "Date": 1485219398, "Score": 1, "Body": "Good decision. Enjoy the wild world of real life! You might find you like it even more then cloistered academia, =).", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "275": {"Subreddit": "PhD", "Author": "Jollyhrothgar", "Date": 1485219517, "Score": 1, "Body": "Do you want to stay in academia or seek employment elsewhere?", "Permalink": "https://www.reddit.com/by_id/t3_5omsjn.json"}, "276": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1485233906, "Score": 1, "Body": "When I started out, I would read one paper relevant to my research. Since I was new and still learning, I did not have enough knowledge on some of the topics to objectively asses the authors ideas. \n\nI would then pick a couple of papers that used this original paper as a reference. I would then read their comments on the original paper. What was good, what was bad and how could it have been better? This led me to, over time, come up with my own critiques.", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "277": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1485234754, "Score": 2, "Body": "Depends on the city and the company. My friend worked in new york for about 6000 for 2 months. The pay was low but the networking opportunities were really good. He managed to get a really good job right out of school", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "278": {"Subreddit": "PhD", "Author": "jzaiss", "Date": 1485242672, "Score": 1, "Body": "Heyo! I applied last year and did not get funded, so maybe I'm not the go to person on this. However, I am going for it again this year. As far as the budget goes, you should find someone in your department to help you out with that. We have a person in our main office who helps us put together the budgets for this and other proposals and makes sure these get submitted to the college in time for approval, etc. \n\nI haven't found much in the way of examples either. What I did last year was intro, preliminary data, future experiments, and the impact the results will have. Then, of course, you have the timeline, degree program, CVs, etc. that they ask for. Just threw it all together in a single pdf and submitted. Then in May they told me I wasn't selected this time but did provide some really great feedback. \n\nHopefully, this helps somewhat. Sorry, I can't help more! If you find anything useful, let me know! Best of luck to ya. ", "Permalink": "https://www.reddit.com/by_id/t3_5mywgk.json"}, "279": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485253577, "Score": 1, "Body": "discovered Zotero a fortnight ago, Wow! my undergrad would've been so much easier had i known about it!", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "280": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485253702, "Score": 1, "Body": "started using Zotero about 2 weeks ago and can already tell its going to be a lifesaver!! Also downloaded Papership so I can read my zotero files on my iPad on the train into Uni. I think i still need a bit more of a play-around with it to get the most out of its features though. It there any way to search what tags are most commonly used to see if I can pick out any recurring themes?", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "281": {"Subreddit": "PhD", "Author": "alex-dissertation", "Date": 1485256737, "Score": 1, "Body": "feels sorry for you that you didn't come up to the solution yet to your problem. i would definitely suggest you (Like Garlic_aroma) that you should read the lesson again and jot down the main and important points of it and try to summarize them up in one single paragraph and PLEASE DON'T FORGET TO GET PROOFREAD FROM YOUR SENIOR OR ANY EXPERT........ All the Best in the end (Y)", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "282": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1485259494, "Score": 1, "Body": "Shouldn't they be coming up with the projects, and you just provide advice?", "Permalink": "https://www.reddit.com/by_id/t3_5pv0zc.json"}, "283": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485261024, "Score": 2, "Body": "your supervisor is an absolute dude! that video was really useful! Do you know where I can find that SerVis review tool he mentions? had a quick google and can't seem to find it", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "284": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1485262850, "Score": 2, "Body": "So the github repo is available [here](https://github.com/fabian-beck/survis). It depends on how confident you are with LaTeX. All you need to do it fill the .bib file with the latex references of each of the papers (you can download these easily through google scholar).  And then run the python script to update the website. \n\nYou can run it locally on your machine if you don't want to host it on a website. (the github page is fairly comprehensive with instructions).\n\nWhat field is your research in?", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "285": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1485267004, "Score": 4, "Body": "&gt; The **award** package.  Makes your paper win an award, as in \\usepackage[bestpaper]{award}. Options include \"impact\", \"beststudentpaper\", and more; be aware that \"bestpaper\" and \"impact\" are mutually exclusive.  Donald Knuth and Leslie Lamport have extended this package with a \"turing\" award option, but never publicly released their extension;  Philip Roth is said to have asked for a \"nobel\" option.\n\n\n... and other fun LaTeX packages you wish existed.", "Permalink": "https://www.reddit.com/by_id/t3_5pwah3.json"}, "286": {"Subreddit": "PhD", "Author": "kendall-mintcake", "Date": 1485267825, "Score": 2, "Body": "marine biology/ecology. hmm LaTex isn't something I have ANY experience with, i'll look into it! cheers", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "287": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1485270770, "Score": 1, "Body": "Not sure but you can take a look at this: http://ideophone.org/12-zotero-tips-and-techniques/ \nhttps://www.zotero.org/support/tips_and_tricks\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "288": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1485271043, "Score": 1, "Body": "It's a very useful skill to learn. It creates very nice documents and it's not too hard to pick up. \n\nGood luck with the lit review! Feel free to message if you need any help. Having spent the past year heavily involved in mine, then I feel I can offer some good help.", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "289": {"Subreddit": "PhD", "Author": "rorrykeys", "Date": 1485271540, "Score": 1, "Body": "Great clickbait for PhD students. haha\n", "Permalink": "https://www.reddit.com/by_id/t3_5pwah3.json"}, "290": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1485273840, "Score": 2, "Body": "Yes indeed, that's why I felt obligated to tag the title :-)", "Permalink": "https://www.reddit.com/by_id/t3_5pwah3.json"}, "291": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1485292353, "Score": 1, "Body": "**What’s Included for £20**\n-24 hours wear -1 play session -1 gym workout -5 private photos modelling the panties emailed to you -1st class standard shipping\n\n**Extras**\n-£5 for extra days of wear –£5 for 5 more pictures, more explicit –Anything else, just ask! ;)\n\n**Payments Accepted**\n-Bitcoin –Google Wallet –Circle pay –Amazon GC \n\n**Shipping Notes**\n-For £1, you can get Royal Mail tracked/signed for on delivery -For £2, you can get tracked (no signature required) delivery by Hermes. **Since I'm offering this, I cannot be held responsible for lost packages!** Sorry!", "Permalink": "https://www.reddit.com/by_id/t3_5pytfg.json"}, "292": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1485292556, "Score": 1, "Body": "**Check out my \"Details\" post for pricing!**\n\n**Shipping to the US**\nPlease add £5 to the order for regular shipping, £9 for tracked. Thanks!\n\n**Current exchange rates** (according to Google): -£20 ~ $25 -£5 ~ $6.20 -£9 ~ $11.20", "Permalink": "https://www.reddit.com/by_id/t3_5pyu0s.json"}, "293": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1485292922, "Score": 1, "Body": "**What’s Included for £20**\n-24 hours wear -1 play session -1 gym workout -3 private photos modelling the panties emailed to you -1st class standard shipping\n\n**Extras**\n-£5 for extra days of wear –£5 for 5 more pictures, more explicit –Anything else, just ask! ;)\n\n**Payments Accepted**\n-Bitcoin –Google Wallet (UK &amp; US) –Circle pay –Amazon GC \n", "Permalink": "https://www.reddit.com/by_id/t3_5pyvtv.json"}, "294": {"Subreddit": "PhD", "Author": "gutia", "Date": 1485324620, "Score": 1, "Body": "Even a cat can get online PhD https://en.m.wikipedia.org/wiki/List_of_animals_with_fraudulent_diplomas will you be mad at a cat for that? :) \n", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "295": {"Subreddit": "PhD", "Author": "HelperBot_", "Date": 1485324622, "Score": 1, "Body": "Non-Mobile link: https://en.wikipedia.org/wiki/List_of_animals_with_fraudulent_diplomas\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^22558", "Permalink": "https://www.reddit.com/by_id/t3_5ozk0f.json"}, "296": {"Subreddit": "PhD", "Author": "infinite_hedgehog", "Date": 1485339134, "Score": 1, "Body": "OP, I feel exactly the same.\nMy supervisor(s) are very hands-off and i feel that if i ask for help from them, or any one else in the department, everyone will think im weak, stupid and not worth a PhD.\nIm in a hole that just keeps getting deeper :(", "Permalink": "https://www.reddit.com/by_id/t3_5p47lm.json"}, "297": {"Subreddit": "PhD", "Author": "infinite_hedgehog", "Date": 1485341915, "Score": 2, "Body": "That video is fantastic, ive been stuck on my lit review for a while now and its really helped.  Thanks :)", "Permalink": "https://www.reddit.com/by_id/t3_5prcex.json"}, "298": {"Subreddit": "PhD", "Author": "SamaSoft", "Date": 1485385437, "Score": 1, "Body": "Well done for making that decision. I made the same decision to leave my PhD a few weeks ago and I now supervise a small lab within a worldwide biotechnology company and I couldn't be happier! I had anxiety issues which triggered severe stomach problems. Happiness is so important! ", "Permalink": "https://www.reddit.com/by_id/t3_5oyuni.json"}, "299": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1485521163, "Score": 17, "Body": "What you're describing is more or less the recommended way to write a phd. But I can say from experience, you'll need to do a lot more rewriting than you expect. \n\n1) First you'll need to delete the paper introduction and rewrite it as a chapter introduction, which picks up on the previous chapter's work and has a more coherent story about where the dissertation as a whole is going. \n\n2) Then you'll need to delete the background/related work sections, and move them to a separate chapter (usually the second chapter) and then add it to all the other related work that you have. Your aim in this chapter is to draw a donut of related work, the hole in the middle is where your work fits. With a complete background chapter, you'll need to now rework all the references to related work in your main chapters to the background chapter, and again integrate them into the larger argument of the dissertation rather than the smaller (and simpler argument) of the paper(s). \n\n3) Then you'll need to expand all the text to make it a little bit more accessible. Papers are typically aimed at an expert audience who are knowledgable of the field the related work. PhD dissertations should be aimed at a good masters student level who is about to start phd work. So the audience is quite different and a lot more detail is needed. \n\n4) Then you'll need to write a chapter conclusion, which is bigger than a paper conclusion and again fits in the larger argument of the dissertation (note: conclusion is not a summary, it should include \"concluding\" statements. Something like: \"In this chapter I hypothesised that X and proved that Y. I therefore CONCLUDE that X is is function of Y\". )\n\n5) And you may need to redo all of your graphs/figures for A4 format (papers in my field are typically 2 column format)\n\nOnce you've done all that work, your chapter will be pretty unrecognizable from the paper. If you'd like to see this in action I can provide links. ", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "300": {"Subreddit": "PhD", "Author": "Ahkce", "Date": 1485522109, "Score": 1, "Body": "This is very helpful. I suppose it's all about context, context of chapter in the dissertation is different. It makes sense and I'd love a link to see this in action. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "301": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1485532017, "Score": 1, "Body": "Many people who have included papers as chapters in their theses have also published them as books, they are usually costly than your usual textbooks but i were you and wanted to see how to do it I'd buy one of those books if they're not available in the university library, or you can always request your library to include it in their stock if you have time on your hands. ", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "302": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1485532070, "Score": 1, "Body": "This is going to be very helpful to a lot of people, thanks. I wish I had gold to give :( ", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "303": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1485532205, "Score": 5, "Body": "Wouldn't it be nice to post an abstract of the blog entry here? It seems all you're interested is getting hits on your blog entry, I may be wrong but that's how it appears to me.", "Permalink": "https://www.reddit.com/by_id/t3_5qhcjc.json"}, "304": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1485538710, "Score": 2, "Body": "Yes, seconded", "Permalink": "https://www.reddit.com/by_id/t3_5qhcjc.json"}, "305": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1485544310, "Score": 2, "Body": "At least in my field universities will pay for expenses for interviews, so although GRE and applications cost a fortune, interviews were paid for. It's worth looking into if it is something influencing your decision. \n\nOtherwise just staying active, doing research, getting to know lots of people in the field (potential supervisors in particular), go to conferences if you can. ", "Permalink": "https://www.reddit.com/by_id/t3_5qid26.json"}, "306": {"Subreddit": "PhD", "Author": "MajoranaFermionCakes", "Date": 1485549958, "Score": 2, "Body": "In my field it's normal. I have a friend who hasn't even begun writing up his thesis and he has already accepted a postdoc fellowship. Most folks I know are job-hunting months before the end of the PhD is defended.", "Permalink": "https://www.reddit.com/by_id/t3_5npa22.json"}, "307": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1485551371, "Score": 4, "Body": "It depends on the rules of your university.", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "308": {"Subreddit": "PhD", "Author": "peterthebigfatcat", "Date": 1485556503, "Score": 1, "Body": "You can apply for financial aid for the GRE and schools will fly you out / put you up for interviews. ", "Permalink": "https://www.reddit.com/by_id/t3_5qid26.json"}, "309": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1485557512, "Score": 1, "Body": "I think this will be field/institution/department specific. Im finishing my dissertation this semester and it is literally three published or publishable manuscripts bookended by a lit review/introduction and conclusion. This is it has been done in my department for a good while (bioscience department at a state flagship for reference). I would suggest to those wondering: look up and download dissertations of recently graduated students from your department, especially those who had similar committee members, for reference of what layouts have been signed off on.", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "310": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1485565668, "Score": 1, "Body": "This is the answer OP. ", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "311": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1485573077, "Score": 1, "Body": "Thanks for this!", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "312": {"Subreddit": "PhD", "Author": "caz-", "Date": 1485590630, "Score": 2, "Body": "Mine looked something like:\n\n&gt;In the work on which this chapter is based [97], it was shown that...\n\nfollowed by a *very* slightly altered version of the work referenced by 97. Then, the paper was also attached, in its entirety, to the end of the thesis.", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "313": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1485591803, "Score": 1, "Body": "Most universities have a digital repository of their graduate theses these days; just search for some previous members of your research group or from adjacent research groups to see how it's done.", "Permalink": "https://www.reddit.com/by_id/t3_5qginx.json"}, "314": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1485610807, "Score": 1, "Body": "A lot of students who did very well in certain subject during high school or even their undergraduate studies think that they \"love\" the subject and they really get it, however a PhD is a completely different story, it requires a lot of thinking ability and a lot of hard work, if you lack in any one of those areas it's going to be a nightmare. I am telling this from experience. I did very well in Physics classes even in my MS but PhD research is at whole another level. I had a very very hard time during my PhD (I am about to defend now and hoping it will be accepted). As a TA I meet students who say they love science and they did this and that in high school and built this and that but often struggle with most fundamental physics concepts in their undergrad and often drop out. I struggled a lot in my PhD, a lot, but I just kept going and going and going and kept doing the best I could (I often had thoughts of quitting). It is very very important to publish, so publish as much as you can, so even if your committee doesnt respect your work you will have publications to show that your work was worthwhile.", "Permalink": "https://www.reddit.com/by_id/t3_5ow6r4.json"}, "315": {"Subreddit": "PhD", "Author": "igrewold", "Date": 1485619103, "Score": 1, "Body": "You are welcome &amp; good luck.", "Permalink": "https://www.reddit.com/by_id/t3_5knmbe.json"}, "316": {"Subreddit": "PhD", "Author": "ursath", "Date": 1485719144, "Score": 2, "Body": "I can't actually make out from your text why you want to drop out. Does the apprenticeship require you to do so? If you can, complete the PhD. If you have enough transferable skills, you are just as employable elsewhere- in fact, most PhD students end up outside of academia anyway. \n\nConsider asking for part-time options or ask to delay the start of the apprenticeship by 6 months.", "Permalink": "https://www.reddit.com/by_id/t3_5qtxu7.json"}, "317": {"Subreddit": "PhD", "Author": "fred24", "Date": 1485720946, "Score": 1, "Body": "Thank you for your answer. Yes, the apprenticeship requires you to drop out.\nI didn't want to sound pretentious, but I guess you are right: I will ask to delay the start of the apprenticeship as you suggested (they do not accept part-time).", "Permalink": "https://www.reddit.com/by_id/t3_5qtxu7.json"}, "318": {"Subreddit": "PhD", "Author": "ursath", "Date": 1485729161, "Score": 3, "Body": "I would definitely stick to the PhD. You have nearly completed it, and you say that you \"frankly love this kind of work\"*. That your supervisor is subpar will only last for 1 more year. Consider:\n1. Delayed/No apprenticeship, PhD later, job opportunities with PhD\n2. No PhD, apprenticeship now, no job opportunities requiring PhD\n\nI am not saying that no one should ever drop out of course, but you saying you really enjoy the work makes me think you would live to regret it. Good luck with your decision, I know it's never easy!\n\n*not sure which one you were referring to, my understanding was that you  meant the work at the consultancy firm. Apologies if I misunderstood.\n\nPS: check out academia.stackexchange. There are loads of questions like yours, maybe you will find more help there.", "Permalink": "https://www.reddit.com/by_id/t3_5qtxu7.json"}, "319": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1485731515, "Score": 1, "Body": "https://www.amazon.com/Surviving-Your-Stupid-Decision-School/dp/0307589447", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "320": {"Subreddit": "PhD", "Author": "_pheebs_8", "Date": 1485732777, "Score": 1, "Body": "Pretty proud of surviving the boys at my british school! Im new too, I posted a few weeks ago about being terrified and people were really lovely to me and there was some great advice. Scroll down and look for 'The Fear?'. Allthebest! ", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "321": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1485745973, "Score": -5, "Body": "Yes, but you would not want to.", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "322": {"Subreddit": "PhD", "Author": "meepinbell", "Date": 1485746530, "Score": 1, "Body": "Why is that?", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "323": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1485752877, "Score": 3, "Body": "He probably means considerably lower pay, crappy short term post doc contracts, and lack of positions in most countries plus inundated job market.", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "324": {"Subreddit": "PhD", "Author": "fred24", "Date": 1485766437, "Score": 1, "Body": "Thank you kind stranger. \n1) You are correct (sorry for the incoherent rambling), I was referring to the work at the consultancy firm. I love it, but it is really underpaid (when compared to other countries, in my homeland it is an average) \n2) More importantly, there are no growth perspectives (I was raised to the status of \"Project Manager\" but ,apart from the title and the longer working hours, there was no monetary benefit).\n2) In 1 year I will forcefully be obliged to leave the firm, because my tutor would be legally obliged to raise my salary by 50%.", "Permalink": "https://www.reddit.com/by_id/t3_5qtxu7.json"}, "325": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1485775536, "Score": 1, "Body": "Think of it more of a marathon, than a sprint, don't go out hard burning the candle at both ends, doing 14 hr days. Take your time at the start, plan realistic goals and get into a peer group with people a year or two ahead, so you have decent peer support to bounce ideas and issue across.\n\nThe best thing I did in my first year was read 2+ publications every single working day, first hour of every day after doing emails and planning then reading and pondering.", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "326": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1485777886, "Score": 1, "Body": "1) Treat it like a job. Do 9am-5pm at your desk, every week day, working productively. No facebook, no newspaper. No extra long lunches. Do not work late nights/weekends unless ABSOLUTELY necessary. \n\n2) Keep yourself accountable for progress. Each week send an email to your supervisor, \"this is what I did, this is what I plan to do\". Before you send your email, check against last week to see how you did. \n\n3) This is a good book. It's UK centric which seems like it will help you: https://www.amazon.com/How-get-PhD-handbook-supervisors/dp/0335242022\n\n4) This is another good book: https://www.amazon.co.uk/PhD-Not-Enough-Survival-Science/dp/0465022227/ref=sr_1_sc_1?ie=UTF8&amp;qid=1485777868&amp;sr=8-1-spell&amp;keywords=a+phd+isnot+enough\n", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "327": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1485779615, "Score": 2, "Body": "What a narrow minded answer. ", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "328": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1485779783, "Score": 3, "Body": "Yes.  You might have to fill out some more paperwork, but that's just a minor formality after they've already decided they want to hire you.", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "329": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1485780579, "Score": 2, "Body": "Yes, I agree, but it's pretty similar to the US, except depending on the country and the field and the position, some salaries are a bit higher than the US.", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "330": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1485802498, "Score": 6, "Body": "sounds like the dumbest comps format ever", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "331": {"Subreddit": "PhD", "Author": "Wowplays", "Date": 1485803286, "Score": 2, "Body": "it's from the school of thought that \"I had to do it this way, so you have to do it that way too!\" at least let me take a references sheet in for Christ's sake!", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "332": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1485804610, "Score": 1, "Body": "In my field/university, we see last years questions, but not this years questions. Nothing is allowed in, but the responses are evaluated based on how well you respond - not how well you memorized bunch of shit.", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "333": {"Subreddit": "PhD", "Author": "Playful_PhD", "Date": 1485808503, "Score": 4, "Body": "I did an American PhD and post doc'ed in the UK. They like American PhDs bc we go to school so much longer than European PhDs. And I found the salary comparable to US post-docs- and MUCH better work-life balance.", "Permalink": "https://www.reddit.com/by_id/t3_5qy8fx.json"}, "334": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1485814738, "Score": 2, "Body": "That format makes absolutely no sense. How do you learn anything?", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "335": {"Subreddit": "PhD", "Author": "Wowplays", "Date": 1485818057, "Score": 1, "Body": "We get the 6 questions ahead of time and have about a 2 months to write, research, and memorize it all. I get the premise of the questions but I don't understand the point of memorization. I feel like it's hazing ", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "336": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1485842684, "Score": 2, "Body": "Pro tip? Change schools, that exam format is absurd ", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "337": {"Subreddit": "PhD", "Author": "Wowplays", "Date": 1485843543, "Score": 1, "Body": "I would love to, but the other school in my area has a similar format, they don't give you the questions but they let you take a reference sheet in.  I don't really know which is worse!", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "338": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1485854807, "Score": 1, "Body": "Its a war of attrition - just survive until the end and you will come out with the degree", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}}