{"0": {"Subreddit": "PhD", "Author": "dpositivelectron", "Date": 1477998735, "Score": 1, "Body": "I didn't define my research question properly. I didn't understand what actually is my goal. I had no experience coming into my PhD in the field am in right now and screwed my first year royally. My supervisor has not much experience in what I am doing and never really showed me or even disagreed/agreed with me in how I should be going. \n\nWhat would I have done differently? First and foremost thing to do is think within the bounds of a manuscript. Whatever you do, you do it for either publishing it or patenting. You got to be clear on the story of your manuscript or at least the pith of it. You have to have an idea about the sub-sections and know the types of graphs that are gonna be inside. This may sound regressive to some but I think however path breaking your research might be, it is important to drill in organizational skills.\n\nHowever good or bad your PhD supervisor might be, PhD is all about taking responsibility. I am glad that some students have excellent support system, but, from my experience I am clear that most of us are on our own. The sooner we realize this the better we can perform. \n\nThe most important thing in a PhD is getting a grip on perspective. Whats the burning question in your field? What actually has not been answered? Can you make a process better? Can you create a completely new process? If so, what are the criteria and what exactly are the challenges? Though these questions can sound obvious, IMO, they are not. Interact with people who are truly innovating and imbibe as much as you can. I would have interacted more, formulated my questions clearly.\n\nNow I have a year more. I have plans for the whole year. Let us see how this goes.", "Permalink": "https://www.reddit.com/by_id/t3_4r2xeb.json"}, "1": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1478006610, "Score": 1, "Body": "Welcome! Great to hear your story. I have some thoughts. \n\nFirst, please define your acronyms. Not everyone knows what NUS is, nor will they be acquainted with MOE. You may be well versed with these acronyms, but a person who has grown up in Boston, for example, will not have the faintest idea what NUS is. \n\nSecond, a PhD is definitely within reach after a degree and work experience. I think academic scores matter most, followed closely by the course you took for undergrad. Work experience, from my experience, doesn't matter quite as much, though of course it is a value add. More appealing is being involved in published articles, whether it is being a research assistant and getting authorship that way, or some other method of being relevant (ie translating seminal work from Chinese to English). \n\nPhD is about knowing how good you will be as a full academic and expert in your field. These will help you show your value to prospective institutions.", "Permalink": "https://www.reddit.com/by_id/t3_5aiacm.json"}, "2": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1478006705, "Score": 1, "Body": "Yes you will be able to apply. Provided you manage to get a job in a related field and publish in that position, you will have a strong application. If you have an industry position during that period that does not allow you to publish then you will have a good application but not as strong as if you publish.", "Permalink": "https://www.reddit.com/by_id/t3_5aiacm.json"}, "3": {"Subreddit": "PhD", "Author": "drainbox", "Date": 1478013307, "Score": 1, "Body": "thank you! \nnus is national university of singapore and an moe grant basically means that the government of singapore subsidizes your education in exchange for you signing a contract which obliges you to work in singapore for 3 years following graduation. ", "Permalink": "https://www.reddit.com/by_id/t3_5aiacm.json"}, "4": {"Subreddit": "PhD", "Author": "drainbox", "Date": 1478013396, "Score": 1, "Body": "thank you. will it be a problem to start a PhD with only an undergrad course completed + work experience? I mean like will I be able to cope up?", "Permalink": "https://www.reddit.com/by_id/t3_5aiacm.json"}, "5": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1478016558, "Score": 1, "Body": "I think you will as your work experience and education are in Singapore. I'm half Singaporean and live in Australia and, from what I hear from my family, the work hours over there are intense. That's the biggest shock to most people going into a PhD. In the UK and the US you will probably be expected to work 40-60 hours a week on your PhD. About 80-100% of this will be on campus. So it's just a question of if you can handle that.", "Permalink": "https://www.reddit.com/by_id/t3_5aiacm.json"}, "6": {"Subreddit": "PhD", "Author": "okimbo", "Date": 1478025439, "Score": 4, "Body": "A PhD is a big commitment and I would not start one if you are unsure what to do. I didn't know what to do and went straight into a PhD program that I will be leaving after 1 1/2 years... \n\nMake sure a PhD is something you really want to do otherwise it wont be worth it in my opinion. If you are hesitant about it then I recommend working in a lab until you are sure you want to do  a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5ajf0a.json"}, "7": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1478034757, "Score": 2, "Body": "If you want to get into a top program then you will most likely need publications and a good/great GPA. The only other thing that I think matters is the GRE if they have that in Canada.\n\nGiven the difficulty in finding a funded program in Canada or the closest country (the US) I would suggest thinking about why you want a PhD. It is not worth doing if you are solely studying to have the degree. You already have a career in the industry, why do a PhD now? If there are positions that are closed to you unless you have a PhD then go for it or if you want to go into academia now. I will say though that the income loss and career set back of doing a PhD are normally not worth the pay increase afterwards and tenure track positions are few and far between.\n\nI'm not trying to put you off here. It's just important to evaluate why you're doing a PhD. It's a rough 5-8 years in Canada so you want a good reason to do it.", "Permalink": "https://www.reddit.com/by_id/t3_5al0q4.json"}, "8": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1478037531, "Score": 1, "Body": "Publications in C/D tier or \"pay to play\" journals are not likely to help (they might even hurt in some cases). Publications in A or B journals would give OP (or anyone really) a huge boost, but almost no one has those going into a business PhD (Are you applying to Business or Computer Science, the last sentence sounded business but the second paragraph sounded computer science), and it's unlikely OP will be able to get them given that he has zero research experience as of right now.  \nIt also doesn't help that your grades were not that high. Was your relative class ranking high at least?", "Permalink": "https://www.reddit.com/by_id/t3_5al0q4.json"}, "9": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1478038481, "Score": 2, "Body": "Yeah you should probably wait, maybe 2 years, or 10, or 60. It might be possible to get accepted and defer an award though, or change your mind after the fact and turn down an offer, so applying doesn't necessarily amount to a commitment. I wouldn't bother rushing for it if I were you though. ", "Permalink": "https://www.reddit.com/by_id/t3_5ajf0a.json"}, "10": {"Subreddit": "PhD", "Author": "shekib82", "Date": 1478041510, "Score": 1, "Body": "no neither my grades nor my relative class ranking were high. And I am looking to get into a CS program.", "Permalink": "https://www.reddit.com/by_id/t3_5al0q4.json"}, "11": {"Subreddit": "PhD", "Author": "shekib82", "Date": 1478043152, "Score": 1, "Body": "just to clarify a few things:\nMy grades weren't high, but they weren't low neither. My GPA was 3.2 over 4 (80 over 100) and I was in the most challenging program at university (Computer and Communications Engineering).\n\nNow in my MBA I am probably in the upper 10 of a class of 31. And I have the best grades on the difficult subjects.", "Permalink": "https://www.reddit.com/by_id/t3_5al0q4.json"}, "12": {"Subreddit": "PhD", "Author": "shekib82", "Date": 1478043195, "Score": 1, "Body": "yes as a business student, this certainly is a calculation that I have made and I am not sure that it makes financial sense. I just like to work in research.", "Permalink": "https://www.reddit.com/by_id/t3_5al0q4.json"}, "13": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1478049515, "Score": 4, "Body": "A PhD is an apprenticeship in academic research, so a lack of research experience should not deter you. (This may depend on your location.)\n\nHowever, I echo the advice here that a PhD isn't the best idea if you don't have a strong interest in an area and a good idea of what you want to do. I don't think you have to be an expert in a field to do a PhD; my own project was a suggestion by my supervisor that I happened to really like. It's study, after all, supervised by a teacher. But doing a PhD for the lack any of better options is a recipe for misery. ", "Permalink": "https://www.reddit.com/by_id/t3_5ajf0a.json"}, "14": {"Subreddit": "PhD", "Author": "dpositivelectron", "Date": 1478177624, "Score": 3, "Body": "Hey, you got to choose the group wisely and prepare interviews in such a way to suggest that you can contribute to their research . For instance, your solidstatechem experience might come handy in synthesizing hydrogen storage materials. May be you can read some review papers on the particular applications (hydrogen storage, graphene synthesis whatever) and find how you can connect your own research experiences to them. \n\nHowever, if you think a PhD might be less stressful than working in an industry, think again. Wish you loads of luck and success in your job search :)", "Permalink": "https://www.reddit.com/by_id/t3_5awei3.json"}, "15": {"Subreddit": "PhD", "Author": "inafewminutess", "Date": 1478183420, "Score": 5, "Body": "Sounds like a silly reason to get married. She can keep publishing under her maiden name, even after you get married.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "16": {"Subreddit": "PhD", "Author": "BandyChalice", "Date": 1478183616, "Score": 1, "Body": "So she could take my name, but then continue to publish under her maiden name?", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "17": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1478184668, "Score": 3, "Body": "Just do it. Just fucking do it. Even if you suck at it. 90% of the time it'll end up being easier than you thought.", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "18": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1478184728, "Score": 2, "Body": "Yes. She does not even have to take your name.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "19": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1478184947, "Score": 2, "Body": "I understand her predicament having just gone through it. In my opinion, it is better to publish in only one name in most fields - so that people can track your work. However, if you were to get divorced she would face this issue again. Honestly, I think it shouldn't matter in terms of getting married. She can always keep her maiden name professionally and married name in her private life if it is a huge issue.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "20": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1478185099, "Score": 1, "Body": "I got a puppy during my masters degree, and it was A LOT of work. I still have him and am now in my final year of phd. I honestly don't think I could have done it without my husband. However, I don't think I could have made it through graduate school without my dog. I have no regrets for getting him.", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "21": {"Subreddit": "PhD", "Author": "BandyChalice", "Date": 1478185467, "Score": 2, "Body": "Thats what I'm thinking. She is set on if she takes my name after she publishes it would ruin her career. However I am trying to explain to her that if she puts all of her professional work in her name and takes my name privately when we get married that there wouldn't be any problem. Unless I am actually wrong and it would ruin her?", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "22": {"Subreddit": "PhD", "Author": "often_oblivious", "Date": 1478186711, "Score": 1, "Body": "Plenty of people do exactly this.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "23": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1478187454, "Score": 1, "Body": "You can publish under any name that *you* want to publish under. It does not necessarily need to be the legal name. Should probably be a name with which you were at one point associated with though. If your SO is in a field that also has a license issued by the government (doctor/lawyer come to mind) then a little bit more thought is required.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "24": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1478187701, "Score": 2, "Body": "1) about a week for my primary and my associate supervisors. About 2 weeks for my co-supervisor.\n\n2) write something else. Keep reading. ", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "25": {"Subreddit": "PhD", "Author": "demosthenes83", "Date": 1478187711, "Score": 1, "Body": "My wife ran into this. We ended up getting married before her masters thesis was finished, and everything subsequent is also under her married name. Having publications under multiple names really is inconvenient for Academia.\n\nThat said, getting married for that reason is a pretty terrible idea IMO. Obviously you don't want to get married now-and if you don't completely want to get married don't! Still, presuming you're currently living together I'm not sure how finances are relevant-you'll likely see a slight tax benefit in your current situation.\n\nAnyways, as has been said, there is no problem continuing to use one name for publications and another in her personal life. She never has to take your name in any case. I know several professional women who never took their husband's name mostly for professional reasons.\n\nAnyways, there are options. Getting married for that reason is a bad idea.", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "26": {"Subreddit": "PhD", "Author": "bobwoodshed", "Date": 1478188296, "Score": 1, "Body": "My mentor does this.  Her married name is also pretty generic, so publishing under her maiden name is actually advantageous.  ", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "27": {"Subreddit": "PhD", "Author": "dpositivelectron", "Date": 1478190637, "Score": 2, "Body": "1) Anywhere from 2 months to 3 months and more\n2) Start doing my next set of experiments. Keep writing. \n\nThe idea is to never give your advisor a break. Give him/her deadlines and keep pushing. ", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "28": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1478192536, "Score": 2, "Body": "This. Particularly that doing a PhD is stressful and if you need less stress in your life, do not do a PhD. Also, doing a PhD because you haven't found a job is not the right reason. It's a long term commitment to very little pay and a lot of stress and long hours. Youre better off waiting to find the job.", "Permalink": "https://www.reddit.com/by_id/t3_5awei3.json"}, "29": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1478202659, "Score": 1, "Body": "yes that should be fine too", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "30": {"Subreddit": "PhD", "Author": "Aumanidol", "Date": 1478205764, "Score": 1, "Body": "the one with 45 papers is my new hero.", "Permalink": "https://www.reddit.com/by_id/t3_59xrsq.json"}, "31": {"Subreddit": "PhD", "Author": "bobwoodshed", "Date": 1478207861, "Score": 1, "Body": "I don't have a quote that motivates me, but I look at [this comic](http://cdn.slowrobot.com/10172012011754.jpeg) when I'm feeling down and it puts me in a better mood.  ", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "32": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1478225783, "Score": 1, "Body": "No, it wouldn't matter then ", "Permalink": "https://www.reddit.com/by_id/t3_5awz10.json"}, "33": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1478226010, "Score": 1, "Body": "Thanks guys! I'm working on my dissertation proposal at the moment and have written over 40 pages without any edits in over 6 weeks. I'm trying to keep busy running another experiment, but it's aggravating bc I would like to make progress on my proposal and actually graduate this next year.", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "34": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1478251233, "Score": 3, "Body": "Does your institution have any policies on this? When i did mine there were outlines for supervisors that had to be followed, timely feedback was one requirement. There may or may not be, worth having a look.", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "35": {"Subreddit": "PhD", "Author": "Dr_Jerkoff", "Date": 1478268031, "Score": 2, "Body": "While I find your situation unfair and unfortunate, I want to avoid any unjustified preconceptions since I have only your side of the story. From what I can gather, you're in a department which is cutthroat with a lot of backstabbing and sabotaging. Sadly this is a common problem. There're many, many people who wear a mask who will throw you under the bus at the first opportunity if it advances their own careers. \n\nI think you have a few options:\n\n1. Find another supervisor, or an associate supervisor, who's working in an area of your interest *and who has a history of publications and supervising successful PhD candidates*. I think your major downfall was letting your familiarity with a certain clinician sway your choice of a supervisor, and now you're paying the price.\n2. Change institution to find what you want, as in start afresh. It seems your current institution may be plagued by some deep seated culture issues which cannot be resolved by the addition of a new supervisor. When I started my PhD I took the exact opposite approach as you - I sought out people at the end of their PhD and asked them what made their experience a productive one. Then I approached the supervisors with the best track record, both in publications and supervising students. Keep in mind that, while you want to form good professional relationships with people, your main goal is the three letters after your name. If you cannot be in an environment which gets you there, the connections you make during research are of marginal value.\n3. Quit totally and go back to clinical medicine. It seems that you enjoyed your time with your supervisor in a clinical context. You have a major advantage that most PhD candidates in the sciences don't - you have an MD. This means you have the ability to find an alternative means of earning income besides in academia, and even do research part time if you choose. Take some time off, save money, search for other PhD opportunities. You're still early in your journey and it's not too late to switch strategies.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_5b2sd4.json"}, "36": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1478282108, "Score": 2, "Body": "Can you achieve your career goals without the PhD? Can you do clinical research and publish with the MD? You might be happier finding a paid position. If you stick with the PhD, then I suggest finding a new advisor. You can do surveys and statistical analyses and publish without your advisor, but setting up any experiment/trial to include in your dissertation might be impossible.\n\nWhen working with people, set the expectations, roles, and responsibilities out before joining their project, so you can expect to get your name on the paper.\n\nI'm near the end of a PhD in sciences - not sure if I'm giving the best advice.", "Permalink": "https://www.reddit.com/by_id/t3_5b2sd4.json"}, "37": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1478283084, "Score": 1, "Body": "I think your advisor is wrong about not submitting to lower impact journals if rejected from high impact journals. Its better to have it on the record somewhere than to throw all that work away - you'll never graduate without your name out there. There are plenty of respectable, legitimate journals with real science in them with impact factors 2-4. The lower impact factor doesn't mean it was bad research, it just means it doesn't have broad readership and applicability. You can do amazing work in a subfield and it will keep getting rejected from the 7+ IF journals because its too narrow. Not because its bad.\n\nI think I'm projecting from my own advisor who says top pub or nothing, to the extreme detriment to our lab.", "Permalink": "https://www.reddit.com/by_id/t3_59qise.json"}, "38": {"Subreddit": "PhD", "Author": "thismynewaccountguys", "Date": 1478284947, "Score": 5, "Body": "Just tell them and be gentle about it, say you appreciate their interest but that you find the high frequency of emails to be a bit stressful.", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "39": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1478292215, "Score": 1, "Body": "The only way out is through. ", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "40": {"Subreddit": "PhD", "Author": "d1o0m", "Date": 1478301539, "Score": 6, "Body": "I would say to enjoy the help. I know someot advisors that have the exact opposite behaviour, letting their students on their own.", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "41": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1478318551, "Score": 3, "Body": "It's a better problem to have than the four-month turnaround on feedback on a draft paper, which a colleague of mine was talking about yesterday. \n\nDo you have regular catch-ups scheduled? A weekly meeting would take some of the heat off. Otherwise, try \"I'm going ok, still working on X - maybe check in on me again next Thursday?\"", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "42": {"Subreddit": "PhD", "Author": "blunderland", "Date": 1478351789, "Score": 1, "Body": "\"The first draft of anything is shit\" - Ernest Hemingway", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "43": {"Subreddit": "PhD", "Author": "FreepostPlus", "Date": 1478355256, "Score": 1, "Body": "You're my hero, this one's going up ", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "44": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1478357667, "Score": 1, "Body": "He might just think you know what you're doing and the others need more guidance.", "Permalink": "https://www.reddit.com/by_id/t3_5b8p49.json"}, "45": {"Subreddit": "PhD", "Author": "rorrykeys", "Date": 1478376141, "Score": 3, "Body": "What is the point of doing a PhD then. This is BS.", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "46": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1478379566, "Score": 2, "Body": "Yikes!", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "47": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1478387610, "Score": 1, "Body": "???  \nI don't understand what this is?", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "48": {"Subreddit": "PhD", "Author": "xithy", "Date": 1478388623, "Score": 1, "Body": "its spam. ", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "49": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1478390174, "Score": 3, "Body": "To be honest, I would be interested to see what the quality would be like. Funny. ", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "50": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1478396147, "Score": 1, "Body": "Totally pointless. Just get one of these instead: http://www.fakephd.com/product/phd-in-awesome-physical/", "Permalink": "https://www.reddit.com/by_id/t3_5bavyz.json"}, "51": {"Subreddit": "PhD", "Author": "caz-", "Date": 1478414548, "Score": 13, "Body": "Were you wrong because you didn't do a thorough reading of the literature and/or didn't understand the topic very well? Or were you wrong because your results are interesting and counter-intuitive?", "Permalink": "https://www.reddit.com/by_id/t3_5beg0b.json"}, "52": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1478423460, "Score": 2, "Body": "Not sure why you're being downvoted. These are valid questions...", "Permalink": "https://www.reddit.com/by_id/t3_5beg0b.json"}, "53": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1478442937, "Score": 1, "Body": "Not to be critical or anything, but how did you write 100 pages before even knowing what your results were?\n\nAlso, if you did a proper job designing your experiment, you should have controls I'm place and sufficient power to support a negative finding, which is still useful. I.e. we hypothesized that X would happen in response to Y. However, we clearly show that changes in Y do not result in alterations in X. \n\nIn molecular biology, I don't know anyone who was even allowed to defend their thesis until they'd published a minimum of one paper as a first author, at least in the U.S.. The operating principle is that in order to get a PhD you have to have contributed something to advance your field. If you haven't, then you don't get a PhD. What this means is that some people simply never make it and some people take 7-8 years to finish. Not sure how this works in other disciplines.", "Permalink": "https://www.reddit.com/by_id/t3_5beg0b.json"}, "54": {"Subreddit": "PhD", "Author": "clydefrogsmom", "Date": 1478449529, "Score": 2, "Body": "Thanks for your input. Just to clarify, in psychology you write the first three chapters (intro, lit review, and methods) first as your dissertation proposal. That's the 100 pages. Then you do the experiment, run the data, and write up the last two chapters which are results and discussion. I have sufficient power and controls, the change just wasn't as strong as expected. I can discuss why I think that happened, intervention wasn't long enough, maybe instruments weren't as sensitive to change, etc. It's science- I tested a hypothesis and it wasn't supported. It's not the end of the world or mean I shouldn't get a phd. I'm just disappointed. \n\nI have other publications that I have done throughout grad school. This is just my dissertation project. It's a 1 year-ish project that you propose and defend. It's in no way the only thing I have done in grad school. And psych programs are more on the end of 5-6 years not 7-8. Plus it's not all research, we are training to be licensed practitioners as well. ", "Permalink": "https://www.reddit.com/by_id/t3_5beg0b.json"}, "55": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1478544908, "Score": 1, "Body": "I see. I didn't realize that in psych programs you wrote up a proposal for your dissertation. That sounds far too organized for a bio PhD - you typically just flail away for 5-6 years (7-8 is only for those unlucky enough to not have enough published to graduate \"on time\") and then slap together your papers as chapters 2, 3, 4, etc and bookend them with an intro and a conclusion trying to tie them all together.\n\nCheers.", "Permalink": "https://www.reddit.com/by_id/t3_5beg0b.json"}, "56": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1478602253, "Score": 2, "Body": "&gt; in most circumstances people are simply abusing the patience of a hard-working underling  \n  \nUnfortunately you've summarised a lot of clinical research environments right there. Capable people are recognised and, unfortunately, saddled with a lot of work, for which they rarely receive the credit. Investigator driven projects can be fickle, and it's very difficult to run something smoothly without the right key people on board. If you are really enjoying the statistics side of things I would recommend focusing on that, approach a biostatistician with a good reputation within your school/department. People who can actually understand the analysis, communicate it, and perform sample size calculations are really valued in my experience. As far as I know there are no MDs in my department with these skills - this would be a fantastic combination which might lead to interesting opportunities... (full disclosure, am biostatistician and think everyone else should be, too!)  ", "Permalink": "https://www.reddit.com/by_id/t3_5b2sd4.json"}, "57": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1478610142, "Score": 1, "Body": "FYI, I have had to click three times on the final \"next\" button (so, the one a the end of the whole questionnaire). Nearly quit at that time, perhaps you should look into it.", "Permalink": "https://www.reddit.com/by_id/t3_5bq8va.json"}, "58": {"Subreddit": "PhD", "Author": "d1o0m", "Date": 1478630796, "Score": 1, "Body": "Done ", "Permalink": "https://www.reddit.com/by_id/t3_5bq8va.json"}, "59": {"Subreddit": "PhD", "Author": "The_Sap_Must_Flow", "Date": 1478638785, "Score": 1, "Body": "I filled it out. Just wondering though - how can you be sure that people taking the survey are actually PhD students? I noticed you posted this in other subs and I can imagine people just filling it out to get the gift card. ", "Permalink": "https://www.reddit.com/by_id/t3_5bq8va.json"}, "60": {"Subreddit": "PhD", "Author": "bahzew", "Date": 1478644206, "Score": 1, "Body": "This. I filled it out (and am a doctoral student), but there was nothing asking me to prove that at all. Maybe at least the email address provided has to be a .edu? \n\nAlso, maybe our IRB is just stricter, but don't you have to provide your project ID number (along with the phone number and IRB contact info in the intro)? Just curious. \n\nAnd one last comment (sorry, I nerdgasm hard for research/survey design). It would be nice to include a skip logic that would spare me and other childfree folk from clicking through all of the career vs. children questions. Or least an \"N/A\" option for each, instead of just having to choose on the Likert scale. Selecting \"strongly disagree\" to all of those could be interpreted as \"screw my kids no matter what, I am a career woman\" ... but I do not want kids nor able to physically produce them. Hence, those questions do not apply to me. If I did somehow end up responsible for a small, not-yet-mature human, I would likely make adjustments to my career for the well-being of said mini-human. ", "Permalink": "https://www.reddit.com/by_id/t3_5bq8va.json"}, "61": {"Subreddit": "PhD", "Author": "OriginalPostSearcher", "Date": 1478646776, "Score": 2, "Body": "X-Post referenced from [/r/funny](http://np.reddit.com/r/funny) by /u/shizzblatt  \n[rocky bottoms...](http://np.reddit.com/r/funny/comments/5bp2yv/rocky_bottoms/)\n*****  \n  \n^^I ^^am ^^a ^^bot. ^^I ^^delete ^^my ^^negative ^^comments. ^^[Contact](https://www.reddit.com/message/compose/?to=OriginalPostSearcher) ^^| ^^[Code](https://github.com/papernotes/Reddit-OriginalPostSearcher) ^^| ^^[FAQ](https://github.com/papernotes/Reddit-OriginalPostSearcher#faq)", "Permalink": "https://www.reddit.com/by_id/t3_5bwp5r.json"}, "62": {"Subreddit": "PhD", "Author": "Born2bFunny", "Date": 1478717869, "Score": 1, "Body": "I don't get it\n", "Permalink": "https://www.reddit.com/by_id/t3_5bwp5r.json"}, "63": {"Subreddit": "PhD", "Author": "auntrhody", "Date": 1478725414, "Score": 1, "Body": "Done!", "Permalink": "https://www.reddit.com/by_id/t3_5bq8va.json"}, "64": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1478750370, "Score": 4, "Body": "I am  ot sure why do you need a post doc position if you are already getting a faculty position.  ", "Permalink": "https://www.reddit.com/by_id/t3_5c55ov.json"}, "65": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1478764639, "Score": 2, "Body": "Why not just become a U.K. Citizen? Marriage + 3yrs = citizenship. Problem solved? Being an international student sucks, your fees are 3x the normal rate and you miss out on lots of other benefits. ", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "66": {"Subreddit": "PhD", "Author": "Time_Ocean", "Date": 1478767246, "Score": 0, "Body": "The laws have changed...we started dating in 2010, got married in 2012 but because I'm a non-EU national, she has to be making £16,800/yr to sponsor me for citizenship. The UK government sees all non-EU spouses as skivers coming from mud-hut villages to suck resources from the UK. I pay half of my +£10,000 fees a year (US federal loan pays the other half) for the privilege of being seen as a 'lazy cheat'. :(", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "67": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1478767416, "Score": 3, "Body": "&gt; my supervisors look to me for answers because it feels like they are behind the times a little and have no idea\n\nYour supervisors look to you for answers because a) it's your project and you need to be able to explain and defend your own methodology, and b) being up-to-date on all of the literature relevant to your specific research question is *your* job, not theirs.  If they had to read every paper related to every project of every student they supervised they'd literally do nothing else.", "Permalink": "https://www.reddit.com/by_id/t3_5c6t4m.json"}, "68": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1478768312, "Score": 1, "Body": "I understand that, which is why I have put in the work, but no help at all? What's the point of supervision? ", "Permalink": "https://www.reddit.com/by_id/t3_5c6t4m.json"}, "69": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1478770325, "Score": 3, "Body": "What field are you in? If it's your research project (which I think it is from what you have written) then they will expect you to initiate the first ideas, including methodology. But don't despair, if you show up with a methodology that is inappropriate for what you are doing they will tell you straight away!! ", "Permalink": "https://www.reddit.com/by_id/t3_5c6t4m.json"}, "70": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1478770974, "Score": 3, "Body": "Welcome to my world. That's we're leaving. I had my PhD funded a US grant so they paid for everything, but you're pretty deeply discriminated against in the UK as a non EU (and soon to be as an EU too). Come to Australia, you'll still be discriminated against, but at least the beer is cold and there is warmth and sunshine.", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "71": {"Subreddit": "PhD", "Author": "blunderland", "Date": 1478775663, "Score": 27, "Body": "Keep fighting the good fight sir. We need passionate scientists now more than ever.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "72": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1478776036, "Score": 19, "Body": "Thanks for the kind words.  I think if anything, this is a call for climate scientists to galvanize even more. I refuse to simply surrender what I've worked so hard to educate myself on. Like I wrote, I have dedicated nearly a decade to understanding my field. The science is sound, and I have earned the right to say that. The future is what we make of it, and I always love a good challenge. So bring it, because I will keep studying and relaying the science as much as I can. Science doesn't care about politics.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "73": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1478779090, "Score": 1, "Body": "the university where i am faculty is more teaching based than research focused. The postdoc would allow me to publish along side with the leading experts in my field. Your question is exactly why I am posting here- I would like to hear the opinions of others if the postdoc is worth it, or I should just stick in my current role.", "Permalink": "https://www.reddit.com/by_id/t3_5c55ov.json"}, "74": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1478779281, "Score": 6, "Body": "Keep spreading the word. Recruit the support of other scientists. ", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "75": {"Subreddit": "PhD", "Author": "ejc16", "Date": 1478787614, "Score": 8, "Body": "Thank you for dedicating your life to something much bigger than yourself. The effects of climate change are very real and we are seeing them already. Although your warnings may be ignored by the most influential policymakers, you bet they will be begging for forgiveness looking for answers and solutions when shit hits the fan. We still need this research and try to remember most of the world is behind you. Never give up the fight.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "76": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1478791416, "Score": 5, "Body": "Science marches on despite what the politics of the age dictate. You are doing amazing work, and essential work. Many wish they had the discipline, resources, and motivation to do what you do! 4th year PhD here and I think I can relate to the downs of research. But wow. Your work is not forgotten at all. And neither will you. ", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "77": {"Subreddit": "PhD", "Author": "tomnnnn", "Date": 1478792203, "Score": 3, "Body": "I've just started my PhD and one of my colleagues is non-EU and gets full stipend so some Universities do offer them. Hope you manage to find what you're looking for!", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "78": {"Subreddit": "PhD", "Author": "folame", "Date": 1478795017, "Score": 1, "Body": "&gt; Have you acquired or developed any bad habits, illnesses or diseases caused/catalyzed by your Ph.D.?\n\nMmkay.", "Permalink": "https://www.reddit.com/by_id/t3_59xrsq.json"}, "79": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1478796135, "Score": 1, "Body": "I see. I am a 3rd year PhD student and I am used to people going for post-doc because they can't get a faculty position right away.  The only one who managed to do it skipped the post-doc gladly. ", "Permalink": "https://www.reddit.com/by_id/t3_5c55ov.json"}, "80": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1478802145, "Score": -9, "Body": "Sorry to break this to you, but you chose this field. I chose a field in which I stand to make 120k a year even if I never publish much of anything. Science PhDs are a shit deal.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "81": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1478805021, "Score": 1, "Body": "CS FTW?", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "82": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1478805503, "Score": 4, "Body": "stfu", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "83": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1478809054, "Score": 6, "Body": "Remember Ernest Boyer (Scholarship Reconsidered: Priorities of the Professoriate, 1990): \"The work of the [scholar] becomes consequential only as it is understood by others\". Of the four disciplines of scholarship (research, application, integration, teaching), now is arguably a historical occasion to focus your efforts on the latter. An electorate that's been informed and enlightened by those in a position of knowledge, such as yourself, is less likely to vote ignorant leaders into office. Be prepared to explain, tirelessly and relentlessly, why the upcoming environmental orientations of this new presidential term don't make sense.\n\nSo, publish a blog. Tweet. Set up a Youtube channel. Get articles released (not just scientific papers - I'm talking about layman articles). Become the next [Elizabeth Kolbert](https://www.fiatphysica.com/blog/people/7-Pioneers-of-Science-Communication-Carl-Sagan), or mentor a student who will. You can multiply your influence over the next election far beyond your own individual vote by sharing with the public your deep understanding of the issues facing our environment in a simple and engaging way. Do not underestimate your potential in this regard. You're not /u/lakewoodhiker. You're *Dr.* /u/lakewoodhiker. People take notice when you speak because you've f****** earned the right to be listened to. Use it to its full potential. This turn of event has just made you hungry again, just as you could have fallen into the trap of complacency for landing that lab job and adjunct position. Being hungry is precisely what made you give out your best in the last 8 years. Just be prepared to keep doing it a while longer, with a renewed focus - *on others*, this time.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "84": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1478809995, "Score": 12, "Body": "It has never been about the money to me, it's been about pursuing something I'm passionate about. The job I had before I went back to graduate school was in IT and I was making 6 figures. But it was soulless work sitting in that cubicle. I made less than 20k a year as a graduate student, but was never happier.  Now, at a government lab, I do really well, and I still get to do amazing field work.  As I write this very text, I'm literally sitting at the South Pole as Secretary Kerry is about to show up to talk about ice cores.  I love what I do. Attaining a PhD is not a \"shit deal\". It's incredibly rewarding and requires an immense dedication. The problem is dealing with others than can't seem to appreciate just how much you had to learn to attain it...", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "85": {"Subreddit": "PhD", "Author": "N140067", "Date": 1478811291, "Score": 2, "Body": "We need scientist like you more than ever. Reach out to private sectors those who understand the effects of climate change, it's all about educating as many people as possible, just like what you are already doing.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "86": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1478811356, "Score": -2, "Body": "That problem we all face. Nobody cares about our narrow research areas. We do it and that's enough for me. I gave up on trying to change people's minds. Many people are too dumb for me to bother.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "87": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1478829490, "Score": 4, "Body": "This is the reason I want to get into science advocacy. I feel educating the public and spreading science to a non scientific audience is very important. Getting my PhD in Biochemistry this December and looking for employment.. so I will see how it goes. For me I am starting with my family, who are all white blue collar Americans, and making sure they understand how terrible anti science stances are for society as a whole, regardless of which side says it.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "88": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1478833996, "Score": 1, "Body": "Imagine where the world would be if people didn't do difficult, important things because they went against the prevailing political grain. We'd probably all be serfs. So thanks for being good at what you do. \n\nYou're an expert in one of the key fields that will shape human civilization in this century, so I'd be surprised if your hard work is not vindicated one day. No matter who is in office the planet's gonna do what it does. I just hope that, in the meantime, you and others like you can make a living and keep expanding our knowledge so that it's there when we need it. \n\nIf you ever do an AMA I'll be there. :)", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "89": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1478836104, "Score": 5, "Body": "Definitely agree with you /u/lakewoodhiker , don't worry about what this guy is saying. We need people with PhDs. I am pursuing my PhD for the same reasons: I don't want to do soulless work for the profit of some business.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "90": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1478846683, "Score": 2, "Body": "As a physical chemist in renewable energy research, I know the feeling.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "91": {"Subreddit": "PhD", "Author": "tomnnnn", "Date": 1478863542, "Score": 2, "Body": "I have a lot of respect for those who take it upon themselves to be 'explainers'. I was listening to a podcast about Carl Sagan a little while ago and it was interesting that some in the scientific community looked down on him for not having carried out much research and yet, without those who go out of their way to translate the research that does exist, then it has the potential to never escape the confines of the academic community.", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "92": {"Subreddit": "PhD", "Author": "tommegee", "Date": 1478925438, "Score": 6, "Body": "nope", "Permalink": "https://www.reddit.com/by_id/t3_5cexo8.json"}, "93": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1478945495, "Score": 1, "Body": "LOL\n\n...... :'(", "Permalink": "https://www.reddit.com/by_id/t3_5cexo8.json"}, "94": {"Subreddit": "PhD", "Author": "richard248", "Date": 1478956359, "Score": 7, "Body": "Do you want to become a better teacher? Do you want to become a better mathematician?\n\nI would tentatively suggest that neither of the above are strict objectives of a PhD in Mathematical Education. The PhD would be trying to develop greater understanding and capability within the field of education. You would be helping educators, rather than yourself doing education. \n\nI don't want to put you off, because research into better techniques for learning in mathematics is surely important. But we should be clear about the dichotomy between \"I just want to be a better teacher\" and \"I want to do research in education\".\n\nAs for your question, it is probably very field dependent so I will leave others to answer. At least in Computer Science in the UK, my experience has been that the Masters will far outweigh the Bachelors, where the most important facet is the proposed research itself. ", "Permalink": "https://www.reddit.com/by_id/t3_5cka7s.json"}, "95": {"Subreddit": "PhD", "Author": "eatscakesandleaves", "Date": 1478962974, "Score": 1, "Body": "Crowdfund a position. Support your work. ", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "96": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1478970316, "Score": 3, "Body": "I agree with everything richard248 said.  \n  \nIn regards to your other stuff, it's been a *really* long time since your undergrad, so those grades (good, or bad) will be discounted. Now, if you have nothing to prove your intellectual capacity (the Masters GPA is nice, but it will be discounted a bit because Masters grades are inflated), then your best bet is to score extremely highly on whatever standardized exam your field uses for admission (I'm guessing for you it'll be the GRE). So score extremely highly on the GRE and you'll be fine.", "Permalink": "https://www.reddit.com/by_id/t3_5cka7s.json"}, "97": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1478997484, "Score": 2, "Body": "I wish I had known what the PhD community is like in the cohort, school, and faculty. To be honest, there seems to be very little. I knew PhDs could be \"isolating experiences\", but I really did think I'd be interacting with people FAR more than I am. ", "Permalink": "https://www.reddit.com/by_id/t3_5caq7r.json"}, "98": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1478999688, "Score": 1, "Body": "I'm a US first year PhD student in NI. I'm currently only paying the difference between UK fees and international fees (still about 7k), but I do qualify for a maintenance stipend from an external funder. They are few and far between- tend to be external grant bodies or university funded ones. There might only be 1 maybe 2 a year available to international students in your school. Make sure you get in people's ear that you would need funding and aren't eligible for the usual DEL/Northern Bridge/whatever. I had to apply three years in a row before I got funding.... not ideal when you're married to a local, I know. ", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "99": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1479001380, "Score": 3, "Body": "Don't respond? Then if it comes up just say you turned off the notifications/weren't checking it (not sure how you use Slack currently, it seems wonky on my Mac) in an effort to boost your productivity. Then hope they get that subtle hint. ", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "100": {"Subreddit": "PhD", "Author": "Zeekawla99ii", "Date": 1479023782, "Score": 1, "Body": "Good idea", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "101": {"Subreddit": "PhD", "Author": "Time_Ocean", "Date": 1479031203, "Score": 1, "Body": "Are you at UU or Queens? Does the grad-extension visa allow you to work more than 20 hrs a week?\n\nMy supervisor and course director know the situation so I'm hopeful they can put feelers out about it. I had the idea the other day that if I can get a funded position that just pays fees, I can still apply for US federal aid and maybe try to live off that.", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "102": {"Subreddit": "PhD", "Author": "RussianWhizKid", "Date": 1479045965, "Score": 5, "Body": "I feel the same way all the time. \n\nOften times I try to compare myself to my cohorts, but it's never a very good idea. \n\nYou really can't compare because you're doing different research under different advisors. \n\nWhat I try to do is at least be a bit above average, I won't be the crazy guy working 80-100 hours per week like a slave, but I also won't just be working 30-40 hours, I'll settle someone in between. \n\nThere will always be that one guy who publishes a 1st author paper like every 6-9 months (I've actually collaborated with him a few times) and looks down on you for not being in the lab until 3am most nights like him. \n\nI also make sure to be above the expectations of my advisor, who truly believes in having your a good work/life balance. \n\nAt the end of the day, it's really up to you and how much you want to get done before you graduate. \n\nI've always tried to set the bar higher where I consistently do more lab work per week each semester, and never go back to my previous work hours. \n", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "103": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1479054802, "Score": 1, "Body": "PhD in mathematics is very very different from a PhD in education with specialization in mathematics education. I am not sure which one you are targeting here.\n\nIf it's PhD in mathematics then I am not sure how your M.Ed. helps you in any way.\n\nIf it's PhD in education then it certainly helps.\n\nI am not sure if there are many jobs for PhDs in education and specially for someone with PhD in education with specialization in mathematics education.\n\nThere are certainly many jobs for PhDs in mathematics.\n\nwhich one are you targeting? ", "Permalink": "https://www.reddit.com/by_id/t3_5cka7s.json"}, "104": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1479055478, "Score": 5, "Body": "STEM PhD is hard in general, and it can become very very hard depending on your advisor and project.\n\nI have seen not so bright candidates (hard-working) get their PhD very fast and some good students (but slacking) struggling with it.\n\nI would recommend you to work as hard as you can, the slower your progress is the longer it will take you to finish the program and the more frustrated you will be. I took my PhD very lightly because I did very well in undergrad and masters, and then I realized that 5 years have passed and I havent really learned anything and it's a horrible feeling, I have been asked by my committee to start writing my thesis and may be do a little more work before defense but it's apparent to them that my research lacks depth and I havent worked hard. Thankfully I have enough publications for them not to question me much but it's not a good feeling when your committee doesnt respect your work.\n\nI would suggest you to focus on the publications, if you have enough publications then the committee cant do much but to grant you your PhD. If you do not have enough publications and the committee doesnt respect your work either then you will be miserable.", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "105": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1479056255, "Score": 2, "Body": "My advisor never edited any of the journal papers I wrote, never!\n\nAfter getting two rejections I realized he was never going to edit the papers so I took it upon me to write the best I can and because I am not a native English speaker I took a lot of help from the English Department of my university (they give free grammar editing services for journal papers at my university).\n\nI used to get very very frustrated with my advisor but again he is your advisor so you really dont have a choice.\n\nIn any case I am happy that now I no longer depend on anyone how to write a paper, I have learned a lot from my mistakes and reviewers comments.", "Permalink": "https://www.reddit.com/by_id/t3_5ax4ka.json"}, "106": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1479056397, "Score": 2, "Body": "Just do it, just fucking do it.\n\nFall seven times get up eight (my favorite at the moment)!", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "107": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1479057974, "Score": 2, "Body": "QUB. I'm on a Tier 4 just like I was for MA. 20 hours max during term time (which for PhD is until you submit your thesis, I believe... maybe viva... either way, three years from now). I'd assume you'd be the same. There's a doctoral extension scheme that you can apply for to look for work (if that's what you're referring to), but not until you're nearly done. ", "Permalink": "https://www.reddit.com/by_id/t3_5c3rwy.json"}, "108": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1479061518, "Score": 3, "Body": "A lot of people don't consider psychology to be STEM, despite the research factor. That being said, I try to right in the annotative bibliography on at least two articles per day that I will be using in my dissertation, stay on top of course work, each month I have a goal that fits into a timeline of completing my dissertation a month before expected (if research goes smoothly). ", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "109": {"Subreddit": "PhD", "Author": "richardroberts92", "Date": 1479063278, "Score": 20, "Body": "I would argue doing more than 40 hours a week consistently isn't particularty healthy. I understand that there are often deadlines, but exhausting yourself by over working might have a damaging effect in the long run.\n\nI do about 40 hours a week. Sometimes less, sometimes more. I have productive days and I have less productive days. I think the most important thing is to give yourself deadlines, make sure that you're investing time into the right things, and maintain a good contact with your supervisor.\n\nLast week I spend four hours debugging code. My brain was tired and I couldn't think straight. I decided to call it a day at 4pm because I wasn't getting anywhere. I could've spent another six hours on the bug in that frame of mind and I would have made no progress what-so-ever!\n\nThe bug was fixed in ten minutes the following morning.\n\nDon't brute force your PhD. Set realistic deadlines. And don't worry yourself into bad health. I've seen it happen far too often. \n\nAll the best with your research, friend! :)", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "110": {"Subreddit": "PhD", "Author": "piglet33", "Date": 1479076631, "Score": 5, "Body": "You need so many upvotes. This is the approach I take too. It's a good balance between productivity and mental health.", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "111": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1479078195, "Score": 3, "Body": "Literally submitted today. PhD in CompSci. \n\nIt depends on where you're up to in the process. \n\nIf you're at the beginning of your PhD (like first few months) there's no way to measure productive. It will take time. Turn up to work (yes work!) every day at 8:30, work until 5:30, tun off Facebook/Reddit/twitter while you're at work. If you've got nothing better to do, read a paper. Try to figure out what the core contribution of the paper is (not what they did, but what they learned) and try to figure out how you could improve on it. What I would look at is conferences/journals that have a high reputation but some kind of low-bar to entry method. For me in compsci, there are plenty of quality conferences that will take \"posters\" as a submission. Great way to get your foot in the door, do something substantial and valuable. Submit your improvement idea as a poster, short paper or work in progress. Go to the conference and talk with people.  \n\nIf I'm the middle years, writing a paper or three should be your goal. Try to latch on to a team of people doing something related and assist.  Then try to take one or ideas from the papers you've read and build it. You'll learn more than you can imagine from the first time you try to ensure anything. The first time you measure something you'll always find you're measuring something different to what you thought. \n\nIf in the later years, you goal is to write chapters. When I got to the final write up I started a daily Facebook blog called \"30 days of thesis \" (#30daysofthesis) I updated it daily with a couple of sentences about what I had done and/or planned to do. In the end, I submitted on #162daysofthesis. I only counted work days (no weekends). The blog kept me honest and made sure that I had a reason to make progress every day. I also kept a graph of my word count which was another good motivator. \n\nOverall, treat it like a job, work 8:30 to 5:30, 5 days a week, and you'll be fine. ", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "112": {"Subreddit": "PhD", "Author": "caz-", "Date": 1479079807, "Score": 1, "Body": "I think my 'routine' was kind of bad, but it worked for me in the long run. I had long periods where I felt like I was getting nothing done. I was doing most of it from home, which didn't help because it was easy to get distracted. But, I somehow managed to make up for it with long stretches where I was working maybe 80 hours or more in a week.\n\nI wouldn't recommend doing it this way, but as I said, it worked out for me in the end. The point is, there isn't only one way of doing it.", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "113": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": 1479081882, "Score": 2, "Body": "Congratulations! :) ", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "114": {"Subreddit": "PhD", "Author": "hoggledorp", "Date": 1479139768, "Score": 3, "Body": "I'd give your advisor a bit of an easier time: they're probably jaded because their advisor *never* talked to them and are trying to make up for it while they have the time. One thing you could do is set up regular meetings so your advisor wouldn't have to pester you.\n\nIf it comes down to it, I think you can just have a polite exchange that goes something like \"hey! Still working on stuff. Not much has changed, but I'll be sure to let you know when I need help.\" and if that doesn't work \"haha thanks for the offer again, but really, I'm the kind of person that works best alone until I need to come and talk to you.\"", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "115": {"Subreddit": "PhD", "Author": "Zeekawla99ii", "Date": 1479149907, "Score": 1, "Body": "&gt; they're probably jaded because their advisor never talked to them and are trying to make up for it while they have the time.\n\nYou're right. I was probably just stressed out this day. \n\nIt's a good problem to have!", "Permalink": "https://www.reddit.com/by_id/t3_5b57nd.json"}, "116": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1479179321, "Score": 3, "Body": "If you can't see yourself handling the current situation for the rest of your PhD then you need to get out. Do not expect the project or your supervisor to change, you can only change what you have control over. Maybe you can switch to another supervisor within your department and drive your project back towards the lab? This would mean you need a way to incorporate that into your project though. If you can't see one, then talk to other supervisors at your institution and see if you can apply to a new project with them. Staying at the same institution and department is by far the easiest way of getting onto a new program.\n\nFailing that, just start applying elsewhere. I don't think having left this program will hurt you as you can say the project didn't end up going in a direction that suited you. It happens sometimes when the project takes off in a certain direction and it's not the skills you wanted. Other supervisors and institutions will know this.\n\nDon't prolong this once you know it's not for you though. It is not a good idea and will only waste time and make you miserable. You do not owe anything to your supervisor or your department except being civil and clear once you make your choice.", "Permalink": "https://www.reddit.com/by_id/t3_5cz26j.json"}, "117": {"Subreddit": "PhD", "Author": "ejc16", "Date": 1479219421, "Score": 4, "Body": "Definitely try to get a coadvisor, which is certainly not unreasonable if you are the first PhD student in his lab. If you want to do more lab work try to come up with something yourself to test in the lab that would compliment your computer work. Maybe your advisor is just not great at delegating lab work or coming up with ideas for the bench. If your advisor still doesn't want you to spend time in the lab, then be honest with him about your expectations and bring up the fact that it was discussed before you accepted the position. If you don't get what YOU really want out of your PhD training, then what is the point?", "Permalink": "https://www.reddit.com/by_id/t3_5cz26j.json"}, "118": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1479222854, "Score": 3, "Body": "Second this. You should have a second supervisor anyway, and he will give you advice on how to handle the less than professional first supervisor. Failing ng that, I would ask for a meeting with the head of school and gently inform them that you are not that enthused with the level of support given from your supervisor. There is nothing worse than a student being perceived in a bad light, when in fact it is the supervisor that is letting the side down. ", "Permalink": "https://www.reddit.com/by_id/t3_5cz26j.json"}, "119": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1479266047, "Score": 2, "Body": "seems to be getting harder year after year", "Permalink": "https://www.reddit.com/by_id/t3_5cexo8.json"}, "120": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1479267093, "Score": 2, "Body": "I think what you need to do is take some time off to recharge. Take a leave of absence now for a month or two. It will not be a good idea to take time off after your PhD because that creates a gap in your resume. Plus, if you take the time off now, it will make finishing you PhD that much easier. You will not be able to really work out what you enjoy when you are suffering from anxiety or depression or other mental health issues. Sort that out now, then sort out your career. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_5d5qhp.json"}, "121": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1479299720, "Score": 9, "Body": "Be careful...  At some point you cease being efficient working that many hours. Work smarter,  not harder. Quantity can diminish the quality of what you do. ", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "122": {"Subreddit": "PhD", "Author": "The_Sap_Must_Flow", "Date": 1479307773, "Score": 2, "Body": "Take a brake man, nothing matters that much. I've nearing the end of my comprehensive exams, a 3-week process in my program, and I haven't put in a 15 hour work day (yet). Relax. ", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "123": {"Subreddit": "PhD", "Author": "kalamano", "Date": 1479322643, "Score": 5, "Body": "I applied in my MSc year for a PhD in politics. I was doing an MSc in global politics and began my PhD application for funding pretty much as soon as I started. I based my PhD proposal on my topic area that I was focusing on in my MSc dissertation so it was pretty integrated. Just go for it! It's very common. It's also a great way to meet and be in touch with potential supervisors if you are planning to stay in the same institution. I think those who apply whilst doing their masters are at an advantage.\n\nAlso - I had no break between my undergrad and masters and now my phd! ", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "124": {"Subreddit": "PhD", "Author": "itisspeltwithanA", "Date": 1479329626, "Score": 1, "Body": "That's great to hear! Thank you. I think part of my fear was struggling to focus down a topic. Likewise I want it to build out of my dissertation topic, but until very recently I was unsure what that was. Now that it's a little more concrete I feel more confident about it. ", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "125": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1479330286, "Score": 2, "Body": "Give yourself permission to take a break and recharge. No one can keep that pace up and be productive.", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "126": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1479339097, "Score": 1, "Body": "Sometimes in life - whether business or academia - you have to sit down and say to yourself: This deadline is going to be missed. Trying to reach it is going to burn me or somebody else out and the result will be poor. I need to write that email now and explain to the client/investor/conference organiser/supervisor that more time is required.\n\nThese are hard moments to get through, but the world doesn't end and the end result is usually much better.\n\nOnce you do this you need to come up with a plan that results in you getting your PhD with a sustainable workload, so these moments are few and far between.", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "127": {"Subreddit": "PhD", "Author": "pocketotter", "Date": 1479339225, "Score": 1, "Body": "I'd say go for it. You've already had time out, as you say, so there doesn't need to be a worry that you haven't ever stepped back and reflected on this choice. And as mentioned in the other comments, if you want to build on your MSc work, and use your contacts from the MSc, this is the best time to capitalise on those things. (Not that you won't be able to capitalise on them later, if that's what you decide.)", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "128": {"Subreddit": "PhD", "Author": "pocketotter", "Date": 1479339330, "Score": 2, "Body": "FWIW, people who've got to the tenure stage may no longer be checking in with this sub. Or so I'll tell myself.", "Permalink": "https://www.reddit.com/by_id/t3_5cexo8.json"}, "129": {"Subreddit": "PhD", "Author": "pocketotter", "Date": 1479339423, "Score": 1, "Body": "Second this. Also, this may very by discipline/school, but ask about the daily routine - where you'd be working, who with, etc.", "Permalink": "https://www.reddit.com/by_id/t3_5caq7r.json"}, "130": {"Subreddit": "PhD", "Author": "pocketotter", "Date": 1479339660, "Score": 2, "Body": "*Original contribution to knowledge*. This is what they want! Make sure you are highlighting this. (I'm also UK based.)", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "131": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1479346425, "Score": 1, "Body": "This so much. There was a spring semester where I stayed up every 1/4 nights. Then I realized it had more to do with how I worked - not that I'd surf Facebook and reddit, but that I was analyzing data without a well construed plan. At the beginning of every day, outline objectives that will follow the 'path of least resistance' towards your goals (e.g., publication).", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "132": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1479354825, "Score": 1, "Body": "I'm going to focus on the issue of paying the loans back, since it seems to be the most important factor here. If you can't find a job and are swimming in a sea of debt after you graduate, you probably won't think the PhD was worth it.\n\nThere are a lot of people that stumble into the PhD process clumsily. Many people don't have a firm idea of what it takes to be successful after the PhD (for instance, to receive a faculty position at a university). I see a good amount of PhD graduates without the job they wanted, only taking part-time positions/internships, or unemployed altogether. In my field (and in most fields), it takes a lot of work to be successful - my department suggests that each student publish 3-4 first author papers in journals with impact factor &gt;3, at a minimum, if they want to pursue an academic career. Even then, a university career is not quite guaranteed. I'm not sure if you've published yet, but it is a very difficult goal to publish this much during a PhD. I know 2 people who graduated with their PhD this past spring - 1 had 1 publication and the other had 0. As expected, neither has found a good job yet.\n\nI am probably not in the same field as you, and thus, the expectations are very different, but if you are worried about thriving after getting a PhD and you don't have a very, very clear idea of what you need to succeed, or if you aren't sure you can meet those demands, I would decide not to pursue it or put it off. \n\nIn summary: I think everyone has the capacity to pursue a PhD, but not all PhDs students are equally successful. Only the more successful ones will have access to the opportunities afterwards that make the PhD worth pursuing. You need to know what it takes to be 'successful' in your field, and then decide if you can meet these demands, and more importantly, if it is something you even want to do.", "Permalink": "https://www.reddit.com/by_id/t3_5d8wak.json"}, "133": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1479355946, "Score": 3, "Body": "I went through a whole semester where I worked 70-80 hrs a week, and every 1/4 nights I missed out on sleep entirely. It eventually realized that my progress had much less to do with how much I worked and more to do with how intelligently I worked. At the beginning of every day now, I outline my goals and follow that outline. Actually, when you are stressed and sleep deprived, you can't maintain a clear mind of your project and the important questions you need to ask for your research, and there is a major loss of efficiency here.", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "134": {"Subreddit": "PhD", "Author": "PimplyChuds", "Date": 1479372446, "Score": 2, "Body": "Thanks! A lot of what I've read has said similar things. I think the idea I have is fairly original. I've not been able to find many journal articles on it anyway. ", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "135": {"Subreddit": "PhD", "Author": "pocketotter", "Date": 1479377544, "Score": 1, "Body": "Yep I thought you'd have heard it before, but I think it bears repeating, as it's the thing that has been drummed into me most thoroughly!  I realise this post is a bit old so perhaps the time has past, but happy to talk in more detail if we happen to be in similar disciplines.", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "136": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1479398563, "Score": 1, "Body": "If you want to go straight in then go for it. You can take short periods of leave (a couple of weeks) during your PhD so it's not like you're stuck there for 3-5 years after you start. I took 2 months off between honours and PhD but you can start your PhD any time of the year in Australia so I went on a short trip to visit family and then went into it. I has applied during honours though and been offered the position. I just enrolled a bit later. I don't think this is offered in many other countries.", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "137": {"Subreddit": "PhD", "Author": "thqrun", "Date": 1479405886, "Score": 1, "Body": "I kind of just got boned this semester, had an easy TA assignment lined up (like just had to proctor 3 exams). But it got switched at the last minute to one of the more demanding positions, the unfortunate thing is I decided to take 2 classes on top of this and research. \n\nI spent too much time on research early this semester to try and be ready to write a paper for a high impact journal (I'm actually 6 months ahead of my project milestones but still haven't published), love the research but its part of a large military project so there's a large number of progress reports and meeting which seriously eat into my time. Next I prioritized my TA duties so classes kind of took a backseat, had to play catch up, now I'm worried I might not pass either class as I've just been bombing exams left and right. \n\nIn one class our professor gave back our exams a day AFTER the add/drop period and i got a big fat F, basically got accused of laziness, just took the second midterm and I think I'll be lucky to walk away with a D. Just didn't have time to adequately study.", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "138": {"Subreddit": "PhD", "Author": "PTRIPLEM343", "Date": 1479408049, "Score": 1, "Body": "Does your university offer any direction in the supervisor selection procedure? An application or information form?", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "139": {"Subreddit": "PhD", "Author": "burhunk", "Date": 1479408730, "Score": 1, "Body": "No, they don't seem to offer any guidance whatsoever. They expect that if you wanted to talk to someone, you'd approach them on your own accord. If you find someone, you mention it in your application. My issue is that I'm not sure how much of a detriment not listing a supervisor is. Some have said that you would be dismissed. Others have said that it's totally fine. This contradictory information is making it impossible to know what to do. ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "140": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1479410391, "Score": 3, "Body": "Have you looked on www.jobs.ac.uk  for advertised PhD positions? Most rejections/ignores may be funding related.", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "141": {"Subreddit": "PhD", "Author": "burhunk", "Date": 1479411592, "Score": 1, "Body": "I have, but as of yet I can't find any projects related to my topic of interest. I'll keep looking, though. Thank you ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "142": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1479414785, "Score": 1, "Body": "But surely there are some open adverts? I was looking just the other day and the Midlands universities (Nottingham, Birmingham, etc) were advertising 57 PhD scholarships or something...", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "143": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1479417032, "Score": 1, "Body": "You need findaphd ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "144": {"Subreddit": "PhD", "Author": "burhunk", "Date": 1479418684, "Score": 1, "Body": "Unfortunately for me, the vast majority of scholarships go to EU/UK students, and I'm not a candidate for the vast majority. ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "145": {"Subreddit": "PhD", "Author": "burhunk", "Date": 1479418765, "Score": 1, "Body": "I've used their website, but most of what's on there isn't applicable to international students. Do they offer any additional services? ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "146": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1479419109, "Score": 2, "Body": "Ok, I see. \n\nMight be worth getting in touch with the funding department/student services dept of intended universities, as there are often grants and scholarships available for international students that may not be advertised. The competition would be pretty high for these, but might be worth a shot. ", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "147": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1479423434, "Score": -5, "Body": "Honestly about 2 weeks, I introduced myself to everyone early on, went to some of the socials. I've got a lot of people I can't talk and joke with. And on the \"other PhD aren't helpful\" thing, they're not their to help you. You have to learn on your own. Supervisors can help, and so can PhD's but don't expect them to, because they're in the same situation as you. Also the whole \"women in stem\" thing is a load of nonsense too. In my solid state department there are more women than men. Just lighten up a bit, work a solid amount of hours,  don't over do it, and talk to people. If you talk to people they will begin to like you, then they will help. Talk to your supervisor about help first though", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "148": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1479423474, "Score": 1, "Body": "Modafinil. That is all...you need", "Permalink": "https://www.reddit.com/by_id/t3_5d886p.json"}, "149": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1479425201, "Score": 5, "Body": "I think most of us go through this, especially if you moved far from home. I moved from NZ to Aus for my PhD, and like you I'm quite a lot younger than everyone else in my group, and didn't have much in common. I found getting involved in something totally outside the research group really helped to keep me happy. I connected with one or two of the social clubs at the university, made a few new friends and felt a lot better. It's still hard when things aren't going my way in the lab but at least I can go for a beer with someone who doesn't care about it and get away from it all. I wouldn't worry too much about finding your \"groove\" - that seems like the kind of thing that can only happen when you're not thinking about it. \nThe other thing that help was allowing myself to take a little bit of pride in where I had got to, and as a result it was easier to hold myself to a certain standard for getting work done. This might not translate well to everyone though, maybe it's just me. ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "150": {"Subreddit": "PhD", "Author": "bookanop", "Date": 1479432265, "Score": 1, "Body": "I'm a year into a social science PhD so an entirely different animal... but, the process is very isolating in and of itself. I can relate to that. Took me a year to start to feel comfortable and break through some of the barriers to my research (ideological and institutional). Around the same time I began to take time for myself to exercise and made it a daily habit to hit both the library and the gym (and if I couldn't make it to the gym, I'd do some other form of outdoor exercise). I find that some peers are helpful but in limited doses. Reach out to professors and peers if you got some that are on the level with you. Otherwise I recommend finding time for things that are valuable to you in terms of recreation, hobbies, and your physical health. ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "151": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1479434346, "Score": 1, "Body": "after comprehensive exams.", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "152": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1479442851, "Score": 3, "Body": "3rd year STEM PhD here. PhD students are awkward as fuck so chances are they are excited to have a girl in their lab but don't know how to start a conversation. Help them by starting it first. When I was in my first year, from the beginning  I got involved with student chapters of professional societies and that helped a lot. I met a lot of more senior students this way. ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "153": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1479451152, "Score": 2, "Body": "For what it's worth, I'd suggest throwing in an application even for projects that are only tangentially related to what you want to do.  PhD projects can often be shaped and edited depending on who's been hired to do the work, and there's no harm in you applying so you can (hopefully) get a chance to talk to them about it in person.", "Permalink": "https://www.reddit.com/by_id/t3_5dh3sf.json"}, "154": {"Subreddit": "PhD", "Author": "DuckHuntHotDog", "Date": 1479470707, "Score": 1, "Body": "I'm a male STEM PhD student in a similar situation to you. What distinguishes me from my colleagues is that I'm not German.\n\nWhile they all speak English perfectly, I believe that the fact I'm still not great at speaking German and have only lived here for 2 years still casts me in a foreign light to them.", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "155": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1479486551, "Score": 2, "Body": "PhDs are a fucking rollercoaster man, and i think everyones experience is different. I'm in my 3rd year and I still feel like I have no clue whats going on. However, I worked way way way too hard in my first year and never took time off, didnt take holidays, worked nights and weekends and burnt myself the fuck out. Now, I'm so lax about things (within reason). -- Talking the no friends thing.. ok, so different boat as im psychology so alot of us are girls and we're pretty close. However, i live overseas, and have for 9 years now, and have moved around a fair bit in that time, so I know how it feels to all of a sudden be in a place with no mates and feel so isolated. \nWhat do you like to do for fun? Make sure you take some time to do it. Or fuck it, learn something new! I've taken soo soo soo many different classes since starting my PhD (aerial silks, pilates, yoga) I find i make friends doing this, its fun, AND it helps with my stress/ lets me know the town and so on. But it doesnt need to be exercise, try an adult art class or jewlery making or whatever. Just because your office mates arent your best mates dosent mean you cant find mates elsewhere! \n\nAlso, ive had many a rough patch, mainly due to strange/ controlling relationships with my supervisor. I always go back to exercise in the end/ having hobbies to fall back on are everything, and not defining my life by my PhD. and also knowing some days are bad and some are good, and when its a bad day- leave the office, read a book, go get a nice coffee, call your friends from home.. have a you day. but know you're doing what you love and you'll be inspired again in a few days :)", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "156": {"Subreddit": "PhD", "Author": "Diirez", "Date": 1479494604, "Score": 1, "Body": "What field guarantees you 120k even if you don't publish?", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "157": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1479501075, "Score": 1, "Body": "trade secret :D", "Permalink": "https://www.reddit.com/by_id/t3_5c73pn.json"}, "158": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1479503376, "Score": 1, "Body": "The TA/fellowship/scholarships etc are all counted as financial resources. In a fully funded PhD program you would not have to show much (if any) assets.", "Permalink": "https://www.reddit.com/by_id/t3_5dosih.json"}, "159": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1479532269, "Score": 2, "Body": "As one who have been in your place just 2 with change years ago I can confirm that once you get accepted into a PhD program with a scholarship your university will issue you an I-20, which is all you need to get a student visa. I  the I-20 it will say that you are accepted and the tuition and the scholarship are provided. ", "Permalink": "https://www.reddit.com/by_id/t3_5dosih.json"}, "160": {"Subreddit": "PhD", "Author": "RobbinGuy", "Date": 1479542607, "Score": 1, "Body": "Publish the method !!", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "161": {"Subreddit": "PhD", "Author": "boopadoop125", "Date": 1479543744, "Score": 1, "Body": "Unfortunately a methods paper on it has JUST been published. I'm still going to try to publish what I have but it will be a big iff on whether I'll make it. ", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "162": {"Subreddit": "PhD", "Author": "Lucy_the_PhD_student", "Date": 1479544644, "Score": 2, "Body": "Turn your introduction chapter into a literature review?", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "163": {"Subreddit": "PhD", "Author": "RobbinGuy", "Date": 1479548897, "Score": 3, "Body": "Draft the manuscript and send it out to a low impact journal and just mention minor differences ", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "164": {"Subreddit": "PhD", "Author": "reddit_joanna", "Date": 1479551866, "Score": 5, "Body": "I can only speak from the perspective of a PhD student in the UK. Here, in 99% cases you don't need to publish to finish a PhD. I actually know one person who worked hard for 4 years and at the end nothing worked. He did not publish anything because of the lack of results but he still defended his thesis and got a job.\n\nI think the most important thing is to realise how much you've learnt, both in terms of the actual science but also the transferable skills (problem solving, communications, time management etc.). The examples of the latter are very important when applying for jobs.", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "165": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1479595195, "Score": 2, "Body": "Honestly, the best thing is just to do better during the postdoc. Do what you can to publish 3-5 things by the end of your postdoc and that may be enough to help you move on past there.\n\nYou still have opportunities to make it up, but you need to be diligent.", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "166": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1479659262, "Score": 3, "Body": "Can you post a summary?", "Permalink": "https://www.reddit.com/by_id/t3_5dy7hy.json"}, "167": {"Subreddit": "PhD", "Author": "esguerrero", "Date": 1479669904, "Score": 1, "Body": "I think that feeling anxiety about future is common at the end of the PhD studies. I just finished my PhD couple months ago and trust me, I felt the same. I live in Sweden and even when are very different countries, academia has the same rules, having a tenure position is not even in my vocabulary. My advice, keep writing, promote yourself in conferences and in the Web, try to get another perspective if you get stuck, one step at the time, for now focus on writing, the tenure will come sooner or later :)", "Permalink": "https://www.reddit.com/by_id/t3_5dwvqt.json"}, "168": {"Subreddit": "PhD", "Author": "curiouskiwicat", "Date": 1479675550, "Score": 3, "Body": "It doesn't sound like you have done a lot of research on your chances. When I wanted to assess my own chances, I looked around at professors in my field who had got a position fairly recently and compared their CVs at the time they would have applied for the job with what I would hope to get. I think that kind of small-scale empirical approach to this question will help you to work out some good chances. It won't do you any good to try to estimate your odds from a base rate that is not specific to your field, area, and your own CV.\n\n\nIn my field, 4 first author would be not bad, and its almost certainly more than I'll have when I graduate, so my initial guess is you stand a very good chance. But if you do analyze your prospects and find yourself coming up short, really ask yourself why academia is so important for you. Private sector is competitive for STEM students both for your own personal gain in $$ and in many cases, also the sense of impact and the value you feel you're providing back to the rest of the world. I know some people have aspirations that really line up with academia and nothing else, but others just get swept along with the academic fervor and forget to consider what's really important to them.", "Permalink": "https://www.reddit.com/by_id/t3_5dwvqt.json"}, "169": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1479679397, "Score": 2, "Body": "You guys have the tenure system up there? It's not a thing in Denmark. But obviously it's very difficult to get rid of anyone on a permanent contract. ", "Permalink": "https://www.reddit.com/by_id/t3_5dwvqt.json"}, "170": {"Subreddit": "PhD", "Author": "phd_in_throwaways", "Date": 1479687963, "Score": 1, "Body": "Thanks for the advice--I definitely need to figure out a better routine and I should probably figure out how to make exercise a bigger component of it.\n\nWere you able to take aerial silks and other similar classes in your university or outside (just so I have a reference point for where to begin looking)?", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "171": {"Subreddit": "PhD", "Author": "phd_in_throwaways", "Date": 1479687985, "Score": 1, "Body": "Any specific reason why it took until then?", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "172": {"Subreddit": "PhD", "Author": "phd_in_throwaways", "Date": 1479688045, "Score": 1, "Body": "Thanks for the advice, my main takeaway so far is how everyone's been using exercise as a staple in their life and I should probably establish some sort of routine to get me out of my hump!", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "173": {"Subreddit": "PhD", "Author": "phd_in_throwaways", "Date": 1479688297, "Score": 1, "Body": "&gt; PhD students are awkward as fuck\n\nHaha yeah, I think that spending most of my time with close female friends hasn't prepared me for the amount of effort I'd have to put into becoming friends with somewhat antisocial guys.\n\nDid you get really involved in the student chapters or just attend meetings? Did you find committing yourself to one more beneficial than just going to a bunch of them to meet people?", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "174": {"Subreddit": "PhD", "Author": "phd_in_throwaways", "Date": 1479688585, "Score": 1, "Body": "I think this experience was my biggest surprise--although I'm an introvert, the complete lack of a social group has been a shock and something I was pretty unprepared for. I guess I was anticipating that there would be more mixers and other events where I could meet people and hang out, but those have been missing. I don't have any close friends here, so it feels quite isolating to see some of the PhD students who went to undergrad in the area be so social with their undergrad friends. Logically, it totally makes sense that they'd have a richer social life than me, but it still hurts to feel like a loser when people ask you what you did on the weekend and there's not much to say.\n\nI'll definitely look into the social clubs here and see what's available--thanks for the advice!", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "175": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1479691556, "Score": 1, "Body": "Only after the exams I am reasonably assured that I will be allowed to finish. My department does not allow students to take or pass the exams if there is doubt of student's abilities.", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "176": {"Subreddit": "PhD", "Author": "bookanop", "Date": 1479692602, "Score": 1, "Body": "It helps with the balance... I tend to be able to focus better writing wise when I have hit the gym... you can do this!", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "177": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1479697928, "Score": 1, "Body": "If you have several - good for you - you can choose where you like it more. I got involved with the only one available and now hold an officer position. I enjoy it and it lets me be as involved as I can and want. I can lay back of there is busy time in my research project. \nRegarding the guys in the lab - STEM fields are traditionally very unbalanced towards males, so as a side effect guys in STEM fields have no idea that girls are also people. Try to offer them to have a coffee break together, or even just go get coffee together and get back to the lab. Tell them you used to do it in your lab during your undergrads (not really, but they don't know). Then once in a while suggest to go get \"lab lunch\" all together. Some other little things like a \"game evening\"  go a long way too. Before you know it you will be their leader! We had a girl like that in our lab, so I am not just talking - I have seen it happen before. After all, guys are people too! ;) Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "178": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1479698627, "Score": 1, "Body": "Best of luck! The first step is the hardest but I'm sure you can do it.  ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "179": {"Subreddit": "PhD", "Author": "esguerrero", "Date": 1479702093, "Score": 1, "Body": "Exactly, in Sweden there are not tenure tracks but stable/safe professor positions scale which can be more or less compared. For now I'm just another postdoc.", "Permalink": "https://www.reddit.com/by_id/t3_5dwvqt.json"}, "180": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1479705866, "Score": 1, "Body": "Ehhhhh me too! I have a manuscript submitted and I am getting another submission ready. Graduating this December, defended in October!  Keep our chin up, no manuscripts isn't the end of the world, just makes some things a little harder. Also, grats on finishing your PhD at 26 :D I am 30.. and my friend who just graduated was 38.", "Permalink": "https://www.reddit.com/by_id/t3_5dresy.json"}, "181": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1479733923, "Score": 1, "Body": "This is excellent! Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_5e2hg8.json"}, "182": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1479745055, "Score": 1, "Body": "You'll need to do a postdoc or 2 before getting a tenure track faculty job. The PhD rate -&gt; tenure track is much closer to 0.5 than 25%. Almost no-one gets a tenure track position in stem straight from a PhD, unless you count sociology and psychology as stem", "Permalink": "https://www.reddit.com/by_id/t3_5dwvqt.json"}, "183": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1479749261, "Score": 1, "Body": "I looked outside the uni mainly, just for the reason i wanted to find and older community/friend group and felt like spending alot of time in uni based groups made me feel like an undergraduate. I do take a yoga class weekly at the uni but thats only bc its free :) ", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "184": {"Subreddit": "PhD", "Author": "limit_veillance", "Date": 1479754800, "Score": 16, "Body": "I'm two weeks away from defending my dissertation and damn that's a good question to reflect on right now. Some days I think I just fell into my phd because I was lucky enough to have some good opportunities come my way for research during my masters. However, in my undergrad I always looked up to my profs and TAs; I knew very quickly that I was at least going to get a masters and see where it would take me. In terms of motivation that keeps me going: it's important to remember that your phd is **your** own project and you get to make a unique (albeit typically very small) contribution to a body of research and a community of scholarship. There's a lot of bullshit some days and no shortage of people that shit on grad students for making 'silly life choices' but in my view it's infinitely more satisfying work then showing up to an office and working on something that might not give you any meaning in life at all. ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "185": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1479757932, "Score": 2, "Body": "Well, I fell in love with psychology as an undergraduate, despite wanting to go into medicine. Approaching graduation, I learned that there are zero jobs in the field for just a bachelors degree. So, I got my masters degree in order to be able to work. I wanted to do the MD route, but I quickly learned that it requires about 14 years of post grad schooling to be a board-certified psychiatrist. So, I went the PhD route. I'll still be a doctor in psychology, and if I do end up wanting to prescribe medication (rather than academia as my current path is leading), I can get an additional masters degree and relocate to a state which allows it. ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "186": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1479757945, "Score": 1, "Body": "Good luck on your defense!!", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "187": {"Subreddit": "PhD", "Author": "angieShroom", "Date": 1479763902, "Score": 9, "Body": "Good luck on defense and thank you for your answer. To be honest I'm really moved by your last sentence because the reason why I'm considering a phd is that I somehow feel like I can't convince myself that I should spend entire life live a so-called-happy-middle-class life.I feel like getting a phd is a way for individual to contribute to human-beings, and thus a meaningful thing to devote in during the best time of my life. I was worried that this is a somewhat naive and idealistic idea. But I feel way, way assured to see that there's someone before graduation(good luck!) still think so. ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "188": {"Subreddit": "PhD", "Author": "angieShroom", "Date": 1479764019, "Score": 2, "Body": "wow that's a big commitment to the discipline. I haven't really found a passion, but I just feel that phD is a lifestyle that suits my value very well. Good luck man.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "189": {"Subreddit": "PhD", "Author": "Saelie", "Date": 1479768201, "Score": 6, "Body": "I've always enjoyed studying and learning, and doing independent research has always appealed to me and been something I feel I've been good at. I tried some internships and work experience and things and never enjoyed them as much as doing research. I also really dislike the concept of a 9-5 (more commonly an 8-8 in the kind of areas I would work in (am an economics PhD student)). So I decided to pursue a PhD for now and see where it takes me :) ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "190": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1479771887, "Score": 1, "Body": "Looks amazing, OP. Thanks for sharing! ", "Permalink": "https://www.reddit.com/by_id/t3_5e2hg8.json"}, "191": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1479774787, "Score": 1, "Body": "I am getting a PhD in a field of computational science, and I don't like to look at it in the specific ways most of the other posters have. I think a productive day is one in which you move some part of your research forward, even a small amount, and you learn something new. A new technical skill, a new way to think about your research, a new research topic, whatever.", "Permalink": "https://www.reddit.com/by_id/t3_5cplme.json"}, "192": {"Subreddit": "PhD", "Author": "comingfromthenorth", "Date": 1479782759, "Score": 18, "Body": "I like to be called Dr.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "193": {"Subreddit": "PhD", "Author": "drarch", "Date": 1479785719, "Score": 3, "Body": "My first year as an undergrad, I got mostly C's. Never would have expected doing a PhD. At the end of my undergrad, however, the great recession had just hit, and 90% of my program didn't find work. I planned ahead and went to grad school. While there, something clicked. After graduation, I went to work, and realized that what clicked for me in grad school wasn't valued in the workplace. I had kept in touch with my undergrad professors, and was eventually invited to return as an adjunct. I realized that my experience in the workplace and in graduate school had left me with some questions that I wanted to explore. I was lucky enough to find a non-profit that needed a researcher in the same field I was interested in. With all of that in mind - my experiences, my curiosity, and the opportunity - I decided to take on the work as part of my PhD. It's been a journey, but it's been worth it. ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "194": {"Subreddit": "PhD", "Author": "Abi1i", "Date": 1479785912, "Score": 3, "Body": "Always had a goal of being the first in my family to accomplish something great. First generation student for my family and I've managed to earn a bachelor's and a master's and will soon earn a PhD with all of them in mathematics. I'm basically being selfish and setting a high bar for my siblings to reach haha.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "195": {"Subreddit": "PhD", "Author": "angieShroom", "Date": 1479788929, "Score": 1, "Body": "convincing. I mean it.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "196": {"Subreddit": "PhD", "Author": "d1o0m", "Date": 1479811840, "Score": 1, "Body": "Main motivation: Lack of good Jobs", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "197": {"Subreddit": "PhD", "Author": "Owny33x", "Date": 1479827164, "Score": 4, "Body": "The only honnest answer in this thread haha", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "198": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1479829386, "Score": 5, "Body": "The money. Hahahahaha", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "199": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1479845415, "Score": 1, "Body": "Boredom, from my dead end job. That and my love of science\n", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "200": {"Subreddit": "PhD", "Author": "lcrc2016", "Date": 1479849601, "Score": 2, "Body": "Motivation: get student visa to stay in Europe :-)", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "201": {"Subreddit": "PhD", "Author": "ryanxmg", "Date": 1479897809, "Score": 1, "Body": "UK PhD student here, just started year 2 of a 4 year course in applied oceanography.\n\nChose my PhD primarily because the subject is so interesting (Can't really say exactly what, because I'm the only person studying this specific area and it may give my identity away if you search for it). Regardless of anything else, this should be your number one priority when choosing whether you want to study it for 3-4 years.\n\nMy PhD has a few added benefits. Namely, working with industry, enhanced multi-disciplinary training, and a little extra than the minimum stipend (Around £14,300 at the moment).\n\nI didn't base my choice on a career in academia. That's never been a goal, but neither was a PhD or even a Masters level qualification. But if the right opportunity turns up, why wouldn't you take it? Plans are to get an interesting job in industry (Software/hardware engineering, government institution, private sector in ocean technology, offshore renewables...), or a post-doc if that's a better option at the time.\n\nFor motivation: it's going to sound depressing, but it's the fact that there is zero guarantee in life for happiness, or fulfilment, or even meaning at all. I've been told countless times that my skills are well-suited to a job, that I could be earning lots of money in an industrial setting, or that a PhD just means I'm still a 'lazy student'. But no, I'm ignoring all of that, because my gut tells me there is a good future ahead of doing this project.\n\nIn your position, I'd think about the following few points.\n\n1) Do you enjoy independent project work? The reason you'll here this many times in the coming years is simply because it is an incredibly important thing to consider.\n\n2) Are you considering a PhD just because you don't know what you want to do in the future? Because a PhD is probably the hardest way to cope with putting off starting a career.\n\n3) Is the area you are thinking of going into likely to fund your position? I have 3 friends who self-funded their PhD positions. ALl three dropped out within the first 18 months, due to finances, or stress from finances.\n\n**TL;DR** My motivation is fuelled from thinking about the future. Consider why you want to study a PhD before you go for it.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "202": {"Subreddit": "PhD", "Author": "angieShroom", "Date": 1479923779, "Score": 2, "Body": "nah man I read it all. I guess the reason why I want to pursue a phD is because I'm in a quite job-oriented college, ironically. Everyone's raving about job fairs and internship and I just stop to ask myself do I really want it? I can't convince myself having a job in some kind of giant tech company is a meaningful way to spend my life. I don't know if I'm being unrealistic or not. But hey I guess I'll figure it out one day. Thanks a lot for your reply.", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "203": {"Subreddit": "PhD", "Author": "paleochiro", "Date": 1479976685, "Score": 1, "Body": "It won't be THAT easy I'm afraid, I have found academic funding to be very restrictive in terms of nationality in Europe, difficult to obtain for non-EU individuals. They tend to be very protective.\n\n I'm talking about the UK, Ireland, Spain, France, not to mention that in the last two you'll be required to speak the local language. Perhaps Germany would be better? I'm not sure, it may also depend on the field of study. The physics and engineering departments in my university bring a lot of PhD students from Asia maybe because they cannot always find interested local students? Quality?\n\nI'm under the impression that the US will be much more open to incoming international students.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "204": {"Subreddit": "PhD", "Author": "ahmadamaj", "Date": 1479977649, "Score": 1, "Body": "I speak fluent English and French, and to a lesser extent Spanish. \n\nWhat university are you attending? Also any recommendation for US universities?", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "205": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1479979150, "Score": 3, "Body": "Are you serious ? AFAIK European universities are *very encouraged* to post PhD positions on [Euraxess](https://euraxess.ec.europa.eu/) (at least mine is). From the universities in Europe I've visited, in my field, the foreigners always outnumbered the natives. I'm thinking of Uppsala (not a single Swede except for the prof), Dublin (the prof in charge is English, quite a few of the PhD candidates are non-Irish), UK (Prof is French, PhD candidates Italian), etc...\n\n@OP: Still speaking for my university, if you're just looking for a 100% research position language proficiency is not required as long as you speak English. We have a Chinese fellow for example, doing research with us. But such positions are hard to come by if you expect to be paid. If you're looking for a TA + research position (full-time assistant as it's called here), then you're supposed to teach and must know the language.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "206": {"Subreddit": "PhD", "Author": "ahmadamaj", "Date": 1479980287, "Score": 1, "Body": "How would I apply to a TA+Research position? is it up to the professor?\n\nAlso thanks for the website you mentioned, looks interesting.\n", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "207": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1479981033, "Score": 1, "Body": "They should be on Euraxess. In my university, there's also a [vacancy page](https://www.ulb.ac.be/ulb/vacances/academiques/). Of course, these are only available when the previous full time assistant has ended their contract, usually end of September.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "208": {"Subreddit": "PhD", "Author": "ahmadamaj", "Date": 1479981383, "Score": 1, "Body": "ok great!\n\nAny ideas about the options for studying environmental sciences in Belgium? I recently visited Brussels and was blown away by it.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "209": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1479981496, "Score": 1, "Body": "I have no idea really :/", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "210": {"Subreddit": "PhD", "Author": "ahmadamaj", "Date": 1479981626, "Score": 1, "Body": "That's ok. Thanks for the help. I'm finding some interesting options on Euraxess.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "211": {"Subreddit": "PhD", "Author": "paleochiro", "Date": 1479982319, "Score": 1, "Body": "Sorry, to clarify, I meant funding is quite restrictive for non-EU individuals. You are right, you'll find many nationalities in European universities, but mostly confined to the EU zone. ", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "212": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1479982640, "Score": 1, "Body": "Oh OK ! Yes I've seen that pattern as well.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "213": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1480025802, "Score": 1, "Body": "oh my god! \n\n\nPlease, please teach me how to do that! I'm a single working mom of 1 child and I cannot manage my head or time properly for my PhD!", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "214": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1480028045, "Score": 3, "Body": "Scandinavia. \n\nThey consider PhD a job, and they pay you for doing it.", "Permalink": "https://www.reddit.com/by_id/t3_5emlmp.json"}, "215": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480030613, "Score": 2, "Body": "Master's degree of any kind is not required. Most students have it not because they wanted a PhD, but because they wanted something else that did not work out. Finance is one of the most competitive business PhDs. As with any PhD most weight is research. If you have good research skills and CREDIBLE researcher(s) write your recommendation letters, you would be as competitive as any. High GMAT and TOEFL are a must of course.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "216": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1480031544, "Score": 2, "Body": "A master's in math or economics (from a reputable institution) is a perfectly viable and legitimate path to the finance PhD, should your profile not be strong enough to be admitted straight from a bachelors degree.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "217": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1480031650, "Score": 2, "Body": "As for publications, as long as they're not pay-to-play, then they will definitely count in the positive. It's very rare that PhD applicants have publications in reputable journals through.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "218": {"Subreddit": "PhD", "Author": "felliperfm", "Date": 1480039313, "Score": 1, "Body": "Thank you for your answer. I will see if I can research and publish something interesting with my professors. I will check GMAT too, and sure will study harder to make a good TOEFL test. ", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "219": {"Subreddit": "PhD", "Author": "felliperfm", "Date": 1480039502, "Score": 1, "Body": "I see. One of my publications won an international prize, and I think it should count, right? I will try and publish as many studies as I can on the next year to see if I can be accepted. If I can't, the experience will be worth it, and I will settle for a masters degree as a preparation for the PhD, which will also be worth it. Thanks for your answer. ", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "220": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480042604, "Score": 1, "Body": "I am really curious what prize now :D", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "221": {"Subreddit": "PhD", "Author": "felliperfm", "Date": 1480047094, "Score": 1, "Body": "I don't think I should disclose too much of personal information, because my advisor got me a really nice (but not asked) offer of a masters in my country. I really appreciate that he did this for me, but I haven't made my mind yet. If I have the chance to get a PhD without the masters degree, then I will probably do it.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "222": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480048268, "Score": 1, "Body": "You can PM me if you change your mind. No need to post in comments. Also, I am not sure what part of the world you are in, but US PhD is very different from European or Asian one. You need to identify the type of research you want to do then look for people who do it. When I was applying I had a spreadsheet with all the US school who grant a PhD in my area - around 100 total. You will get similarly long list.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "223": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1480053442, "Score": 1, "Body": "What is the impact factor of the journals you are publishing in?  \nAre these considered top journals in your field? Are they decent journals in your field? Do the people at the institutions you want to study at also publish in the journal you published in (if the answer to this is yes, then you have a great shot at admittance)? \n  \nThese are all good questions to ask to find out how much value your publications will have when you are applying.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "224": {"Subreddit": "PhD", "Author": "kalamano", "Date": 1480091698, "Score": 1, "Body": "How's the application going?", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "225": {"Subreddit": "PhD", "Author": "Larianna", "Date": 1480097030, "Score": 2, "Body": "Yes, absolutely. You have to pass through different institutions. The university, before forwarding your application to the department, will typically look only at GRE/GMAT, your GPA in your previous degrees, and sometimes TOEFL. If you fulfill the requirements they will pass your application on to the department. The department will primarily be interested in your letters of recommendation, cover letter or personal statement, and research. Look for personal statement samples written by successful students in your field. Make sure you show them you are serious and passionate about this, because the biggest problem in a PHD program is that people get exhausted and give up or take forever. Your department wants someone who loves the field so much you won't just run off at the first signs of stress.", "Permalink": "https://www.reddit.com/by_id/t3_5eq8rz.json"}, "226": {"Subreddit": "PhD", "Author": "itisspeltwithanA", "Date": 1480103862, "Score": 2, "Body": "Pretty well thanks, really kind of you to ask! \n\nI was lucky to find a paper that helped to crystallise my potential research and better yet, the academics who authored it work in departments I was hoping to be able to apply to! \n\nI've gotten in touch with one, who's unfortunately on leave right now but put me through to a colleague. So now I'm currently working on the proposal while awaiting responses from the colleague and from the other academic. \n\nHopefully I can get a solid proposal together and put in some applications before funding deadlines...", "Permalink": "https://www.reddit.com/by_id/t3_5dawib.json"}, "227": {"Subreddit": "PhD", "Author": "awayfromtheants", "Date": 1480119864, "Score": 1, "Body": "My dad was a professor and I grew up hanging out in his lab/classroom. I always told him I didn't want to do a PhD; that I wanted to work and develop practical skills/build my professional career etc, etc.  He died while I was doing my Masters, and I nearly dropped out. But after producing a successful dissertation despite the personal challenge, I started to think I could indeed complete and enjoy research. I definitely like the idea of having a terminal degree in my field, but I also think I was seeking a connection with my dad. \n\nA PhD was also the ticket back to a country where my partner lived. We were desperate to be together, were really committed to a future, but kept running into immigration hurdles. It took three years of applying but I finally got PhD funding and came back. We just broke up. \n\nI forgot where I was going with this..... Make sure you have a really good/personal/enduring reason you want to do a PhD. It's a tough road and many days there's nothing to keep you going but yourself. ", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "228": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1480179190, "Score": 3, "Body": "If this tool only goes up to the end of high school then I would find it irrelevant. I normally try to write articles so they can be read by someone with an undergrad degree in my field. For example, I shouldn't need to explain atomic bonding and orbitals when writing about self assembly.", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "229": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1480210956, "Score": 3, "Body": "Lower grade level language takes more space to explain the same information, right?  If you've got a page limit, you can't afford to waste space on simple explanations.  The goal becomes: Squeeze as much info into the allotted pages through the mechanism of high grade level language so that reviewers feel your work is a significant contribution, while not using language so complicated (such a high grade level) that your reviewers decide to reject based on incomprehensibility.\n\nProTip: I don't think I've ever seen a paper rejected based on high grade level language incomprehensibility.", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "230": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480248337, "Score": 2, "Body": "&gt; I don't think I've ever seen a paper rejected based on high grade level language incomprehensibility.\n\nMy advisor papers are usually (1 every 3 approx.) rejected due to language incomprehensibility. She likes to write in a very obscure and wordy way, adding a lot of concepts, explanations and technical concepts in a boring and complicated way to read. Even for experts on the topic, following one of the explanations can be really difficult and exasperating. \n\nAnd even with that high ratio of rejection, she won't change her way of writing.\n\nJust commenting...", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "231": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1480250423, "Score": 1, "Body": "I'd be really curious to see the result from running some of her material through an online readability calculator like [this one](https://readability-score.com/text/)-- does she actually score high on FK-grade level?  And what advice is the system giving to solve readability problems?\n\nNote: FK and other readability metrics are only calculating readability at a very shallow level, based on things like word and sentence length, and syllable count.  The \"logic\" structure of the text, or the ordering of claims and evidence, etc, is studied in argumentation analysis, and I'm not sure that field has progressed far enough to build a trustworthy readability calculator.", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "232": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480272615, "Score": 1, "Body": "sure whatever you want to use this for", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "233": {"Subreddit": "PhD", "Author": "ai_4_life", "Date": 1480279268, "Score": 3, "Body": "its nice to rant here. i often wonder if it will be worth it in the end, but i'ts just my own self-doubt. I know I really want to be a professor and work in academia. Hardest part for me is not working with and around other people.", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "234": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1480280058, "Score": 15, "Body": "I've never been happier, more fulfilled and my PhD is fully funded", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "235": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1480280387, "Score": 9, "Body": "You just killed OP", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "236": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1480280800, "Score": 6, "Body": "At what stage of you PhD are you? I was the same as you when I started out, also with a fully funded PhD. Now everything crumbles.", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "237": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1480280860, "Score": 5, "Body": "A Ph.D. is the highest degree, and signifies that you are an expert in the field and that you have made a significant contribution to your subject (this is what a thesis is). Of course it is going to be hard. There are quite a few people that waltz into the Ph.D. simply because 'its the next step' or because they couldn't get a good job with their B.S. or M.S. degrees. \n\nBy year 2-3, I was at my breaking point, but I made the necessary adjustments. Now, this year, I published 6 papers and might get a 7th by the end of December. Looking back, I realize that I approached the Ph.D. without really understanding what it represented or how much work would be involved. Luckily for me, I started to love my research around 2-3 years in and got the hang of it and became more successful. But obviously, it doesn't always work out this way.\n\nThe internet (including this forum) are full of warnings - similar warnings are not given for B.S. and M.S. level degrees, so it is obvious that the Ph.D. is on 'another level' of difficulty. Too many prospective students are ignoring this advice unfortunately. Like another commenter posted about being fulfilled, I completely agree. The Ph.D. has been the most challenging, but most fulfilling thing I've ever done, by far. I wouldn't change a thing.\n\nIf you feel the way you do, why not just wrap it up with a Master's degree and head out? Any career that really makes use of your Ph.D. is not going to be much easier than what you are experiencing now.", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "238": {"Subreddit": "PhD", "Author": "uniquelysimilar", "Date": 1480286190, "Score": 1, "Body": "It's always nicer in hindsight, isn't it?  But I'm sure when you were sitting there at the year 2 or 3 mark, you were at that point of wondering what you had gotten yourself into.\n\nIt's great to love the research.  I think that's probably the best part about it.  But when time (more like the lack having time) isn't on your side, well, it becomes a little difficult.  And yeah, I'm sure we've all had out tales of the 80+ hr weeks.  Was just more of a rant and vent situation.\n", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "239": {"Subreddit": "PhD", "Author": "uniquelysimilar", "Date": 1480286234, "Score": 3, "Body": "/dead\noh, if it was only that simple.  might as well tie those volumes of research material to your ankles like a cinder block and go swimming!", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "240": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1480295504, "Score": 1, "Body": "True, but like I mentioned, it doesn't always work out for the better.  I've seen a lot of people go through the same thing and leave the program or end up jobless at the end. I'd say even when I was at my limit, I never thought that pursuing the PhD was a terrible idea.\n\nIn this case, and for other big life decisions, whether to keep going or not is a critical decision. If you really don't like it, don't continue just because you feel too invested - a lot of people wrongly apply this logic for relationships, career, etc.. I've seen a few people 'keep going anyway' only to land in further disaster. I know someone who eventually got kicked out after 4 years of their Ph.D. program, even though they firmly knew they weren't interested in the work after 1-2 years but kept continuing because they felt too invested and because their parents were pressuring them to continue. In the end, you know best. \n\nWe all have our lows, so any big decision should only be made after &gt;1-3 month of consideration, I'd say.", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "241": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480296232, "Score": 1, "Body": "This just in: your dissertation has to actually show something new... in other news: fire is hot.", "Permalink": "https://www.reddit.com/by_id/t3_5f8u53.json"}, "242": {"Subreddit": "PhD", "Author": "physixer", "Date": 1480296576, "Score": 1, "Body": "I know. But 'the showing' is officially in the defense. During the proposal, 'potential of showing' should suffice (subject to the committee being convinced)?", "Permalink": "https://www.reddit.com/by_id/t3_5f8u53.json"}, "243": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1480296958, "Score": 1, "Body": "idk. up to the way its done in your place. In my field/institution defense is a formality that you go through when you already have results.", "Permalink": "https://www.reddit.com/by_id/t3_5f8u53.json"}, "244": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1480309944, "Score": 1, "Body": "Just to crush us a little more, PhD's are not the highest degree. You can be awarded Doctor of Science or Doctor of Letters by some institutions in some countries. It's can be a little upsetting to find this out. There is no end, ever haha.", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "245": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1480328432, "Score": 2, "Body": "My thesis is due at the end of February. I'm hating every second of this. I've only really enjoyed very small portions of the PhD. If I knew what it was going to be before I did it - maybe I wouldn't have done it. But it's too late to think that now. Lots of writing to do...", "Permalink": "https://www.reddit.com/by_id/t3_5f6jk8.json"}, "246": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480333479, "Score": 1, "Body": "I was also curious so I just entered one of her papers to the tool you suggested. I chose one I know it is difficult to follow and requires a high level of attention, the results are the following:\n\nFlesch-Kincaid Grade: 10.6\nFlesch-Kinkaid Reading Ease: 50.4\nGunning-Fog: 14.6\nColeman-Liau: 13.5\nSMOG: 13.7\nSMOG: 10.9\n\nSentences &gt; 30 syllabes: 137 (50%)\nSentences &gt; 20 syllabes: 175 (64%)\nSentences (total): 274\nLongest sentence: 62 syllabes.\n\nThat's why I don't really trust this kind of tools. According to the numbers, it is an average text, suitable for undergrad students. But I know it is a very tangled text, hard to read, that was rejected (among other reasons) for being \"excessively wordy and verbose\". I guess the tools can be useful to compare certain aspects of the text, or as an approximation, but cannot be trusted for a serious use.\n\nP.S.: According to the same tool, the former text in my comment scored 3.8 in Kincaid grade and 82.8 in reading ease, which is another symptom that it cannot seriously be trusted and should be considered just as a guidance.\n\nMy advice is to use it if it teaches you how to write better, but to trust your instinct when evaluating the quality of the text.", "Permalink": "https://www.reddit.com/by_id/t3_5f061u.json"}, "247": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1480354659, "Score": 7, "Body": "Start with your hypotheses (what's the point of the paper, what are you trying to accomplish)  \nThen back them up with past literature  \nThen talk about how you'll prove/disprove your hypotheses with data  \nHow will you get that data, and how will you analyze it?  \nOnce you've proved your hypotheses, what does that mean for the field? What theoretical contributions have you made?\n What limitations did your research have?\n  \nAnd all of a sudden you have a paper.", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "248": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1480366353, "Score": 4, "Body": "Start by making the figures.  What data do you have, and what does it show?  Then write up an outline around that.", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "249": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1480371314, "Score": 1, "Body": "What are you actually applying for funding *for*?  A PhD?", "Permalink": "https://www.reddit.com/by_id/t3_5feevf.json"}, "250": {"Subreddit": "PhD", "Author": "wandering_hedgehog", "Date": 1480371876, "Score": 1, "Body": "Ah. Yes, a PhD. Will add that.", "Permalink": "https://www.reddit.com/by_id/t3_5feevf.json"}, "251": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1480376757, "Score": 2, "Body": "I usually start by filling out the introduction and methods sections. This will make you feel like you have 30-40% of the paper done (which is a good feeling), is the easiest part, and lets you step back to overview what the background/purpose for your study is, what your specific objectives/hypotheses are, and what sorts of experiments and analysis you've carried out. \n\nThen, it is easier to connect these things and start putting your results into text and figures. After this, start discussing the results in relation to the background and original hypotheses in a discussion or conclusion section. Then, take a day off or so and re-read the paper you've written - how can it be improved? What sorts of additional analyses need to be carried out? How can some discussion/results be expanded upon? Once you feel it is in good shape, summarize everything with an abstract and viola, you have a first draft of your paper.", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "252": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1480378412, "Score": 1, "Body": "what field bro? ", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "253": {"Subreddit": "PhD", "Author": "gonutzdonutz", "Date": 1480379398, "Score": 1, "Body": "Biochem", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "254": {"Subreddit": "PhD", "Author": "iamlivingalife", "Date": 1480381725, "Score": 1, "Body": "I was in a similar situation where I was away from all my families and close friends. And there was this language and cultural barrier to break as well. It was hard at first. But things start to get better once you expand your life a bit. For example, for me, what worked was to search part-time jobs online, get interviews, volunteer jobs(I met really nice people there). And if you are an international student, you could hang out with other international students as they are probably at the same situation with you.\n\nBe curious about things around you.Things unexpected will always happen. Follow event news on Facebook. Join the ones that interest you or whatever just to get yourself out of your normal routine. This really helped me.", "Permalink": "https://www.reddit.com/by_id/t3_5di01c.json"}, "255": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1480382528, "Score": 1, "Body": "Then no idea. Good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "256": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1480412938, "Score": 1, "Body": "I start by putting in data/figures, then write about them for discussion. I do methods after this and try to make it flow with the results so it's easy to pick out info. Then do the intro and make sure you thoroughly reference the previous literature on every point you've now made. Then conclusion and done.\n\nMy suggestion for you though, write whatever you think is easiest first. Get something onto the pages, anything. It will help immensely.", "Permalink": "https://www.reddit.com/by_id/t3_5fcq3n.json"}, "257": {"Subreddit": "PhD", "Author": "cjtargaryen", "Date": 1480414595, "Score": 1, "Body": "If it is imaging based, may find something with Sinapse: http://www.sinapse.ac.uk/", "Permalink": "https://www.reddit.com/by_id/t3_5feevf.json"}, "258": {"Subreddit": "PhD", "Author": "ticonzero", "Date": 1480455778, "Score": 1, "Body": "r slash Scholar", "Permalink": "https://www.reddit.com/by_id/t3_5fkxdm.json"}, "259": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1480479524, "Score": 3, "Body": "Sci-hub.cc", "Permalink": "https://www.reddit.com/by_id/t3_5fkxdm.json"}, "260": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480491701, "Score": 2, "Body": "gen(dot)lib(dot)rus(dot)ec\n\nIf you are looking for a scientific text add to the URL afterwards: \"/scimag\". It contains scihub among other sources for the search.", "Permalink": "https://www.reddit.com/by_id/t3_5fkxdm.json"}, "261": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1480499561, "Score": 6, "Body": "I usually acknowledge everything that is published, except if any other source has proven it wrong. I assume that if it published, it is likely to be true (at least with the current knowledge on the topic). It's not your job (at this point) to prove if somebody is wrong, but to get founding to be able to do that.\n\nHaving that in mind, I try to build a background for my research with the available sources. Think on it like writing a story. First you start showing a little bit of general context, and afterwards you tell everything around your topic, leaving a \"gap\" on the information, to develop the context for your research. That gap is where your research will fit, which is the conclusion of the story. In the development you should care about topics as why are you going to do what you are going to do, why it can be interesting, what technical drawbacks can you expect, why nobody ever cared about that before, if there are another known ideas different to yours to solve that problem and why yours could be better... And any other thing related to your research that could be of interest (of course, always trying to keep a positive mood about why your research is important).\n\nIn my field, chemistry, first I write a little bit about the history of the family of compounds I'm going to describe (first compound of the family, most characteristic reactions or products, technical applications of compounds of that family, etc). Afterwards I describe similar products to my own, but leaving some gaps my research will fill. If, for example, my research is about improving X property in my compounds in order to get something from them, I would start describing similar compounds that doesn't have the property (so afterwards I can focus my research on improving those products with the X property), I would continue by describing different products (unrelated to the family I want to do) that do have that X property and how it affect their behavior, and finally I describe products of my own family that already have that X property (if any). After all of that, fitting my research idea into that background is easy, telling how that X property would make those products interesting fo achieve something specific.\n\nEvery field is different, and perhaps in engineering, social sciences or other fields the best way is different. Perhaps knowing the specific field would help us to give a more accurate answer.", "Permalink": "https://www.reddit.com/by_id/t3_5fnmq4.json"}}