{"0": {"Subreddit": "PhD", "Author": "theworstcow", "Date": 1456849260, "Score": 2, "Body": "I would like to progress onto a PhD, and I was advised by at least two academics to do an MRes over an MSc. It seems that research experience is much better than taught knowledge, as my current supervisor thinks that all research experience is transferrable and therefore preferred, so depending on your field, narrow focus may not be an issue.\nI'm halfway (ish) through my MRes in biological sciences and I work alongside PhD students, pretty much just like a PhD except I have less time and my project is obviously smaller. I think the experience of working in the postgrad environment is excellent for preparing you for a PhD as well. I get nearly the same training as first year PhD students.\n\nMy advice would be to talk to your current tutor/supervisor and other academics, to get a feel of their impressions. It might be possible that you don't even need a masters at all?", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "1": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1456892867, "Score": 1, "Body": "That is a very strange requirement. What university requires that?", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "2": {"Subreddit": "PhD", "Author": "miniskull", "Date": 1456900407, "Score": 1, "Body": "Northwestern University", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "3": {"Subreddit": "PhD", "Author": "DoctorMarx", "Date": 1456901996, "Score": 1, "Body": "My PhD program had a similar requirement. (I'm not in Finance, though.) Like you, I hadn't really written something that in-depth before, so I ended up having to write a whole new piece just to submit with my app.", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "4": {"Subreddit": "PhD", "Author": "miniskull", "Date": 1456905384, "Score": 1, "Body": "Can you give me some details on how you write your own paper: how do you choose a topic (your own interest or by looking at the most known research activities of your department)? How do you prepare for the data, materials for this paper? Do you have anyone to assist you in writing this?", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "5": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1456916603, "Score": 2, "Body": "I would call and ask them about the specifics. At a guess, they want to see a sample of your writing style and general research views, so something from work might suit and save you heaps of time. ", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "6": {"Subreddit": "PhD", "Author": "DoctorMarx", "Date": 1456931516, "Score": 2, "Body": "To be honest, this was quite a few years ago, so I don't remember all of the details, but I think I just chose a topic that I was interested in, and I think it was a more theoretical paper, so I didn't have issues with data collection, etc. I might have had a faculty member from my undergrad institution look it over, but I can't remember if I actually did so.\n\nIf I were to it over again, I'd probably choose my topic a little more intentionally--use it as an opportunity to contribute to the story about your fit with the institution that you're telling in your statement of purpose, and so on.", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "7": {"Subreddit": "PhD", "Author": "Fenzik", "Date": 1456942499, "Score": 1, "Body": "Do you not have to do a masters thesis?", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "8": {"Subreddit": "PhD", "Author": "miniskull", "Date": 1456966743, "Score": 1, "Body": "A lot of Ph.D's program doesn't require students to have a Master's Degree. Plus, some Master's Student doesn't need to write a thesis to graduate (i.e. MBA students). ", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "9": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1456970596, "Score": 1, "Body": "Any update? ", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "10": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1456970802, "Score": 1, "Body": "I'm in Australia where the PhD system is entirely different and much more benign than the US, which sounds dreadful. I'm in the first year of a PhD that I started at age 40. The track record in industry and my mature work ethic were seen as a plus. I re-established myself by coming in as a vacation scholarship student. That went really well and I was actively recruited as a PhD student. So maybe looking for a program that can let you assist on research without enrolling as a grad student in order to demonstrate your commitment and other qualities? ", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "11": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1456970951, "Score": 2, "Body": "I think the obvious place to start is a review paper in an area of particular interest to you. Try and get a handle on some of the current literature (and read other reviews) and then write something up that details the state of the art and some avenues for further investigation. It could be a head start on your postgrad work.", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "12": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1456999798, "Score": 1, "Body": "Yeah, I have made it clear that I'm NOT PLEASED. But I don't feel like he's apologised. BAH :(", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "13": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1456999854, "Score": 1, "Body": "Yeah, so I couldn't be a TA yet as I think that's from 2nd year onwards, but I'm exploring other funding options at the moment...", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "14": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1456999928, "Score": 2, "Body": "Yeah - they're not going to let me apply for the funding. SO FRUSTRATING. But I am trying to put that rage in a little box and tie it with the Bow of Life Experience and hide it deep in my soul. Am also potentially looking for other funding. There might be one other option, so plz can the elven/Jedi parts of you send some good vibes?", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "15": {"Subreddit": "PhD", "Author": "Lattice_Bowel_Mvmnts", "Date": 1457009164, "Score": 2, "Body": "I can't speak to any of the foreign aspects, but it is definitely doable!  I did the same thing, 5.5 years in industry, got bored with product development and had gone as far as I could with my MS degree, and am now a PhD candidate in the heart of my dissertation research.\n\nAssuming the degrees are transferable to a US institution, I would start by identifying your subtopic of interest, and find schools that match your goals and professors who have some connection to the subtopic you want.  A quick email to them may be a good way to then find out if they are available and open to working with you.  I did that as my first step, had a few emails back and forth, really liked the guy, and so I did what he told me to do next, just apply formally.", "Permalink": "https://www.reddit.com/by_id/t3_48p2dt.json"}, "16": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457011942, "Score": 3, "Body": "First, the easy answers. Your industry experience will not hurt you.  Your non-citizenship will not hurt you.  As long as you have the knowledge to back them up, your foreign degrees will not hurt you.\n\nThe harder questions: will a PhD get you where you want to go?  In your field of CS/AI/EE/Stats, 95% of your time is going to be spent not developing new algorithms, but reading papers (many many papers) and building storylines that connects your research with other research in your field.  Is this what you want to do?  Well, give it a dry run: pick a topic you are interested in, go to Google Scholar, read 50 IEEE or AAAI papers on the topic, and write down a few questions or notes for each.  Repeat with a different topic.  How's it going?\n\nIf this is the right direction for you, my advice is to read 500 papers before applying to a PhD program.  This experience will help you narrow down your exact area of interest, give you the necessary background to be productive immediately, and make you an attractive candidate for the top effective professors in your field (there's alot of incompetant professors in academia, who target less qualified applicants as students, and you are trying to avoid ending up with one as your advisor).\n\nYou can definitely email professors (or any researchers) whose work interests you.  To break the ice, I would say I am interested in their area of research, and then politely ask 2-3 questions that I had from reading their recent papers.  Alternatively, submit some small papers to a conference/workshop, and chat up professors there.  (I make a list of people I want to \"bump into\" ahead of time.)  If they like you and are in a position to take you on as a student, they will guide you through the formal department applications process.\n\nLet us know what you end up doing!", "Permalink": "https://www.reddit.com/by_id/t3_48p2dt.json"}, "17": {"Subreddit": "PhD", "Author": "forams_galorams", "Date": 1457017146, "Score": 1, "Body": "That's interesting, I'll certainly have to get some views from supervisors before the time to choose comes. Do you feel any particular downside to doing an MRes at all? It sounds like the perfect intro to research from your description. ", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "18": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1457020191, "Score": 2, "Body": "I really appreciate your feedback. To provide more information, my company allowed me to go to multiple conference during each year. Reading papers is something I am used to since that's basically what I am doing right now (reading and implementing papers). But to be honest I am far from 500 papers in my pocket. I also spend a lot of time to make my maths base a solid one by taking multiple courses online. Unfortunately, by going to those conference I couldn't talk much with people because of the position of my company. I can't even publish papers, The only \"official\" thing I have for me is some patents... \n\nI understand with experience that some of papers and contribution are more or less valuable. I find myself finding a lot of theoretical mistake in papers that require me to work out the idea from scratch. I do not want to fall into the pressure of publishing weak content just to get a Phd. I am not also super attracted by the Phd program per say. It is more a passion for research and thinking.\n\nAnd since I got to pay the bills I thought a Phd program would be a good balance between the two.\n\nNote : I will definitively give a go to reading a lot of papers to narrow down my specific interest.\n\nSide question : Do the professor make you pass an interview to judge your knowledge ? Or it is more a feeling kind of thing ?", "Permalink": "https://www.reddit.com/by_id/t3_48p2dt.json"}, "19": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1457020287, "Score": 1, "Body": "Thank you so much for your concise answer. It feels good to have feedback ! You going the informal route and I like it :). I asked a question in response to \"PM_me_good_Reviews\", and I would like to also get your take on this :\n\nSide question : Do the professor make you pass an interview to judge your knowledge ? Or it is more a feeling kind of thing ?", "Permalink": "https://www.reddit.com/by_id/t3_48p2dt.json"}, "20": {"Subreddit": "PhD", "Author": "blufox", "Date": 1457025256, "Score": 1, "Body": "Good luck. I know what it is like to go through a year without funding.", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "21": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457042972, "Score": 3, "Body": "Academia is built upon a paper-publishing schedule.  There's weak papers everywhere.  The funding cycle runs in ~3 year increments, and to stay competitive for funding, labs must publish 2, 3 papers per year per researcher.  There's no escape from weak papers ;-)\n\nWhen I started grad school, I planned to provide a major scientific insight, run experiments to prove it, and graduate.  Many painful years later, I realized my mistake: insight is optional and rare; publishing papers and connecting research projects runs the show.\n\nFor your next conference, plan ahead of time so you have a story to talk about.  So you can't talk about your main work, that's fine.  Maybe you've gotten interested in this algorithm, or that use case, and you spent some Saturdays exploring solutions.  Talk about that.  \n\nInterview: Nope, no admissions oral exam.  There might be casual \"get to know you\" admissions events, but it's mostly about personality and research interest matching.  Depending on the program you choose, there might be oral exams partway through the PhD.\n\nEdit: Can't grammar", "Permalink": "https://www.reddit.com/by_id/t3_48p2dt.json"}, "22": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457043966, "Score": 1, "Body": "Consider publishing some papers at workshops or low-level conferences.  Talk to professors at the conference and tell them about your work and ask them to sit in on your talk if they have time.  Since your contribution as a grad student will be publishing papers, your ability in this area is much more important than grades or recommendations.  Just be prepared with a brief explanation of why your past grades are not representative of your current abilities.", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "23": {"Subreddit": "PhD", "Author": "BA_Pro", "Date": 1457138351, "Score": 1, "Body": "I agree with your instinct to approach your application from the side of the program you are applying to. Top professors can essentially hand-pick the qualified applicants that they are willing to work with; so, you might want to consider identifying a potential mentor/advisor in a program you are interested in and establish a strong enough relationship that they want to continue working with you during your doctoral studies. Set up meetings; volunteer to do research work; ask them to discuss your past papers -- anything that will make them highlight your application when it comes up for discussion. However, it needs to be more than just \"making contact.\" Even if it takes an extra year to apply, you'll want to have the professor champion your application. Otherwise, you're just one of many similar applicants.", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "24": {"Subreddit": "PhD", "Author": "bobleplask", "Date": 1457143439, "Score": 2, "Body": "Do you have autism?", "Permalink": "https://www.reddit.com/by_id/t3_48xbt1.json"}, "25": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1457181373, "Score": 1, "Body": "Thank you :) what are you studying?", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "26": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457194323, "Score": 1, "Body": "Very common request for Humanities and SocSci PhD programs. For us in COMS it is vital for us to know you are a good writer.\n\nIn STEM less so why they might want to see some examples of research? \n\nFor Finance, I suspect a report you wrote for a grad class might do. Yes, ask them.", "Permalink": "https://www.reddit.com/by_id/t3_48kdr2.json"}, "27": {"Subreddit": "PhD", "Author": "blufox", "Date": 1457197861, "Score": 1, "Body": "PhD in CS. I lost my funding part way through, and had to switch advisors.", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "28": {"Subreddit": "PhD", "Author": "degarmot1", "Date": 1457206305, "Score": 1, "Body": "I know that this is not entirely relevant to the overarching message, but what were the methods that didn't fit together just out of interest? \n\nI am having the same experiences as you. Feeling disrespected and like my team does not trust my judgement at all. ", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "29": {"Subreddit": "PhD", "Author": "blufox", "Date": 1457213990, "Score": 1, "Body": "If you are a woman (as seems from your username), it pays to go talk to the student advisors, female professors, and any of gender based organizations in campus. In U.S I often see scholarships and endowments from private parties targeted towards women, and more importantly, it may be available year round. Even if the people you talk to do not know about it directly, they may be able to direct you towards people who may have some info.", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "30": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1457224283, "Score": 1, "Body": "Ugh, that sounds like a nightmare :( Are you still working on it?", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "31": {"Subreddit": "PhD", "Author": "grrlinterrupted", "Date": 1457224398, "Score": 1, "Body": "I am indeed a person with the ladyparts. That is something I've looked into, but none of the ones available are enough to allow me to do the PhD even part time. I have found another scholarship which I can apply for, but have to be put forward by my supervisors, so am waiting to hear if they'd be willing to. :S", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "32": {"Subreddit": "PhD", "Author": "blufox", "Date": 1457224939, "Score": 1, "Body": "Yes, I am still in my PhD, due out this summer. I got external funding from a different department after a year, hence my advice. In fact, now that I have gone through it, it is better to get external funding than to rely on your advisor for R.A, because you will be more independent.", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "33": {"Subreddit": "PhD", "Author": "blufox", "Date": 1457225744, "Score": 1, "Body": "Whatever it is that you do, please do not burn your bridges. I saw in another comment that you had told them that you were unhappy. Be careful of doing that, because you may have to rely on the same ones for another reference -- especially because you are new, and you don't get to see what they write. I was asked to specifically get a referral from my previous advisor when I applied to a prof in a different university (and for what ever reason, I did not get admitted there).\n\nIn my experience, your supervisors (especially your advisor) should be quite happy to do that for you because it often means that they get your labor for free. However, do that immediately, and be sure to ask them what they need for the referral (they may need stuff like your resume, work experience if any, any papers written etc).\n\nDo you have access to external financing at all (such as student loans)?\n", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "34": {"Subreddit": "PhD", "Author": "theworstcow", "Date": 1457289975, "Score": 2, "Body": "I guess at times I do feel slightly unsupported, as there's not a lot of structure and my supervisor probably prioritises PhD students over me. Also I have to fund all my research materials myself, which for me isn't an issue but I bet a lot of students would struggle with that.\nI also would quite like some more basic tuition in my subject, which a taught MSc would provide, but I can always read up about it myself. \nI think if I could have done, I would've gone on to do a PhD straight away, but competition is hard. \nMRes is significantly cheaper too! Mine is about £4,500. ", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "35": {"Subreddit": "PhD", "Author": "lightnovel_abuser", "Date": 1457316884, "Score": 3, "Body": "I'd like to know as well, it seems for the science majors, they have their hands full with tests and experiments and such. Business majors on the other hand are rarely talked about. ", "Permalink": "https://www.reddit.com/by_id/t3_499p7a.json"}, "36": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1457323223, "Score": 2, "Body": "I'm in my 4th year in a doctorate in business, in an area that draws on psychology (think like organizational behavior, or marketing). I'm done all my courses and now just working on my dissertation/research.  \n\nHere's my typical day:  \n8am: wake up/have breakfast/read the news  \n9am: start working. I like to do the hardest/most intellectually draining work in the morning, so this is typically either writing time, or thinking of new research ideas/working on experiment design time.  \n12pm: grab lunch  \n1pm: 2nd work session of the day, typically this time is devoted to designing experiments, collecting data, or analyzing data.  \n7pm: dinner and leisure time.  \nI make sure to get at least 8 hours of sleep each night. Only time I don't is when there are tight deadlines with regards to grants/experiments being conducted in the behavior lab/academic deadlines.  \n\nNote that the above schedule is an ideal day. A lot of the time I need to be in the behavior lab collecting data for a few hours, or meeting with my supervisor, or having meetings with research colleagues. That happens pretty often during the week, and takes away actual working time.  \n\nFeel free to follow up with any questions if you want more details on anything.", "Permalink": "https://www.reddit.com/by_id/t3_499p7a.json"}, "37": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457334818, "Score": 2, "Body": "I am in 2nd year of a doctorate in business. The two years were pretty much the same. I have 3-4 classes I am taking. The seminar in my area takes the same amount of time as other classes combined. I teach a class every semester. Currently I have 2 research projects going. Typical day: wake up either at 10AM or earlier if I need to be somewhere before. I am usually productive until 9 or 10 at night. It's not that different time wise from a job, but you do what you like and that makes all the difference. I work either saturday or sunday on the same schedule. Sometimes entire weekend.", "Permalink": "https://www.reddit.com/by_id/t3_499p7a.json"}, "38": {"Subreddit": "PhD", "Author": "forams_galorams", "Date": 1457340443, "Score": 1, "Body": "I see. Funding any materials myself is unfortunately not an option, never even thought that would be a thing to be honest. I'll about it, there's only one actual MRes that I would be interested in doing. Also, even though the MSc programmes I have my eye on are like 8-9k, I have seen quite a few that are 4-5k!", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "39": {"Subreddit": "PhD", "Author": "Brenduke", "Date": 1457349885, "Score": 1, "Body": "Hi,\n\nI am a first year business PhD student, I started in October last year after graduating with a first class degree in BA business studies, one of my class tutors suggested I look into studentships within the faculty (self funding was not an option for me), I was successful without a masters.\n\nThe first thing I would do is talk to your current tutors and dissertation supervisors in your final year; they will at least point you to the right person to speak to. I would also look into the studentships available at your university and those of of which you are interested in applying to, if your research area aligns with that of the university you may get full funding.\n\nBefore applying I would contact the university and arrange a meeting with your potential supervisor,  for me this was an hour long discussion which answered pretty much all my questions and provided guidance as to what to include in the application. The supervisor is likely to be present at interview so meeting him/her beforehand really helps.\n\nThat said an MRes will give you a much better footing going into the PhD, but there is alot of overlap between first year PhD and MRes so you need to decide if it is worth it.\n\nOf course this varies across institutions and disciplines, for example my sister applied for an early years PhD studentship at Sheffield University with a first BSc and PGCE and found MRes was a non-negotiable requirement.", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "40": {"Subreddit": "PhD", "Author": "zoobily", "Date": 1457367933, "Score": 1, "Body": "Can you give details on what the step-by-step research is like?", "Permalink": "https://www.reddit.com/by_id/t3_499p7a.json"}, "41": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457370732, "Score": 2, "Body": "There is no step by step. You have an idea or decide to look into something. If you think something is there and no one looked into it before, you talk to your professors and see what they think. If they thing its worth pursuing you start thinking of all relevant theories. Once theory is settled and predictions are made you go on to your method, which can be an experiment (like comment above) or historical data analysis. Once you run your stats (or experiment) you can present somewhere and see what others think. More likely than not you go back with comments and try to address them in your paper. I would say it may take year(s) to get the paper ready to submit to a journal. After that it WILL take at least 1-2 years to have it accepted and probably another year to have it published.", "Permalink": "https://www.reddit.com/by_id/t3_499p7a.json"}, "42": {"Subreddit": "PhD", "Author": "theworstcow", "Date": 1457384282, "Score": 1, "Body": "Yeah originally the department thought they had money for me, but then realised they didn't, so I have had to put up about £700 in equipment/fuel costs. \nHowever I'm sure this varies between departments and unis, my uni asks for a £1000 bench fee at the start of the year, or I could just pay my own costs (which is cheaper so I did). It would be something you could inquire about before applying. Another good thing to do would be to contact any MRes supervisors directly and ask them these questions, if they really want you to work with them then they may be able to get your costs covered. Best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_47uj7t.json"}, "43": {"Subreddit": "PhD", "Author": "TheHoadinator", "Date": 1457412616, "Score": 1, "Body": "Different area but finishing year 4 of my PhD clinical program, I've written and rewritten my dissertation more times than I can count on the past year, I have between 1500-2000 clinical hours, a decent number of integrated reports, a book chapter and related journal article, over 20 posters, have presented a number of community and conference workshops, and I'm about to walk away. So I find this post particularly relatable. \n\nI don't have any answers; just offering some company in an effort to tell you you're not alone in this difficult decision. It can be difficult to parse out what is \"normal grad school depression\" and when it's appropriate to say you deserve to look elsewhere for an environment where you can be happy. ", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "44": {"Subreddit": "PhD", "Author": "TheHoadinator", "Date": 1457413180, "Score": 1, "Body": "Different area but finishing year 4 of my PhD clinical program, I've written and rewritten my dissertation more times than I can count on the past year, I have between 1500-2000 clinical hours, a decent number of integrated reports, a book chapter and related journal article, over 20 posters, have presented a number of community and conference workshops, and I'm about to walk away. So I find this post particularly relatable. \n\nI don't have any answers; just offering some company in an effort to tell you you're not alone in this difficult decision. It can be difficult to parse out what is \"normal grad school depression\" and when it's appropriate to say you deserve to look elsewhere for an environment where you can be happy. ", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "45": {"Subreddit": "PhD", "Author": "TheHoadinator", "Date": 1457413436, "Score": 1, "Body": "I guess this is a saddening depiction of what is happening right now. I was accepted elsewhere, but was run over by a car in the interim summer so I declined because I was told I would never walk. I didn't think that was a good time to move away from my Uni and family (and hometown). \n\nEdit: I forgot to include that the next year I kept working with the labs in our graduate program and applied only to that program; and was accepted. I've been there since, but one faculty I was working with was pushed out after a breakdown, the other then had to take 9 students in total, so I was shifted a second time to another mentor. This mentor has never liked me; I worked in her lab the first year and left because of differential treatment. So after 2 faculty changes, I've been with her for the past 18 months or so. \n\nBack to the original post: Now, I'm finishing year 4 of my PhD clinical program, I've written and rewritten my dissertation more times than I can count in the past year, I have between 1500-2000 clinical hours, a decent number of integrated reports, a book chapter and related journal article, over 20 posters, have presented a number of community and conference workshops, and I'm about to walk away. So I find this post particularly relatable. ", "Permalink": "https://www.reddit.com/by_id/t3_43qe2u.json"}, "46": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1457492368, "Score": 1, "Body": "I've never heard of anything like this happening in my program but have heard similar stories from other folks in other disciplines. I can only say that those folks have survived the process and came out with their degrees in the end. I'd say just do the best you can. It's really unfair but I don't see what else you can do given the circumstances if the goal is to move forward. I wish you the best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "47": {"Subreddit": "PhD", "Author": "Alpacatastic", "Date": 1457494433, "Score": 1, "Body": "\"You should be able to extrapolate the comments on the first page to the rest of the dissertation.\"\nWelp. \n\nIs there a chance you can send the dissertation to other committee members that you might be close with to see if they can help with revisions? ", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "48": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1457510572, "Score": 1, "Body": "*Can* you extrapolate the principles from her comments on the first page?  If so, why not send it out to your committee but include a small overview of planned revisions so they know it's a work in progress and won't worry about the things you're changing anyways?", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "49": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457526484, "Score": 1, "Body": "I have heard many horror stories about advisers who are incredibly lazy or tardy in reading drafts of the dissertations or vague and unhelpful in comments.\n\nBut your advisor – – I hate to even apply that term to her --  wins the award for worst \"Advice\" ever. She is acting unprofessionally and just generally despicably.\n\nI have to ask: I cannot believe that her caddish behavior just started now. Wasn't she like this in different ways in the past?\n\nI am so sorry. It seems to me that you have very few options; you could make the corrections on the first page and just send the rest of the document as it is to the committee. Maybe your advisor is such a big idiot that she will just accept whatever there is...But I doubt it. It sounds like she has no shame\n\nQuestion: Is there another more senior person in the department whom you trust, whom you can go to discuss the situation? I have seen cases where a white knight senior faculty member comes in and rescues a PhD student in this kind of trouble.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "50": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1457565271, "Score": 1, "Body": "Oh man thanks. That really helps me understand why I'm even doing this. I was thinking of dropping out even after I did my candidacy/comprehensive exam (meaning I was in MSc but now direct phD so I won't have a MSc to fall back on if I drop).\nI think I'll try to stick it through even if I plan on doing other things than research just for personal achievements sake.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "51": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1457568783, "Score": 4, "Body": "As a fellow grad student, I empathize with the nonstop struggle of academia and the shadows of a persistent imposter syndrome. However, you've made it this far already. You worked hard to get where you are and you earned your successes. Don't let other people take that away from you. They're probably dealing with their own insecurities or engorged on their own sense of superiority. Ignore them. I would suggest that you push your advisor for some constructive feedback on your strengths and weaknesses and a clear evaluation of your progress towards your degree and whether you have met expectations to achieve a meaningful career that you're interested in after graduation. As a psych person, I would also recommend seeking support outside of your program, including possibly seeing a therapist to get manage your self-doubt and clarify your goals for the future. I hope things get better for you!", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "52": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1457569176, "Score": 1, "Body": "Do you have a program limit on the number of committee members that you can have? Instead of changing one of them for someone with expertise on your topic, why not just add a 4th committee member? You can then have the benefit of a supportive committee who works well with each other and an expert member who can advise you on your research. I would say that it is a skill to initiate, develop, and maintain a professional relationship with others in your field so this might be a really good opportunity to do that since it's in a learning capacity. ", "Permalink": "https://www.reddit.com/by_id/t3_49p99q.json"}, "53": {"Subreddit": "PhD", "Author": "vhruno", "Date": 1457593866, "Score": 3, "Body": "Your English isn't bad at all! I'm a Chilean that got an undergraduate degree in \nChile and have followed the academic life in north america with two postgraduate degrees (and more to come!). From my experience (which by no means is universal) academic degrees from any part of the world that is considered a third world country, are looked down and considered inferior. It's very sad. A posgraduate degree in architecture from Morocco, Chile or Nigeria will not land you a job, as if you had that same degree (or even a slightly shorter one) from either Europe or North America. I can't tell you how many people I've watched struggle due to this. Fortunately not myself, because my degrees are from the U.S. and Canada, but I've seen fellow latin americans struggle to find a decent job, and not even hoping they'll be able to get a job in their field because of this. However, this definitely DOES NOT mean that degrees in Chile are any less valuable or simpler. I think it just means that they (government, institutions, academia) don't understand other contexts and would prefer to rule them out. Overall, I think if you can skip a masters and go straight to a PhD you should totally go for it! Especially if you love academia! If a PhD is your goal, and why not get a head start! If you want to work in a European or North American institution in the future then you might want to seriously consider doing the PhD elsewhere. However, knowing full well, that PhDs in Chile are just as exhaustive, and if you plan to work and teach in Chile then absolutely go for it! Thanks for sharing your story!!", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "54": {"Subreddit": "PhD", "Author": "petitekarma", "Date": 1457612998, "Score": 1, "Body": "DocEar is free and super easy to use as well. I prefer ir to Mendeley.", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "55": {"Subreddit": "PhD", "Author": "petitekarma", "Date": 1457613367, "Score": 7, "Body": "From the top of the mountain, the hike always seems smaller than from the ground. Just like that, perhaps the idea in your mind of what a phd or postdoctor should be or how they should act seemed grander before you got there, and since you don't match up to that idealized version, you feel like an impostor. \n\nYou're probably not. The only way I can think of for you to deal with this is to try to identify what specific things make you feel inadequate (i.e. have not read as much, not published as much, etc.) and work towards improving in those areas. ", "Permalink": "https://www.reddit.com/by_id/t3_49shz6.json"}, "56": {"Subreddit": "PhD", "Author": "homesickexpat", "Date": 1457633672, "Score": 1, "Body": "I'm curious, how did you pay for your postgrad degrees abroad? If you don't mind my asking :)", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "57": {"Subreddit": "PhD", "Author": "homesickexpat", "Date": 1457633715, "Score": 2, "Body": "I agree with the above poster. A PhD from Chile won't mean much to people in North America. But if you want to stay in Chile or even within Latin America, it should be worthwhile.", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "58": {"Subreddit": "PhD", "Author": "vhruno", "Date": 1457635544, "Score": 1, "Body": "Grants, scholarships and loads of part time jobs!", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "59": {"Subreddit": "PhD", "Author": "vhruno", "Date": 1457635622, "Score": 1, "Body": "Have you had this experience too?", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "60": {"Subreddit": "PhD", "Author": "homesickexpat", "Date": 1457638872, "Score": 1, "Body": "No, the opposite, I'm a gringa in Chile :)", "Permalink": "https://www.reddit.com/by_id/t3_49r5le.json"}, "61": {"Subreddit": "PhD", "Author": "Myerzz", "Date": 1457669016, "Score": 1, "Body": "yeah thats true, I guess I have been thinking that by adding an extra person that's another one who has to evaluate my work/more notes/ more changes/more opinions/ another person to please/ possibly more problems etc. but yeah I think you're right and it may be best to do it that way. Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_49p99q.json"}, "62": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1457674250, "Score": 1, "Body": ":)\n\nI hope things work out for you!!", "Permalink": "https://www.reddit.com/by_id/t3_49p99q.json"}, "63": {"Subreddit": "PhD", "Author": "YouHadItComing", "Date": 1457675269, "Score": 7, "Body": "Isn't that just life though?  I'm a current PhD student, and I see those sorts of people occasionally.  Thing is, it's not like shitty people are going to disappear once you graduate.  My way of handling it has been to simply avoid all toxic people unless I HAVE to interact with them.  Really, my work is just between my advisor and I, so I haven't had many problems.  I'm not sure what your situation is, but minimizing your interactions with hostile people can really improve your overall quality of life.  ", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "64": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1457702864, "Score": 1, "Body": "She has down-prioritized me relative to her other responsibilities and roles for a while now, like she decided I would be fine without the regular meetings we used to have. Almost all of the contact I've had with her has been when she intends to talk to another grad student or postdoc in the lab and I interject into the conversation (I have excellent working relationships with the other postdocs and grad students in the lab so they are positive about this).\n\nIn any case, I had to send it out to my committee as-is (by the rules, they are supposed to have two weeks to read it), and she told me to send a note to them saying that what I was sending was subject to revision in the next couple weeks.\n\nI think she will finally read it now that I've sent it out to my committee, will say it needs major work, and then I'll have to rush-job that and send out the revisions to my committee, who are in principle supposed to have two weeks to read the document but will not get that.\n\nShe is a senior professor and she has historically discouraged me from other faculty in the department in terms of keeping to the minimum required number of committee meetings, not doing side projects with other faculty, etc.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "65": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1457703270, "Score": 1, "Body": "I can at least try, and I did, though she may tell me that I didn't actually do what she intended or that my revisions were not adequate.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "66": {"Subreddit": "PhD", "Author": "-izzle", "Date": 1457711461, "Score": 2, "Body": "Be selfish. I am irreperably jaded and I regret not being more selfish and arrogant. Because if you're not, you're getting shit on.", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "67": {"Subreddit": "PhD", "Author": "connexin7", "Date": 1457720777, "Score": 2, "Body": "I can relate- I am also in STEM and see people all the time who try to assert their dominance. I get through it by breathing, and trying to be aware. I've noticed how those people are trying really hard to cover up their own fears and insecurities, which humanizes them in my head. If you look closely, you can usually see cracks in their hard show of face. I try to surround myself with people who are positive and supportive, and I have begun to learn to assert myself in conversation with these dominant people. I gently stand my ground. I've started to gain more confidence this way, by reminding myself that no one really knows what they are doing, and we are all venturing into the unknown together. Having someone to vent to is a great help here too (for me, my family). ", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "68": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1457721225, "Score": 1, "Body": "When I was in my program, people told me they wouldn't study with other grad students because they thought the other student would try to mislead them and make them fail.  I was astounded, I'd never act like that, those people are pathetic who would.  Luckily I was theoretical physical chemistry and was able to work quite independently and the people in my rather small research group were great.", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "69": {"Subreddit": "PhD", "Author": "ResEtVerba2", "Date": 1457733559, "Score": 1, "Body": "Thanks the_petman :)\nI feel like I should've stopped 2 years ago and that now I'm just ridiculous, but I want it, and I hate it. The reason I'm still here is because I want to do it, and what's driving me is: I want to be done, as quick as possible.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "70": {"Subreddit": "PhD", "Author": "ResEtVerba2", "Date": 1457734319, "Score": 1, "Body": "I completely understand. Have you thought about getting a side job? \nLet me explain. Sometimes when you feel like an impostor, and you delay everything, it can be because you haven't had anything successfull in a while, any \"reward\" like good results, or just a finished task. And it piles up. It gets scary. Doing a phd takes so much energy and so much time, but it's not rewarding at all so you don't know if you're even good at what you're doing. Plus, you start comparing yourself. But If you get a side job, you can have these few moments a day/ a week where you just fulfill something, and it was easy, and you realize that you're still as good as you used to be.\nIt can also be a hobby, or sport! but I find side jobs more rewarding because it's professionnal recognition, and not just an auto-recognition.", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "71": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457737448, "Score": 2, "Body": "To quote a line from The Godfather II: This is the business we have chosen.\n\nThere is an unfortunate subset of people in our business who abuse the privilege of tenure and status. \n\nThey are small in number...but painful in effect. That's just the way it is. Some of them can be negotiated with or scared off. Others...well, I actually wrote an essay about the species of super villains in our trade:\n\n http://chronicle.com/article/Spotting-Your-Faculty-Enemies/125289\n", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "72": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457737648, "Score": 1, "Body": "Controlling, vain, cruel...\n\nClassic narcissistic personality disorder.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "73": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457738534, "Score": 2, "Body": "You need background in the field you are trying to get into. ", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "74": {"Subreddit": "PhD", "Author": "the_petman", "Date": 1457739094, "Score": 1, "Body": "I'm in the same boat. I'm out of academia as soon as this finishes. As far as I see it, the regret of having not completed it (particularly now I'm 10 months away) is greater than the strain of continuing.\n\nI wish you all the best with your future studies!", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "75": {"Subreddit": "PhD", "Author": "the_petman", "Date": 1457739151, "Score": 2, "Body": "Glad I could help. If you want to do it, thats really all you need. Just be focussed on why you are there and I'm sure you can do it! Best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "76": {"Subreddit": "PhD", "Author": "SmellyWeapon", "Date": 1457739803, "Score": 1, "Body": "i understand but the school im graduated from said I can apply as different major. They had physical science major before applied for phd in BA.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "77": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1457742505, "Score": 1, "Body": "I don't think there is any deliberate cruelty here, she just didn't have time to look at it until now and had other higher priorities.Maybe a little bit of intellectual vanity, but that's not so unusual for academics.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "78": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457746725, "Score": 1, "Body": "You are being quite magnanimous -- my thought is if a professor does not have time to fulfill responsibilities to advisees, then don't take them on.\n\nI hope you feel the same way after the defense...", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "79": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1457752833, "Score": 1, "Body": "Agree with ShadowHunter, a PhD in business is not just an \"MBA+\" or a \"free MBA\". A PhD in business is like a PhD in any other field, and is an advanced degree that teaches you how to do **research**.  \n\nIf you find business issues interesting, and want to learn more about the why and how, then a PhD in business will give you the tools to independently ask and answer interesting/important questions after 5 years of non-stop studying (living and breathing research).  \n\nAnd yes, once you have a PhD in business, there are plenty of opportunities, but you should be doing it for the right reasons. Otherwise you might not even like those jobs. Also grades and test scores are extremely important for Business PhD admissions.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "80": {"Subreddit": "PhD", "Author": "SmellyWeapon", "Date": 1457753481, "Score": 1, "Body": "True. What business issues should i look into? I think the most suitable for me right now is mangement and international business. Also, What jobs can you get after you obtain a phd in BA , concentrate in management &amp; international business? Does school ranking matters for phD in job hunting ? Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "81": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1457755095, "Score": 1, "Body": "We'll see. Her letter of recommendation was positive enough that I got a good postdoc job complete with fellowship funding. So that's good.\n\nIf the defense actually happens I don't really see them failing me - I am quite good at giving talks. The worst case scenario would be that she waits until a day or two before the defense then says the thesis isn't ready to defend and vetoes it. I guess then I'd just have to be ABD and get a job as a computer programmer or something.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "82": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457759728, "Score": 1, "Body": "You can apply. But, most serious PhD program I looked into encourage relevant work experience and some basic coursework in the area. If you apply for management or organizational behavior then work experience is more important, but technical fields like accounting or finance would require you to take all the basic courses.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "83": {"Subreddit": "PhD", "Author": "SmellyWeapon", "Date": 1457759990, "Score": 1, "Body": "Ok, I should just look for jobs in management or office job just now and go from there.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "84": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1457800105, "Score": 3, "Body": "YES! Looking back this is the only thing that might have saved my mental health.\n\nPut you first. Learn to say a hard and confident 'no'. Do not feel bad for their woes or ever think you're friends. Get an outside school hobbie with interaction with normal nice non academics.", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "85": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1457800364, "Score": 1, "Body": "FUCK THEM. Stuck people with little experience outside academia.\n\n\nPlease find a way and keep going.\n\n\nDon't believe their bullshit.\n\n\nStick with your supervisor. The right people see the potential in you and help you achieve. The assholes see it and try to turn you around.", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "86": {"Subreddit": "PhD", "Author": "-izzle", "Date": 1457801316, "Score": 3, "Body": "Learning to say 'no' is easily the most important thing. Because believe me, people will go out of their way to have you do their crap work for them. \"Can you take pictures of the team for the website?\" - NO. \"Can you clean up 20 years of stuff from the lab?\" - NO. If it is not in your job description, it is not your job.", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "87": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1457802797, "Score": 1, "Body": "Ok, best wishes.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "88": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457803773, "Score": 1, "Body": "If you want to do Management, I would just apply. You can do both at the same time I guess.", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "89": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1457818219, "Score": 1, "Body": "Transfers aren't really a thing in graduate school. You can contact the department you're interested in; however, you'll need to apply again with all the PhD applicants.", "Permalink": "https://www.reddit.com/by_id/t3_4a4rk6.json"}, "90": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1457836879, "Score": 1, "Body": "Even transfers from department to another department within a school is not really a thing. You can contact them and what not, but you are just making your life complicated, unless there is something seriously wrong with the place you are now.", "Permalink": "https://www.reddit.com/by_id/t3_4a4rk6.json"}, "91": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1457837440, "Score": 1, "Body": "Thanks! =)", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "92": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1457906705, "Score": 2, "Body": "Just torrent it. Got version 23 off kick ass torrents, works great.", "Permalink": "https://www.reddit.com/by_id/t3_4a8tn1.json"}, "93": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1457909336, "Score": 1, "Body": "Just for the love of god don't torrent on a university network. Yes, people at my university have been caught doing that. ಠ_ಠ", "Permalink": "https://www.reddit.com/by_id/t3_4a8tn1.json"}, "94": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1457916215, "Score": 1, "Body": "Course not! My uni Internet is too slow for that anyway 😀", "Permalink": "https://www.reddit.com/by_id/t3_4a8tn1.json"}, "95": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1457965313, "Score": 2, "Body": "Thanks man! I went to a grad advisor counselor and it has definitely helped! I'm going to continue seeing them until I get out of this slump!", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "96": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1457965394, "Score": 1, "Body": "I'm actually a part-time tutor and it feels really great to feel as if I'm on top of at least undergrad level chemistry. I've been doing a tonne of extracurriculars, so much that I think I should drop some since I have no time! But yes you may be right, I should try to find something more rewarding then :)", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "97": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1457965473, "Score": 1, "Body": "Thanks man! The past year of bullying from my research group (and some faculty and staff) has definitely not helped (not to mention I have a shitty low self-esteem to start with). I've been finding ways to cope with the bullying and to get past it and hopefully I'll feel better soon! I just really needed to vent and you guys have been nice! :)", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "98": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457966779, "Score": 1, "Body": "I wish you well, my friend.", "Permalink": "https://www.reddit.com/by_id/t3_43qe2u.json"}, "99": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1457969113, "Score": 2, "Body": "I'm so glad you're doing that and you're finding it helpful. I hope things pick up for up. I'm a chick btw :)", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "100": {"Subreddit": "PhD", "Author": "ResEtVerba2", "Date": 1457969341, "Score": 1, "Body": "Haha yes you're right, it's already a great achievement ! I should think about it more that way as well. :) thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "101": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1457972445, "Score": 1, "Body": "Thats assuming you do something for low pay. Thanks for your input.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "102": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1457972693, "Score": 1, "Body": "Thanks for your input and yea, \"It can be difficult to parse out what is \"normal grad school depression\" and when it's appropriate to say you deserve to look elsewhere for an environment where you can be happy.\"", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "103": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457973008, "Score": 1, "Body": "Non-impostor here.  I promise you that 99+ percent of the people around you are also impostors, and they are terrified of being discovered, and that's why they are so rough on calling people out as impostors: it's to cover themselves.  A real non-impostor will *never* call you out; they will simply discuss your research with you starting with your last firm findings and build up from there.\n\nFWIW, IMO, if you can latch onto one or two tiny tiny unexplored problems, and put real thought into them (even a few Saturdays' worth), this is awesome, and is more contribution than most professionals ever make to the scientific community in their lifetimes.", "Permalink": "https://www.reddit.com/by_id/t3_49shz6.json"}, "104": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1457973269, "Score": 1, "Body": "Thanks, yes it would be nice to be called \"Doctor\" but I lack the passion to \"play in the lab\" so really I would be doing it simply for the title.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "105": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1457990921, "Score": 1, "Body": "It might be your university/group/lab.\n\nWhen I was interviewing at different grad schools, I saw a huge difference between them.  Sometimes a crappy person becomes department chair, and the whole place gets filled with a bad attitude.  Another place I saw had an undergraduate population from disproportionately wealthy and snotty families, and it rubbed off on the grad program.  Other groups are really great, filled with fun, cheerful, and kind people that will go out of their way to help you with your research.  It was a huge factor for me in choosing a grad school.  By the way, at top conferences, I've seen no correlation between shitty personalities and good research.", "Permalink": "https://www.reddit.com/by_id/t3_49x96u.json"}, "106": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1458064332, "Score": 1, "Body": "I got one of those, part of an ITN in the Netherlands. They're pretty good, yeah :) anything special you want to know?", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "107": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1458126591, "Score": 1, "Body": "&gt; too good to be true \n\nbut aren't they a fuck-ton of work just to apply? I considered putting in for one but was too busy looking at reddit to even start to get together the required documents. ", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "108": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1458141948, "Score": 1, "Body": "Use [PIA](https://www.privateinternetaccess.com/) to connect. I used it for years on FIOS. Reinstalled my OS, forgot to set it up again, got three copyright warnings in a month. \n\nUsing a VPN in research work is a pretty good idea anyway. \n\nIncidentally, have you looked at educational pricing? I don't know SPSS as well as I should, but it looks like a 12 month license is under $100. ", "Permalink": "https://www.reddit.com/by_id/t3_4a8tn1.json"}, "109": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1458151149, "Score": 1, "Body": "Hi. I can help you.\n\n&amp;nbsp;\n\n*What field?*\n\nThe field you are heading towards is Natural Language Processing, or NLP.  This field generally uses machine learning and other algorithms to extract knowledge and patterns out of natural text.  Alternatively, if you want to study language (such as your house/houses/stately/states example) by developing intuitively-sensible explanations rather than statistically-predictive methods, this is the field of Linguistics (in Humanities or Arts-and-Sciences).  If you want to focus on investigating the algorithms themselves, that is Machine Learning (ML), a subfield of Computer Science.  If you want to figure out if your experiment numbers mean anything, or are just random noise, this is Statistics.  In university organization, NLP is usually hosted by Computer Science or Linguistics departments.\n\nTo grad-study any of these fields, your activities will consist of reading lots of papers in the field, and then writing/publishing your own.  So, before you start thinking grad school, you should start reading papers.  This will also help you figure out which field you want.  My general recommendation is to read 500 papers before deciding where to apply for a PhD.\n\n&amp;nbsp;\n\n*Paper Sources*\n\nThe [ACL Anthology](https://aclweb.org/anthology/) is the most relevant source of NLP papers, and freely available.  I recommend this first, after you read any necessary textbooks.\n\n[AAAI Digital Library](http://www.aaai.org/Library/library.php) has a mix of NLP and other AI papers, freely available.\n\n[IEEE Xplore](http://ieeexplore.ieee.org/Xplore/home.jsp) has a mix of NLP and other CS-topic papers but only shows title and abstract unless you buy membership.\n\n[Google Scholar](https://scholar.google.com/) is a good tool to search everywhere at once.\n\n&amp;nbsp;\n\n*Your Plans*\n\n&gt; I'm 48\n\nThis won't be a problem.  NLP and related fields are not taught in high school, so people typically don't discover them until later in life, and older students are not uncommon.  \n\n&gt; Does it make sense to build some more experience in the text analytics\n\nAs long as you've found a subfield with papers you love to read, and are ready/able to be writing your own similar papers, then you have enough experience.  From looking at your slides, it looks like you might have fun and get a basic linguistics education by reading some introductory linguistics material (textbooks).  You'll probably also want to read up on things like basic statistics, experiment design, common evaluation metrics, and other topics that won't be mentioned in research papers.\n\n&gt; then go for a PhD in Computer Science\n\nDoes a PhD get you where you want to go?  Are you sure you need a PhD to get there?  In the US, if you are a competant coder in python/java/etc, a CS PhD will take 5+ years of your life and be very stressful (check out all the depressed/anxiety/suicidal posts over at r/GradSchool).  \n\nTo state the obvious, these days, NLP/ML/CS degrees are worth little more than the experience/ability behind them, which is different than most other degrees.  You'll lose money on it from the lost income.  If you need one, though, that's fine; for some paths they are necessities.\n\n&gt; PhD in Computer Science looking at the global implications of text analytics and factoring in regional idiosyncrasies in semantic analysis\n\nYou could probably do this.  (Of course, these topics are too broad and you will have to be more specific.)  You will need to find a professor who does something similar and who has the authority to supervise you.\n\n&gt; I'd probably try for a government or private grant to survive in addition to savings\n\nNLP and related fields are well-funded, which means any school worth attending will pay all your tuition/fees plus ~$14,000 to $30,000/yr stipend.  If you obtain external funding, like a fellowship or your own grant, this will give you additional flexibility on where you can study, but probably won't increase your take-home pay.\n\n&gt; maybe pick up some ad-hoc hourly work here and there\n\nYour funding contract may prohibit this.  People do it anyways.  Just FYI.\n\n&gt; Will I have fun?\n\nOops, didn't you ask that?  Oh well.  The answer is, generally not.  You'll get to think about lots of super awesome ideas and patterns and linguistic use and rules and algorithms, and you'll have awesome discussions with other people about these things, but you'll generally be miserable trying to shape up your experiments into publishable papers before deadlines, and you'll have to cut all sorts of corners in your work (ignoring alternative hypotheses, using badly-fitting algorithms, pretending bad data is good data) to stay academically competitive and make progress towards your degree.  Publishing deadlines, and efforts to twist unpublishable data until it is publishable, will consume most of your energy.  However, if you have a greater use for the experience or the certification for after you finish, then you may find it worthwhile.\n\n&amp;nbsp;\n\n*Your Slides*\n\nSlide 3: False review detection, sentiment analysis, spam detection (and other document classification), email categorization, thread reconstruction, authorship identification, and text-based forensics, among others, are all subfields of NLP.\n\nSlide 5: house/houses/stately/states: this is the realm of Linguistics.  They find this interesting, and develop typologies to describe these lexical differences.  Same for synonymy.  \nStopword lists: This is mostly a NLP tool.\n\nSlide 10: This list covers an enormous variety of downstream tasks.  These tasks can all be approached from an NLP angle, from a Statistics angle, or from a simple rule-based get-the-system-running-quick angle.  They don't automatically require NLP or semantic knowledge.\n\nSlide 11: Building semantic taxonomies.  There is a whole lot of existing research in this domain.  Keywords: information extraction, lexical resources, ontologies, ontology population.  It sounds nice at first glance, but there some pretty deeply entrenched problems like \"how to disambiguate between multiple senses of the same word\" and \"how can we make the ontology big enough that it's actually useful.\"\n\n&amp;nbsp;\n\nHope this was helpful.  Good luck.\n\n&amp;nbsp;\n\nEdit: Formatting that sucker.", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "110": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1458153293, "Score": 1, "Body": "This was amazingly helpful, thank you. I can absolutely see what you're saying regarding the PhD - that in many (most) cases I can get to the same place simply by doing the work on my own, and that I'd be happier with creating results to my own standards instead of some artificial journal standards that exist for publication but don't necessarily serve the real world. \n\nMy thinking was that the program would add a measure of structure and rigor to the research, as well as credibility in the field. However, your response supports my gut feeling that simply doing the work and publishing can accomplish the same thing without the cost or frustration. \n\nDoes that about cover what you were trying to convey? \n\nMost importantly - what a fantastic guide for \"where to go next\"! Thank you so very much for putting the time into this!", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "111": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1458153897, "Score": 1, "Body": "[Post Script]\n\nReading through your response again, I'm struck by an interesting idea. To date I have made my name by crossing domains - generally through combining technologies to produce usable solutions. Recently I've been crossing areas of expertise, e.g. semantic analysis and business intelligence. \n\nYour response takes the approach (of necessity) of saying \"First you have to decide which field you want to study.\" The thing is - my answer is \"all of them.\" I don't mean this in a \"Jan Brady signing up for every club and society\" way. My experience to date is that so many interesting fields are well-stocked with deep expertise. However, there is a huge problem with \"ivory tower\"-ing. Huge expertise in text mining may not benefit from advances in visualization technology because that's not where their field of interest is. \n\nSo I try to stay nimble - instead of getting \"400 level\" in a single field, I learn things as I need them to solve problems, then go back and dig more deeply into areas where I think there's more worth learning. \n\nAnd I'm pretty sure from my research on PhD programs that \"inter-disciplinary\" is not a word that is greeted with enthusiasm in academia. ", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "112": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1458156577, "Score": 1, "Body": "&gt; My thinking was that the program would would add credibility in the field\n\nYes, I agree it adds credibility.\n\n&gt; add a measure of structure and rigor to the research\n\nNo. The peer-review publication process will evaluate your experiment structure and rigor, and your papers will not get published, or not get published at reputable journals/conferences, if they do not meet community standards.  Anyone can publish, regardless of academic affiliation or degrees or employment status, etc.  Additionally, PhD degrees vary in vigor, which is why peer-review is trusted and not degrees.\n\n&gt; simply doing the work and publishing can accomplish the same thing without the cost or frustration\n\nYes, that's about right, unless you have other reasons for needing the degree.  For example, it's very difficult to build a career as a professor without a PhD, and there are certain industrial research leadership positions on certain projects that heavily prefer a PhD, especially if there are external people to be convinced the research is credible.  You can also use it for quick credibility points when selling your research to others outside the field who don't know your field's journal rankings.", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "113": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1458156931, "Score": 2, "Body": "Crossing domains is fine, but you have to master each of them separately.  Academic research is all about defense of your research.  When a master of one of your fields points out a flaw in your paper, then your credibility is ruined.  There's no defense of saying, \"Well, maybe that's wrong, but it's ok because I covered these other domains too.\"\n\nYou can study all the fields, if you want.  It will be more papers to read ;-)  Probably, though, you will discover that you can't stand the perspectives of the researchers in certain other fields, so you should avoid those fields, because you will never join them.  My advice on choosing a field was intended to help you avoid fields whose perspectives you cannot stand.", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "114": {"Subreddit": "PhD", "Author": "starkywarky", "Date": 1458213428, "Score": 1, "Body": "Thanks littlemousy. Were your college fees taken out of it? The one I went for is like 30k sterling per annum. That seems a lot for a phd. I'm just wondering if there's a catch", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "115": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1458216157, "Score": 1, "Body": "Well in the Netherlands PhDs are not students but employees of the university, so I didn't have to pay any tuition fees. I'm not sure about your case, but generally speaking Marie Curie positions are very good grants.", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "116": {"Subreddit": "PhD", "Author": "starkywarky", "Date": 1458261879, "Score": 1, "Body": "Okay great, thanks a lot!", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "117": {"Subreddit": "PhD", "Author": "Z10201Z", "Date": 1458351718, "Score": 1, "Body": "Finished\n\nPlease share the results... It's good to know that others are having the same problems", "Permalink": "https://www.reddit.com/by_id/t3_4axh60.json"}, "118": {"Subreddit": "PhD", "Author": "midwestwatcher", "Date": 1458430719, "Score": 3, "Body": "I know I'm late to the party, but I really want to know: which school was this?  I worked for a number of years at one Ivy League school, that actively promoted students to pursue their career interests and take classes in economics/patent law/venture capitalism/health policy etc etc.  Thinking back to that time period of my life, I don't recall one student in that program that didn't end up with the job they wanted (albeit a few of them had to do a post-doc for 2-3 years before it happened when work experience was required). \n\nWhich school dropped the ball and expects all their students to go into academia??", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "119": {"Subreddit": "PhD", "Author": "midwestwatcher", "Date": 1458433027, "Score": 1, "Body": "&gt; 2) Publish 1 paper per year, (3-5 papers total AT A MINIMUM. Please take this seriously), all in journals with impact factor &gt;2-3.\n\nThis has got to be field-dependent.  Everyone in my field winds up with 2 to 3 papers and are perfectly able to get fellowships/jobs.\n\nBesides, there comes a point where you are bottlenecked on something other than papers.  We recently had a job search for a bio-physics type person, and got a great MIT post-doc with papers in Science, Nature, etc etc.  Couldn't give a talk to save his life.  He was not hired.  Someone with two middling pubs was, and she is on her way to her first major grant.  Where is this advice coming from?", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "120": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1458575090, "Score": 2, "Body": "Don't waste your time on this useless bullshit. Unionize. It's harder than clicking a checkbox but it's literally the only way to improve your working conditions. ", "Permalink": "https://www.reddit.com/by_id/t3_4bcodz.json"}, "121": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1458582787, "Score": 1, "Body": "While I acknowledge that this is somewhat 'field specific', I think my guidelines apply to &gt;75% of all disciplines in STEM. I also agree that 'well-roundedness' is important, and is thus why I suggested going to conferences, networking, and giving presentations. \n\nWhile we can agree to disagree, I would ask you one thing - If you only have to publish a few papers and its not as demanding/competitive as I make it out to be, then why are so many people struggling to find faculty positions? Why is unemployment so high for those in possession of a PhD? Its not because 'everyone who publishes 2-3 papers are perfectly able to get jobs' as you say. If this isn't the case for your field, and in it, every other person gets the faculty job, then your field is the exception, not the rule.\n\n I outlined what I did for those that don't want to struggle as much as other struggle and want to more/less put themselves on a track to get those positions down the road.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "122": {"Subreddit": "PhD", "Author": "porterble", "Date": 1458621353, "Score": 1, "Body": "14 days ago.... how did it go?", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "123": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1458665465, "Score": 1, "Body": "Your plan isn't very clear.  Why are you applying for a software engineering job if you want to get into a PhD program?", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "124": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1458675628, "Score": 1, "Body": "I am applying to PhD in the end of this year, so I'll have a gap year from June 2016 to September 2017. So I need to have a job during my gap year. And I hope to work with robotic software in the future.", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "125": {"Subreddit": "PhD", "Author": "RussianWhizKid", "Date": 1458793851, "Score": 0, "Body": "Work in the Semiconductor industry ", "Permalink": "https://www.reddit.com/by_id/t3_4bor9a.json"}, "126": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1458813439, "Score": 1, "Body": "College professor, either at a university or a two-year community college. That is, if everything goes as planned.  If not, then bartender.", "Permalink": "https://www.reddit.com/by_id/t3_4bor9a.json"}, "127": {"Subreddit": "PhD", "Author": "GP4LEU", "Date": 1458825426, "Score": 2, "Body": "Hopefully residency that has a strong research component (basically combined with a post doc) and becoming a research professor. That's the dream ", "Permalink": "https://www.reddit.com/by_id/t3_4bor9a.json"}, "128": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1458915109, "Score": 2, "Body": "I found that this question becomes exponentially harder to answer when you factor in:\nThe flood of recent PhD's into the academic job market...and \nThe 2-party problem.\n\nWhat I mean is that 30 years ago, it wasn't uncommon to finish a PhD, and then begin an assistant-professor position on a tenure track.  Now, because literally thousands of people are applying for those jobs, you are almost expected to do multiple post-docs before even applying.  Additionally, if you have a spouse or family also in a similar field, it becomes even more challenging, especially since institutions are starting to do away with spousal hiring.\n\nFor me and my partner, we agreed that whoever gets the \"better\" job, will take lead, and the other will simply do the best they can in the same area.  For us, that meant she was fortunate enough to get an assistant professor job, and I was able to secure a job working in a lab nearby.  Ideally, I think I'd like to also start on a tenure-track route, but thus far, I have only made it to one interview stage.  The University where my partner was hired, does not do spousal hires for junior faculty, and even if they did, they do not have a strong program for my area of research.  Long story short, I had to be willing to compromise a bit, BUT...I'm absolutely ok with it.  To me, I'm still working on the stuff I like, and I get to be with my partner/family.  On the flip side though, if I were to get a really awesome faculty offer in the next year or two, I would try to negotiate her a position...meaning we'd move together (something she has said she's already on board with).  Our fields are in the Geosciences and neither of us have any interest in \"Industry\".", "Permalink": "https://www.reddit.com/by_id/t3_4bor9a.json"}, "129": {"Subreddit": "PhD", "Author": "thornbaby", "Date": 1458925240, "Score": 1, "Body": "You are unlikely to get a job for only a year, if the employer knows that is your plan.  I would suggest applying for graduate school now, work with the university so they know what you are doing, but then go out and get an internship.  Yah, they don't pay as well, but the employer knows that it is a short term thing.", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "130": {"Subreddit": "PhD", "Author": "extreme_road_rage", "Date": 1458939464, "Score": 2, "Body": "&gt; I feel like I'm screwing with both our careers\n\nso are you already related somehow? or is it platonic?\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4bycjr.json"}, "131": {"Subreddit": "PhD", "Author": "Zero_Fucks_", "Date": 1458941203, "Score": 1, "Body": "There are a few questions: How far into your PhD are you? Do they know you have feelings for them? Have you been involved? Do they have feelings back?\n\nWithout any other information, all I can say is you're working relationship is too important...this is your PhD and you need a proper supervisor with no emotional ties. You need to start the process to get an alternative supervisor before this wrecks you. But I think you already knew this. ", "Permalink": "https://www.reddit.com/by_id/t3_4bycjr.json"}, "132": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1458952441, "Score": 1, "Body": "I know two such couples. One couple has like 20+ years of difference in age.", "Permalink": "https://www.reddit.com/by_id/t3_4bycjr.json"}, "133": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1459001375, "Score": 1, "Body": "try and get a new supervisor. barring that, cut WAY down on any contact except what is strictly necessary. if necessary tell your supervisor you need some breathing space to dive into your research. then, dive into your research. this is too important for you to nuke your career with what is ultimately a schoolgirl fantasy.\n\nalso, make some new student and non-academic friends! and spend your evenings and weekends with them. step awaaay from the supervisor. ", "Permalink": "https://www.reddit.com/by_id/t3_4bycjr.json"}, "134": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1459010769, "Score": 1, "Body": "Professor (older male) divorces wife to marry doctoral advisee (younger female) was once upon a time a very typical story in higher Ed.\n\nStill happens but fraught with a minefield of ethics and career ending mistakes. Do you know the actual OP of your university? I am betting relationships with students you teach or supervise are actually banned. Please also read in the Chronicle of HE of the many, many cases where it did indeed blow up and bust both careers. \n\nSo yes, you are edging towards disaster.\n\nWho said \"Love doth make boneheads of us all\"?", "Permalink": "https://www.reddit.com/by_id/t3_4bycjr.json"}, "135": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1459085202, "Score": 2, "Body": "I defended in August, didn't finish all of my post-defense edits until November, and so couldn't walk until May.  At my university, you aren't \"done\" until your committee all signs your dissertation signatory form...which happens AFTER you complete your edits.  Even, then, you are not officially a Doctor, until your degree is conferred at the moment you walk across the stage.  So, I would put the date of graduation.  \n\nIt can be a bit of a weird limbo, to tell people, \"well I'm done, but technically not yet...\"", "Permalink": "https://www.reddit.com/by_id/t3_4bxaid.json"}, "136": {"Subreddit": "PhD", "Author": "thornbaby", "Date": 1459093789, "Score": 1, "Body": "What if you never walk, though?  I didn't for my undergrad...", "Permalink": "https://www.reddit.com/by_id/t3_4bxaid.json"}, "137": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1459110003, "Score": 2, "Body": "If you mean simply, \"what if you don't attend your graduation\", then, you are still awarded your title on graduation day (at least at most universities).  \n\nWhen applying for post-docs and jobs, all of the places I interviewed at wanted a copy of the signatory form.  To most outside institutions, you are done for all intents and purposes once your committee signs off on your work (signs your signatory form).  So even though you haven't made it to graduation day, the graduate school still has it on record that you've met all requirements needed to graduate.", "Permalink": "https://www.reddit.com/by_id/t3_4bxaid.json"}, "138": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1459222547, "Score": 1, "Body": "I mean I don't really need to say that I am going with PhD. Employees just come and go in a company when they see higher gains somewhere else, right? \n\nIf there's like one year internship, I'll try that option, too. Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "139": {"Subreddit": "PhD", "Author": "thornbaby", "Date": 1459224172, "Score": 1, "Body": "No, you don't need to say that, but if you pull the only-stay-for-a-year thing more than once, it looks really bad on your resume. Future employers get the idea that you aren't going to stick around, and so they won't hire you in the first place. ", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "140": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1459235189, "Score": 1, "Body": "hmm, somewhat true. I hope by then my PhD experience, if I finish, will increase my chance.", "Permalink": "https://www.reddit.com/by_id/t3_4bfkm2.json"}, "141": {"Subreddit": "PhD", "Author": "cjtargaryen", "Date": 1459339375, "Score": 1, "Body": "I`m on one now, money is good, but my university takes a chunk of the cash for conversions(EUR-&gt;GBP) or something...", "Permalink": "https://www.reddit.com/by_id/t3_4aio09.json"}, "142": {"Subreddit": "PhD", "Author": "rubzo", "Date": 1459344814, "Score": 1, "Body": "Was just offered funding through EPSRC by the university. I went straight into it after my bachelor's. 23. Because I never gave in to the crushing reality of research. Most of it, apart from the internships and some friends I made through it.", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "143": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1459347210, "Score": 1, "Body": "I applied for an AHRC-sponsored collaborative doctoral award. It was very unappealing so I got it even with a mediocre track record. \n\nStraight out of my MA. \n\nAbout 5 weeks after I turned 22. \n\nNo other fucker would touch it with a barge pole. \n\nI regret everything. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "144": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459349108, "Score": 1, "Body": "no one seems to have actually enjoyed doing one. is there a big difference between expectation and reality when you go in?", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "145": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459349433, "Score": 1, "Body": "was it the same university you did the bachelors with? did you know the staff doing to applications?", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "146": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459349762, "Score": 1, "Body": "What's the topic?", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "147": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459349782, "Score": 1, "Body": "I really enjoy mine, there are peaks and troughs sure, but overall I'm really glad I did it.", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "148": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1459350014, "Score": 2, "Body": "I think like u/lithicist that actually, most people do ultimately appreciate their PhD experience. They key thing is to find something you really want to do, then go ahead and find a great place to do it. Honey first, money second. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "149": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459350092, "Score": 4, "Body": "Finished MSc in September 2011, applied for PhD summer 2012 to start in January 2013. \n\nWent for the interview and the staff member who would be my supervisor was showing me around talking like I'd already got it (e.g. \"this is your office, this is your desk\"). The PhD came with a studentship that paid my fees, but I would still have to work to support myself. \n\nI was 24 when I started. I think the main reason I got it was becuase I the only fucker who got an interview - I'm terrified of asking if there was ever anyone else in consideration for it cause I'm pretty sure it was just me. They wanted someone who had experience of both arts and science; my BA was theory-based and my MSc was a lot more sciencey. \n\nI regret nothing. My PhD is nothing to do with my MSc, but what I want is a job lecturing in a uni, and I need a PhD, any PhD, to get there. I've met some amazing people, had great experiences, and gained loads of skills I can use to bolster my CV for applying for jobs. Thanks to my totally different MSc and PhD I have two specialisms in my field, which will hopefully make me more employable. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "150": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459350397, "Score": 2, "Body": "So much this. I have a large number of friends who have either done/are doing a PhD, and although there are tough times with research/money/lab trouble/dickhead supervisors, they love it. If they had just gotten a job out of uni they'd be having problems with work/money/dickhead bosses. Don't go into a PhD thinking you'll have 3 amazing years of fulfilling research and intellectual stimulation. As I write this I'm spending my Easter holiday making the third round of corrections to a chapter that took me months to write because I basically had to teach myself statistics. It ain't all pretty, but it's so worth it.", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "151": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459351459, "Score": 1, "Body": "do you think that there is a risk of 'de-skilling' if you spend to long finding the right one? do you think you would be less likely to get one if you wait 1 year+ after finishing the prevous degree?", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "152": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459352743, "Score": 1, "Body": "Depends - what field are you looking at? If it's a really fast-paced specialism it might be an issue, but for me (archaeology) things tend to move relatively slowly, my MSc was human remains and while the methods used to analyses can change, the basic stuff has been the same for decades. \n\nI know a few people who have gone back to do PhDs/Master's after years out of academia, I think you'd maybe be less likely to get a funded PhD in a competitive area, but it totally depends on how you present your 'time off' - if you stayed up to date and did volunteer stuff for example. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "153": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459353258, "Score": 1, "Body": "If I was thinking of applying for one this year, when would be the best to apply?\n\nDo universities get funding for PhD any particular time of year? (assuming they are pickier when money is tight)\n", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "154": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1459356658, "Score": 3, "Body": "Couple of things here: \na.) im funded through a studentship at my university\nb.) it took me a long time. I finished my MA in 2011, started my PhD in 2014\nc.) I was 26 when I started\nd.) research experience, and a relationship with the department and my supervisor when applying\nc.) no\n\n\nMy take home message is this, don't get discouraged that you may not be getting a place right away. It took my bloody ages. I applied straight after my BSc, didnt get a place- did a MSc instead. applied to a load of places after that, still no where. applied for jobs after that. Ended up working as a research assistant in the department for a year at a place I had an interest in possibly doing a PhD, applied there among other places... didn't get in, and finally after another year of research assistant work, I got a place.  \n\nNow, this isn't because I'm underqualified. I went to a very good university, and had loads of good experience when I applied the first time around, but...so does everyone else applied for PhDs. Also, I'm not from the UK I'm an international student so I had extra difficulties getting funding- however all my education to date has been here, so I was keen to stay here for my PhD.  To be honest, the work and experience I gathered in my 'break' as a research assistant has made my life as a PhD so much easier, i've found working on one task rather than multiple ones pretty chill; and compared to my peers, the rest of us who worked for a few years before PhDs are generally coping better. So, don't sweat it if you have to take some time out, work, get familiar with a department and so on- it may help you in the long run. (however, this really depends on your area---- I'm working in science, not sure how well this would work in the arts, but perhaps you could find something similar. )", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "155": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1459357388, "Score": 3, "Body": "I think this would work as well in arts as for STEM etc. Any work experience will help you appreciate the freedom of studying one thing for a big chunk of your work (instead of having to work). And, it gives time to do a bit of wider reading and understanding of the world, making you a better 'humanist' and more fully-prepared to engage with the travails of a very specific topic. \n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "156": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459359163, "Score": 1, "Body": "It depends where the funding is coming from  - i.e. a research body or the uni itself. Don't mean to be sarky, but the best time to apply is when you see one advertised - which could be months ahead of the anticipated start date or more short notice, keep an eye on jobs.ac.uk and various social media outlets for PhD opportunities. \n\nMy understanding of the funding situation is: unis compete with each other to get a block grant from research bodies (NERC, AHRC etc). The uni then gets a lump sum that departments within the uni compete for. Bigger depts. get more money. For my field, archaeology, we're usually one of the smaller depts. so get less cash to use for funded degrees. When I did my MSc I got one of three NERC grants for the course, which was considered a good year. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "157": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1459367169, "Score": 3, "Body": "yep, i also appreciate my PhD so much more than some of the people that got in easily (theres obviously nothing wrong with getting in easily, im not slagging it off in any way) but since I had this extra time, and worked so much extra harder to get in, I REALLY knew it was what I wanted. So when I go through blips, or the peaks and troughs as [u/lithicist](https://www.reddit.com/user/lithicist) stated, I always just treat is as a ''low'' day. Like, hey.. today my PhD is boring me, im not agreeing with my supervisor, my analysis isnt going my way,  and I'm everyone in my open plan office is doing my head in....I may just take a personal day, read in the sun... buy a nice coffee, so on so on, and hit the refresh button.. because I know in a few days, I'm going to be back in love with my PhD and overexcited at some finding/paper/meeting/conference so on. \n\n..sorry that rambled on... ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "158": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459412415, "Score": 1, "Body": "thanks this is really good infomation, i would be looking to do science. I havent found many job adverts for any lab work in universites and the ones i have found, i fould i was against people with phds and was simply out gunned.", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "159": {"Subreddit": "PhD", "Author": "lscanlon93", "Date": 1459412517, "Score": 1, "Body": "so the funding isnt linked to financial years or anything like that, it just happens when it happens?", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "160": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1459428265, "Score": 1, "Body": "There are deadlines for applications from research bodies that universities have to meet, then it gets distributed within the uni. Some years they get more, some years they get less. When they get less from a funding body there's less to go around between the departments and some will go without for that year. \n\nAs I said before, I'm in archaeology and the year after my master's (where my course had three funded places available) there was one funded place. It changes year by year. ", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "161": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1459455126, "Score": 1, "Body": "Brilliant - thank you.\nProposal accepted, just about to embark!", "Permalink": "https://www.reddit.com/by_id/t3_4cr10i.json"}}