{"0": {"Subreddit": "PhD", "Author": "capaldithenewblack", "Date": 1454295931, "Score": 1, "Body": "I shouldn't be reading this. Started a PhD program a month ago and am feeling burnt out-- teaching full time and have a family. I'm going to hate the next five years... it sounds like you're almost there! I'd try to push through, but do talk to someone.", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "1": {"Subreddit": "PhD", "Author": "bobwoodshed", "Date": 1454359571, "Score": 1, "Body": "It totally depends on the program and the institution.  It never hurts to broaden your horizons, but also don't discount staying at your institution if it truly is the best fit and opportunity for you.  ", "Permalink": "https://www.reddit.com/by_id/t3_43qe2u.json"}, "2": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1454367206, "Score": 1, "Body": "Richard Feynman, American physicist and 1965 Nobel Prize winner in Physics, describes his experience in his autobiography, \"Surely you're joking, Mr. Feynman!\"\n\n&gt; When I was an undergraduate at MIT I loved it. I thought it was a great place, and I wanted to go to graduate school there too, of course. But when I went to Professor Slater and told him of my intentions, he said, \"We won't let you in here.\"\n\n&gt; I said, \"What?\"\n\n&gt; Slater asked, \"Why do you think you should go to graduate school at MIT?\"\n\n&gt; \"Because MIT is the best school for science in the country.\"\n\n&gt; \"You *think* that?\"\n\n&gt; \"Yeah.\"\n\n&gt; \"That's why you should go to some other school. You should find out how the rest of the world is.\"\n\nFeynman ended up going to Princeton, and all went well.\n\n&amp;nbsp;\n\nAnother true story:\n\nThere was once a very smart man who did his undergrad at Harvard in the 1970's.  He knew of no finer school — where else should he go? — so he decided to stay there for his PhD.  He was admitted.\n\nBut academic politics are a force to be reckoned with.  You too will learn this in your doctoral studies.  This man was very smart, probably smarter than most of his professors.  His professors grew sick of him, and even though he successfully passed his graduate classes and *wrote his dissertation*, he was forced out in his last year and ~~prohibited~~ prevented from defending and receiving his PhD.\n\nThis happens much more frequently that many people realize.  Please, do yourself a favor and find a different university!  \n\nBesides avoiding \"academic inbreeding\", IMHO the other idea is to go to a different-enough university that they don't think you are hanging around one city with nothing better to do except dabble in more schooling.  Moving to a different geographical area shows you are taking your research and career seriously.\n\nEdit: word change.", "Permalink": "https://www.reddit.com/by_id/t3_43qe2u.json"}, "3": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1454392529, "Score": 1, "Body": "One other thing to look out for - most schools will give you an offer where they waive the tuition and give you a stipend, etc., but will still charge you certain student fees. Going into my program, I thought the stipend was moderate to high, but I need to pay $4,500 between fees, health insurance, parking permit etc. of my AFTER TAX INCOME! This is really a killer. Ask department officials or other students from the program how much this is. It seems to vary from $1,000 to mine being actually the highest I've heard of.", "Permalink": "https://www.reddit.com/by_id/t3_43834o.json"}, "4": {"Subreddit": "BrianHasaPhD", "Author": "DataKeeper", "Date": 1454424182, "Score": 1, "Body": "As mod, I can confirm that Brian does have a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_43sylx.json"}, "5": {"Subreddit": "PhD", "Author": "falahaldeen", "Date": 1454460514, "Score": 1, "Body": "My advice is to prepare a list of the good things of becoming PhD graduate &amp; why did you join the program. Probably this will give you  strong motivation. Keep in mind since you're in your 2nd day, it could be temporary feeling. Since I started my PhD program(1 year ago), everyday I'm thirsty to learn more, thinking of my future after graduation &amp; new ideas of things that I'm going to do after graduation. Good Luck", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "6": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454479757, "Score": 1, "Body": "A doctorate degree is the superlative level of formal academic knowledge that you can attain in any subject.http://www.phdadmission.info/management", "Permalink": "https://www.reddit.com/by_id/t3_43yjg5.json"}, "7": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454481106, "Score": 1, "Body": "You can take up industry specific jobs or even academics and teaching after pursuing a PHD degree. http://www.phdadmission.info/management", "Permalink": "https://www.reddit.com/by_id/t3_43ymp5.json"}, "8": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454482345, "Score": 1, "Body": "You can gain tremendous knowledge and perspective about any discipline or sub discipline by pursuing a PHD degree in the subject.http://www.phdadmission.info/management", "Permalink": "https://www.reddit.com/by_id/t3_43yoy9.json"}, "9": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454490640, "Score": 1, "Body": "Doctor of Philosophy or PhD in Life sciences covers the subjects of biochemistry, cell biology, immunology, molecular biology, genetics &amp; more. There is no age constraint associated with PhD in the field of Life Sciences.http://www.phdadmission.info/life-science\n\n", "Permalink": "https://www.reddit.com/by_id/t3_43z25c.json"}, "10": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": 1454501516, "Score": 1, "Body": "Yep, welcome to expat life", "Permalink": "https://www.reddit.com/by_id/t3_41vz3x.json"}, "11": {"Subreddit": "PhD", "Author": "dny6", "Date": 1454501979, "Score": 1, "Body": "I was reading through the USNews rankings for bio grad programs today. Was just admitted to UVA for the biomedical umbrella program, and have an interview at UNC-CH in two weeks.\n\nUNC is ranked 25 and UVA 50 (in straight biology), you know what the different in their raw scores is? 3.9 vs 3.6 out of 5. How is that even meaningful -_-. Not to mention they only get a 9% response rate for their surveys!", "Permalink": "https://www.reddit.com/by_id/t3_43yjg5.json"}, "12": {"Subreddit": "PhD", "Author": "DrMerkelig", "Date": 1454525966, "Score": 1, "Body": "Thank you very much for the awesome response. \nJust to clarify, I don't want to stay at my current uni (don't even have a program for what I want here), I just meant staying in the general area (I live in NJ, and would prefer to stay on the Northeast coast).", "Permalink": "https://www.reddit.com/by_id/t3_43qe2u.json"}, "13": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1454615969, "Score": 4, "Body": "Hum. It sounds like you already made your decision to quit: all the reasons you give for not quitting are external whereas you're pretty clear about why you want to quit: you don't like it!   \nSince you have some down time and somewhat stable position with the fellowship, you could try using it to look into what you would actually enjoy doing. Since you got that fellowship, I'm assuming you're smart, and your talent would probably be useful in other areas!   \nSo why did you start this PhD in the first place? Was it only because it was the logical thing to do? Try finding what exactly you thought you'd like doing and why, from there you can hopefully figure out what type of job would fit you better.   \nDon't lose your time (and everyone else's) doing something that makes you miserable! It sounds like you have a great environment, so it's unlikely it's gonna get any better.  Better realize early it's not for you and start looking for what actually is.   ", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "14": {"Subreddit": "PhD", "Author": "jillthebear", "Date": 1454616876, "Score": 4, "Body": "I too was in your situation a few months ago. I had a very prestigious government fellowship, I was publishing good research, professors viewed me as an \"ideal PhD student,\" and my advisors were fantastic. But I felt dead inside every time I stepped into lab. First of all, it is so common to doubt the value of your PhD at year 2 (one PhD blog refers to this time as the \"Valley of Shit\"). That said, this is a sign that you need to take charge of your life. While it is a super lonely to feel this way, the good news is that you don’t have to rush making any life altering decisions until you’re ready. \n\nExplore your options. The best thing I ever did was conduct informational interviews. Ask family and friends to connect you with people in your field. Meet with career services and have them connect you to alumni who you think may or may not do interesting things. Connect with people on Linked In, etc. Also, attend professional meetups and talk to professors (especially ones with experience in both industry and academia). There are so many alternative career paths besides academic research for PhDs. But you may need to be a bit clever to enter these alternative career paths (it’s good to start acquiring relevant skills now). In addition, there are so many career paths for people with a Masters. Figure out what inspires you and what genuinely makes you feel alive and go from there. \n\nQuitting is not failing. Going through life on autopilot in order to live up to other people’s definition of success is a failure. There is a HUGE world beyond academia. I ultimately decided to leave with my masters and was surprised at how much employers did not care that I quit PhD. Just be able to articulate why you decided to change career paths and always be positive. Also, many employers value research skills and the ability to tackle ambiguous problems. Family and friends were not always supportive of my decision at first, but if they care about you they will ultimately support you. \n\nThen again, you may decide that PhD is the correct decision for you (perhaps changing your project or even labs will inspire you enough to want to continue). If you do stay, you should have a clear vision as to why you are pursuing this path. Whichever path you do choose, explore and reflect often. Life does not have to be linear and there is no “right answer.” The world is fascinating and life is way too short to be depressed, uninspired, and jaded. What is your definition of a successful life? Sorry for the word vomit. I do wish you all the best in your decision making process!\n", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "15": {"Subreddit": "PhD", "Author": "Coste10", "Date": 1454617462, "Score": 3, "Body": "YES! I think that I just got into it because I like research (did 3 years in undergrad + 2 summer internships), and this seemed like the next logical step. \n\n\"A B.S. is not enough anymore\"\n\n\"A PhD is the only thing that can guarantee you a stable future\"\n \nThese were all things that the people who were supposed to advise me told me, soooo I believed them. Plus I was in a research program whose objective was to introduce undergraduates to research (and hopefully push them into a STEM PhD) so in my mind it just seemed like the next logical step to take. ", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "16": {"Subreddit": "PhD", "Author": "Coste10", "Date": 1454617583, "Score": 2, "Body": "Thank you soooooo much for your feedback!\n\nI guess my best option right now IS to talk to a career counselor or something like that because I just have no idea. If someone where to even ask me right now what job I would like in the future (if I could have any job) I wouldn't know what to answer. \n\nSo I guess because I can't see the end goal (job), I don't know why I'm taking this path (PhD). ", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "17": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1454618365, "Score": 2, "Body": "So, you like research but not academia? Or is it just your project you don't like? Are you getting results? It's easy to get frustrated when you spend your time working without seeing where your project is going, and it often happens in year 2 ;) \nWhile this website is more aimed at people with PhDs, it mpay give you an idea on careers outside the university: http://cheekyscientist.com/", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "18": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1454623879, "Score": 1, "Body": "You have more job opportunities with a B.S. than with a PhD. You risk overqualifying yourself for a lot of industry positions once you educate yourself past Masters.", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "19": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454654796, "Score": 1, "Body": "Best PhD in Management Courses in India - 7533-00-7534\n\nOur counselors possess exceptional information about the course curriculum of a number of universities which is very useful for the ones who need best information about the PhD in management admission.\nCALL US : 7533-00-7534\nVisit Hare : http://www.phdadmission.info/", "Permalink": "https://www.reddit.com/by_id/t3_449oyp.json"}, "20": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454657558, "Score": 1, "Body": "How to Get Admission PhD in India - 7533-00-7534. There are a few profession opportunities accessible in the wake of contemplating a PHD. You can fabricate an energizing and compensating profession which will satisfy your scholarly interests.\nCALL US : 7533-00-7534\nVisit Hare : http://www.phdadmission.info/", "Permalink": "https://www.reddit.com/by_id/t3_449to0.json"}, "21": {"Subreddit": "PhD", "Author": "phdadmission", "Date": 1454658556, "Score": 1, "Body": "Get PhD in Management Admission 2016 - 7533-00-7534. You can seek after a PHD in the wake of seeking after your MA degree. You are presented to a variety of energizing profession opportunities in the wake of seeking after a PHD program in any order of your decision.\nCALL US : 7533-00-7534\nVisit Hare : http://www.phdadmission.info/", "Permalink": "https://www.reddit.com/by_id/t3_449v9q.json"}, "22": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1454786182, "Score": 1, "Body": "Yes! You should not even be considering a PhD in psychology...\nComparing OBHDP and Psychology PhDs is like comparing PhD i English literature and Economics.\n\nYou will get a job with an OBHDP PhD and you will actually graduate in 5 years, whereas with a Psych. PhD everything is very uncertain. It's not uncommon for Psyc PhD to spend 7+ years in the program and still not graduate. Those who graduate have an extremely hard time getting a good job. OBHDP is a much better career choice.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "23": {"Subreddit": "PhD", "Author": "missusamazing", "Date": 1454809175, "Score": 2, "Body": "I would suggest that you identify how many of the courses you've already taken apply for the master's degree in your field (if your university offers it). At least this way you will be able to walk away with the Master's. Then instead of \"quitting\" it's \"Earned a Master's Degree in X.\" \n\nAlso, Academia isn't the only thing out there. It's easy to feel that way being surrounded by journals, professors, conferences, etc. But there are practitioners out there that just research and have absolutely nothing to do with academia (which is my goal). Also keep in mind this drudgery is only temporary and you're almost done, but if you think you'll be miserable *after* completion, then you may want to look at alternatives. Good luck! \n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_446g6w.json"}, "24": {"Subreddit": "PhD", "Author": "missusamazing", "Date": 1454809595, "Score": 1, "Body": "Check out the Penn State program in Human Resource Development/Organization Development, it sounds like something up your alley. \n\nhttps://ed.psu.edu/lps/workforce-ed/grad-program-folder\n\nhttps://ed.psu.edu/lps/workforce-ed/grad-program-folder/hrd-od-course-requirements", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "25": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1454832959, "Score": 1, "Body": "Reza Aslan probably did both (i.e., revisit sources and refer to his notes).\n\nPersonally, I like to highlight the interesting parts of the article/book I'm reading and then write a short summary of it in my research log (a LaTeX document).", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "26": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1454913850, "Score": 2, "Body": "Thank you for this advice. I realize I know Prof. Rothwell who's teaching there. I'll definitely check it out", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "27": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1454913936, "Score": 1, "Body": "Thanks for this piece of advice. Yeah I was thinking about the practical side and OBHR seems to be a better choice.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "28": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1454975525, "Score": 1, "Body": "The university I attend have a program called 'discovery' which comprises all the major databases into one. Check to see what your uni has on offer. ", "Permalink": "https://www.reddit.com/by_id/t3_43s8jz.json"}, "29": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1455069130, "Score": 1, "Body": "Check out national ratings of any program you are considering.\n\nSee if you can track,down grads and ask them\n\nDo they tell you YTC rate? Placement of grads?\n\nLook at faculty -- how well published are they?\n\nLots of factors...but it's close to getting married in depth of importance of making right decision.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "30": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1455148391, "Score": 3, "Body": "you must understand that a PhD itself is almost like having a second relationship. you go to bed thinking about it and you often wake up thinking about it. one becomes extremely intimate with the literature, to a point where you almost feel like you begin to 'know' the major researchers/authors in the field. you become so passionate about it that you talk to anyone who is willing to listen. the fact that they're both doing a PhD means they have a 'connection' in that they both understand what each other are going through. it doesn't mean anything 'seedy' is going on between them. you should be talking to him about it, not redditors. ", "Permalink": "https://www.reddit.com/by_id/t3_455sgm.json"}, "31": {"Subreddit": "PhD", "Author": "Webby911", "Date": 1455148971, "Score": -1, "Body": "smh \"Ivy League University\", what meaningful detail did this add to the story?", "Permalink": "https://www.reddit.com/by_id/t3_455sgm.json"}, "32": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1455150254, "Score": 4, "Body": "Would this bother you so much if his friend was a man?", "Permalink": "https://www.reddit.com/by_id/t3_455sgm.json"}, "33": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1455157518, "Score": 1, "Body": "superfluous fluff? ", "Permalink": "https://www.reddit.com/by_id/t3_455sgm.json"}, "34": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1455161758, "Score": 1, "Body": "Yes that's a good advice.  Thanks for this.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "35": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1455165726, "Score": 1, "Body": "You have no clue. OBHDP (as is any other business PhD) is grounded in data analysis. You are trained to be a researcher, not a teacher. You may find some low ranked school that does not care if you can't do (or don't want to do) data analysis, but for every respectable program statistics courses are required.", "Permalink": "https://www.reddit.com/by_id/t3_456w41.json"}, "36": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1455167330, "Score": 1, "Body": "Yes and my data analysis skills are no good.  I may as well have a Plan B.", "Permalink": "https://www.reddit.com/by_id/t3_456w41.json"}, "37": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1455187687, "Score": 2, "Body": "I think this is probable best suited to r/relationships. But I think you are only bothered by this behaviour because his best friend is a woman, none of this behaviour would be odd if she was a man instead. You need to take a step back from this as you are starting to become that \"crazy, possessive girlfriend\". ", "Permalink": "https://www.reddit.com/by_id/t3_455sgm.json"}, "38": {"Subreddit": "PhD", "Author": "AeroDoc28", "Date": 1455191173, "Score": 4, "Body": "I often found (and still find) myself in the same situation. Honestly the only way I've been able to cope with looming graduation is by not setting a date of when I'm graduating. Instead I've set a detailed description of my dissertation and what it will solve/answer/contain. I'm only able to do this since I got got a job after achieving candidacy. \n\nKeep digging, sometimes you just have to grind it out. But yes my professor does the same thing as you are describing. Hope this helps! ", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "39": {"Subreddit": "PhD", "Author": "MSAE", "Date": 1455214065, "Score": 1, "Body": "Thank you for the kind words. Judging by your username, we're in the same curriculum. Ultimately, the professors here have sizable egos, so when their ideas don't work out, they won't let them go, even when there's a strong proof as to why.", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "40": {"Subreddit": "PhD", "Author": "AeroDoc28", "Date": 1455229295, "Score": 1, "Body": "For sure, I feel like my professor is crazy when he brings up an idea over and over although we've either proved it wrong or don't have experimental evidence to prove it correct.", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "41": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1455251000, "Score": 1, "Body": "I agree with ShadowHunter that you should only do a PhD in OB if you are interested in being a researcher.\n\nHowever I don't think you should give up on your dream if you are worried about data analysis.\nA lot of it you can learn during the program. You can also take some statistics courses, now, and before you start the program.\n\nIt also depends on the type of OB you are interested in, if you are interested in Micro OB (very psychology based) then it will be mostly experimental.\nAnd if you are interested in more of the macro stuff, then that stuff tends to use a sociology lens, which is much more qualitative.\n\nBut yes, bottom line, only do a PhD if you are interested in research, otherwise you are going to not enjoy the process (and people who find the process painful have a hard time finishing)\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_456w41.json"}, "42": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1455251141, "Score": 1, "Body": "As long as you realize that you will still take a lot of the same courses and learn a lot of the same things that you would learn in a Psych PhD program.\nJust, as the posters below have mentioned, your job prospects will be a lot better.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "43": {"Subreddit": "PhD", "Author": "rrgjl", "Date": 1455288180, "Score": 1, "Body": "In the Netherlands everyone is supposed to finish their PhD in 4 years (or less, but that rarely happens).", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "44": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1455313986, "Score": 1, "Body": "So I originally said that I had no words of encouragement, but then I decided that it could be encouragement after all.  Sometimes, when I'm deep into the weeds of a given subject, its hard to pull back and look around to see where I took a wrong turn.  This happens to me both in academics and at work.  Take those times of discouragement and focus them toward your work and research.  Keep on hanging in there man, it gets better!", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "45": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1455334665, "Score": 1, "Body": "I don't know about the first one but I can offer brief comments on the next 3\n\nSocial neuroscience -- you should have a really solid grasp of neuroscience (obviously), and you should live and breathe neuroscience. Like it should make you super excited to be thinking about and talking about brain-stuff all the time.\n\nBehavioral economics... don't let the \"behavioral\" part fool you, you will need to have a very strong command of math, statistics and judgment and decision making. If you're doing more JDM type stuff, you might find that a program housed in the marketing department would be the best fit. If you're thinking of doing it in an economics phd program, then you will approach things from a very math-heavy stance. It goes without saying that you will need superb math preparation, so since your Masters doesn't look math based, hopefully you had a very strong math background in your undergrad.\n\nCultural psychology -- this is a fairly large area. The foundational articles by Nisbett, Choi and others come to mind. You should have a pretty strong psychology background. Advanced statistics and knowledge of experimental design would be a huge asset.", "Permalink": "https://www.reddit.com/by_id/t3_4554b1.json"}, "46": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1455360544, "Score": 1, "Body": "In fields like political science, if you hope for a tenure track position after the PhD, ratings/rankings matter VERY MUCH.\n\nThere is a great study out there -- forgot the author -- that basically tied r/r of polsci programs to likelihood of getting a job at an R1.\n\nI know there are other considerations for selecting a PhD program but future employment must be one of them.\n\nGo to each schools website and find -- if you can -- where their grads are placed.\n\nCall some of them and ask about their experiences and worth of their degree.\n\nThis is, save for marriage, perhaps the most important decision of your lifetime.\n\nResearch it heavily.", "Permalink": "https://www.reddit.com/by_id/t3_458jvu.json"}, "47": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1455360872, "Score": 1, "Body": "On first one, lots of great COMS programs out there.\n\nMany have unique qualifiers. Areas of faculty, types of labs, level of support.\n\nFor example, our school has a very large psychometric research lab set up, a Hispanic Media Center and lots of collaboration with HSTEM.\n\nOthers have other strengths.", "Permalink": "https://www.reddit.com/by_id/t3_4554b1.json"}, "48": {"Subreddit": "PhD", "Author": "which-phd-program", "Date": 1455554456, "Score": 0, "Body": "Please I need advice. ", "Permalink": "https://www.reddit.com/by_id/t3_45x9vt.json"}, "49": {"Subreddit": "PhD", "Author": "LawOfExcludedMiddle", "Date": 1455582065, "Score": 2, "Body": "A PhD International Studies is probably the way to go *if* you want to do a PhD. Don't do one unless you're genuinely interested in the subject matter.", "Permalink": "https://www.reddit.com/by_id/t3_45x9vt.json"}, "50": {"Subreddit": "PhD", "Author": "which-phd-program", "Date": 1455583465, "Score": 1, "Body": "I appreciate your comment. If you have experienced  process doing PHD please let me know more and other possible alternatives other than International Studies. I have really no Idea .", "Permalink": "https://www.reddit.com/by_id/t3_45x9vt.json"}, "51": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1455611570, "Score": 1, "Body": "Hi, thanks for that advice.  Yes I aim for something more practical.", "Permalink": "https://www.reddit.com/by_id/t3_44gz6j.json"}, "52": {"Subreddit": "PhD", "Author": "IamMikyles", "Date": 1455611954, "Score": 1, "Body": "Hi, thanks for the assurance.  I actually have decided that it is what I want cos it aligns with my personal vision in life:  empower people and empower organizations.  Yes I am interested in studying OB at macro level.  Upon reflection for these past few days, I don't mind going into data analysis cos it's definitely needed in the discipline.  I'm looking forward to studying it actually.  It's just this GRE hurdle that I need to go through.  I suck it Math.  Wish me luck.  My exam is on the 11th April :)  Ey, I wish you all the best too in your endeavor. ", "Permalink": "https://www.reddit.com/by_id/t3_456w41.json"}, "53": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455649566, "Score": 6, "Body": "A few suggestions that might work for you as it does for me:\nKeep reading at least 3 articles per week day and write at least one paragraph a day;\nTry to organize writing retreat with your colleagues \nWhen working on your stuff,  try following the pomodoro technique (Google it) \nAsk for advice from your supervisor\nPlease,  have a hobby or do something else that you like\nNetwork \nThere are a lot of nice PhD blogs out there that may suit your needs \nIt's OK to not be as cognisant as you think you should be.  You are learning and will be all your life\n\nDon't know if it helps but I wish you the best of luck", "Permalink": "https://www.reddit.com/by_id/t3_462kde.json"}, "54": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455649891, "Score": 1, "Body": "Unfortunately a PhD is about research,  not teaching. Glad you are interested in that but if you want to work in academia,  focus on research...", "Permalink": "https://www.reddit.com/by_id/t3_456w41.json"}, "55": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455649994, "Score": 1, "Body": "Find a research topic first and then decide how you want to address it. The program should then be obvious...", "Permalink": "https://www.reddit.com/by_id/t3_4554b1.json"}, "56": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455650071, "Score": 1, "Body": "I would advise against a PhD in History... \n\n\nNo,  seriously,  it depends on your topic. Each university has its area of expertise.", "Permalink": "https://www.reddit.com/by_id/t3_44w093.json"}, "57": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455650328, "Score": 1, "Body": "Good luck with that.  You'll be transformed by this project.  For better or worse...", "Permalink": "https://www.reddit.com/by_id/t3_41buny.json"}, "58": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1455652201, "Score": 1, "Body": "1.  Is Ph.D. a good investment for me?  \n     The PhD is never a good investment from a monetary point of view if you are planning on going into the private sector or public sector job (in the non educational sense).  If you want to teach at a university then yes, PhD all the way (more on this at #3).  However, if you love the area of research and you want to complete a program with the highest degree possible because you want to expand an area of knowledge, then by all means YES!  \n\n2.  Are there chances for me to get a full funded program with those GPA?\n     Most universities that provide a PhD program provide assistance with the program.  Usually in the form of a stipend and tuition waiver.  However, they require that you do something along the following lines:  teach class(es), professor research, etc.  I've seen some STEM PhD students get in the 15-17k a year stipend with tuition waived.  Also, keep in mind that some PhD programs also have research tanks giving away scholarships and money to graduate students in their area of research.\n\n3.  Which university or state .... ?\n     If you want to teach at a top tier school, then you must (usually) graduate from a similar ranking school in order to do that.  Not always the case, but most of the time this is the unofficial consensus.  If you want some advice, the adviser makes or breaks a PhD student.  School X doesn't really matter if you find a well respected adviser in the area you want to study.  That being said, please keep in mind the first thought on this question.  School matters when it comes to teaching at a university of similar or higher ranking.\n\n4.  Any other suggestions...?\n     Yes, if you are thinking about a PhD program, you need to learn to love learning.  You need to learn to be completely solo (on your learning) and you need to learn to love to read.  If you can't sit down and read about which schools provide the best programs in your research area and search for what programs are similar to your interests, etc.  It might not be the best approach for you.  Although, there are many non-dissertation research that is usually conducted in groups, the majority of your time as a PhD student will be spent scrounging the material for anything related to your interest area.\n\nGood luck.", "Permalink": "https://www.reddit.com/by_id/t3_45x9vt.json"}, "59": {"Subreddit": "PhD", "Author": "fjanko", "Date": 1455665164, "Score": 1, "Body": "why?", "Permalink": "https://www.reddit.com/by_id/t3_44w093.json"}, "60": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1455666852, "Score": 1, "Body": "The PhD in History blurb was a joke. Sorry if it offended you. \n\nI know that the University of Ottawa has great scholarships for PhD students. Www.uottawa.ca", "Permalink": "https://www.reddit.com/by_id/t3_44w093.json"}, "61": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1455677611, "Score": 2, "Body": "Write a Survey Paper. You'll get a publication out and it'll help you look into the state of the art.", "Permalink": "https://www.reddit.com/by_id/t3_462kde.json"}, "62": {"Subreddit": "DoctorZoidbergPhD", "Author": "[deleted]", "Date": 1455703969, "Score": 1, "Body": "\n# *FREE BOOK \"Zealot by Reza Aslan\"  txt pdf price wiki store djvu no registration*\n\n\n***\n## █ ► [**READ** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n***\n## █ ► [**ONLINE** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n***\n## █ ► [**DOWNLOAD** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n\n. \n\n***\n## █ ► [**READ** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n***\n## █ ► [**ONLINE** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n***\n## █ ► [**DOWNLOAD** ***Zealot by Reza Aslan***](http://piskihuiski.ivanovo.su/60bY?source=reddit&amp;keyword=Zealot%20by%20Reza%20Aslan)\n***\n\n&gt; . \n\n&gt;  Description book **Zealot by Reza Aslan**:\n\n&gt;  From the internationally bestselling author of No god but God comes a fascinating, provocative, and meticulously researched biography that challenges long-held assumptions about the man we know as Jesus of Nazareth.Two thousand years ago, an itinerant Jewish preacher and miracle worker walked across the Galilee, gathering followers to establish what he called the “Kingdom of God.” The revolutionary movement he launched was so threatening to the established order that he was captured, tortured, and executed as a state criminal.Within decades after his shameful death, his followers would call him God.Sifting through centuries of mythmaking, Reza Aslan sheds new light on one of history’s most influential and enigmatic characters by examining Jesus through the lens of the tumultuous era in which he lived: first-century Palestine, an age awash in apocalyptic fervor. Scores of Jewish prophets, preachers, and would-be messiahs wandered through the Holy Land, bearing messages from God. This was the age of zealotry—a fervent nationalism that made resistance to the Roman occupation a sacred duty incumbent on all Jews. And few figures better exemplified this principle than the charismatic Galilean who defied both the imperial authorities and their allies in the Jewish religious hierarchy.Balancing the Jesus of the Gospels against the historical sources, Aslan describes a man full of conviction and passion, yet rife with contradiction; a man of peace who exhorted his followers to arm themselves with swords; an exorcist and faith healer who urged his disciples to keep his identity a secret; and ultimately the seditious “King of the Jews” whose promise of liberation from Rome went unfulfilled in his brief lifetime. Aslan explores the reasons why the early Christian church preferred to promulgate an image of Jesus as a peaceful spiritual teacher rather than a politically conscious revolutionary. And he grapples with the riddle of how Jesus understood himself, the mystery that is at the heart of all subsequent claims about his divinity.Zealot yields a fresh perspective on one of the greatest stories ever told even as it affirms the radical and transformative nature of Jesus of Nazareth’s life and mission. The result is a thought-provoking, elegantly written biography with the pulse of a fast-paced novel: a singularly brilliant portrait of a man, a time, and the birth of a religion.\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; . \n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; [FREE.. BOOK.. \"Falling.. Kingdoms.. by.. Morgan.. Rhodes\".. .. how.. to.. finder.. without.. registering.. windows.. iBooks.. kindle.. cheap](https://www.reddit.com/467o3g),.. [FREE.. BOOK.. \"Uglies.. by.. Scott.. Westerfeld\".. .. thepiratebay.. price.. prewiew.. finder.. torrent.. tablet.. ebay.. pc](https://www.reddit.com/467oob),.. [READ.. BOOK.. \"Magic.. Hour.. by.. Kristin.. Hannah\".. .. djvu.. epub.. find.. book.. android.. selling](https://www.reddit.com/467nm1),.. [READ.. BOOK.. \"Destined.. for.. an.. Early.. Grave.. by.. Jeaniene.. Frost\".. .. djvu.. download.. pc.. full.. portable.. book](https://www.reddit.com/467n7p),.. [READ.. BOOK.. \"UnWholly.. by.. Neal.. Shusterman\".. .. purchase.. eReader.. ebook.. look.. shop.. how.. download](https://www.reddit.com/467oe3),.. [FREE.. BOOK.. \"The.. Other.. Queen.. by.. Philippa.. Gregory\".. .. for.. touch.. review.. pc.. german.. how.. download.. read.. apple](https://www.reddit.com/467nnj),.. [DOWNLOAD.. BOOK.. \"Gabriel's.. Redemption.. by.. Sylvain.. Reynard\".. .. how.. read.. ebay.. for.. reader.. itunes.. get.. torrent.. ipad](https://www.reddit.com/467nz5),.. [READ.. BOOK.. \"Barefoot.. by.. Elin.. Hilderbrand\".. .. apple.. spanish.. macbook.. touch.. without.. signing.. pocket.. mobile.. pdf](https://www.reddit.com/467ndi),.. [FULL.. BOOK.. \"Illuminae.. by.. Amie.. Kaufman\".. .. ios.. how.. read.. offline.. price.. finder.. link.. book.. value](https://www.reddit.com/467nvs),.. [FULL.. BOOK.. \"Lockdown.. by.. Alexander.. Gordon.. Smith\".. .. value.. page.. direct.. link.. sale.. iBooks.. online.. german.. tablet](https://www.reddit.com/467ob9)\n\n&gt; .\n\n&gt; .\n\n&gt; zealot \nby \nreza \naslan \nreviews\nreview \nof \nzealot \nby \nreza \naslan\nVisit \nAmazon.com's \nReza \nAslan \nPage \nand \nshop \nfor \nall \nReza \nAslan \nbooks \nand \nother \nReza \nAslan \nrelated \nproducts \n(DVD \nCDs \nApparel). \nCheck \nout \npictures \nbibliography\nReza \nAslan \nTells \nan \nOld \nStory \nabout \nJesus \n| \nChristianity \nToday\nbook \nreviews \nfor \nzealot \nby \nreza \naslan\nzealot \nby \nreza \naslan \nepub\nReza \nAslan's \nZealot: \nThe \nLife \nand \nTimes \nof \nJesus \nof \nNazareth \nresurrects \nthe \ntheory \nthat \nJesus' \nministry \nand \ndeath \nare \nbest \nexplained \nagainst \nthe \nbackground\nzealot \nreza \naslan \nfox \ninterview\nzealot \nby \nreza \naslan \nbarnes \nand \nnoble\nzealot \nreza \naslan \nny \ntimes\nReza \nAslan \n- \nIMDb\nJewish \nReview \nof \nBooks \n» \nWhat \nJesus \nWasn’t: \nZealot\nzealot \nreza \naslan \nkindle\ncritique \nof \nzealot \nby \nreza \naslan\nDebunking \nthe \ndebunker: \nReza \nAslan's \n'Zealot \n' \nvs. \nthe\nzealot \nby \nreza \naslan \nwikipedia\nWhen \nI \nsaw \nthat \nReza \nAslan’s \nportrait \nof \n“Jesus \nZealot: \nThe \nLife \nand \nTimes \nof \nJesus \nof \nNazareth” \nhad \nrisen \nto \nnumber \none \non \nthe \nNew \nYork \nTimes\nzealot \nby \nreza \naslan \nebook\nthe \nbook \nzealot \nby \nreza \naslan\nzealot \nby \nreza \naslan \nfree \ndownload\nReza \nAslan \nBooks \n- \namazon.com\nReza \nAslan's \nZealot: \nThe \nLife \nand \nTimes \nof \nJesus \nof \nNazareth \nhas \ntaken \noff \nas \na \ncultural \nphenomenon. \nJust \ntwo \nweeks \nafter \nAslan's \ninterview \non \nNPR's \n\"Fresh\nzealot \nby \nreza \naslan\nReza \nAslan \nSelf: \nBhutto. \nReza \nAslan \nwas \nborn \nin \n1972 \nin \nTehran \nIran. \nHe \nis \na \nproducer \nand \nwriter \nknown \nfor \nBhutto \n(2010) \nThe \nThree \nHikers \n(2015) \nand \nZealot: \nThe\nWhen \nFox \nNews' \nLauren \nGreen \nasked \nReza \nAslan \nwhy \nas \na \nMuslim \nhe \nwould \nwrite \na \nbook \nabout \nJesus \nhe \nanswered \nthat \nit \nwas \nhis \njob \nas \nan \nhistorian \nof \nreligions—which\ncatholic \nreview \nof \nzealot \nby \nreza \naslan\nReza \nAslan’s \nnotorious \ninterview \nwith \nLauren \nGreen \non \nFox \nNews \nhas \nmade \nhim \nthe \ntoast \nof \nthe \nliberal \nmedia \nand \nhis \nbook \nZealot: \nThe \nLife \nand \nTimes \nof\nthe \nzealot \nby \nreza \naslan\n5 \nFalsehoods \nin \nReza \nAslan’s \nZealot: \nThe \nLife \nand \nTimes \nof\nzealot \nreza \naslan \ndownload\nzealot \nby \nreza \naslan \nreview\nzealot \nreza \naslan \ninterview\nReza \nAslan \non \nJesus: \nA \nBiblical \nScholar \nResponds\nbook \nreview \nof \nzealot \nby \nreza \naslan\n\n&gt; .", "Permalink": "https://www.reddit.com/by_id/t3_467ot8.json"}, "63": {"Subreddit": "PhD", "Author": "caz-", "Date": 1455714210, "Score": 4, "Body": "Read some PhD theses in your field. The final chapter is usually \"Future Work\". If you can't think of anything yourself, just start on someone else's suggestions. After you start working on it, you will realise their ideas don't really work and you need to modify the methodology significantly to get it to work. Then it becomes your own.\n\nYou're building on the body of scientific literature. You're not pulling a novel idea out of thin air.\n\nHope this helps :)", "Permalink": "https://www.reddit.com/by_id/t3_462kde.json"}, "64": {"Subreddit": "PhD", "Author": "which-phd-program", "Date": 1455717009, "Score": 1, "Body": "Thank you so much and i am really grateful for your nice advice. I will keep in mind and eagerly follow what you have written. In fact this is a response to almost all my concern about PH.D . Could you please give me an idea which program suits best for me based on my academic achievements mentioned on above post. I received some comments stating about International relations, international studies, Political science and anthropology. I am more interested in a program besides other subjects should comprise law as well. ", "Permalink": "https://www.reddit.com/by_id/t3_45x9vt.json"}, "65": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1455737842, "Score": 1, "Body": "It sounds like you just need to take a step back and breathe. Grad school is a long marathon and really a walk in the park. At your stage it might help to connect with a colleague or mentor in this specialization and just talk out your frustrations and ideas. I've always found it helpful to get out of your own head and seek constructive feedback and direction. I sometimes also like reading writing books because it reminds me how to put my ideas into a frame and some of them offer some humor back into a relatively dry aspect of academia. I personally like \"how to write a lot\" to get ideas down on paper (even if they're no good) and then I can think about what's possible or worthwhile later.", "Permalink": "https://www.reddit.com/by_id/t3_462kde.json"}, "66": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1455818611, "Score": 2, "Body": "There are no guarantees about acceptance to any program purely based on scores or experience. In my experience, it also depends on who else is applying your year and how competitively you stack up are in comparison.  Your match with that particular program or to a specific academic mentor could also be really important. I'm biased in terms of my own exposure but I think UMass Boston's clinical program is really good and with checking out.", "Permalink": "https://www.reddit.com/by_id/t3_46f5dd.json"}, "67": {"Subreddit": "PhD", "Author": "schoolpsychms16", "Date": 1455853108, "Score": 2, "Body": "Thank you! I will definitely check out UMass Boston's program. ", "Permalink": "https://www.reddit.com/by_id/t3_46f5dd.json"}, "68": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1455883445, "Score": 2, "Body": "Good luck! :)", "Permalink": "https://www.reddit.com/by_id/t3_46f5dd.json"}, "69": {"Subreddit": "PhD", "Author": "thousandarms", "Date": 1455894631, "Score": 1, "Body": "Perhaps implementing the cornell method and the bullet journal indexing would work out for you.", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "70": {"Subreddit": "PhD", "Author": "erus", "Date": 1455904869, "Score": 4, "Body": "Check [Mendeley](https://www.mendeley.com/). ", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "71": {"Subreddit": "PhD", "Author": "im_in_the_pants", "Date": 1455905236, "Score": 4, "Body": "I use Zotero to store all my sources, then highlight the related pdf like you do. However if you install the addon to Zotero called ZotFile (just google it or pm me), you then have the option to export all the highlighted text in a single note. Then, I just add my notes to that, or divide it into multiple ones to which I apply different tags/colors (I have previously assigned different hotkeys to the tags so really the whole process takes seconds). Then the cool thing is that if you check out Zotero's settings and tick \"index pdfs\" or something like that, you can actually search for anything directly from Zotero's search tool.", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "72": {"Subreddit": "PhD", "Author": "crandell84", "Date": 1455926760, "Score": 1, "Body": "Did not know about Zotfile. Will have to check it out. I just have a Word document that I make notes on, with references to papers. Also have some notes within Zotero. ", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "73": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1455931418, "Score": 2, "Body": "I am beyond frustrated with my dissertation. It is a relief to read and find support through this forum.", "Permalink": "https://www.reddit.com/by_id/t3_456yog.json"}, "74": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1455931458, "Score": 1, "Body": "like Kayak but for search engines? This is a brilliant idea.", "Permalink": "https://www.reddit.com/by_id/t3_43s8jz.json"}, "75": {"Subreddit": "PhD", "Author": "wannabetimberlake", "Date": 1455936214, "Score": 1, "Body": "I'm in the beginning of a PhD program at a well-known university and considering other options at the moment. The thought of being a scientist no longer excites me. This was an interesting read indeed.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "76": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1455945035, "Score": 2, "Body": "I second mendeley", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "77": {"Subreddit": "PhD", "Author": "StalkerShrike", "Date": 1455963267, "Score": 1, "Body": "Mendeley works well, but is owned by one of the nastiest publishers when it comes to open access and knowledge sharing (Reed Elsevier). Zotero works just as well (better on Linux) and is FOSS.", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "78": {"Subreddit": "PhD", "Author": "Alirezag", "Date": 1455994473, "Score": 1, "Body": "&gt;  cornell method\n\nAny good software for that?", "Permalink": "https://www.reddit.com/by_id/t3_46kytk.json"}, "79": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1456088440, "Score": 2, "Body": "I felt the same way. I'm now about 6 months or so from completion. It's definitely a grind and I hate it. But at the end of this I'm tapping out of academia forever.\n\nAs far as microbiology goes - I'm not so sure. Have you looked at marine biology? Is that applicable? There seem to be lots of places that require people in that field.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "80": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1456091801, "Score": 1, "Body": "Thanks for your input. I'm already in a PhD program now, changing fields to more research plus starting over is less than appealing to me at the moment. I'm glad to hear someone could push through :)", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "81": {"Subreddit": "PhD", "Author": "the_petman", "Date": 1456226437, "Score": 5, "Body": "It might not mean much, but from my anecdotal experience, a large fraction of PhD students, including myself have felt this way.\n\n Also, to make this decision you have to understand WHY you are doing a PhD. Why did you choose this path over leaving academia and what is it you want to do with the PhD. \n\nPersonally, I hated, and still hate my PhD in my final year. The work is meaningless, the professor is a bully, and theres no helpful supervision. The reason I am doing it, though, is for the personal achievement. To be able to look back and say \"Hey, I did this thing. It sucked, but I did it and will have that for the rest of my life.\"\n\nThe \"why\" is something you have to decide for yourself, and better sooner than later, so its good you're questioning it now. Whatever you decide on, just be confident in it, and remember why you made that decision. \n\nI might be an extreme example, so it might not be the best advice. I hate going into work every single day, but reminding myself why I'm doing it, and why I made the decision 2 years ago to stay is why I keep coming in.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "82": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1456242444, "Score": 1, "Body": "To start, there is no inherent benefit to having work experience when going for a PhD. It's better to start the PhD as early as possible. Work experience will not help you get accepted, and it will also not be rewarded once you are in the program. (Relevant work experience might help you with gaining perspective, coming up with more nuanced ideas; it might also help you with teaching MBAs if you get a professor job after || On the flipside of that, a lot of older candidates who come in with way too much work experience, often have a hard time disentangling their applied work experience from theoretical constructs, and thus have a hard time with the program and with doing research)\n\nI don't know what the difference is between those 2 masters but you should go for the one that is 1) more theoretical (and less applied) and 2) has more professors that share your common research interests and that you can start doing research with.\n\nI don't know what an MRes is.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_4767jf.json"}, "83": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1456272007, "Score": 1, "Body": "Thanks, great advice.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "84": {"Subreddit": "PhD", "Author": "Janoskino", "Date": 1456328219, "Score": 1, "Body": "Thanks for the reply and perspective.\n\nFor me, there are huge benefits of getting work experience but it's important to note that I never stated it was the case in relation to pursuing a PhD as that's a separate matter. I'll probably stay in Corporate for &lt;5 years if I do go down the PhD route.\n\nMy query is more focused on doing an Masters by Research vs a taught Masters with funding being a concern if I pursue the former.\n\nThanks for your input though.", "Permalink": "https://www.reddit.com/by_id/t3_4767jf.json"}, "85": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1456346913, "Score": 3, "Body": "There is literally no way I would risk using something like this. In fact, it's insulting to the whole idea of a thesis and a PhD in general in my opinion. A thesis is supposed to be the product of a researcher who has discovered something on their own and presented it to their academic community. If English isn't the first language of the author, which I can sympathise with, then proofreading for spelling mistakes etc is the job of the supervisor who took on a non-native speaker in the first place. \n\nPlagiarism can ruin careers, please don't risk it people!\n\nNinja EDIT: changed scientific community to academic because not every PhD candidate is in the sciences.", "Permalink": "https://www.reddit.com/by_id/t3_47bgd3.json"}, "86": {"Subreddit": "DoctorZoidbergPhD", "Author": "[deleted]", "Date": 1456414001, "Score": 1, "Body": "\n# *[BOOK]. READ \"Super Sad True Love Story by Gary Shteyngart\"  get android ios free spanish view price cheap*\n\n\n***\n## █ ► [**READ** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n***\n## █ ► [**ONLINE** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n***\n## █ ► [**DOWNLOAD** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n\n. \n\n***\n## █ ► [**READ** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n***\n## █ ► [**ONLINE** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n***\n## █ ► [**DOWNLOAD** ***Super Sad True Love Story by Gary Shteyngart***](https://karelialia.karelia.su/60bY?source=reddit2&amp;keyword=Super%20Sad%20True%20Love%20Story%20by%20Gary%20Shteyngart)\n***\n\n&gt; . \n\n&gt;  Description book **Super Sad True Love Story by Gary Shteyngart**:\n\n&gt;  The author of two critically acclaimed novels, The Russian Debutante’s Handbook and Absurdistan, Gary Shteyngart has risen to the top of the fiction world. Now, in his hilarious and heartfelt new novel, he envisions a deliciously dark tale of America’s dysfunctional coming years—and the timeless and tender feelings that just might bring us back from the brink.In a very near future—oh, let’s say next Tuesday—a functionally illiterate America is about to collapse. But don’t that tell that to poor Lenny Abramov, the thirty-nine-year-old son of an angry Russian immigrant janitor, proud author of what may well be the world’s last diary, and less-proud owner of a bald spot shaped like the great state of Ohio. Despite his job at an outfit called Post-Human Services, which attempts to provide immortality for its super-rich clientele, death is clearly stalking this cholesterol-rich morsel of a man. And why shouldn’t it? Lenny’s from a different century—he totally loves books (or “printed, bound media artifacts,” as they’re now known), even though most of his peers find them smelly and annoying. But even more than books, Lenny loves Eunice Park, an impossibly cute and impossibly cruel twenty-four-year-old Korean American woman who just graduated from Elderbird College with a major in Images and a minor in Assertiveness.After meeting Lenny on an extended Roman holiday, blistering Eunice puts that Assertiveness minor to work, teaching our “ancient dork” effective new ways to brush his teeth and making him buy a cottony nonflammable wardrobe. But America proves less flame-resistant than Lenny’s new threads. The country is crushed by a credit crisis, riots break out in New York’s Central Park, the city’s streets are lined with National Guard tanks on every corner, the dollar is so over, and our patient Chinese creditors may just be ready to foreclose on the whole mess. Undeterred, Lenny vows to love both Eunice and his homeland. He’s going to convince his fickle new love that in a time without standards or stability, in a world where single people can determine a dating prospect’s “hotness” and “sustainability” with the click of a button, in a society where the privileged may live forever but the unfortunate will die all too soon, there is still value in being a real human being.Wildly funny, rich, and humane, Super Sad True Love Story is a knockout novel by a young master, a book in which falling in love just may redeem a planet falling apart. \n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; . \n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; [[BOOK]... FREE.. \"Beyond.. the.. Grave.. by.. Jude.. Watson\".. .. wiki.. page.. value.. without.. registering.. download.. pdf.. epub](https://www.reddit.com/47jd0k),.. [[BOOK]... DOWNLOAD.. \"Flash.. Boys.. by.. Michael.. Lewis\".. .. german.. amazon.. flibusta.. italian.. shop.. review](https://www.reddit.com/47jd2j),.. [[BOOK]... FREE.. \"Black.. Bird,.. Vol... 01.. by.. Kanoko.. Sakurakouji\".. .. torrent.. sale.. how.. download.. cheap.. without.. signing.. pc.. flibusta.. pdf](https://www.reddit.com/47jd1f),.. [[BOOK]... READ.. \"Everything.. Leads.. to.. You.. by.. Nina.. LaCour\".. .. online.. sale.. amazon.. flibusta.. how.. read.. ebook](https://www.reddit.com/47jd0s)\n\n&gt; .\n\n&gt; .\n\n&gt; Read \nSuper \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart \nVarious \nNarrators \nand \nAdam \nGrupper \nby \nGary \nShteyngart \nVarious \nNarrators \nAdam \nGrupper \nAli \nAhn \nfor \nfree \nwith \na \n30\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart\ngary \nshteyngart \nsuper \nsad \ntrue \nlove \nstory \ntrailer\nSuper \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart \n- \nbook \nreview\nGary \nShteyngart's \n\"Super \nSad \nTrue \nLove \nStory\" \nreviewed \nby\nREAD \nBOOK \n\"Super \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart\nSuper \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart \nVarious\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \nbook \nreview\nsuper \nsad \ntrue \nlove \nstory \ngary \nshteyngart \npdf \ndownload\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \nreview\nSUPER \nSAD \nTRUE \nLOVE \nSTORY. \nby \nShteyngart \nGary. \nRandom\nsuper \nsad \ntrue \nlove \nstory. \na \nnew \nyork \ntimes \nnotable \nbook. \nselected \none \nof \n10 \nbest \nbooks \nof \nthe \nyear \nby \nmichiko \nkakutani \nthe \nnew \nyork \ntimes. \nnamed \none \nof \nthe \nbest\nGary \nShteyngart \n- \nWikipedia \nthe \nfree \nencyclopedia\nSuper \nSad \nTrue \nLove \nStory \nGary \nShteyngart \nGranta \npaperback \n12.99 \nreview \nby \nPatrick \nHudson \nUp \nuntil \napproximately \n1977 \nthere \nwas \na \nhealthy \ntradition \nof \nfantasy \nand \nSF\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \nwiki\nSuper \nSad \nTrue \nLove \nStory \nAmazon.co.uk \nGary \nShteyngart\nFICTION \nGary \nShteyngart's \n\"Super \nSad \nTrue \nLove \nStory\" \nreviewed \nby \nRon \nCharles\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \nfree \ndownload\nREAD \nBOOK \n\"Super \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart\" \nmp3 \npage \nfrançais \nhow \nto \nhow \nread \nebay \ntablet \naudio\nGary \nShteyngart \nwas \nborn \nin \nLeningrad \nin \n1972 \nand \ncame \nto \nthe \nUnited \nStates \nseven \nyears \nlater. \nHis \ndebut \nnovel \nThe \nRussian \nDebutante’s \nHandbook \nwon \nthe \nStephen\nBuy \nSuper \nSad \nTrue \nLove \nStory \nby \nGary \nShteyngart \nand \n\"Super \nSad\" \nreflects \nhis \n\"Super \nSad \nTrue \nLove \nStory\" \ncrackles \nwith \nmuch \nof \nthe \nsame \nhigh \npowered\nGary \nShteyngart's \nSuper \nSad \nTrue \nLove \nStory\nGary \nShteyngart \nat \nthe \nLos \nAngeles \nTimes \nFestival \nof \nBooks. \nBorn \n(2006) \nand \nSuper \nSad \nTrue \nLove \nStory \n(2010). \nHis \nother \nwriting \nhas \nappeared \nin \nThe \nNew \nYorker\nGary \nShteyngart’s \nlatest \nnovel \nSuper \nSad \nTrue \nLove \nStory \nsignals \nhis \nmove \nout \nof \nSoviet \nterritory \nand \ninto \na \nnear-future \nNew \nYork \nCity \nwhere \nbooks \nhave \nno \nplace\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \nepub\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \npdf\ngary \nshteyngart \nsuper \nsad \ntrue \nlove \nstory \ndeutsch\nAbout \nGary \n| \nSuper \nSad \nTrue \nLove \nStory\nAbeBooks \nSUPER \nSAD \nTRUE \nLOVE \nSTORY. \nSigned \nby \nGary \nShteyngart. \nWhite \nwraps \n334 \npages. \nThis \nbook \nis \nin \nexcellent \ncondition \nlightly \nbumped \nalong \ntop \nedge \nof\ngaryshteyngart \nSUPER \nSAD \nTRUE \nLOVE \nSTORY\nsuper \nsad \ntrue \nlove \nstory \nby \ngary \nshteyngart \ninterview\n\n&gt; .", "Permalink": "https://www.reddit.com/by_id/t3_47jdan.json"}, "87": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1456428948, "Score": 1, "Body": "googlescholar", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "88": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": 1456433502, "Score": 1, "Body": "Try talking with the subject librarian at your university. It also helps if you can take seminar courses outside your major-- I added a whole new dimension to my thesis by taking phd seminar classes in the liberal arts (I'm in engineering)", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "89": {"Subreddit": "PhD", "Author": "RedPotato", "Date": 1456434015, "Score": 1, "Body": "I feel like that's very needle in a haystack - its what I've been doing and its just endlessly reading things until I realized they weren't exactly what I wanted.  ", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "90": {"Subreddit": "PhD", "Author": "RedPotato", "Date": 1456434068, "Score": 1, "Body": "Hm, yeah - I should do that.  I can take a week long seminar in the summer, since I'm part time distance so I'll try to pursue that.  Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "91": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1456450797, "Score": 1, "Body": "Does your university subscribe to scholarly databases? Ask one of the reference librarians about the databases your university has available to you. They are much more specialized than Google scholar so you can avoid that needle in a haystack feeling and you can search peer-reviewed journals in just about every discipline depending on which subscriptions your school has.", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "92": {"Subreddit": "PhD", "Author": "flamboyanza", "Date": 1456456114, "Score": 1, "Body": "Catch hold of a journal in your work and do reference hopping. It usually works. ", "Permalink": "https://www.reddit.com/by_id/t3_47h4wn.json"}, "93": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1456474395, "Score": 2, "Body": "&gt; Its a whole lot of work for nothing IMO (as in high stress, long hours, low pay, for something that may help something in the future possibly)\n\nWhat are your alternatives? This describes a lot of people's lives who are working in crappy jobs that aren't any more meaningful. So, if you are giving up a great opportunity elsewhere to do the PhD, you'll have to seriously weigh up whether it's worth the sacrifice. But if the alternative is low pay, high stress, long hours and no PhD at the end of it, you're probably in the best position right now!", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}, "94": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1456503015, "Score": 1, "Body": "go kick some referees' ass", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "95": {"Subreddit": "PhD", "Author": "blufox", "Date": 1456542682, "Score": 1, "Body": "I don't know about U.K but in U.S universities, you will have other options such as T.A or R.A from other departments, sometimes in the middle of the year. It helps if you are in the campus. Get in touch with other students and enquire whether getting funding in the next quarter is possible.", "Permalink": "https://www.reddit.com/by_id/t3_47om90.json"}, "96": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": 1456653329, "Score": 1, "Body": "Second year PhD Nanosciences here. I always thought working late nights every day even on weekends is such a grad thing to do. I have now started to wonder if it isn't as common as I think. I don't have any advice for you but I wish you all the best! ", "Permalink": "https://www.reddit.com/by_id/t3_47z3tf.json"}, "97": {"Subreddit": "PhD", "Author": "Lattice_Bowel_Mvmnts", "Date": 1456698290, "Score": 1, "Body": "Your story is very much like mine.  I worked in industry with my MS specialty for 3 years before realizing the problems became too easy, and that this is about the highest level job I'm going to get with the MS.  \n\nMy first step was to research schools for what kind of program they have, what their researchers focus on, and what are the reviews of these researchers.  When I found the best one for me with the research I was excited about, I wrote an email to my future adviser along with a brief summary of my qualifications, relation to work experience, and goals.  He was helpful and said apply and he would stay in the mix.  That was about it really.  Pursued the application per instructions.  My references were respectable PhD's in their fields, but not household names.  One was from my MS, the other a work colleague in a different but related field.  Really no way around the formal application process, so that is your starting point.  And I know you probably have some anxiety about being out so long, not having big name references, etc... but you won't know until you apply formally.", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "98": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1456746288, "Score": 1, "Body": " You have identified the chief problem that you face. If your grades were not stellar then your letters of recommendation will not be stellar. And now there is pretty much an arms race in how pumped up a letter of recommendation can be. In order to be admitted to a truly top PhD program -- which is what you want -- you really have to have a terrific record of some kind. \n\nLow grades, tepid letters will not help. What were your scores on grad school tests -- In USA the GRE?\n\nThat would be one strategy. Get stellar scores.", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "99": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1456776247, "Score": 1, "Body": "I went back to graduate school at 30 after an 8-year hiatus.  My undergraduate degree was in computer engineering, but I had always regretted not studying my true passion - geoscience.  I knew, like you, that it would be very difficult to get into a respected program with such a large gap in my academic studies...and applying for a program unrelated to my undergraduate degree.  My approach was multifaceted.\n\nFirst, I began taking as many classes as I could at local community colleges in geology and geophysics to establish a refreshed base of the geosciences.  (I did take a few geology courses as an undergrad, but like I said, 8 years prior). I also retook some differential equations courses to refresh those skills as well.  I did this for about a year, and then studied like mad for the GRE.  I actually had a killer GRE score from my undergrad days, but it had expired!  Doh!.  I studied and took practice exams for a solid 3 weeks and ended up doing very well on the exam.  This definitely helped my case.  Lastly, I was very proactive about contacting potential future advisors.  I tried to expression my passion an avidity for the discipline I wanted to study, and that though various life experiences I came to realize what my passions were.  I talked a lot about how my current situation felt very much like a \"dilbert\" job, sitting in a cubicle, and I longed to do field work in the sciences.  In the end, I had very positive interactions with many universities, but only applied to 3 (I was only applying for a masters at the time).  Even with all this said, and with a lot of luck...I was still only accepted at one school (which thankfully happened to be my first choice of the three).  I was worried about my recommendations as well, and ended up using one of the professors from the community college, a co-worker (who could speak to my work ethic), and my current boss (At the time, I told him I was applying to an on-line program at the university, and not a full-time one).  I remember when I met with the graduate chair, I asked her what was it about my application that got me accepted?  This was a very-respected program that had over 300 applicants, and only accepted 20.  She told me, \"I was very moved by your personal statement essay on your application\".  Seriously.  It helps to write a well-thought-out personal statement.\n\nAfter being accepted, I figured the MS would be a good litmus test to see if I was PhD material.  After 2.5 years and a Masters working with my fantastic advisor, I asked if I could stay on to do a PhD and he approved it.  In all, it took me almost 8 years to get through it all and I didn't actually start my post-doc until I was 38 years old.  It's been a very long road, but I am SO glad I took it.  I've spent over 2 years of those 8 doing field work and lab work.  It has been so worth it.  Hope that helps\n", "Permalink": "https://www.reddit.com/by_id/t3_484kek.json"}, "100": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1456778003, "Score": 1, "Body": "I wrote a response to a similar posting a few months ago that basically sums up my thoughts (although this posting was more related to getting through motivational slumps). In your case, it may be more of figuring out just what your passion is.  Are you still passionate about the work you're doing if there was no timeline, and you got to just play in the lab doing the research. Here was my comment:\n************\nI would add a couple of motivational things... I just finished up late last year and walked in May. I went through all of the same stages and emotional slumps described here...especially the imposter syndrome. Despite obvious progress I was making in the lab, and in discussions with my advisor or committee, I wasn't publishing so felt like nothing was actually getting done. (My university requires 3 publishable chapters...although at least 4 is recommended, but they don't have to be published to graduate). Anyhoo. After finishing my Candidacy and Comprehensive exams, I no longer had any palpable milestones to shoot for other than graduation. I was another ABD, and defending seemed so far away. Don't despair though...There were two things that did it for me:\nI went to a graduation and watched my girlfriend (wife now) walk and be addressed as \"Doctor\" for the first time about a year before my defense. I was obviously super happy for her, but I also sat there almost in tears. I knew where I was with my work and watching her walk was an incredible motivator. I sat there and told myself, \"I want that\", I want to be walking across that stage just like her. I want to be called Doctor\". Later that night I recorded a video on my phone of myself saying something like \"you saw her walk today, and you know how bad you want that. Stop fucking around, and get your damn work done\". I watched that video anytime I was slacking off or procrastinating. It worked surprisingly well.\nThe second thing that did it for me was actually setting my defense date. As soon as my committee agreed on a date (about 3 and half months out), it was if I went into robot mode. I had a necessary milestone, a date. For three months I barely slept, I wrote like a muthafucka, and I sent drafts back and forth with my advisor incessantly. I survived on ramen, coffee, and fruit loops, but I made it happen. Nothing else mattered for those three months and I thankfully had a very understanding partner (who knew exactly what I was going through...from personal experience). The final few months leading up to your defense will absolutely suck. There is no other way to say it. BUT....BUT....when you have that robe on and you walk across that stage....nothing feels like it in the world. Nothing.\nI forgot to add, as far as \"losing that part of you\", don't worry to much about that. You'll always have the memories and the experience, and something will get settled post graduation. Whether it be a post-doc, or industry job, or tenure track faculty position, you'll figure something out and you'll be surprised at how excited you are about starting the next chapter.", "Permalink": "https://www.reddit.com/by_id/t3_46vvok.json"}}