{"0": {"Subreddit": "PhD", "Author": "EarendiI", "Date": 1448988905, "Score": 1, "Body": "You're very welcome! :D", "Permalink": "https://www.reddit.com/by_id/t3_3gcptr.json"}, "1": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": 1448991177, "Score": 1, "Body": "Sorry for the long delay in replying. I went to California to see my gf for Thanksgiving, and I did my best to do nothing but spend time with her. When I went back to school, my goal was to get the PhD to be a professor, but with that in question, I honestly don't know what I'd do with it outside of academia. Having it probably wouldn't help much, if any, if I went back to my old field of work. \n\nMy gf and I are both committed to the relationship and have talked about marriage down the road once we are financially stable and in the same place again, so that's about the only thing I'm not worrying about, hahahaha. \n\nI know some of my issue with leaving is dealing with accepting the sunken cost of several years, but yes, the finding a job issue looms large as well. And I do worry that if I move to California and the relationship doesn't work out for some reason, I'm doubly screwed because I probably wouldn't choose to live where she does if she weren't there.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "2": {"Subreddit": "PhD", "Author": "divB_is_zero", "Date": 1448994387, "Score": 2, "Body": "What's his field and what is he planning on doing now? Also, your budget is important here, I suppose.", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "3": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1448998483, "Score": 6, "Body": "Nice massage and backrub, and spending a weekend together somewhere remote. (Don't matter where, just a nice ish hotel and you guys don't have to even leave the room for the weekend )", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "4": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1448999914, "Score": 10, "Body": "I did an informal survey of some of the more senior academics at my institution, and they almost unanimously recommended that you suck him off for at least 10 minutes. ", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "5": {"Subreddit": "PhD", "Author": "im_in_the_pants", "Date": 1449008222, "Score": 2, "Body": "A pen, as a sign of academic recognition like in A Beautiful Mind!", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "6": {"Subreddit": "PhD", "Author": "Beammeupsnotty", "Date": 1449009499, "Score": 2, "Body": "What's your budget?", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "7": {"Subreddit": "PhD", "Author": "calikilla", "Date": 1449018193, "Score": 1, "Body": "I've never been in this situation specifically, but all colleges have a way of managing situations like this. The details of which are easiest to find in a syllabus from a class you took. They will usually guide you to a certain department within the institution, or the long-form academic code of conduct will guide you there. I would speak with that department before you decide on a course of action as they will probably have the best advice to offer, the course of action differs at each institution, but when teachers post that in their syllabi it is binding in both directions. It prevents situations like this, and unfair forms of administering grades. This is why professors make sure the entire class is OK with curving before they do it even if it benefits everyone. I'm sorry I can't be of more help, but I would develop a strategy before you say anything. It will be an uphill battle once the advisor knows that you are trying to do something about it.", "Permalink": "https://www.reddit.com/by_id/t3_3ujuaj.json"}, "8": {"Subreddit": "PhD", "Author": "tigertigerduckduck", "Date": 1449025689, "Score": 3, "Body": "Don't use it for official documents if you want to work or live overseas. You will often have to provide the notarized degree to get the title recorded. Or someone might assume it's part of your name, rather than a title, and make your life really difficult (like when you're married, or when your name now conflicts with other official documents). In Asian countries your name may be too long for their IT systems and it may get cut off, causing you more trouble.\n\nSo put it: domestic IDs (diver's license, etc), resume, biz cards. Don't put it in passports, flight tickets, other government issued documents.", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "9": {"Subreddit": "PhD", "Author": "thejasmo", "Date": 1449053503, "Score": 2, "Body": "My family once read that PhDs in Finland and Sweden get a top hat and sword upon graduation (https://en.m.wikipedia.org/wiki/Doctoral_hat). They've since promised me a top hat and sword, and the thought amuses me enough to keep me motivated on even my most stressful days. So, maybe a top hat and sword?", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "10": {"Subreddit": "PhD", "Author": "amadeus_x", "Date": 1449063582, "Score": 2, "Body": "While trying to sing the conclusions of his thesis to make it special.", "Permalink": "https://www.reddit.com/by_id/t3_3v0mhu.json"}, "11": {"Subreddit": "PhD", "Author": "tigertigerduckduck", "Date": 1449107046, "Score": 1, "Body": "show some self reflection and appear as a well rounded and mature person; If you worked on a thesis in the past, with a supervisor, this could be a good thing to write about.\nCritically evaluate your own past work in a honest and analytical way, and draw conclusions from it to show that you've learned something. After all, that's the academic way - discuss the pro's and cons and draw a conclusion - ideally a positive one that supports your application ;) Good luck!\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3ri778.json"}, "12": {"Subreddit": "PhD", "Author": "divB_is_zero", "Date": 1449386364, "Score": 5, "Body": "This is really difficult to answer, even if we had enough information, which you certainly haven't provided. Admissions are a strange thing that seem to be dependent on undergrad grades, research, publications, GRE scores, recommendations, etc. Each school thinks of these differently, and they want to see how your experiences will fit their program. Does this school do the type of research you've been doing, or want to do? Have you been in contact with any of the professors there? Are your references close with anyone there? Even if we had this information it would be very difficult to say, but given you told us nothing really, it is impossible. ", "Permalink": "https://www.reddit.com/by_id/t3_3vmmf9.json"}, "13": {"Subreddit": "PhD", "Author": "jethroguardian", "Date": 1449386809, "Score": 2, "Body": "Don't count on one particular school. Apply to lots.", "Permalink": "https://www.reddit.com/by_id/t3_3vmmf9.json"}, "14": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": 1449458236, "Score": 1, "Body": "I think this will depend on the school's policies. Is there a graduate department you can call (potentially more anonymous than email) and ask what happens in your type of situation? ", "Permalink": "https://www.reddit.com/by_id/t3_3vqo1q.json"}, "15": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": 1449458368, "Score": 1, "Body": "Haha, yes! When a Starbucks barrista asks my name for a drink \"oh, it's Dr.phddumbdumb\" ", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "16": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1449465292, "Score": 2, "Body": "I don't have an answer, but I wish you good luck man. I have faced some dark times where I have questioned whether this journey has been worth all the pain I have had to endure. I hope you get a chance to complete your PhD", "Permalink": "https://www.reddit.com/by_id/t3_3vqo1q.json"}, "17": {"Subreddit": "PhD", "Author": "Pfungen", "Date": 1449475432, "Score": 1, "Body": "Never ever go unfunded. I study at a top tier university in the US. For obvious reasons, I wouldn't name the school. But I guarantee you it's some school that makes headlines from time to time. Some professors here just put too much emphasis on research and don't pay their students. They'd rather spend every single dime on their research than covering students. The students are treated as slaves. Many of them quit after a year or two. But those professors usually get a handful of freshmen each year, and so they can afford the loss. After all, at least some students would be like oh I've spent too much time and fortune on my degree to simply quit at this point. Sad stories. I've witnessed too much. Sorry to discourage you. But doing PhD unfunded turns you into an easy target for being exploited. ", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "18": {"Subreddit": "PhD", "Author": "caz-", "Date": 1449484343, "Score": 2, "Body": "You're certainly not alone. A huge percentage of people have anxiety about public speaking. In fact, I would argue that *most* people have a fairly high level of anxiety about it until they are used to it.\n\nThe fact is, if you want to do anything worthwhile in your life, you are going to have to talk to groups of people about it at some stage.\n\nYou just have to decide whether what you want is important enough to deal with that. You aren't going to 'fail' because you gave a bad talk, but you *do* fail if you never pursue the PhD because you are afraid. The fact is that you will be working on your PhD for years, and over that time you will be talking in front of a crowd for maybe about an hour, combined. You have to decide whether it is worth it to you to try to overcome your fear.\n\nYou also talk about losing your train of thought and not making sense. Do you think you could stand in front of a crowd and recite the alphabet? Because that's how well you will know your topic by the end of it. It doesn't matter if you are blinking nervously, staring at the floor, going bright red, etc., as long as you achieve the milestones of talking about your topic in front of a group.\n", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "19": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1449497887, "Score": 5, "Body": "You are suffering from a disease called PhD-itis.  And there is only one cure. Graduate.\n\nAlso see - https://en.wikipedia.org/wiki/Impostor_syndrome.  You are not alone - believe me. \nEdit - Forgot the pep talk - I went through the same thing but finished this past spring.  And be forewarned, even after you finish, for a few months anyways, you will still wake up thinking \" I need another chapter!\".  Know your pain but see boxofdice's comment.  You're going to finish.    ", "Permalink": "https://www.reddit.com/by_id/t3_3vrvcz.json"}, "20": {"Subreddit": "PhD", "Author": "boxofdice", "Date": 1449506639, "Score": 3, "Body": "I'm doing this as my full time job, and I'm still having all the same feelings as you. You're not alone at all. I'm in my 6th year as well.\n\nI don't post a lot but I just had to say something because I've been struggling myself- we're going to finish. We just have to get through to the other side. It's not going to be perfect and it may not be what we expected and hoped, but you know what, it's still an achievement.\n\nMost people don't understand the mental and emotional stress that we're going through. And I get that. I wouldn't have believed it either at the beginning. \n\nJust get through. Finish. Do whatever it takes. The post-PhD world is scary (to me, anyway), but there's no other choice. We have to push forward. I really believe that we'll only gain the perspective on what it meant to us after the fact.\n\nOne last thing. **You are not defined by your PhD.** You are a whole person. It is a part of you, for sure, and it always will be. But  there's a lot left for you to give, and to experience, after this thing is over.", "Permalink": "https://www.reddit.com/by_id/t3_3vrvcz.json"}, "21": {"Subreddit": "PhD", "Author": "AlmightyMexijew", "Date": 1449528757, "Score": 2, "Body": "[זה](https://www.youtube.com/watch?v=PQp2a_yunmM)", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "22": {"Subreddit": "PhD", "Author": "cluidc", "Date": 1449532240, "Score": 1, "Body": " Seeing your username confused me so much! I was like \"huh, I didn't post in r/Judaism\". I feel like when you see someone from work at the supermarket lolol \n\nThanks though :)  A nice coincidence and very encouraging! I think I might be underestimating my support system. \n\nEdit for the confused: it's a song about how everything will be ok  ", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "23": {"Subreddit": "PhD", "Author": "ForgottenPotato", "Date": 1449550044, "Score": 1, "Body": "Yeah, you're right. I'm going to have to give presentations in almost anything I choose to do and it shouldn't stop me. Thanks caz. Really appreciate it ", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "24": {"Subreddit": "PhD", "Author": "caz-", "Date": 1449550214, "Score": 1, "Body": "No problem. Whatever you decide to do, I wish you the best of luck :)", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "25": {"Subreddit": "PhD", "Author": "AlmightyMexijew", "Date": 1449564681, "Score": 1, "Body": "Haaaaaa...I know the feeling\n\nTruth is, I have you friended because of past conversations there.  I saw your post and wanted to give support.", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "26": {"Subreddit": "PhD", "Author": "cluidc", "Date": 1449568632, "Score": 1, "Body": "Ahh makes more sense! Well, thank you :) ", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "27": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1449580376, "Score": 1, "Body": "Your anxiety will get a lot worse during your PhD. Many people lead great lives without a PhD or entering into academia. There's no shame in not doing a PhD!\n\nIf you don't think you can handle feeling this way for the next few years - maybe rethink the PhD. There will be many times during your PhD where you will seriously regret ever enrolling into it. It's really important to power through those times and keep working regardless of how you feel. If you can't do that - you'll be fine.", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "28": {"Subreddit": "PhD", "Author": "cluidc", "Date": 1449597494, "Score": 1, "Body": "Thank you, lots to think about! ", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "29": {"Subreddit": "PhD", "Author": "samshady64", "Date": 1449615611, "Score": 1, "Body": "I switched labs during my PhD (acquired this past summer) and found an awesome mentor as a result.  I was in a little different situation though as I was already admitted to candidacy.  I found no help among my department and ultimately went to the dean of graduate studies.  My suggestion would be to setup a meeting asap and detail your issue to your dean of grad studies.  They don't become dean because they kiss ass like the dean of the pharmacy school or the med school.  They are there because they are good with students!  ", "Permalink": "https://www.reddit.com/by_id/t3_3vyni7.json"}, "30": {"Subreddit": "PhD", "Author": "almostphd", "Date": 1449627670, "Score": 2, "Body": "I agree with the other two commenters that graduate is the only cure. I was in the same boat as you until last month: been in my program for 6+ years and feeling that I have accomplished so little while everyone else has graduated and moved on. But things changed after I managed to set a date for my defense. Now that I can see the \"exit\", I work more efficiently and am actually looking forward to the next stage of my life (enough with counting cells/overexposed blots/PCR with no band already!). Sure, getting a PhD is a BIG accomplishment, but to me, it is merely a training to prep you for the real world. Finish it by all means!!", "Permalink": "https://www.reddit.com/by_id/t3_3vrvcz.json"}, "31": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1449633581, "Score": 7, "Body": "Life as a PhD also sucks, but in different ways.  \n  \nIt's a tremendous time investment with very little pay (or even potentially a large tuition cost) relative to industry. You'll work on a very narrow field of inquiry that will hopefully start out being very interesting to you and may eventually become boring or even feel like a waste of time. It will be a tremendous amount of effort over several years of your life. Your social life and relationships may very likely suffer, as may your mental health, because you will putting in much longer hours than an equivalent industry position, working in a narrow knowledge domain, and getting very little immediate reward. Getting a PhD isn't about being the smartest person, or the best student, but rather about caring so much about a field of inquiry that you will not give up until you've put forth the effort required of a PhD. From a monetary and social point of view it is almost guaranteed to be a bad decision; but if you want to do detailed research for a living on something you really care about, it's worth it.  \n  \nAs a caveat, I'm not sure if this applies to management or economics PhDs as much as it does to those in science and engineering.", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "32": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1449649655, "Score": 1, "Body": "&gt; show that even though my grades may have been 'meh', I fought hard for my achievements and I don't truly believe I wasn't capable of being that 4.0 student or of a 700 GMAT score if I really focused and tried hard\n\nDon't rely on this being particularly relevant in your applications.  They aren't going to hire you based on what you say you could have done had your circumstances been better, they'll hire you based on what you can actually prove that you can do.  So kick ass on the GMAT, and prepare to make a strong case about how your work experience qualifies you to be there.  \n\nThe 3 jobs in 12 months thing might be a bit difficult.  Switching jobs that often may have been perfectly reasonable for your circumstances, but I guess it'll raise red flags to a prof looking at your application.  You could mitigate this by showing that you have a really solid grasp of what doing a PhD in your field is like, so they don't think you'll just bolt after a few months.  Maybe you can find some current/recent PhD students in your field of focus and \"interview\" them about what they do day-to-day, what it's like, what their classmates are saying about their experiences, etc, and then bring that up if the job thing is mentioned.  (This is a good thing to do anyways, so you don't waste your own time doing something that doesn't suit you.)\n\nAs for being cut out for a PhD - a PhD doesn't require genius.  It requires decent intelligence but mostly a strong work ethic, initiative and motivation, good planning and communication skills, and the ability to self-direct your research over several years.  Grades/GMAT scores get you in, but they don't get you out.  Evaluate yourself accordingly.", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "33": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1449672068, "Score": 2, "Body": "The question you need to ask yourself is what do you want to do with a phd? If you want to get into academia or top consultancy you'll need it, but those are pretty much the only jobs where this is a requirement. The rest is achievable, you might not get into a top program but if you work hard you'll find a phd position. Grad school is not about brains or grades, is about consistency, resilience and ability to work independently IMO. \n\nYou need to figure out if a phd will help you get the sort of jobs you want to get and if you are really okay with being \"poor\" for 4 years or more while working on the same topic. And I would really stress the same topic part, changing jobs 3 times in a year could raise a red flag in an application. If the answer to any of that is not, then don't do it you'll just waste your time. If you are really okay with all the downsides then grad school might be really fun working on the right topic with the right advisor, at least I enjoy it. ", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "34": {"Subreddit": "PhD", "Author": "odway", "Date": 1449677397, "Score": 1, "Body": "Thank you for the comments (esp boxofdice); helps to know I am not alone, and also not the only one at it for this long. I actually pulled myself off facebook recently because I was getting so disheartened seeing my friends (many of whom started before me) submit and graduate. Of course I am happy for them, but at the same time that inadequacy creeps in and has a habit of settling there (and then I stall even more). I actually pushed myself yesterday to submit my extended thesis abstract, which straight away got sent to my potential examiners... so it's slowly getting real. I hope with that sent off maybe the \"exit\" almostphd was talking about will spur me into action too. I can definitely say that this PhD experience was nothing like I thought it would be: I didn't think it would make me this raw. I don't regret it, but I also didn't expect it to take me to the places it did emotionally either. One would think this close to the finish line I'd be running there happy and merry, rather than dragging my feet and questioning everything. But I guess as long as I get there it doesn't matter. Thank for the peptalks", "Permalink": "https://www.reddit.com/by_id/t3_3vrvcz.json"}, "35": {"Subreddit": "PhD", "Author": "Webby911", "Date": 1449682736, "Score": 2, "Body": "530 is still bad without any practice though... like if you were 700+ capable you would've gotten at least a 600+ with little to no practice.", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "36": {"Subreddit": "PhD", "Author": "RBellani", "Date": 1449682765, "Score": 1, "Body": "0) Decide what you want the outcome of this situation to be (Do you, for example, care to get public credit for this? Can you not right now put it on your CV that you won this award?). If you just want justice for justice's sake, then drop it until you are far away with tenure somewhere or with a job. Don't start massive fires for some small argument - at the end of the day, its one grant, not a special award that has opportunity-changing impact (e.g. K-award, HHMI young investigator award) and the award is 300K - not a huge $5M grant. It's an F'ed up situation, but maybe it's a take it on the chin moment.\n\nRegardless, I'd do steps 1 and 2 below, but consider carefully step 0 before moving on to 3 and beyond.\n1) Collect all of the proof\n2) Speak to your professor about it like an adult (except record the convo on your phone)\n3) If fixed, good for you. If not, and you need it rectified, go to department head. If you pre is super influential there or was former dept head, go to the next level (e.g. school of life science head) and do NOT accuse or threaten, just lay out the facts and ask for advice. Listen carefully to how they position their response to see if they are more on your side, understand your wrongs, etc.\n4) Collect letters of rec from other professors so you have those locked up\n5) Adjust and plod on!\n\nSorry this happened! :/ \nGL!!!", "Permalink": "https://www.reddit.com/by_id/t3_3ujuaj.json"}, "37": {"Subreddit": "PhD", "Author": "xithy", "Date": 1449683096, "Score": 1, "Body": "&gt; As a caveat, I'm not sure if this applies to management or economics PhDs as much as it does to those in science and engineering.\n\nIt does. ", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "38": {"Subreddit": "PhD", "Author": "ZeroPhd", "Date": 1449731421, "Score": 1, "Body": "I do that all the time. What I've learned about me is that \"procrastination\" is part of my process, and I don't beat myself up about it anymore. The truth is, I write when I'm ready. I do my thinking off the screen. Some people use writing as a way to get to their thoughts; I finally accepted that I do not. I write when I know what I want to say, for the most part. This means that I tend to write in long sessions over a few days. I'm ABD, so it's been working so far. ", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "39": {"Subreddit": "PhD", "Author": "DDconKiwi", "Date": 1449779010, "Score": 1, "Body": "I'd like to echo this. 100% this. \n\nWhen considering getting a PhD, it's about the long game. You'll be delaying gratification while you get your PhD- low pay, shitty hours, mental and physical health stresses, etc. But the real question is whether you think future you would 1. regret not doing it or 2. absolutely need it to follow through on your real interests, passions, and goals. ", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "40": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1449802405, "Score": 1, "Body": "Life as a PhD student is hard, stressful and financially challenging -- though in most reputable PhD programs you are paid to take the program. It also depends on what field you pursue. Check out many back issues of the Chronicle of Higher Education and the forums on the website. Some fields, like History, are in serious decline in available tenure-track positions.  In others like finance or my field of mass communication job prospects are excellent.\n\nI think the most important question you have to ask is what exactly do you want to have happen after you get a PhD?", "Permalink": "https://www.reddit.com/by_id/t3_3vzz2o.json"}, "41": {"Subreddit": "PhD", "Author": "abloblololo", "Date": 1449855381, "Score": 3, "Body": "Like with everything else you need to word it in a way that emphasizes your strengths and de-emphasizes your weaknesses. So don't excuse your bad grades, instead talk about how you got good grades when you found what you wanted to study. If you have two masters that probably counts for a lot. Also, research is quite different from studying and in my experience (which isn't in the US tbf) any research work you've done weighs heavier than grades. Write good letters, make a strong impression, show up well prepared. Everyone has weaknesses that makes them anxious, but instead of worrying about it (which does nothing) channel that into  focusing on doing your best.", "Permalink": "https://www.reddit.com/by_id/t3_3weec3.json"}, "42": {"Subreddit": "PhD", "Author": "daldrys", "Date": 1449879223, "Score": 1, "Body": "Why would you like a PhD ?", "Permalink": "https://www.reddit.com/by_id/t3_3weec3.json"}, "43": {"Subreddit": "PhD", "Author": "Joy_Addiction", "Date": 1449882055, "Score": 1, "Body": "Because I want to do specific research at one of a few national laboratories and it's very difficult to get in without a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_3weec3.json"}, "44": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1449935511, "Score": 1, "Body": "You don't tell us what stage you are in your education. So my first question would be: have you actually taking a class in rhetoric or speech?\n\nThink about it. You are making the assumption that public speaking is a natural skill like having good vision.  Certainly, there are people who seem naturally comfortable in front of an audience or seem to be naturally good storytellers. But for the rest of us public speaking is a skill set and so we have to practice and study hard to do it well. You have not, yes?\n\nIf you take a good public speaking class -- Typically offered in a speech communication or communication studies department  --  you will learn all sorts of ways to prepare for and execute a good speech. \n\nAnother point is that good speakers have different methods of achieving their talents. Obama is considered to be a very good public speaker but he is completely dependent on a Teleprompter. Other good public speakers are great at extemporaneous speech.\n\nYou may simply be one of those people who needs to refer to or read from notes.\n\nFinally, the Academy is one of the few places where introverts who are not great on social skills find a happy place to work.", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "45": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1449950915, "Score": 1, "Body": "I would add a couple of motivational things...\nI just finished up late last year and walked in May.  I went through all of the same stages and emotional slumps described here...especially the imposter syndrome.  Despite obvious progress I was making in the lab, and in discussions with my advisor or committee, I wasn't publishing so felt like nothing was actually getting done.  (My university requires 3 publishable chapters...although at least 4 is recommended, but they don't have to be published to graduate). Anyhoo.  After finishing my Candidacy and Comprehensive exams, I no longer had any palpable milestones to shoot for other than graduation.  I was another ABD, and defending seemed so far away.  Don't despair though...There were two things that did it for me:\n\nI went to a graduation and watched my girlfriend (wife now) walk and be addressed as \"Doctor\" for the first time about a year before my defense.  I was obviously super happy for her, but I also sat there almost in tears.  I knew where I was with my work and watching her walk was an incredible motivator.  I sat there and told myself, \"I want that\",  I want to be walking across that stage just like her.  I want to be called Doctor\".  Later that night I recorded a video on my phone of myself saying something like \"you saw her walk today, and you know how bad you want that.  Stop fucking around, and get your damn work done\".  I watched that video anytime I was slacking off or procrastinating.  It worked surprisingly well.\n\nThe second thing that did it for me was actually setting my defense date.  As soon as my committee agreed on a date (about 3 and half months out), it was if I went into robot mode. I had a necessary milestone, a date.  For three months I barely slept, I wrote like a muthafucka, and I sent drafts back and forth with my advisor incessantly. I survived on ramen, coffee, and fruit loops, but I made it happen.  Nothing else mattered for those three months and I thankfully had a very understanding partner (who knew exactly what I was going through...from personal experience).  The final few months leading up to your defense will absolutely suck.  There is no other way to say it.  BUT....BUT....when you have that robe on and you walk across that stage....nothing feels like it in the world.  Nothing.\n\n\nI forgot to add, as far as \"losing that part of you\", don't worry to much about that.  You'll always have the memories and the experience, and something will get settled post graduation.  Whether it be a post-doc, or industry job, or tenure track faculty position, you'll figure something out and you'll be surprised at how excited you are about starting the next chapter. ", "Permalink": "https://www.reddit.com/by_id/t3_3vrvcz.json"}, "46": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1450029680, "Score": 2, "Body": "It is painfully clear that these are designed by engineers", "Permalink": "https://www.reddit.com/by_id/t3_3wmses.json"}, "47": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1450050499, "Score": 1, "Body": "Agree.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "48": {"Subreddit": "PhD", "Author": "Klumber", "Date": 1450110079, "Score": 1, "Body": "You do a PhD for yourself, if you are not motivated well enough, don't begin. Judging by what you say you are relatively young, there is no harm in getting life experience first, in fact, I would recommend it. \n\nDoing a PhD is a lonely affair, make sure you know where you are in life and what you want in life before committing. Even then it is hard, I had a pretty rough time 3 years ago (2 years into my PhD) due to circumstances and it led to me being depressed and not having the right motivation to finish in the set 3 years. I ran out of funding and without my brilliant wife supporting me I would not have finished it.\n\nPS also in the UK.\nPPS make sure you go for a good university, Russell Group Unis have proper support, real research classes etc. that will really help. I did mine at a non-Russell after working at a Russell as an RA and really regretted going for that option.", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "49": {"Subreddit": "PhD", "Author": "cluidc", "Date": 1450114585, "Score": 1, "Body": "This is actually really helpful advice. Thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_3vujvn.json"}, "50": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1450166966, "Score": 1, "Body": "PhD programs like that include all the classes a person with a master's degree would have taken, so you will know even more after you start.  You will also have help settling in to new research.  I wouldn't worry if I were you.", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "51": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1450175352, "Score": 3, "Body": "I did (or still am) doing this. My advice? Take a year off. In that year, go work in industry. This may be your last chance to do so. Having a PhD will over qualify you for a lot of positions and you may never know what it's like to work in industry vs. continuing in academia. Doing a PhD has made me realise that academia is not where I want to stay, but I luckily have a R&amp;D position lined up once I'm done.\n\nYou'll pick up research experience while doing the PhD. You'll spend the first year not really knowing what you're doing, but then you slowly begin to figure out the way you're supposed to think and do work there.\n\nPhD's are also really emotionally testing in a way that is difficult to describe to people who haven't done grad-school before. Also, if you go into them without a scholarship - you aren't just paying the money for the course, but you're also more or less paying what you would have earned if you'd taken up a job in the industry.\n\nGrad School isn't going anywhere - there's no rush to go into it fresh from university. Take that year and revisit this question at the end of it.", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "52": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1450177906, "Score": 1, "Body": "I really second this, that's what I tell all my final research project students. Try working in the industry for a few years, and after that if you still really want to, go back to uni and get a phd. Specially with an engineering degree, after you get a phd going into the industry is very hard and a lot of fresh graduates don't know it. ", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "53": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1450214895, "Score": 1, "Body": "From [Wikipedia](https://en.wikipedia.org/wiki/Master_of_Fine_Arts):\n\"While this has had an effect in Creative Writing, and to a lesser extent in design and new media, the influx of graduates from practice-based PhD programs has not appreciably changed the standard for the MFA as the terminal degree in most Arts disciplines. This is an ongoing contentious topic and is the frequent subject of academic panels, especially at the annual College Art Association conference. The CAA 2008 guidelines regarding the MFA strongly re-affirms that the PhD is not required as a terminal degree in the visual arts.\"\n\nI'm not in your field so hard for me to give advice (someone else might be better).  If I had to guess, PhD would still be preferred even though it seems open for discussion.  I got my PhD Sept 14.  The process was arduous!  Just know what you are getting into and know if it fits your long-term goals or not.\n", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "54": {"Subreddit": "PhD", "Author": "chaosredd", "Date": 1450234912, "Score": 1, "Body": "Thanks, it was really helpful to know that they know I'm completely uneducated and will educate me in the first year.\n\nI am looking at a scholarship that not only pays for coursework, but also pays me a monthly allowance of roughly 2000 USD. Does that change the equation?\n\nMy main motivation for doing it straight away is the fear that once I get used to industry pay I can't pull myself out nor adjust to the allowance amount.", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "55": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1450235801, "Score": 1, "Body": "2k a month really isn't that much. You'll be making 24k a year. Your industry counterparts will be making twice that if not more. Your stipend also will not increase as their salaries increase. You will look around at one stage and feel that you're being surpassed by all of your classmates.\n\nMy point is that by not working in industry, you will not know what it means to work in the industry. There's this alternative career path that you just haven't explored at all or know anything about. I, for one, found it much more fulfilling than research, and I honestly can't wait to get back to it. So maybe my answers are a bit biased towards that.\n\nSure, it's easier to just get bogged down in academia, rather than breathe in the industry air. But, it's only a year. How adjusted will you be? Also, if you can't muster up the willpower to adjust to a bit of discomfort in order to better your own education, then maybe a PhD isn't really for you. Which is fine. It definitely isn't for everyone.", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "56": {"Subreddit": "PhD", "Author": "the1andonlyE", "Date": 1450235855, "Score": 1, "Body": "As far as long term goals I am seriously looking into becoming a professor. Most of the reason I want to get a PhD is for that purpose. I already can see that a PhD vs an MFA is better for a variety of schools and classes to teach. What is your PhD? How long was it and what is the general process for getting it??", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "57": {"Subreddit": "PhD", "Author": "chaosredd", "Date": 1450238355, "Score": 1, "Body": "Sorry, it seems I keep leaving out pertinent information.\nI am in the midst of a 6 month internship at an aromatics plant, which will end at the end of this year. The experience has been good-not-great and as much I can't find anything to complain about, I also can't see it being my life's work. \n\nWould that qualify as getting a breath of industry air? \n\nThe year off suggestion is one that sounds very reasonable to me, and I have contemplated it as one of several options. As with all options, I've had to think of potential flip sides and the comment about adjusting to the pay was the flip side I thought of for this particular option. It's not a big deal, just something I felt I needed to acknowledge before making a decision. This line of thought would actually coincide with what you're saying, albeit in the opposite direction - I'm afraid if I get so attached to industry life, having committed to it, there would be an alternative career path (Academia) which I will never get the chance to explore. \n\nOf course, I'm taking the view that it is easier to settle into industry (as many people have) as compared to academia (which in my perspective is the road less taken). Correct me if I'm wrong on this!", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "58": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1450238671, "Score": 1, "Body": "Haha, it sounds like you've already made up your mind and are just looking for someone else to assure you that you're making the right choice.\n\nLife's not that easy :) What's right for one person may not be the best for someone else. It's your life - do what you want to do. You're still young. If you fail at whatever it is you choose to do - you've got time (and freedom from responsibility) to rebuild.\n\nJust as a sidenote - you will not get disqualified from academic positions based on your experience and merit in industry, but you will get disqualified from industry positions based on your experience and merit in academia.", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "59": {"Subreddit": "PhD", "Author": "chaosredd", "Date": 1450239334, "Score": 1, "Body": "You're right, I have a greater inclination towards the PhD, though the balance is precarious, perhaps a 51-49. If someone from a senior position were to put forth strong arguments for or against either case, it would probably send me scurrying to the other side.   \n\nPerhaps what I was seeking was, true to the title, assurance that I would not be taken on board a programme that would be way beyond me, which you have also provided in your original reply.\n\nThe rest of what you said resonates because it is essentially what has been playing at the back of my head but I've been intentionally ignoring it to maintain this precarious  balance.   \n\nThis is really a difficult choice for me, simply because of the ramifications that it entails :/ \n", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "60": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1450239513, "Score": 1, "Body": "Good luck with whatever it is you choose. You won't be able to do everything. I guess this is one of the first times you're coming up to one of these types of decisions!", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "61": {"Subreddit": "PhD", "Author": "bottomfeeder_", "Date": 1450241655, "Score": 1, "Body": "Apply for a Master's when you qualify, THEN tell your advisor that you're quitting. ", "Permalink": "https://www.reddit.com/by_id/t3_3wyfmq.json"}, "62": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1450281627, "Score": 1, "Body": "My PhD is in Computing Technology.  It took me ~6 years from start to finish.  In every other discipline PhD will always be preferred and will almost always provide a salary bump as a professor.  It looks like MFA is a little more contentious than other areas, but my hunch is that all things being equal, PhD would still be preferred.  Check out [HigherEdJobs](https://www.higheredjobs.com/default.cfm) for positions you would be interested in and see what the requirements are.  \n\nFor me, I thought I knew what I was getting into, but until I got in the heart of the dissertation process, I didn't really know!  I think that's a common experience.  Good Luck!", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "63": {"Subreddit": "PhD", "Author": "the1andonlyE", "Date": 1450289888, "Score": 1, "Body": "See and I do not really know either. Since I am taking my MBA courses I find some easy and some hard. Art background was just very different overall. I would say people saying that an BFA in Graphic Design is \"so easy man\" I would call bullshit. I didn't take math and finance, but writing papers on your work as well as someone else can be very very hard. Majority of my classes being study classes took hours on end of serious work for many projects. I would like to start to teach classes after my MBA. I am a good speaker and mentor I think getting my foot in the door part time (well I guess whatever an MBA could get me) would be ideal.\n\nAny other thoughts???\n\nI really appreciate this, it is very hard to get guidance on this subject matter as an online student!\n\n-E", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "64": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1450303957, "Score": 1, "Body": "My only other thought is why are you getting the MBA then?  That will help you for certain in the private sector, but if that's not your goal you might want to switch to something that will more align with your PhD goals.", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "65": {"Subreddit": "PhD", "Author": "the1andonlyE", "Date": 1450304600, "Score": 1, "Body": "Well when I started that was my goal was to stay private sector and work for a company. That is why I started. I am half way through (2 year program and took time off for the military almost a year) and now the last semester I have realized I love to teach. I have mentored a lot of younger guys and gals both in the MBA program and outside of it. My thinking is to finish up and continue from there. It seems as though a lot of professor positions require (not exclusively, but many) an MBA. Isn't it still worth doing? I only have a semester left. I am keeping my options open at the time, I have more military training that will take time up after I graduate, and hopefully by that point I can really look into a PhD.\n", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "66": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1450306175, "Score": 1, "Body": "If you have only one semester left, definitely finish it up.  An MBA is a GREAT thing to fall back on if your PhD plans don't pan out.  I know not everyone is going to have this opportunity, but I taught night and weekend adult courses before decided to commit to Masters then PhD.  Maybe you can see if there is some level you can teach at right now with your experience to make sure this is something for you.  PhD is a possibly expensive (sounds like you might have some military funding, in some countries sponsored, still some costs though), but definitely time intensive task.  I'm not sure there's one person that comes out of it saying, \"wow, that was just how I thought it would go!\"  If there's a little uncertainty that's okay, wait on it until you are certain.", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "67": {"Subreddit": "PhD", "Author": "NitsujTPU", "Date": 1450411365, "Score": 1, "Body": "&gt;The myth that wonderful educational capabilities signifies excellent jobs has kept numerous grad students from checking out opportunities and meeting with individuals during graduate school. In case you invest all of your focus on your school work during graduate school and forget to examine different careers or build skills which are valued in industry, you will leave 1000s of dollars behind. It is crucial to place importance on meeting people, transferable skills, and the employment search procedure on its own above just completing your work and wrapping up your journals.\n\nMaybe it wouldn't be such a waste of energy if you learned to express yourself concisely.", "Permalink": "https://www.reddit.com/by_id/t3_3x6dth.json"}, "68": {"Subreddit": "DoctorZoidbergPhD", "Author": "[deleted]", "Date": 1450559369, "Score": 1, "Body": "\n# *ONLINE BOOK \"The African Child by Camara Laye\" FREE FULL how to how download link prewiew epub shop*\n\n\n***\n## █ ► [**READ** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n***\n## █ ► [**ONLINE** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n***\n## █ ► [**DOWNLOAD** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n\n. \n\n***\n## █ ► [**READ** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n***\n## █ ► [**ONLINE** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n***\n## █ ► [**DOWNLOAD** ***The African Child by Camara Laye***](https://investigationbooks.ru/607B?source=reddit&amp;keyword=The%20African%20Child%20by%20Camara%20Laye)\n***\n\n&gt; . \n\n&gt;  Description book **The African Child by Camara Laye**:\n\n&gt;  \n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; . \n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; [DOWNLOAD.. BOOK.. \"The.. Voyage.. Out.. by.. Virginia.. Woolf\".. FREE.. FULL.. iphone.. offline.. online.. prewiew.. finder](https://www.reddit.com/3xi6li),.. [READ.. BOOK.. \"A.. Spy.. In.. The.. House.. Of.. Love.. by.. Anais.. Nin\".. FREE.. FULL.. no.. registration.. iphone.. download.. epub.. for](https://www.reddit.com/3xi690),.. [DOWNLOAD.. BOOK.. \"Chimera.. by.. John.. Barth\".. FREE.. FULL.. audio.. android.. buy.. mp3.. apple.. store](https://www.reddit.com/3xi5vg),.. [READ.. BOOK.. \"The.. Wife.. of.. Martin.. Guerre.. by.. Janet.. Lewis\".. FREE.. FULL.. page.. view.. windows.. touch.. djvu.. buy](https://www.reddit.com/3xi6l7),.. [ONLINE.. BOOK.. \"The.. Old.. Jest.. by.. Jennifer.. Johnston\".. FREE.. FULL.. iBooks.. wiki.. offline.. amazon.. mp3](https://www.reddit.com/3xi7bh),.. [ONLINE.. BOOK.. \"My.. Life.. and.. My.. Life.. in.. the.. Nineties.. by.. Lyn.. Hejinian\".. FREE.. FULL.. shop.. apple.. reader.. djvu.. text.. look](https://www.reddit.com/3xi6sx),.. [DOWNLOAD.. BOOK.. \"Wings.. of.. the.. Dove.. by.. Henry.. James\".. FREE.. FULL.. sale.. eng.. torrent.. iBooks.. no.. registration](https://www.reddit.com/3xi6xn),.. [ONLINE.. BOOK.. \"Much.. Ado.. about.. Nothing.. by.. William.. Shakespeare\".. FREE.. FULL.. doc.. read.. authors.. flibusta.. without.. registering](https://www.reddit.com/3xi60e),.. [ONLINE.. BOOK.. \"Murphy.. by.. Samuel.. Beckett\".. FREE.. FULL.. wiki.. purchase.. mobile.. macbook.. find.. finder](https://www.reddit.com/3xi6n4)\n\n&gt; .\n\n&gt; .\n\n&gt; the \nnovel \nafrican \nchild \nby \ncamara \nlaye\nThe \nDanger \nof \na \nSingle \nStory \n- \nTranscript\nThis \nbibliography \non \nAfrican \noral \ntradition \nhistory \nand \nliterature \nin \ntranslation—to \nbe \nfrequently \nupdated— \nrepresents \nhighlights \nfrom \nthe \nlast \nfifty \nyears \nof\nmyth \nin \nthe \nafrican \nchild \nby \ncamara \nlaye\nthe \nafrican \nchild \ncamara \nlaye \nebook\nthemes \nin \nthe \nafrican \nchild \nby \ncamara \nlaye\nthe \nafrica \nchild \nby \ncamera \nlaye\nPostcards \nFrom \nPurgatory \n| \na \nblog \nabout \nreading\nsummary \nand \nanalysis \nof \nthe \nafrican \nchild \nby \ncamara \nlaye\nGuinea \nFacts \ninformation \npictures \n| \nEncyclopedia.com\nAfrica: \nColonialism \nArts \nProtest \n&amp;amp; \nIndependence \n| \nSouth\nAfrican \nOral \nTradition \nHistory \n&amp;amp; \nLiterature \nat \nColumbia\nthe \nafrican \nchild \nby \ncamara \nlaye \nsummary\nInspired \nby \nNigerian \nhistory \nand \ntragedies \nall \nbut \nforgotten \nby \nrecent \ngenerations \nof \nwesterners \nChimamanda \nNgozi \nAdichie’s \nnovels \nand \nstories \nare \njewels \nin \nthe\nthe \nsymbolisms \nin \nthe \nafrican \nchild \nby \ncamara \nlaye\nI \nfinished \nthe \nback \nof \nmy \noatmeal \nsweater \nlast \nweekend \nand \ntoday \nI \ncast \non \nfor \nthe \nfront. \nI \nenjoyed \nmaking \nmy \nbrown \nEnglish \nrib \nsweater \nover \nthe \nsummer \n(summers \naren\nsetting \nof \nthe \nafrican \nchild \nby \ncamara \nlaye\nThe \nDanger \nof \na \nSingle \nStory \n- \nTranscript \nCourtesy \nof \nTED \nBy \nChimamanda \nAdichie \nTranscript: \nI'm \na \nstoryteller. \nAnd \nI \nwould \nlike \nto \ntell \nyou \na \nfew \npersonal \nstories\nChimamanda \nNgozi \nAdichie: \nThe \ndanger \nof \na \nsingle \nstory\nGet \ninformation \nfacts \nand \npictures \nabout \nGuinea \nat \nEncyclopedia.com. \nMake \nresearch \nprojects \nand \nschool \nreports \nabout \nGuinea \neasy \nwith \ncredible \narticles \nfrom \nour\nsummary \nof \nthe \nafrican \nchild \nby \ncamara \nlaye\nsummary \nthe \nafrican \nchild \nby \ncamara \nlaye\nA \nPsychoanalytic \nDeconstruction \nof \nPerspective \nin \nJohn\ndiscuss \nthe \nthemes \nin \nafrican \nchild \nby \ncamara \nlaye\n1884 \nOtto \nvon \nBismarck \nchairs \nthe \nBerlin \nConference \nto \nstem \nthe \nscramble \nfor \nAfrica. \nOnly \nMorocco \nEthiopia \nand \nLiberia \nare \nrecognized \nas \nindependent \nentities.\nIn \nJames \nKirkup \nand \nErnest \nJones’ \nEnglish \ntranslation \nof \nCamara \nLaye’s \n1953 \nautobiography \nThe \nDark \nChild \nthere \nis \na \nsignificant \nstylistic \ndecision \nin \nthe \nfinal\nthe \nafrican \nchild's \nplot \nby \ncamara \nlaye\n\n&gt; .", "Permalink": "https://www.reddit.com/by_id/t3_3xi7lm.json"}, "69": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1450580157, "Score": 1, "Body": "Pretty much you need a \"terminal degree\" to get a tenure track position almost everywhere in any field.\n\nGraphics/Design = MFA\n\nLaw = JD\n\nChemistry = PhD\n\nAnd so on.\n\nBut overall the vast majority of research professors at major research universities are PhDs. In many fields it would not be possible to get a TT position without one.\n", "Permalink": "https://www.reddit.com/by_id/t3_3wzmpb.json"}, "70": {"Subreddit": "PhD", "Author": "mjaow1233", "Date": 1450791047, "Score": 1, "Body": "Possibly a cultural/institutional difference here, but forced to take out 5 weeks of vacation/year and socially frowned upon working during that time.\n\nWill never get rid of the guilt of not working though, but thats there even during the weekends.", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "71": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1450791473, "Score": 1, "Body": "Oh, interesting. Can I ask where (geographically) you're working? I'm currently home for the hols and the only thing keeping me from working on a paper is that my laptop screen got smashed on my flight. I'm taking it as a blessing in disguise heh", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "72": {"Subreddit": "PhD", "Author": "watchmakerfromfuture", "Date": 1450800772, "Score": 4, "Body": "Yes, they do.", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "73": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1450804004, "Score": 3, "Body": "It depends where you study.  Some PhDs have no taught component, and thus no GPA associated.", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "74": {"Subreddit": "PhD", "Author": "biocomputer", "Date": 1450812554, "Score": 2, "Body": "I took a total of only 3 one semester classes throughout the entirety of my ~6 year PhD.  Technically I could calculate a GPA but it wouldn't mean much.", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "75": {"Subreddit": "PhD", "Author": "blufox", "Date": 1450817124, "Score": 2, "Body": "Depends on where you are getting your PhD from. In U.S universities, where there is a mandatory course requirement, (at least in computer science) there is. \n\nSecondly, if you are an international student in U.S, your stay at U.S is influenced by your GPA when you are a grad student (If it drops below 3.0, you are in trouble). So, the GPA is clearly calculated, and is used.\n\nFinally, I think I have seen graduate scholarship applications (can't remember which ones now) where they specify a good GPA is a must.", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "76": {"Subreddit": "PhD", "Author": "GivePhysics", "Date": 1450831922, "Score": 1, "Body": "Are there online PhD programs?  For some reason that's a horrifying thought for me. ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "77": {"Subreddit": "PhD", "Author": "downtownblue", "Date": 1450849015, "Score": 1, "Body": "Depending on the program, your GPA only matters until you make it through the coursework \"gate\", be it general exams or a proposal defense. If you fall short prior, you may be at risk. However, when you're done, no one is likely ever going to look at a GPA. \n\nMy first year of my program, I had a \"first-year review\" with a member of the PhD committee. My grades were lower in my PhD than in my Masters (at the same institution) and the referee said, \"Good, it means you're learning something.\" The grades weren't bad by any stretch, but it's an example of how much/little grades might matter. ", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "78": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1450959468, "Score": 1, "Body": "You get graded and a GPA appears in your transcript but as the saying goes in many PhD programs there are only two grades, A and F.  You either do the work at a high level of excellence or you don't. In terms of what matters it's finishing your dissertation, publishing, grants, letters of Rec.", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "79": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1450998683, "Score": 1, "Body": "Funded students are usually expected to have a first (1:1), but that is mainly due to the competition for the funding. 2:1 would be acceptable I would imagine for self funded students. When I was applying for a PhD, I was on schedule for a 1:1 on my MSc, but obviously had not received it yet as I was still doing it, but my references stated that was my expected mark. I didn't get funding from one government body as I lost out to those who had already graduated from their Masters. I did however receive funding from another body on the strength of this, but for a smaller stipend. Hope that helps....", "Permalink": "https://www.reddit.com/by_id/t3_3y4gn1.json"}, "80": {"Subreddit": "PhD", "Author": "imadiscodancer", "Date": 1450999932, "Score": 1, "Body": "Thanks for your reply. It did give me an idea of what I have in store for my future. \n\nThere's no way I can self fund. ", "Permalink": "https://www.reddit.com/by_id/t3_3y4gn1.json"}, "81": {"Subreddit": "PhD", "Author": "cbaruob", "Date": 1451007204, "Score": 1, "Body": "I'm not sure if there's much difference between research councils but I got a 2:1 and got the full funding from EPSRC and I know a lot of the people in my department also got the full award with the same grade. I applied at the start of the 4th year of my MEng  as funding usually comes through the following academic year, so if you don't want to have a year gap I'd suggest you apply now.", "Permalink": "https://www.reddit.com/by_id/t3_3y4gn1.json"}, "82": {"Subreddit": "PhD", "Author": "Ermischiella", "Date": 1451038291, "Score": 1, "Body": "Most people I know (including me!) got funding for a PhD with a 2:1, guessing it depends what area/what uni, but it's very doable!", "Permalink": "https://www.reddit.com/by_id/t3_3y4gn1.json"}, "83": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1451047112, "Score": 3, "Body": "Whenever I came across an interesting passage in a book or essay in the past I used to mark it with a post-it note and then I would go back and type it up along with the full reference information.\n\nNow that I am farther along in my career I have an assistant who does the typing for me. I suspect that a lot of senior authors and professors have the same. I'm sure our younger, more digital folks probably use some other methods \n\nWhat ever you do the key is to put down the exact correct reference information or you will get end up losing passages and getting confused", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "84": {"Subreddit": "PhD", "Author": "imadiscodancer", "Date": 1451053351, "Score": 1, "Body": "Thanks for sharing. Gives me a little hope.", "Permalink": "https://www.reddit.com/by_id/t3_3y4gn1.json"}, "85": {"Subreddit": "PhD", "Author": "DoctorMarx", "Date": 1451061822, "Score": 1, "Body": "While reading, I note the page number and first few words of noteworthy passages. I jot this down in a notebook with any comments I might have. Later I type up my handwritten comments in the notes section of a bibliographic entry in Zotero. (My Zotero files are backed up on two different hard drives and synced to a cloud service.)\n\nHandwritten notes are easier to take \"in the moment\" of reading, and typing them up again 1) reinforces my memory of the reading, 2) provides opportunities for further reflection on the reading and my line of thought at the time, and 3) provides me with a searchable, digital copy.\n\nI wish I'd started this habit from day one of grad school, but I really only became this disciplined starting with my comprehensive exams.", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "86": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1451067733, "Score": 1, "Body": "For every paper/book that I read I have a handwritten copy of notes that contains all relevant/interesting ideas or quotes written down with page number. Obviously this can be done digitally, but I found hand writing notes a lot easier for me personally, and kept me away from the computer while I was reading.\n\nMy notes are then organised by either author or topic, depending. I ended up having two very large folders of notes to refer to as I wrote up. Cannot vouch for it being the best way to do it (as digital enables better idea or word search when looking for a particular idea/quote) but having notes to refer to is pretty much a mandatory requirement for a thesis I would imagine. \n\nAlso as you read, make a full bibliography reference for the paper. This is again, mandatory I would imagine. ", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "87": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1451226361, "Score": 3, "Body": "There are lots of degrees that don't come with honours, MA, MSc for example. I have been told it's to distinguish differences at lower degree levels. Where as you're still at a high level if you at least pass a masters degree.", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "88": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1451235153, "Score": 2, "Body": "My PhD program had an honours option (well, cum laude).  It was something that your committee decided on, not anything that you had control over as a student.", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "89": {"Subreddit": "PhD", "Author": "wifichick", "Date": 1451283228, "Score": 2, "Body": "Because earning the PhD is tough enough. No one really ever asks a PhD what their gpa was; at least not technical PhDs. ", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "90": {"Subreddit": "PhD", "Author": "biocomputer", "Date": 1451285296, "Score": 1, "Body": "To begin with the honors distinction means different things in different places so a lot of the time it wouldn't apply to a PhD.  At my university in Canada, an undergraduate honors degree means your degree is more concentrated in a particular area (you take more courses in a specific area and have fewer electives), and the minimum grade requirements are higher (70% instead of 60%, though in practice it's often higher than 70% because entry to the honors programs are sometimes competitive), compared to a non-honors degree.  In some departments a senior research project is required as part of the honors degree (it's often even called an honors thesis). Most of these things wouldn't apply to a PhD degree.  In a PhD there aren't levels of specialization.  For many STEM PhD's you don't take many classes, and even for subjects where you do take a lot of classes the main goal is still to do original research, not to take classes.  So giving a special degree title for having high grades would not recognize the main goal of the PhD, the research, and giving one for being more specialized wouldn't make sense since everyone in a PhD is already specialized. My school does give out an award for the best PhD thesis in each department, I don't think it's noted on the degree but it's probably on your transcript.", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "91": {"Subreddit": "PhD", "Author": "jpirie23", "Date": 1451466517, "Score": 3, "Body": "This is just my opinion, but I think you really need to have a **strong** love for your subject area before starting a PhD in that field. Generally a PhD is a rather grueling experience which required a ton of persistence and some personal sacrifices, so unless you are really super keen, then I probably wouldn't venture into this. It's hard enough to do it for a subject that you love, to go through all that for a subject that you don't have strong positive feelings for could lead to a lot of wasted time and effort.\n\nIf you want to do a PhD because you very want to try a real experience of research in this field, are willing to work extremely hard and spend a lot of time on this, then go for it, and the very best of luck! If however you just want it to get a PhD just for the sake of it, trust me it's not worth it, not by a long shot.", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "92": {"Subreddit": "PhD", "Author": "raw_hazard", "Date": 1451468054, "Score": 1, "Body": "First of all, thank you man. I would like to ask you another question then. What do you think is the difference between a Ph.D. and another job in your opinion? When I want to convince myself to start this thing I think: \"Well, it can not be much harder than any other job that I could do with my degree\". I think that with a \"standard\" job I would have to work as much hard as for a Ph.D. and probably on a very less interesting subject. This is what makes me choose the Ph.D. Do you think this is foolish? it is, maybe =)", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "93": {"Subreddit": "PhD", "Author": "jpirie23", "Date": 1451470688, "Score": 2, "Body": "Of course again just my opinion here, if anyone else is reading with contrasting opinions please do jump in. I \ndid a PhD then went into the industry so I have some kind of view on both sides, so here's some points: \n\n**PhD**\n\n* Expensive for you, not a real money earner. If you're young and haven't bought a house/flat or whatever then this could be an important factor for you.\n* Greater hours of work. For a job maybe you work 8 hours a day, for a PhD in my case it was closer to perhaps 12 or so on average.\n- Can often be very solitary. If you like working with people, research can be quite isolating.\n- If you go into the industry, it may bear virtually no resemblance to what you end up doing and so give no real benefit other than experience of research (which might not necessarily be a bad thing).\n+ You'll probably get a salary boost when you go for your first job which is nice.\n+ Experience in the world of research, and opens up new options later on.\n\n**Job**\n\n+ Much greater salary.\n+ You get to work as a team.\n+ Greater experience if you go into a job straight away. This could certainly make the salary boost you'd get with a PhD immaterial, as you could easily be on the same pay anyway.\n+ More personal time.\n+ Less stress.\n\nAn extra point on the difficulty level though, a PhD is probably **much** harder than a job. You're basically at the front-line of human knowledge, which means sometimes you don't get to ask anyone for help, because no-one knows the answers you're looking for. There's no hand-holding either.\n\nA PhD is really a very challenging undertaking, and you should seriously consider the implications of taking up this degree. What I've said here could certainly be viewed as one-sided and weighing on the negatives, I recommend asking others the same question before making this decision as it's an important one to make.", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "94": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1451478365, "Score": 2, "Body": "Also there's a very real chance that you'll be overqualified for a lot of the graduate positions in industry. Before you start your PhD you have many more job opportunities than after you finish!", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "95": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1451484442, "Score": 2, "Body": "As I read all of these comments, I feel obligated to chime in here. I guess you could say I got lucky but I somehow got into a great PhD program and now work with a great PI. I personally think she is great but others are scared of her and say she is too demanding, however I think we are going to be a great team. \n\nI think a large part of a successful PhD experience is having a good PI that clicks with you. I understand this isn't very common but if you find it, it is great. \n\nI mostly wanted to point out that industry and academia are NOT the only options for life after a PhD. There are many options that don't involve lab research.\n\nSome examples: Science writer, consultant for law firms, jobs at the CDC, WHO, NCI, government contractors, national defense type jobs, startups etc. The skills you learn in a PhD prepare you for leadership positions - you need organization, time management, team management, communication (visual and oral), and budgeting. These are all skills that are easily translated between fields you just have to be willing to take a non-traditional career. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "96": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1451489272, "Score": 3, "Body": "No.\n\nThe work, hours, stress, toll on personal life and odds at success are high or hard.\n\nReally only the 100% dedicated, even obsessive need apply.\n\nFind something you are devoted to.", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "97": {"Subreddit": "PhD", "Author": "michmochw", "Date": 1451494171, "Score": 2, "Body": "If you're not 100% certain then no, don't do it. Starting a PhD for the sake of staying in academia is a bad idea. If you can't justify sacrificing your personal life and all your mental and physical energy then it will be impossible to stick to it, and supervisor money and research grants get wasted in the process. \n\n\nTake some more time to explore your own interests, maybe do a taught masters course, try for research assistant jobs or look for a job in industry.", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}, "98": {"Subreddit": "PhD", "Author": "Realitybytes_", "Date": 1451529704, "Score": 1, "Body": "I work alongside PHDs in my job (IB) and if you showed this to the MBA grads you'd be laughed out the building.", "Permalink": "https://www.reddit.com/by_id/t3_3nzw8j.json"}, "99": {"Subreddit": "PhD", "Author": "raw_hazard", "Date": 1451558547, "Score": 1, "Body": "Thank you everyone! Could I ask you where did you do your Ph.D.? Do you regret doing it? Were you passionate about it?\nyour opinions make me think, thank u!", "Permalink": "https://www.reddit.com/by_id/t3_3yrj0t.json"}}