{"0": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475293125, "Score": 3, "Body": "From what I've seen, industry only cares about what you can physically do. You can learn a field, they know you don't need that going in. They want you to know how to use the instruments, tools of the trade, whatever, that they use. That's where their largest time sink would be in training you. Many of my friends spend their PhDs just trying to get as many instruments onto their resume as possible.", "Permalink": "https://www.reddit.com/by_id/t3_555lb2.json"}, "1": {"Subreddit": "PhD", "Author": "JTorgo", "Date": 1475297187, "Score": 1, "Body": "Thanks for the advice! My research definitely uses a lot of instruments. It also has a lot of practical use in mining remediation. ", "Permalink": "https://www.reddit.com/by_id/t3_555lb2.json"}, "2": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1475328735, "Score": 3, "Body": "Not really lab, it's science education not a hard science.  The lab is classrooms.\n\nSo do I just shoot out an email saying:\n\nGood afternoon, I've read your work on XYZ and thought it was lovely.  If you have a moment could you describe your experience with the doctoral program at QWE university.", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}, "3": {"Subreddit": "PhD", "Author": "arcoftheark", "Date": 1475336406, "Score": 1, "Body": "Yes that sounds good. Professors want good students, and they want people to reach out to them!", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}, "4": {"Subreddit": "PhD", "Author": "nfq94o75tp", "Date": 1475346115, "Score": 3, "Body": "You paint a realistic portrait of academic life and you get downvoted for describing what is, rather than repeating what others think should be. Then you describe pragmatic solutions.\n\nIf I had to bet my life on whether you or OP would have a better career in academia, even if OP had ten times your talent, I would bet on you. \n\nEdit: a word", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "5": {"Subreddit": "PhD", "Author": "longshuicy29", "Date": 1475349190, "Score": 2, "Body": "sigh, my former advisor once hinted that I'm stupid because we had some different opinion about an experiment. I didn't cry in front of him. I held myself together and left the meeting politely. \n\nThat night (9 ish on a Friday) he called me. I didn't pick up.\n\nThe following Monday he summoned me to his office, sat me down telling me because I'm a girl I'm too emotional, along with other gender biased comments against me and my female labmates.\n\nI quitted in a few months.\n\nNow it's almost two years later, I'm still dealing with some leftover trauma from that particular advisor.\n\nedit- grammatic issue apology English is not my native language", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "6": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475396052, "Score": 2, "Body": "Are you on track to finish in the minimum time (3 years)? If you are then you might be able to make it with a bit more time off, it'll just be more expensive. What I mean by time off is do 2-3 weeks hard in the lab and then fly/drive/train back to Melbourne for 1-2 weeks to write. Then, hopefully, in 9 months you can go back to Melbourne full time and write up there with maybe a few trips back up for specific meetings. Do you think your supervisor would let you telecommute like that?", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "7": {"Subreddit": "PhD", "Author": "DJDizhna", "Date": 1475400006, "Score": 2, "Body": "Before I reply, just a quick clarification: I don't work in a lab, I'm doing a Pure Maths PhD...\n\nI have no issues with the PhD at all; on track to finish within 3 years, supervisor's been great (we Skype whenever meetings are hard to schedule), I'm loving the research topic. I'm just finding it too hard right now balancing my own well-being with my career goals (immediate career goal is to finish the PhD).\n\nWhat I had in mind was for me to move back to Melbourne early next year and (seeing as I have one year left to finish the PhD) spending my time in Melbourne writing up the thesis (and teaching too) &amp; take a trip up to Sydney once every 4-6 weeks, for a day or two. I will definitely bring this up with my supervisor in the coming week. Happy to talk more if you want.", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "8": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475404386, "Score": 1, "Body": "That sounds like a great plan for you then! Can I ask how you're going to teach from Melbourne? Do you teach online or will you teach at a Melbourne uni?\n\nI'm in Perth but I have a supervisor at UNSW and end up there for a week or two every two to three months. I don't mind it for the stints but I totally agree that living in NSW/Sydney is rough.", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "9": {"Subreddit": "PhD", "Author": "DJDizhna", "Date": 1475405985, "Score": 1, "Body": "Interesting... I'm doing my PhD at UNSW, actually. Originally did my undergrad &amp; honours at Monash, also did teaching there for about 3 semesters. So if I was to end up back at Melbourne, I would probably teach back there again. I could also try applying for teaching at UoM...", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "10": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1475415214, "Score": 1, "Body": "How much face to face contact do you have with your supervisor? I live about 2.5 hours away from mine. A different city. I see him about once every six months and we talk on the phone once every couple of months or so. It works out fine.\n\n\nWhat's stopping you from just moving?", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "11": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1475415940, "Score": 1, "Body": "I think you have answered your own question. Doing a PhD while distanced from your campus/supervisor comes with some unique challenges and frustrations (I'm across the country from mine, 5 hour flight to visit), but can be done. Self-motivation, communication and unique problem solving skills become vital. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "12": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1475416197, "Score": 1, "Body": "You haven't mentioned what your partner thinks about this? His or Her support will be critical. ", "Permalink": "https://www.reddit.com/by_id/t3_51mhq7.json"}, "13": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1475477408, "Score": 1, "Body": "Agreed. I'm doing mine 8 time zones ahead of my Uni and advisor... A 16 hour flight. It's doable with all the synchronous and asynchronous communication means that exist today. Just requires a bit more planning and logistics. But if your relationship with your advisor is already established and solid, working remotely should work.", "Permalink": "https://www.reddit.com/by_id/t3_55hdsd.json"}, "14": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1475554970, "Score": 1, "Body": "Not sure, but I hope it works out for you and you stay in the States for the last bits of your PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_55r6nx.json"}, "15": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1475561260, "Score": 1, "Body": "What a shitty thing to do as a professor. I would look into transferring next year. From immigration perspective you need to either be a student, be employed or be married.", "Permalink": "https://www.reddit.com/by_id/t3_55r6nx.json"}, "16": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1475561339, "Score": 1, "Body": "Also please give us some idea as to what field you are in. I have never heard of a story like this in a business PhD.", "Permalink": "https://www.reddit.com/by_id/t3_55r6nx.json"}, "17": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475567190, "Score": 2, "Body": "Speak to your student union ASAP. I think they need real reasons to dismiss you like that and you might have a case for the department having to help you. The union can support you in other ways too like helping you find a scholarship/funding.", "Permalink": "https://www.reddit.com/by_id/t3_55r6nx.json"}, "18": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1475580823, "Score": 1, "Body": "I would wait for peer review. A 'student paper' will likely not be cited since is not peer reviewed and it won't look as good as a regular publication in your cv.", "Permalink": "https://www.reddit.com/by_id/t3_55soj8.json"}, "19": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475587016, "Score": 2, "Body": "Ouch. So, as Baudin82 says, a non-peer reviewed \"Student paper\" is worthless. May as well post it on a blog somewhere. As for multiple submissions, if you pull the paper from the other journals (who operate under the assumption that they're the only ones currently looking at the paper and often make you electronically sign a statement to that effect) and it immediately pops up somewhere else, 1 of three things can happen:\n\n1) nothing\n2) the editors from the journals who were looking at your paper see it and blacklist you\n3) the same thing as 2), but they also contact the journal that published the article and request that the article be retracted for violation of publication ethics standards", "Permalink": "https://www.reddit.com/by_id/t3_55soj8.json"}, "20": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1475590825, "Score": 1, "Body": "Definitely! (And sorry for the slow reply!)", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "21": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475595696, "Score": 5, "Body": "This is a huge breach of contract and also very unethical. It is \"doable\" to wait for a paper to go through peer review at one journal. It's what everyone else in academia does and it's working fine for them (including myself). If you plan on continuing on in academia or anything involving research and publication, I would withdraw this paper from all journals and not publish it as you cannot undo the mistakes you've already made and publishing even part of it anywhere means you've broken the contracts.", "Permalink": "https://www.reddit.com/by_id/t3_55soj8.json"}, "22": {"Subreddit": "PhD", "Author": "lock-groove", "Date": 1475599089, "Score": 3, "Body": "When an university examines you for a PhD position, they don't limit the evaluation to your marks: they evaluate your academic independence and critical approach. If your marks are lower then other students because you are committing to actually learn something, don't worry: you are learning more then them, and this will come up during the selection process.\n\nI had a similar experience, graduating with a relatively low mark, and going through the first round of selection (evaluation of my academic cv) with the minimum score: what you have to do is to demonstrate you have more than what your academic path shows, in particular that you have deep motivations to pursue a PhD and that you are are an critically active person. \n ", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "23": {"Subreddit": "PhD", "Author": "lock-groove", "Date": 1475599346, "Score": 1, "Body": "13, got 3 interviews and accepted in 2. I was also called for an interview in another school after having filed the paperwork for my PhD of choice. I am a Regional planning and public policy PhD student in Italy.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "24": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1475602151, "Score": 3, "Body": "&gt;  in particular that you have deep motivations to pursue a PhD\n\nThis is really the kicker, there is infrastructure and support in place to support a PhD student but what the uni doesn't want is someone that's going to flake out after two years.\n\nI wouldn't worry about being in the top ~20% of your class.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "25": {"Subreddit": "PhD", "Author": "Danteal56", "Date": 1475602589, "Score": 2, "Body": "What the actual fuck man? ", "Permalink": "https://www.reddit.com/by_id/t3_55soj8.json"}, "26": {"Subreddit": "PhD", "Author": "lawrtist", "Date": 1475607482, "Score": 1, "Body": "Thanks..it's good to know that not all universities are curious about grades only.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "27": {"Subreddit": "PhD", "Author": "lawrtist", "Date": 1475607704, "Score": 1, "Body": "I know being almost in the top 20% isnt bad...on the contrary,it's considered a good thing in my university..im just worried not to get into a good university in europe because most of the uni-s there accept \"top\" international students.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "28": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1475608662, "Score": 2, "Body": "26-27 out of 135 is pretty good, and you're still in the beginning stages of this process. Focus on learning and doing that hard work, and the results/progress will happen. There's more to a PhD application than a GPA. ", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "29": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1475608697, "Score": 1, "Body": "Do they ask for your ranking in applications? \"Top\" is relative. The top students at my last university would be in the mid-range of my current one.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "30": {"Subreddit": "PhD", "Author": "lawrtist", "Date": 1475609839, "Score": 1, "Body": "You're right about that...and some universities ask for the rank and for those who dont,im sure writing down the rank will have a good impact.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "31": {"Subreddit": "PhD", "Author": "lawrtist", "Date": 1475609913, "Score": 1, "Body": "Thank you...im glad now that there's more than grades in a phd app", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "32": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1475619021, "Score": 6, "Body": "I am not sure you are thinking about this the right way, and are also perhaps underestimating the amount of work that goes into a PhD. \n\nHowever you can do a interdisciplinary PhD. I wouldn't advise doing two at once though. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "33": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1475619258, "Score": 6, "Body": "TLDR: Is there a way to get two useless PhDs at the same time? Yes, there is!", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "34": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1475619423, "Score": 12, "Body": "You can't do two PhD's at once whatever gave you that idea???", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "35": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475620520, "Score": 1, "Body": "What do you mean an interdisciplinary PhD?", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "36": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1475622884, "Score": 2, "Body": "An article discussing it is [here](https://www.google.co.uk/amp/s/amp.theguardian.com/higher-education-network/blog/2014/feb/19/interdisciplinary-research-universities-academic-careers%3f0p19G=e?client=ms-android-motorola) though i haven't read it, but am sure will give you a bit of a start to understanding the term. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "37": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475623618, "Score": 1, "Body": "Replace get with do. I would be super surprised if anyone doing this managed to actually get even one of the doctorates.", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "38": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475624968, "Score": 5, "Body": "The biggest questing is \"why?\"", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "39": {"Subreddit": "PhD", "Author": "KERdela", "Date": 1475626754, "Score": 1, "Body": "just follow the tutorials proposed by mendeley and you will be highly statisfy", "Permalink": "https://www.reddit.com/by_id/t3_53iu8w.json"}, "40": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1475642468, "Score": 1, "Body": "Oh my... ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "41": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1475661080, "Score": 3, "Body": "As a PhD candidate, this makes my jaw drop. Good luck if this is what you're actually aiming to do. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "42": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1475661689, "Score": 2, "Body": "Yes, well sometimes presenting reality isn't popular, *shrug*. Saying the OP needs thicker skin might sound 'mean' or even micro-aggression like!, the reality is the culture is never going to change and you must adapt to your environment if you are to survive.\n\nI am indeed a competent scientist, but I really struggle with the office politics and the publish or perish mentality.", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "43": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1475664496, "Score": 1, "Body": "And in *less* the time too?!", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "44": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475666605, "Score": 2, "Body": "After giving it thought I'll probably pursue one PhD then an MS in a different subject as well. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "45": {"Subreddit": "PhD", "Author": "WithMyHoodieOn", "Date": 1475666646, "Score": 1, "Body": "Which country are you coming from and which one do you want to be going to?\nI have been admitted to one of the Top10 UK universities but never once anybody wanted to discuss grades with me. The most important part is having a good proposal and an advisor who likes working with you. If you want to go for OxBridge decent GRE scores might help you. But in the end a PhD is still a very personal situation once you passed the minimum requirements listed on the website.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "46": {"Subreddit": "PhD", "Author": "WithMyHoodieOn", "Date": 1475666766, "Score": 1, "Body": "May I ask where in Europe you are studying? I have never seen here a formal PhD cohort system admission.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "47": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475667907, "Score": 1, "Body": "I believe Zizek has two doctorates? ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "48": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1475668496, "Score": 3, "Body": "You can do multiple PhD just not at the same time.", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "49": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1475671190, "Score": 1, "Body": "I did a cross disciplanry PhD and I wouldnt recommend it.\n\nIt was radiation biology and mathematical modelling. My first degree was in Chemical engineering. \n\nUltimately you end up half a biologist and half engineer. It ends up putting off employers from both sides. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "50": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475671492, "Score": 0, "Body": "I think most of my reasoning to pursue extensive study is for the ability to theorize and academically contribute in multiple fields that have overlap (Philosophy, Sociology and Political/Economic theory, for example). I know, for example, that Noam Chomsky is a trained linguist but also contributes in the realms of politics, international relations and philosophy. I'm interested in many different fields and studies. Currently I'm still in undergrad and I have written a few of my own analyses/theories within both the realms of political philosophy, social theory and phenomenological/ontological philosophy on my spare time, and i'm looking for the best way to coalesce all my interests in ways that will allow me to touch base upon multiple subjects of interest. Any thoughts?", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "51": {"Subreddit": "PhD", "Author": "rrgjl", "Date": 1475674147, "Score": 3, "Body": "That's an interesting statement. Please do explain. I don't see why one would not be able to do 2 PhD's simultaneously, especially if they work on them part-time, which isn't entirely uncommon either.", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "52": {"Subreddit": "PhD", "Author": "jfp51", "Date": 1475675042, "Score": 1, "Body": "I guess I should qualify it ;) In my field (remote sensing) and I would venture most hard sciences it is unheard of, even part-time. At my institution, there is not even any part-time PhD. Trying to rush through all the steps is also discouraged, although they do monitor our progress quite closely and you are expected to be done in 4-5 years.\n\nI should know better than to make blanket statements!", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "53": {"Subreddit": "PhD", "Author": "lawrtist", "Date": 1475687015, "Score": 1, "Body": "Im coming from the middle east and i have in mind France,Finland,Norway,Austria... (i haven't narrowed my choices down to 1 or 2 yet)", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "54": {"Subreddit": "PhD", "Author": "unicornsquad9", "Date": 1475688296, "Score": 1, "Body": "You said in a reply comment that you started to work outside academia?\n\nI'm halfway through my Masters in biochemistry, and the stress and anxiety is so all-consuming that I've decided that academia is absolutely not for me. I would like to finish off my Masters (because I just can't bring myself to quit), and I'm thinking about the type of job that I can have that is still involved in the science community but not as stressful as academia. Any information would help!", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "55": {"Subreddit": "PhD", "Author": "future-madscientist", "Date": 1475688515, "Score": 3, "Body": "You're still in your undergrad and you think you will be capable of doing two PhDs at the same time? You are incredibly naive about the time,  commitment and focus to do just one PhD.  ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "56": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475694338, "Score": 1, "Body": "One guy I approached said he can't at the moment, I said let me know if you can. 7 months later I get an email saying do I want to come in for an interview", "Permalink": "https://www.reddit.com/by_id/t3_5527qt.json"}, "57": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475694620, "Score": 3, "Body": "If you think it's possible or a good idea, you should not even attempt one", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "58": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475697723, "Score": 1, "Body": "how exactly are you planning to fund all this?", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "59": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475699251, "Score": 1, "Body": "I wrote to my current supervisor, formal and respectful, and said his work sound really interesting. Saying it made me sound informed and a good fit. However if I had said \"I have read all of your papers and you're a smart cool man\" it would have sounded disingenuous. It's a balance. As it turns out my supervisor really is a cool smart man ", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}, "60": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475699421, "Score": 1, "Body": "I did my undergrad in chemistry, got 0 publications. Now doing PhD in physics. Undergrad doesn't matter all that much. What was your undergrad/graduate? If it's vaguely in the same area, you'll be fine, if not then at the very worst you could start a MRes/Mphil and upgrade to PhD after a year if you're doing well", "Permalink": "https://www.reddit.com/by_id/t3_53fluo.json"}, "61": {"Subreddit": "PhD", "Author": "butterbell", "Date": 1475699673, "Score": 1, "Body": "Right, I definitely went the formal route.  It's been pretty eye opening.  One of the professors at my original top choice school was a tots bitch, and now they're farther down the list as there's only one professor left i'd like to work with.", "Permalink": "https://www.reddit.com/by_id/t3_55agdk.json"}, "62": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475701559, "Score": 1, "Body": "Loan Repayment/Forgiveness Programs working in the nonprofit sector, hopefully.", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "63": {"Subreddit": "PhD", "Author": "porterble", "Date": 1475714579, "Score": 2, "Body": "Can you digitise your articles? The vast majority of mine are in PDF and I use an iPad with stylus to mark them up. \n\nEverything goes in either my Peak Design 13\" messenger or GoRuck GR1 depending on what I'm wearing or if I'm teaching. (Blazers and backpacks never mix)", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "64": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1475721212, "Score": 1, "Body": "Find some TA work, or an RA that leads to a publication. Or work on a pub or two asap. ", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "65": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1475721413, "Score": 3, "Body": "Huh? Who the hell carries around physical copies of articles? ", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "66": {"Subreddit": "PhD", "Author": "caz-", "Date": 1475721797, "Score": 10, "Body": "\n\nI don't really understand how you can not have enough to do during a PhD, because you set your own pace. Don't have much to do? Do more.\n\nI mean, unless you have written several papers, have all the results you could want, and also finished your thesis, there is more to do, right?\n\nBut, my specific advice: Start writing. That in itself will take time, but the chances are you don't have enough to write about yet, and trying to write will help you work out what you need to work on in the mean time.\n", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "67": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1475731402, "Score": 1, "Body": "Can you elaborate on the abbreviations ? ", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "68": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1475732334, "Score": 5, "Body": "TA = Teaching Assistant. It's good to teach (or assist) as soon as possible if you want an academic career beyond the PhD. \n\nRA = Research Assistant. A great way to do grunt work for a professor (data analysis, transcription, writing, etc). Bonus if there's a publication at the end.\n\nPub = Publication\n\nASAP = As Soon As Possible", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "69": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1475732742, "Score": 2, "Body": "My beginning was slow as well. Mostly took classes first year, and focused on  that. Talk to your advisor, and figure out what he expects of you. Then make sure you are ahead of his expectation, and always hold a few days' worth of experiments away from him, in case you need to repeat some stuff or things stop working. At the beginning, I did not feel much pressure. A year or two in, completely the opposite.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "70": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1475734477, "Score": 1, "Body": "I had long periods where I did almost nothing. But then I am part time and working full time so maybe it's something I needed.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "71": {"Subreddit": "PhD", "Author": "instagnome", "Date": 1475739086, "Score": 1, "Body": "I'd love a job but my scholarship doesn't allow me to take on any other employment.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "72": {"Subreddit": "PhD", "Author": "instagnome", "Date": 1475739165, "Score": 1, "Body": "Thanks for this perspective and the tip! I think I will get busier next year as well, just feels weird bumming around right now.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "73": {"Subreddit": "PhD", "Author": "instagnome", "Date": 1475740475, "Score": 1, "Body": "Thanks man, maybe it is a motivation issue.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "74": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1475748115, "Score": 3, "Body": "I think you'd be surprised how much there is to do once you start - I thought the same in my first 6 months... and then I started really trying to put it together. Fuuuuck it's hard. Been working in the morning 5 days a week and staying in library until 8pm each night just trying to make the stupid thing make sense. And that's after months of research and writing plan after plan after plan. \n\nI did have long periods of doing nothing, but that was more procrastination and being stuck on a direction than not having anything to do.\n\nIf you don't have enough to do it means you haven't done enough to realise just how much there is left.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "75": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1475759673, "Score": 1, "Body": "One. I was pretty sure this was the faculty I wanted to learn from / work with.", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "76": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1475761174, "Score": 4, "Body": "Me. I get headaches easily if I try to read on a screen and can't remember the important things without physically writing in the margin/physically highlighting. \n\nI kill a lot of trees. I should probably go donate some money to a protect the forest campaign. Last night alone I printed over 600 pages of articles for my dissertation \n\nEdit: if it makes anyone feel better, the packaging on the paper says it's 100% recycled. And if anyone knows of a cause I can give money to to offset all my printing, I would really, really love that. ", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "77": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1475761343, "Score": 1, "Body": "I would imagine you just need to keep publishing.", "Permalink": "https://www.reddit.com/by_id/t3_53i4fi.json"}, "78": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1475763791, "Score": 1, "Body": "PhD biology Student from Hong Kong here\n\nI would say the work culture here is very dependant upon your professor. Most professors expect you to be very hardworking. Our director of the graduate division literally said that we were expected to work 8:00-20:00 Monday - Saturday and coming in on Sundays and holidays was a bonus. At least in east Asia there is a very strong focus on spending a lot of time in the lab, regardless of whether or not you are generating a lot of data. \n\nIn talking to other students from China and Korea the culture is very similar. The caveat is that this usually only applies to the Asian professors. Most western professors have a similar culture to their home or where they studied. ", "Permalink": "https://www.reddit.com/by_id/t3_560rj2.json"}, "79": {"Subreddit": "PhD", "Author": "richard248", "Date": 1475771302, "Score": 1, "Body": "I actually think some discussion of this kind of thing would be useful in this subreddit. \n\nThere are a million posts about imposter syndrome, where everyone is told they are probably better than they think they are.\n\nBut we all have things we are not good at and do need to improve upon in order to be at the standard of what is expected of a successful PhD candidate. Not having enough work to do is maybe an example of lack-of-direction, motivation, etc, and it would be useful to hear some suggestions of how to overcome this.\n\nMy 'lack of motivation' / temporary lack of work mostly manifests from indecision. I get a weird result, or I can't get results to make sense, or I'm not quite sure whether or not the material I'm reading is actually important and worth the time. I am unsure of what to do, so reach for something easier - procrastination.\n\nI read Hayton's book called 'PhD' and he discusses the importance of \"sticking with the problem\". Stick with the problem and a clear direction will probably emerge. I remember this when I'm confused and want to do something else, and I find it helps. \n\nIn your case OP, definitely get some direction from your advisor as to what you should be doing, and keep regular checkups with him/her. Even if you just email weekly with no response, having to report what you are up to will help you make consistent progress, and clearly communicating your workload to your advisor should ensure you don't have too little. ", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "80": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1475776207, "Score": 1, "Body": "The same could be said about my PhD. I had an interest in radiation biology and an interest in engineering (and by extension the critical thinking behind statistical modelling). There's definitely merit in cross disciplinary research. That and collaboration are the buzzwords of the time when it comes to grant proposals. \n\nEveryone who I have ever given advice about PhD's, it has always been caveat emptor, which is exactly what you're exploring I suppose. A PhD is a daunting task, but ask yourself what lies beyond that and will that fit in with your life plans. \n\nIn the EU, you're looking at 3-4 years, longer in the US. Academia can be a very unstable environment for work, as particularly early on, you're going to be post-doc'ing on short term contracts (1-3 years?).\n\nEven when you are cross-disciplinary, it just puts much more pressure on you to perform. The standard doesn't drop and so you have to rise to literally doing twice the work. I don't think that's sustainable if you hope to do it in less than the normal time. Mental health is something often ignored by the academic world as a whole and the toll that a PhD takes on a person is often unseen until they break.  \n\nI would be a complete hypocrite if I said don't do it, but if you are going to do it, go at it with open eyes. I would do some research to find academics already working in your 'primary' field and explore the possibilities that way. \n\nGood luck :)", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "81": {"Subreddit": "PhD", "Author": "planetbyter", "Date": 1475776911, "Score": 1, "Body": "Thank you so much. I wish you much luck and happiness in life. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "82": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1475786064, "Score": 4, "Body": "If you want to do a PhD, it's better to do it as early as possible, so that you can maximize the benefits of having that degree. This holds whether you plan on being in academia or industry afterwards.  \n  \nHowever, an argument that is often made, is only do the PhD if you absolutely need it. So if you plan on working in industry, only go for a PhD if the job you desire requires a PhD. Otherwise it's 4+ years of lost income and opportunity cost for no good reason.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "83": {"Subreddit": "PhD", "Author": "instagnome", "Date": 1475789329, "Score": 2, "Body": "&gt; not quite sure whether or not the material I'm reading is actually important and worth the time\n\nI relate to this. I hate the idea of reading or writing something that's not likely to end up in my thesis. I like to do things stage by stage so I don't accidentally do any extra, unnecessary work. Perhaps it's a working style that should be ditched in a PhD.\n\nI meet my supervisor weekly and I'm on track with my planned workload. I just seem to have my evenings and weekends all to myself. I wasn't expecting such a healthy work/life balance!", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "84": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475791858, "Score": 2, "Body": "Thank you for your insightful answer.\nI  would be 24 after finishing my Masters, so I'm still pretty young and I'm not that dependent on money, since I have a financial background of my family. But you're right, if it's not necessary it's a long time. ", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "85": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1475842304, "Score": 2, "Body": "PhD, however, opens way more opportunities for you, academics, consultancy roles and other chances of doing more cutting edge research. ", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "86": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475848284, "Score": 2, "Body": "Maybe start writing a review paper that could also form the introduction to your thesis.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "87": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475848454, "Score": 2, "Body": "Get a hobby in the evenings and weekends to keep you sane. I'm really extroverted so I need a lot of interaction with people, which I can't get from the lab. Plus I find reading and writing quite boring so it's nice to do something fun in the evenings.", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "88": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475848688, "Score": 1, "Body": "I use an [osprey pixel backpack,](https://www.amazon.com/gp/aw/d/B00AVSEAA2/ref=mp_s_a_1_1?ie=UTF8&amp;qid=1475848514&amp;sr=8-1&amp;pi=SY200_QL40&amp;keywords=osprey+pixel+backpack&amp;dpPl=1&amp;dpID=41OdCXEL-sL&amp;ref=plSrch) it rains a lot where I am (UK) so I needed something waterproof.\n\nI use EndNote as a reference manager. Please at least organise your references in there, even if you also print them out.", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "89": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1475852354, "Score": 1, "Body": "I have everything in EndNote, with PDF versions of each article attached to the EndNote entry, Plus I have my endnote library (with all 400+references neatly organized into categories) saved on their cloud, on my computer, on my external hard drive, and on a thumb drive, lol. Bit neurotic about losing my data. ", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "90": {"Subreddit": "PhD", "Author": "barkupatree", "Date": 1475854174, "Score": 2, "Body": "I would only to a PhD if you have a very specific line of research you wish to become an expert on. Unless a PhD offers some terminal skill set (e.g., some clinical psych PhD programs include a licence to be a practitioner), you'll be spending time only narrowing your knowledge. Getting a master's would mean gaining a very practical skill set and getting into your field of work quickly, meaning you'll be gaining vital hands on/real world experience that'll best propel you in your field. Of course, it really varies and some industries love PhDs for administrative and research positions! Lastly, I would be careful because the last thing you want is to find yourself stuck in an open ended PhD program for 6, 7 or even 8 years — people that excel in these programs (and get out in &lt;5 years) tend to be very passionate about a very, very specific topic and are ready to dedicate everything to solve it. It's a long and painful track, which you may be totally apt to do in terms of the work load, but it really boils down to passion about science. Hope this is helpful!", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "91": {"Subreddit": "PhD", "Author": "barkupatree", "Date": 1475854303, "Score": 2, "Body": "Write! Get a head start. Review the literature you're interested in and just write for yourself. ", "Permalink": "https://www.reddit.com/by_id/t3_56371q.json"}, "92": {"Subreddit": "PhD", "Author": "barkupatree", "Date": 1475854439, "Score": 1, "Body": "It's already been said but — join a combined program! Or, find an interdisciplinary field — my PhD requires me to take classes and work with people across my campus. ", "Permalink": "https://www.reddit.com/by_id/t3_55vvxe.json"}, "93": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475857276, "Score": 1, "Body": "Thank you, thats very helpful! Sinne they are looking for many people in my field. I can start working after my Bachelor without any problem. I only thought doing a master and maybe PhD to broaden my mind and to learn other things, since I have to work for 50 more years anyways.\nBut you're totally right, the topic has to be my absolute passion when I'm spending several years in it. I thought that a PhD takes 3 to 4 years, so I didn't thought it would be that long, but if it doesn't work the right way it can take a long time... ", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "94": {"Subreddit": "PhD", "Author": "nellasbean", "Date": 1475857788, "Score": 2, "Body": "It might do you some good to speak with someone already working in industry. If you know any professors, they may know someone in the field that you can speak with.\n\nA few years ago, I spoke with a project manager at Merck who gave me a couple different perspectives on getting into the pharmaceutical industry field. On one hand, he told me that not having a PhD can almost be beneficial to you, because you can start lower in the heirarchy and work your way up. Sometimes companies will even pay for you to get more educated. PhD's saturate the job market right now, so competition is high, and you might need to complete a Postdoc before getting into the industry that you want if you don't have the skills that they want.\n\nOn the other hand, one of my friends just graduated a year ago and is now working as a Postdoc for a biotech company. He tells me it makes a world of difference in how you're treated, depending on whether you have a PhD or not. He also told me he was lucky to be able to get his job without doing a Postdoc first, strictly because he had some genomics skills that came from his PhD training.\n\nSo it really depends... \n\nAlso, training for your PhD will take years, and network you with a millieu of routes you can take outside of industry.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "95": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475860452, "Score": 2, "Body": "You may experience an issue, where the phd actually Huerta you in the industry.  You may be viewed as expensive,  difficult and too smart (you will get bored and leave). A phd in engineering is a weird thing.  You may be happier looking at a different type of MS degree, instead of a phd. Something like statistics or an mba, may fair better.  Do what you want to do though. Phd isn't terrible or anything but i just want to share the things that i have heard and experienced in the industry.  (I only have a master's in engineering.)", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "96": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1475870715, "Score": 1, "Body": "PhD is not for you. Don't waste your time. I would get an internship before the MSc.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "97": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1475876875, "Score": 5, "Body": "For a second I thought you were talking about doing research on the twitter platform (it's highly used for data mining).  \nBut really you're talking about a twitter following. I'll give you the advice multiple professors have given to me: the only thing that matters is your publication record. A stellar twitter following won't make up for a poor record. And if you have a stellar publication record, other academics will be more inclined to follow you on twitter. So that should be your focus.", "Permalink": "https://www.reddit.com/by_id/t3_56dpp9.json"}, "98": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1475887932, "Score": 5, "Body": "You're overthinking this way too much. I use it sparingly, others I know don't at all or have hardly any followers. No one cares. It's all about the quality (and quantity) of your research.  ", "Permalink": "https://www.reddit.com/by_id/t3_56dpp9.json"}, "99": {"Subreddit": "PhD", "Author": "readmethings", "Date": 1475911300, "Score": 3, "Body": "I don't think the number of followers you have is more important than your publishing record. Publishing in high impact journals &gt; most things in academia.\n\nHowever, I think the 'value' of academic Twitter is different- you connect with other researchers, the 'inter' and 'cross' disciplinary discussions can flourish, and you could, potentially, disseminate research to a wider audience. \n\nI used Twitter well before I returned to academia when I was working on the issues I now research, so in terms of access to information or 'thought leaders' and academics in my field, I had a bit of a headstart. It's a great way to keep up with what's going on 'around' your work, and what the people you want to work with/whose work you admire are doing. It's also super helpful when you're at conferences- when you're using a conference hashtag &amp; end up having conversations online &amp; build important research relationships with some of them- I did that at a conference recently and we're throwing around ideas for a paper we want to co-author at the moment. \n\nSo, I don't think it's essential; but I think it can build connections that may be helpful.", "Permalink": "https://www.reddit.com/by_id/t3_56dpp9.json"}, "100": {"Subreddit": "PhD", "Author": "SparedByTheGenius", "Date": 1475920953, "Score": 1, "Body": "Solid advice, thanks.", "Permalink": "https://www.reddit.com/by_id/t3_56dpp9.json"}, "101": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1475939096, "Score": 2, "Body": "I did my PhD after about 7 years of industrial work. You need to do a robust cost benefit analysis. My PhD does follow well from my industrial experience, is comparatively applied, and is at an excellent institution. I had the liberty of spending a coupe years waiting for the 'right' PhD, and my main motivation for doing it was around leveraging it for consultancy.\n\nHowever, it is at best useless in the jobs market unless you are going for a very specific role that requires a PhD, e.g. pharma research or academia. Conventional industry will not value it. Hence it's good to get it done early so that you can still apply as a 'graduate'. It was a bit of a shock to me, but here you have it, I am the most qualified I have ever been,  but now working for less money than before my PhD.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "102": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475947106, "Score": 1, "Body": "I didn't see if you were in the US? There it is 5 years however, in other countries (European countries, Asian countries, Australia) it is 3-4 years after honours or masters.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "103": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475954698, "Score": 1, "Body": "I'm from Germany actually :) ", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "104": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475954865, "Score": 1, "Body": "Thanks for your answer. I finished one year of time doing different internships in my Bachelor already and will do one or two more before finishing my Masters.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "105": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475955419, "Score": 1, "Body": "Thank you for all your insightful answers! What I should mention, is that I'm from Germany and in the field I will be working, everyone is getting an easy Job since there are many people needed. So it means that I don't even need a master. I just feel like I'm interested in education and it would benefit my personal development, not so much to get a job.\n\nAt the moment I'm doing different internships already and I see that most of the people in higher positions don't have a PhD. So it isn't necessary to have one in this field.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "106": {"Subreddit": "PhD", "Author": "Fesskon", "Date": 1475955736, "Score": 1, "Body": "I also thought of doing an mba or some masters more into economics since I'm generally interested in many topics. ", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "107": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1475963433, "Score": 0, "Body": "If you do economics,  do a phd...it will be paid for and you get a stipend.  It is also one of the few phd that is easily employable", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "108": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475966481, "Score": 1, "Body": "My supervisor is German and I'm hopefully heading over there on a DAAD grant next year! My supervisor said that the minimum time for a PhD in Germany is 3 years but most of the people he knows will finish in 4 years.", "Permalink": "https://www.reddit.com/by_id/t3_567f6i.json"}, "109": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1475966879, "Score": 5, "Body": "Put together a PDF of all the research you've done. Some people like to call that a dissertation.", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "110": {"Subreddit": "PhD", "Author": "justaway3", "Date": 1475968633, "Score": 1, "Body": "I was a tech in his lab for 3 years and the study is almost but not quite done so no dissertation. ", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "111": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475974563, "Score": 1, "Body": "Can't go wrong with a bottle of wine/whiskey or whatever", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "112": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1475978116, "Score": 5, "Body": "Hey, neuroscience PhD candidate with a lot of machine learning overlap here.  \n  \nDo whatever you think is more interesting. You're going to spend a lot of time and money on your PhD, why do it in something that you're not as interested in? The experienced professors are right: if you're not interested in your field, your work won't be as good, and your outcomes will be worse.  \n  \nBesides, nobody can tell what will be the \"hot\" field 10 years from now. Odds are you will be able to apply your neuroscience-based research to ML if you decide to go that route later.", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "113": {"Subreddit": "PhD", "Author": "gneisscleavage28", "Date": 1475979413, "Score": 1, "Body": "Sorry about the delayed response.\n\nThis is beautiful. Thank you", "Permalink": "https://www.reddit.com/by_id/t3_51ihon.json"}, "114": {"Subreddit": "PhD", "Author": "justaway3", "Date": 1475980519, "Score": 1, "Body": "I agree but he doesn't normally drink, only during lab parties and even then he is mostly pouring drinks.", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "115": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1475980865, "Score": 1, "Body": "big bag of weed then?", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "116": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475996525, "Score": 1, "Body": "I agree that you need to be interested in what you're doing. I also think networking is ridiculously important but I don't think it has to come from your advisors network. You can get your name out there without their help. Get LinkedIn, get twitter, go to events, go to conferences and, as always, publish. Of course if your advisor has a wide network that they can introduce you to then that's great but I don't think it's necessary for success.", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "117": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1475996754, "Score": 1, "Body": "If you've been working in his lab for 3 years, is there nothing personal you can think of? I bought my supervisor some cool Lego stuff at the end of my honours because I know he loves Lego. My other supervisor has a mug from a previous student with his nickname printed on it in very large lettering. Something that is very office based and useful is a 1-2 can mini fridge that is USB powered.", "Permalink": "https://www.reddit.com/by_id/t3_56j6il.json"}, "118": {"Subreddit": "PhD", "Author": "mind_library", "Date": 1476014198, "Score": 1, "Body": "Both fields are interesting and there is a lot of overlap\nmy feeling now is that the brain&lt;-&gt;computer field is in a plateau (tell me i'm wrong please!)\nif that's the case entering a static (with respect of robotics/ML) field would feel like a bad deal and I'm afraid it'll bite me in the ass mid-PhD\n\nin my mind:\nneuroscience is very noble\nML is 80% as noble but 3 times safer", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "119": {"Subreddit": "PhD", "Author": "mind_library", "Date": 1476014680, "Score": 1, "Body": "should i start before starting my PhD (next year)?\ni  didn't think about twitter + linkedin\nthx for that", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "120": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1476015409, "Score": 1, "Body": "If you are already meeting people in the field then yes start now. Make sure you brush up on your etiquette for LinkedIn. It's a really great place to tap into unlisted positions after you graduate but you need to build the network throughout your PhD. I wasn't a huge fan of LinkedIn originally and then in a seminar the speaker said that when you meet people at conferences and you say that you'll get in touch with later, it can be hard to come up with something to say in the email when you've said it all. However, you can just add them on LinkedIn instead. Much easier, less awkward haha.", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "121": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1476015930, "Score": 2, "Body": "Make a plan and try to stick to it. Update it when you need to. This really helps with making sure you don't get carried away with one idea/section and finish much later because you haven't gotten around to the rest of the project. Plan out the larger sections and then work that plan down into individual experiments.\n\nKeep up good communication with your supervisors. Be honest early about how you work and how you would like to keep in touch with them. It could be emails or fortnightly meetings, monthly meetings whatever. They may tweak this with their experience but I think a lot of supervisor issues arise from noone communicating how they want to do things and then getting frustrated when the other one doesn't do what they expect.\n\nThe two mantras in any PhD are publish, publish, publish and write often, write early.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "122": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1476026427, "Score": 12, "Body": "Take it slow. A PhD is a marathon, not a sprint. Put aside 8-9hrs per day and work on it every day for that period. Treat it like a job. No facebook, no reddit, no personal emails during that time. Don't work on the weekends or evenings. You will burn yourself out from the stress. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "123": {"Subreddit": "PhD", "Author": "Andge0", "Date": 1476028692, "Score": 2, "Body": "http://www.slate.com/blogs/quora/2015/08/22/stem_advanced_degree_what_s_it_like_to_get_a_ph_d_in_science.html", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "124": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1476037682, "Score": 8, "Body": "\"Don't work on the weekends or evenings.\"\n\nThis. So many PhD students have zero life and begin to resent grad school for it. Set boundaries-- you CAN be a very productive researcher without working 80 hours a week. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "125": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1476043635, "Score": 4, "Body": "You can be. But you need to treat it like a job. 9-5 woking hours means actually doing productive work for 8 hours each day. That's pretty hard to do when you're self directed, but you can do it. Source: submitting CS PhD this month. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "126": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1476045370, "Score": 1, "Body": "Fine point. If you don't have the discipline, then yeah, you'll definitely need to be doing some work at home. It's about finding balance. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "127": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1476046856, "Score": 4, "Body": "\"A PhD isn't about intelligence, it's about endurance\" --dean of my dept. \n\nEvery day go through two articles related to what you think you want to do your dissertation on. Highlight relevant things, jot down some quick notes, now maybe 50-100 words on where you might use that article in your dissertation. You don't have to do it every day if you don't want to and certainly it'll depend on what sort of research you're doing, but doing little bits every day will keep your mind on the big goal while you do the boring menial classwork. It will also make it so that you're not one of those people who two months before your proposal is due is scrambling to even come up with even a research statement. \n\nAgain, a lot of this depends on what kind of research you're doing. Figure out what it is you want to study with your dissertation, find he gap, then figure out the best way to answer that gap. you are not going to solve any world problems. In that sense it's just another paper. It will make you one of the worlds experts in that specific niche area, so in that sense it's a lot more than just another paper. \n\nFrom what I've read and what I've heard there are three things that help people get through a PhD. One: that dissertation-- really feeling like you own it and it's yours. Two: a sense of community and belonging with other PhD students and your professors. Three: stop thinking of yourself as \"just a student\"-- you are more than that now. No, you're not a doctor yet, but you best start acting like one. At least in real life I don't care if youre a dick on the Internet. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "128": {"Subreddit": "PhD", "Author": "caz-", "Date": 1476047260, "Score": 3, "Body": "Write *everything* down. There is nothing worse than deciding you want to use those cool results from a year ago that you never thought you would use, and then realising you don't remember the material you used, the conditions the experiment was under, or the approximations you used in your analysis. Something as seemingly irrelevant as the clock speed of the CPU in the PC you used to do a simulation might turn out to be an important detail when you go to write up your results for publication. Record *everything*.\n\nI learnt this lesson too late. There were some things I ended up spending weeks redoing to make sure I had every detail, and there were other results I had to leave out of my final thesis altogether.\n\nIf you are doing experiments or simulations, and you have a wide range of input parameters and a wide range of results, keep all your results in a relational database. This will make it easy to find things, and also to quickly make comparisons, plot various quantities, etc., but it means you will also learn some data analytics techniques that will be very useful when you are looking for a job at the end of your PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "129": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1476052009, "Score": 1, "Body": "BCI, ML and robotics are far from static fields. You'll be able to make a career out of any of them. What *will* most assuredly bite you in the ass mid-PhD is a dissertation topic that you don't find interesting.  \n  \nI also think it would be wise to eschew all notions of nobility from academia, it's a mess out here ;)", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "130": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1476061015, "Score": 2, "Body": "A lot of good advice has already been given here. I would like to add, *set your own deadlines and stick to them.* Your advisor does not care if you ever graduate so long as you keep generating cheap labor. I spent a LONG time passively waiting for my advisor to push me along the set of graduation milestones (i.e., writing drafts of the prospectus and thesis chapters) while doing research. *Cultivate the discipline to work on writing your thesis independently from your advisor's feedback or direction.*", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "131": {"Subreddit": "PhD", "Author": "ZeMeest", "Date": 1476087077, "Score": 1, "Body": "Easier said than done when you work with infected animals that have to be checked on, or have massive experiments that have to be run in between classes before the sample loses fidelity...\n\nSource: my life rn", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "132": {"Subreddit": "PhD", "Author": "jamedz", "Date": 1476185849, "Score": 3, "Body": "That link doesn't take you to a specific paper - just the general SciFinder log in. Although If I can't get access to a paper I usually try [SciHub](http://sci-hub.bz/). Just put in the DOI or the URL to the paper. ", "Permalink": "https://www.reddit.com/by_id/t3_56x6lc.json"}, "133": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1476217756, "Score": 1, "Body": "Use google scholar instead then. Like @jamedz said, you didn't link to a specific paper.", "Permalink": "https://www.reddit.com/by_id/t3_56x6lc.json"}, "134": {"Subreddit": "PhD", "Author": "carowald", "Date": 1476249578, "Score": 1, "Body": "So I'm not in either of those fields, but I would tell you to go with what you are more interested. You're going to be researching and working in the field(s) you choose for the rest of your life. Definitely go with what will bring you the most joy, not what is the safest. If you have passion, you'll find a job after!", "Permalink": "https://www.reddit.com/by_id/t3_56jkeo.json"}, "135": {"Subreddit": "PhD", "Author": "carowald", "Date": 1476250454, "Score": 1, "Body": "One, but I had strong connections with people here before I applied. I suggest spending time networking to however many you apply to so you are more likely to get accepted :) I would also say to only apply to schools you'd be happy at!", "Permalink": "https://www.reddit.com/by_id/t3_54atwe.json"}, "136": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1476287191, "Score": 2, "Body": "Great survey! Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "137": {"Subreddit": "PhD", "Author": "carowald", "Date": 1476289632, "Score": 1, "Body": "Thanks! And thank you for taking the survey!! :)\n", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "138": {"Subreddit": "PhD", "Author": "novohash0905", "Date": 1476309126, "Score": 1, "Body": "I've got to the point where I just default to sci-hub, 99% of the time it's faster than going through the university's verification system. It also has access to everything. Best thing in science since...i can't think of a metaphor now but it's great", "Permalink": "https://www.reddit.com/by_id/t3_56x6lc.json"}, "139": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1476317437, "Score": 2, "Body": "give us money!", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "140": {"Subreddit": "PhD", "Author": "carowald", "Date": 1476322711, "Score": 1, "Body": "Haha, I wish I could, but as I am a PhD student and have no money either I have to rely on the generosity of other graduate students to give some of their time to take the survey :)", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "141": {"Subreddit": "PhD", "Author": "veggiemedley", "Date": 1476357201, "Score": 1, "Body": "Currently working on a *thesis* for MS. It looks like I will be submitting an entire semester early...because I need a job.  I don't think I'll be completely done with the small, tedious tasks, but I'll certainly be at a point where those can be handled remotely and in the evening. \n\nI suppose it came about it by just being focused my entire time here and just knowing the end goal. I read several \"how to be a graduate student\" books during my first year, so maybe that helped.", "Permalink": "https://www.reddit.com/by_id/t3_579m97.json"}, "142": {"Subreddit": "PhD", "Author": "BangarangRufio", "Date": 1476357713, "Score": 1, "Body": "Often, programs have \"general timelines\" for completion of a doctorate, but these are rarely (if ever) set in stone. My department claims to have a 5 year timeline and, thus, guarantees funding for phd students for that period of time. However, a number of students have finished in 4.5 years because they had enough data/writing to go ahead and put together their dissertation. Similarly, a good number of students finish in 5.5 or 6 years because they want more time to put together a cohesive dissertation.\n\nThis is just to say that, for many (most?) programs, the end of a phd isn't on a set timeline, but is when you have enough put together to submit and defend a dissertation. So, if you have enough and your advisor agrees, then you're ready. If either of the points of the previous sentence aren't true, then you're probably not ready.", "Permalink": "https://www.reddit.com/by_id/t3_579m97.json"}, "143": {"Subreddit": "PhD", "Author": "exilhesse", "Date": 1476376496, "Score": 1, "Body": "Seriously. Learn R, git and LaTeX. Read about reproducible analyses. You will benefit from it for your entire life.", "Permalink": "https://www.reddit.com/by_id/t3_53lbeq.json"}, "144": {"Subreddit": "PhD", "Author": "SparedByTheGenius", "Date": 1476379428, "Score": 7, "Body": "Not at all, in fact it should help. It will give you more perspective and world experience. ", "Permalink": "https://www.reddit.com/by_id/t3_57bb3y.json"}, "145": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1476402897, "Score": 3, "Body": "At my university, if you're a full-time PhD student, on scholarship, you are only allowed to work 8 hours a week. I do this and it's not that stressful. Some weeks are worse than others. If you had a stipend from a scholarship or TA or RA would you still need to work? I think if you could get one of those you would be way better off but it's not necessary.\n\nAs for children, I don't have any myself but I know many people who have completed their PhD in close to the minimum time that have children. Communication with your partner is going to be very very important. One thing that seems to come up a lot is the other person thinking a PhD is not work and that you should do more of the child care/housework ect than they do. This won't work. You will sometimes need to bring work home with you after being on campus all day. This shouldn't occur every day but sometimes deadlines and important work comes out of nowhere. This tends to mean you have to work about 12 or so hours that day and are still expected to look after the children.\n\nBottom line is it all comes down to communication to make it work. With your partner foremost but also with your supervisor. Honestly, if your current advisor says you can't do it with children then you might need to change to someone else for PhD because they will not be supportive or give you advice when you need it.\n\nIf you don't get many responses here, maybe try r/GradSchool. It's a more active subreddit than this one.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "146": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476403354, "Score": 1, "Body": "Wow, thank you so much. Do you mind if I ask about the stipend for TA or RA work? I know that people do this, but I don't know how it works/ how much you can expect to make doing that. If it were enough I could potentially quit my job. \n \nI'm fortunate to have a very supportive partner who understands that school is my work. It's very encouraging to hear that other people have made it work! I'll definitely post in /r/GradSchool and see what other folks say. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "147": {"Subreddit": "PhD", "Author": "paranitrophenol", "Date": 1476403398, "Score": 2, "Body": "Yeah go for it, if anything it'll help your chances of admission. Wish I had the chance travel before I had started.", "Permalink": "https://www.reddit.com/by_id/t3_57bb3y.json"}, "148": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1476406557, "Score": 1, "Body": "You would probably have to ask someone from your country I would say (I'm guessing you're in the US? I'm in Australia). Here we apply for a federal government scholarship which is $32500 tax free a year and then we can do 8 hours of work which is normally teaching and that is another $200 or so a week. Once we receive our scholarships, as long as we don't go onto conditional or anything like that, it is guaranteed for three years (this is the minimum length of a PhD here).\n\nIn the US I believe there is also fees if you don't get funded by a TAship or RAship. I think this is quite expensive. I'm not sure how expensive though because our universities pay the fees here because they know we won't do the PhD if they don't.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "149": {"Subreddit": "PhD", "Author": "Ktsockmonkey", "Date": 1476412407, "Score": 4, "Body": "I started my PhD with a child under one and had a second child last year. . I took about 9 months off after the birth of both my boys and have them both full-time in daycare now. I also work as a TA and researcher. It is completely possible to do a PhD with children and work as long as you lower your expectations of yourself. I accept that it will take me longer to finish if I want to keep a good work/school/family balance. I wish I could be farther along, but having weekends and evenings with my family is more important. Having an awesome husband is also helpful. He totally understands the demands and helps out as much as he can. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "150": {"Subreddit": "PhD", "Author": "bobwoodshed", "Date": 1476412624, "Score": 13, "Body": "Plenty of graduate students are also parents, but anecdotally the ones who navigate it successfully are those who have a plan.  You cannot over communicate with your spouse and you both have to consider whatever your plan is to be fair.  Kid gets sick.  What's the plan?  Kid needs day care.  Can you afford it?  You get home from school/work/whatever and need to hole away for the rest of the night to write.  Is the spouse ok solo parenting?  Those are the types of things you should be thinking about ahead of time and make sure you're both OK with whatever the answers are.  \n ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "151": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476413807, "Score": 2, "Body": "Thank you for this. We take care of my 6-year-old nephew one or two days out of the week, and although that isn't full time and it's very different from a toddler, I think it has given me some insight into how that might play out if we had children of our own. I'm confident in our ability to work together and in his ability to support me in this. But those are definitely conversations that he and I need to have. Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "152": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476413898, "Score": 1, "Body": "That is so amazing to hear! Thank you for giving me your insight. I can be totally okay with it taking longer as long as it eventually gets done :) It sounds like I need to look into TA work and compensation as well as leave.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "153": {"Subreddit": "PhD", "Author": "lakica", "Date": 1476428556, "Score": 6, "Body": "I'm a single mom of three wild  boys and I'll be defending my PhD next spring :) I know lots of folks  doing, or who have done PhDs with kids.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "154": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1476432564, "Score": 7, "Body": "You're getting a ton of support here, and that's great, but let me offer some competing advice. I'm skeptical it's worth it. My dad was a primary care taker and ended up ABD due to childrearing. Similar stories are abound. Some questions / advice.\n\n1. Why a PhD? If it's for industry, don't. You're able to do most in psych without a PhD. If it's to be a professor than it's necessary.\n\n2. What's your husband doing? Will he be helping significantly with childrearing? You'll need him to.\n\n3. Money. How much does your husband make? How much would you receive at the programs you realistically can get into? Kids are expensive. Also while you may be able to do a few odd jobs on the side realize a PhD is a full time job and most programs forbid you from holding another job. Unless your husband is rich you are an absolute sucker if you aren't getting a full tuition waver plus salary (this goes doubly, because nearly all good programs offer full funding. A PhD from a bad / for profit school is nearly worthless).\n\n4. Why now? If you're young could you put off kids for five years? Having a kid as an assistant professor is easier due to the far higher salary and learned habits in regard to publishing.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "155": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1476440550, "Score": 4, "Body": "get a new advisor. \n\nseriously. yes it will be bloody hard, but it will be *that much harder* if your supervisor/department doesn't get it and doesn't have your back. speaking from experience here.\n\nhaving said that, there's nothing wrong with deciding to do one first and then the other. just because you *can* do both at the same time, doesn't mean you should. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "156": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1476446652, "Score": 2, "Body": "No, I had two children (4 and 1) when I started grad school in 2008 (Molecular Bio PhD) and I finished in 5 years. I had a very supportive spouse and we were poor as hell, but it's doable. \n\nI worked in a lab with two women each (independently) had babies while in grad school. They each only took the 6 weeks off for maternity leave that you are allowed, and it tacked an extra semester or so onto each of their degrees. Childcare and nursing were issues (one didn't nurse at all, the other did nurse and had wealthy parents who paid for childcare). Again, not something easy to do, but it's possible. \n\nI got a stipend while in grad school which was nice, but I was also forbidden from working any other paying job, so that limited my income. This will depend entirely on your degree program. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "157": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476453538, "Score": 2, "Body": "Holy cow! That's really amazing ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "158": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476453743, "Score": 2, "Body": "I think that might be a safer choice. I have a tendency to take on a lot at once, but I may choose to get my Masters now and my PhD later", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "159": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476454780, "Score": 1, "Body": "Thank you for sharing your experience!", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "160": {"Subreddit": "PhD", "Author": "dbrass", "Date": 1476484414, "Score": 3, "Body": "I had two childs during my Master degree and now I'm a full time PhD student with pre-school kids. \n\nI would thus say that it is possible. The most important is that you need to be organized. Don't slack during daytime and don't expect to be productive when you'll be back home. With proper time management and self-control you can get through it. In every aspects of your life you'll need to consider your childrens. For exemple, you won't be able to skip a meal or eat really late to finish some work. You also can't pull an all-nighter last minute rush because your kids could be sick and wake up in the middleof the night  and anyway they will wake up at their usual time the next morning... \n\nAlso, I'm lucky to have an advisor who is a year older than I and who has two young kids. He is understanding of my situation when kids get sick (because they really do). He know that I don't take days off unless my kids are sick. Also, when I can, I try to work in the evening when the kids are in bed. \n\nBest of luck in your project!", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "161": {"Subreddit": "PhD", "Author": "EvermoreCR", "Date": 1476541120, "Score": 2, "Body": "I had one child, full time job, and I think 50% done of my PhD. Is hard but possible.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "162": {"Subreddit": "PhD", "Author": "648734678", "Date": 1476553040, "Score": 2, "Body": "If you don't have children yet I'd say concentrate on getting your PhD first.\n\nI'm a 29 year old PhD student and I'd love to have children now, but if I wait until I graduate I'll be eligible for maternity pay through work etc.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "163": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476558241, "Score": 2, "Body": "I'll be having children (or at least one child) before I enter a PhD program-- I'm currently eligible for some of the best maternity leave available, as well as zero co-pay for childbirth, and those things won't be available to me once I finish my PhD because I won't be working in the same place. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "164": {"Subreddit": "PhD", "Author": "648734678", "Date": 1476558460, "Score": 2, "Body": "For me I wouldn't be entitled to any, the best I would get is unpaid leave. I'd get much more maternity pay from an employer when I graduate though.\n\nIs it because you are a research associate doing a PhD part time? I hear they're well looked after.", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "165": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1476558728, "Score": 1, "Body": "No, I'm working as a research assistant for free for the experience. I'll start doing it for uni credits next term, tho. \n \nMy insurance is through the hospital that I work part-time for. I have amazing benefits through them right now, but I'll have to stop working here when I start my PhD program and I will, of course, not be coming back. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "166": {"Subreddit": "PhD", "Author": "lock-groove", "Date": 1476706405, "Score": 1, "Body": "I am studying in Venice, Italy. In Italy the selection process is quite different from other countries in Europe (Germany, France), but similar to others (Spain, Portugal). Once a year the university issues a public call for admissions, awarding grants to the highest placed students. I think we adopted this system because if the selection process is not based only on one professor or research group, it's easier to fight nepotism, a problem we have in all layers of society. Having a public call requires a clear system of evaluation, therefore it's harder to put in a totally unprepared person (but you can still do it if you require the exact profile of the person you want to pick).\nIf you want an example of doctoral announcement, here (http://www.iuav.it/English-Ve/Internatio/phd/HOW-TO-APP/---academi4/Doctorate_Announcement_2016-2017.pdf) is one from my university.", "Permalink": "https://www.reddit.com/by_id/t3_55t1qd.json"}, "167": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1476707087, "Score": 1, "Body": "Most UK universities will have teaching assistant (TA) positions that are advertised in house for their PhD students. I am not sure how many of these, if any, would be given to visiting PhDs as they are usually reserved for resident PhD students so that they can get teaching experience on their cvs.\n\nYou might be able to get a guest lecture or two at some universities around the UK, and they would pay you a once off fee, but again these are usually organised well in advance (often a year) and would not be a steady source of income. \n\nThat is all I can help you with I am afraid. As a side note, why are you worried about being paid in Euros and dealing with pounds? Once you are in the UK and have an address you can open a bank account and use services like transferwise to move money about.\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_57ravh.json"}, "168": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1476732694, "Score": 3, "Body": "I am a 3rd year PhD in STEM field and practically no one from my program had any experience coming in. No one cares about it. More important is to know if it is REALLY what you want to do for the rest of your life because you path is pretty much set by your PhD, if it was not a waste of time.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "169": {"Subreddit": "PhD", "Author": "rjj9", "Date": 1476735985, "Score": 1, "Body": "Thanks for the advice! Did you or anyone from your program come in with a different undergrad background?", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "170": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1476739927, "Score": 2, "Body": "It depends on the program. In my program basically everyone has prior research experience - they don't accept people without it. I worked in 2 research labs in undergrad and thay really helped me. But, again, it depends on the program and most likely the school.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "171": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1476743679, "Score": 2, "Body": "In my U.S. engineering program, prior research experience mostly influences whether or not you get funded through a research assistantship. In particular for my lab group, people without prior research experience will usually be brought on as an unfunded M.S. student for the 1st year, and contingent upon their success, will be given funding to pursue a Ph.D.. Funding vs no funding equates to a ~$300,000 difference once you consider the stipend and tuition waiver over the course of 4-6 years, so it really is a big deal.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "172": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1476744013, "Score": 3, "Body": "As everyone has alluded, it heavily depends on the type of field you're applying for. What area are you looking at?", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "173": {"Subreddit": "PhD", "Author": "MaxwellDemons00", "Date": 1476744937, "Score": 3, "Body": "Agreed --- everybody in my program has prior research experience. I think it depends on the program you want and if you want to go R1/R2/etc. And a lot of people from my dept. had different undergrad majors, so they had research experience in their old fields.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "174": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1476745359, "Score": -1, "Body": "I think you will benefit from being coached by some of us lol", "Permalink": "https://www.reddit.com/by_id/t3_57ziyr.json"}, "175": {"Subreddit": "PhD", "Author": "potential_phd_coach", "Date": 1476745549, "Score": 1, "Body": "Potentially. I just wanted to offer specific support that I'm well-versed in.", "Permalink": "https://www.reddit.com/by_id/t3_57ziyr.json"}, "176": {"Subreddit": "PhD", "Author": "istudyscience", "Date": 1476749672, "Score": 2, "Body": "I think another question to ask yourself is if you've never had prior research experience- how do you know you even want to go to graduate school? Prior research experience is more than just gaining experience in a field, but really understand if this is something you are okay doing for about 5-6 years.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "177": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1476767039, "Score": 2, "Body": "yes we all had different backgrounds - physics, math, astronomy, mechanical eng, electrical eng, and computer science are some examples of people in the same PhD program.  ", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "178": {"Subreddit": "PhD", "Author": "mohataher", "Date": 1476789793, "Score": 3, "Body": "I'm currently funded by the same scheme. My advice is simple; stay away. It will not add anything to your set of skills and won't advance your career since you're already a senior. In fact, it will block your career.\n\nWhat you will learn in the next four years will not compensate the financial losses. You mostly already know it. \n\nBe careful, those who invited you to the interview are happy because they're stealing a senior like you to work nearly for free. They'll make everything sound amazing until you sign and get involved with them. Then, the tone changes and you have to be a compliant student. \n\nStay away.", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "179": {"Subreddit": "PhD", "Author": "justspendingtime", "Date": 1476791817, "Score": 1, "Body": "Thank you - helpful and clear advice!\nThis echoes the thought process of the more rational side of my head, and it's encouraging to hear the same from a PhD student as well.\nIt didn't occur to me that they would be excited to have me for the sake of free labour - I'll make sure I bear that in mind!", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "180": {"Subreddit": "PhD", "Author": "rjj9", "Date": 1476800680, "Score": 1, "Body": "I'm looking primarily at Political Science (International Relations) programs, but also some history programs, as well.\n\nIt won't be STEM, where I'd assume research experience is more crucial. Am I correct in saying that?", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "181": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1476809914, "Score": 2, "Body": "Oh god yes, please yes. \n\nI was literally just looking for a life coach or motivational interviewer to help wit this!", "Permalink": "https://www.reddit.com/by_id/t3_57ziyr.json"}, "182": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1476811141, "Score": 3, "Body": "Your use of the term \"course content\" makes me wonder how well you know what a PhD is really like, but maybe it's just a fluke of wording.  Have you actually talked to several PhD students and recent grads in your field to get an idea of what it's like?  I ask because, well, there's no real *content*.  It's just you, doing research, day in and day out, for at least 3 years (UK funding is mostly 3 years).  If you're lucky you'll get along well with your supervisor and finish within the time frame of the funding, but a lot of things can go wrong, it can be very isolating, and your motivation might not be enough to get you through the tough times.\n\nThat said, your experience as a professional may work well in your favour - you'll probably have more relevant knowledge, better time management skills, and a more mature outlook on your work than your fellow fresh-out-of-uni colleagues.  ", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "183": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1476814581, "Score": 6, "Body": "&gt; I'm applying to be a PhD candidate\n\nMan, I should have done this -- could have skipped the courses, comps, and proposal. Or just apply right away to be a PhD graduate - even better!", "Permalink": "https://www.reddit.com/by_id/t3_585bi6.json"}, "184": {"Subreddit": "PhD", "Author": "Invyz", "Date": 1476815750, "Score": 2, "Body": "Wasn't aware of the difference between candidate and student...thanks", "Permalink": "https://www.reddit.com/by_id/t3_585bi6.json"}, "185": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1476838114, "Score": 2, "Body": "Arguably that's a healthy about of paranoia.", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "186": {"Subreddit": "PhD", "Author": "SpottedPaws", "Date": 1476838429, "Score": 1, "Body": "When you're at 80 pages and 400 articles, it seems the right amount. The only problem is remembering to save all my changes in all those places. ", "Permalink": "https://www.reddit.com/by_id/t3_561wjf.json"}, "187": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1476842160, "Score": 1, "Body": "I work full time and have 4 kids (2 bio, 2 step) all between 8 and 4years old.  My DH works full time too but we try to balance it.  I'm struggling right now to find motivation and balance but that's just because I'm struggling to write.  I'm nearing the point that I'd be defending my dissertation proposal...it's hard with kids and other commitments, but I just try to stay realistic and positive.  I know I am 3 years in and understand it may take me 5-6 years versus 4 if I could do this full time.  I also know that I just need to be focused and do my best!", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "188": {"Subreddit": "PhD", "Author": "Lost7176", "Date": 1476842525, "Score": 2, "Body": "I don't know your field, full disclosure, I'm in marine science and conservation.\n\nIn my field, fit and advisor are the most important things. If you're going to be doing research (which is almost certainly the case in most fields), you should pick your school based on the kind/quality of research it offers, and who you could end up working with. That matters way more than a school's ranking in most fields. Additionally, a mid-range candidate that the advisor knows and likes is going to have a much better chance than an exceptionally qualified candidate who the advisor doesn't know. Introduce yourself and, if you can, get to know one or more faculty at your top choice, it will make a huge difference since they're usually the ones making the admissions decisions.\n\nAlso, if you can score some money, even a small grant, that makes you look great. Hell, even just applying to grants before you go looks good, regardless of whether or not you get them. It shows that you're aware of how science and research work these days.\n\nThen again, maybe your field is very different from the other sciences that I know...", "Permalink": "https://www.reddit.com/by_id/t3_585bi6.json"}, "189": {"Subreddit": "PhD", "Author": "biznatch11", "Date": 1476844061, "Score": 3, "Body": "Several people in my program used \"candidate\" on CVs, business cards, email signatures, etc. from their first day in their PhD program and thought I was being stupid when I tried to tell them there's a difference between student and candidate :S They though candidate and student were the same thing and candidate was just more formal/professional sounding.", "Permalink": "https://www.reddit.com/by_id/t3_585bi6.json"}, "190": {"Subreddit": "PhD", "Author": "justspendingtime", "Date": 1476877839, "Score": 1, "Body": "It's a CDT - there are taught modules during the first year (MRes), in which I have a strong interest, and these are what I was referring to when I said 'course content', although I appreciate that this is a confusing way to put it. I've worked in academia before, and have a research based Masters (MChem) in which I was working alongside PhD students. In addition a number of my friends and the majority of people I work with have PhDs, and I have discussed these with many of them on numerous occasions. All in all, I'd say I have a robust understanding of what a PhD involves, and just how much independent work is involved.\nI know that I'm capable of independent work, thanks to my MChem and my industry experience (I'm currently in a start-up, and a large amount of the direction in my work, and some of the work of the people around me, comes from me).\nI personally would say my motivation and resilience are up to the task, and my time and workload management skills have improved considerably since the days of my Masters degree.\nI know I'm capable of doing a PhD, and doing it well, but the issue I'm really struggling with is whether or not it makes sense to leave a lucrative and interesting job to commit 4 years of my life to it.", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "191": {"Subreddit": "PhD", "Author": "ElizabethPhD", "Date": 1476884693, "Score": 1, "Body": "I was in your position about a year ago I thought having previously completed a research masters whilst working full time, with a 3 hour round commute, planning a wedding, caring for a sick mum and maintaining a relationship, and being exceptionally organised, I could do it no worries and you probably can if you're in no rush to finish...but...a phd is by nature very up and down / mutable e.g in my second year, my supervisor left, data collection was delayed and I received scholarship which was great news but meant that suddenly everything has to be completed within a year!! We compromised on a new puppy in May and I'll just say I'm glad we did because as I'm trying to finish data collection and analysis, write up chapters, attend conferences, care for pup and cook/clean etc, I barely have time or mental energy to talk coherently to my husband let alone look after a newborn. So, I would say, if you have strong financial support (lots of savings!!), a hugely supportive (domestically orientated!!) partner and are in no rush to finish the PhD or gain an academic position right away then it is possible but not for the faint hearted. I am so glad I made the decision to wait...but we're all different so do what you feel and good luck! :) ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "192": {"Subreddit": "PhD", "Author": "ElizabethPhD", "Date": 1476886498, "Score": 1, "Body": "Done :) all the best ", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "193": {"Subreddit": "PhD", "Author": "carowald", "Date": 1476891182, "Score": 1, "Body": "Great! Thank you so much!!", "Permalink": "https://www.reddit.com/by_id/t3_572gac.json"}, "194": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1476891357, "Score": 1, "Body": "Have you cross posted this is any of the digital currency sub reddits? It may skew the sample, but just thought I would ask...", "Permalink": "https://www.reddit.com/by_id/t3_5897ny.json"}, "195": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1476901966, "Score": 1, "Body": "Our lab uses Serum Clot Activator Tubes. You can skip the waiting for the blood to clot part with these tubes. When you spin the whole blood in these tubes, the gel will separate the serum from the rest of the blood. The pure serum will on top of the gel. We were using the serum for cell free DNA PCR and we do second \"hard spin\" (16,000rpm for 10min) to remove any debris. \n\nhttps://us.vwr.com/store/product/4648883/vacuette-serum-clot-activator-tubes-greiner-bio-one\n\nHope this helps!", "Permalink": "https://www.reddit.com/by_id/t3_58ah4q.json"}, "196": {"Subreddit": "PhD", "Author": "MichaelEasy", "Date": 1476902910, "Score": 1, "Body": "Ah, would be helpful if i could have my own coagulation formula.  These tubes are coated with silica, aiding the clotting process.\n\n:( Thank you though!", "Permalink": "https://www.reddit.com/by_id/t3_58ah4q.json"}, "197": {"Subreddit": "PhD", "Author": "FreethePhD", "Date": 1476920309, "Score": 1, "Body": "definitely!  Now is the time to think about the next step; it's NEVER too early.  The reason is because we have to work the human network in some way shape or form in order to move from one place in life to the next in careers, just like any other aspect of life.  People in science all too often get hung up on just working, and neglect the other things that matter when it comes to finding a job, like getting some experience, exploring options ahead of time, and making some friends or advocate who can help when the time comes.  I suggest taking a look at the cover letter template on my website (freethephd.com) and see if you know how to fill in the blanks for some positions outside academia that you find attractive (could be anything from scientific research in industry to government work with your background).  Remember that what you study, and the value you bring to a future employer, are not one and the same.  You bring your whole self to your future career, and that includes your other skills away from the bench, and even more so if you're not interested in academic research.  ", "Permalink": "https://www.reddit.com/by_id/t3_52akt6.json"}, "198": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1476921262, "Score": 3, "Body": "As someone who didn't have great mentoring through my PhD process, I'm in full support of your article. Academia is extremely difficult to navigate and having strong contact with experience would be very helpful.", "Permalink": "https://www.reddit.com/by_id/t3_58a3bc.json"}, "199": {"Subreddit": "PhD", "Author": "ioarou", "Date": 1476947605, "Score": 1, "Body": "Survey has been circulated by many means. As far as reddit is concernet, it has been published in many subreddits, not only digital currency oriented, but businness, economy, eu, etc. Thank you.", "Permalink": "https://www.reddit.com/by_id/t3_5897ny.json"}, "200": {"Subreddit": "PhD", "Author": "Luminiriel", "Date": 1477083735, "Score": 3, "Body": "It's about the same as adopting a toddler. Requires a lot of time, energy, and attention. A puppy will not be happy left alone for long stretches of time, at 10 months it'll be a bit easier if you can hire a walker or if there's a puppy play-group service in your area for when you're in the lab. ", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "201": {"Subreddit": "PhD", "Author": "JabberwockyPhD", "Date": 1477086781, "Score": 2, "Body": "I got a Yorkie puppy maybe a year into grad school. It was fine for the most part. The potty training took a year but that's bc I trained him on wee pads (small dog, small bladder). The transition period took a lot longer than I expected but in the end he was trained. In the beginning I would take long lunches to run home and let him out. Tbh I had much more time to spend with him in grad school than when I started working. I was fortunate to have a PI that cared more about getting work done than \"clocking in\". If you can, find a PI that is flexible. ", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "202": {"Subreddit": "PhD", "Author": "meeshathecat", "Date": 1477091601, "Score": 2, "Body": "I am at a good psych post grad school in the UK and I have to say that in my experience what your advisor said is BS - I also lecture and run a charity, am in a long term relationship (8 years) and many of my colleagues have children, one of my former colleagues who actually fell pregnant during her phd and had a child (with a year out) has just won a very prestigious award from the APA - if this is your schools attitude - find a new school ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "203": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1477096315, "Score": 1, "Body": "As long as you adopt and are prepared to give them your full attention, like seriously (walks everyday, vet care, etc.) get one. Otherwise, no. I would also suggest not adopting a puppy. Sorry but you are going to be spending more time working and it is just not fair to the puppy.", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "204": {"Subreddit": "PhD", "Author": "Salad_Phallus", "Date": 1477097641, "Score": 1, "Body": "That's fantastic! Thank you so much-- that's really great to hear. I honestly think that our advisors tend to say those things as a way to deter students from \"complicating\" their lives while they're in school, but I think that if I said \"I'm pregnant and want to go to grad school\" they would help me make it happen. I attend a school with a very non-traditional population of students, so it was surprising to hear them say things like that. ", "Permalink": "https://www.reddit.com/by_id/t3_57dfw8.json"}, "205": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1477100324, "Score": 2, "Body": "I adopted a greyhound six months into my PhD. I had fostered them before so I knew the breed and mine was a resurrender so she was 8 when I got her. I didn't have a problem and it was good in a way because it forced me to go home at 530 and feed her most days. My partner is rarely home before 10pm with his work so this is mostly my responsibility. If I have to be there late we have fall back plans though.\n\nI would also not suggest getting a puppy, get a dog. Puppies need more attention and training and you'll be stressed enough as it is. If you adopt a dog you'll know it's temperament beforehand and how much exercise it needs.", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "206": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1477104275, "Score": 9, "Body": "I don't think this accurately measures their value to you so much as their value to the institution. While papers, grants and connections are important, the most important thing is going to be how well the group fits you. This is more to do with social values, how they work, when they work, how often they schedule meetings, how they handle giving you feedback ect ect. Some of these things you can get from the supervisor themselves but their current and previous students are the most help. I guess you could also include how often they're at the university and how many other students/responsibilities they have. Their availability to you is possibly the most important thing.", "Permalink": "https://www.reddit.com/by_id/t3_58r1mw.json"}, "207": {"Subreddit": "PhD", "Author": "ProfessorBurns", "Date": 1477109894, "Score": 2, "Body": "Think of the most important thing to you. For instance, landing a good postdoc so that you can eventually get a good tt job. What are the most important factors, or the elements that are best aligned with that happening that you can assess? Weight those highest. \n\nIn the short term, interpersonal relationships with you advisor and lab mates will be important in terms of keeping you sane in grad school, but still, the longer term metrics aligned with your goals trump everything.\n\nAs am example, you may love the lab and the PI, but if all of their grads ended up as permanent postdocs in shit labs, then you wasted your time. \n\nThe converse is a little tricky. If you find a PI who's an asshole, bit cranks out grads who land great postdocs who get good jobs, then one of two things might be happening. 1) the mentor is worth working for as they can help with your goal or 2) they happen to graduate students who would do well regardless of who they were mentored by. It's a tough call.\n\nYou also need to bear in mind that if you have a hard time fitting in with the lab or getting along with the PI, it's a really long haul and you will be very tempted to quit (this also explains the \"all my grad students do well even though I'm an asshole\" thing as well. Everyone else might just drop out of the lab and thus don't get counted).\n\nBest of luck.", "Permalink": "https://www.reddit.com/by_id/t3_58r1mw.json"}, "208": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1477122782, "Score": 3, "Body": "What about fieldwork? Who will watch them if you have to disappear for months at a time?\n\nWhere will you go after your PhD? What if you need to move abroad?\n\nCan you definitely say you are going to be able to give this dog the full amount of attention and care it deserves for the next *10-15 years*?", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "209": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1477126755, "Score": 1, "Body": "&gt;I can bring the dog with me to the lab/office everyday - so they won't be alone for long.\n\nI'm mostly curious about how you know this, given that you're only just applying now.  I've worked in a lot of labs and we would *never* have allowed a dog in any of them.\n\nThe obvious H&amp;S problems aside, what if one of your colleagues is allergic?", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "210": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1477126857, "Score": 1, "Body": "Getting a dog will mean that you will have to look after them and take them out for walks, and this is a GOOD thing!! I know so many PhD students who have burned themselves out by trying to work 24/7 if you have a dog it will force you to have a break and that can only be good for your mental health :)", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "211": {"Subreddit": "PhD", "Author": "caringrobot", "Date": 1477156635, "Score": 1, "Body": "Well the dog I'm getting is hypoallergenic so that won't be a problem. But I know because my current geology department is like that - my family dog comes to work with me everyday. Also, I have asked people (grad students, prospective PI, etc) in each program I'm applying if the case is the same in those schools - all said yes. I had no idea this was even a thing until I started at my current lab!", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "212": {"Subreddit": "PhD", "Author": "fulis", "Date": 1477157513, "Score": 1, "Body": "I don't agree, plenty of PhDs who go into industry don't work on the same thing they did their PhD on. I doubt I will (who knows), but I'm doing a PhD because I like my topic and my workplace, not for my career (I don't give a shit). So I won't see it as a waste as long as I enjoy it.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "213": {"Subreddit": "PhD", "Author": "barkupatree", "Date": 1477160967, "Score": 1, "Body": "I have a dog and I'm in my second year. Grown up around dogs and everybody in my family has one — that's to say, I'm a dog person. \n\nI would NOT get a puppy in your first year. Adopt an adult dog instead, who are much easier to care for and way less expensive! Puppies are expensive, will (no matter what you do) destroy a few things in your home (both costly and if it's an apartment, you could get in serious trouble with your landlord), and they have endless amounts of energy. They need regular supervision and, for most breeds, extensive exercise (and even then will STILL demand your attention — not that great when you're running an experiment). Not only will you lose valuable time trying to train and take care of your dog, but the level of stress is high and you do not want to exhaust yourself as you adjust to your new program.\n\nAdopting an adult dog still is a lot of work, however they are way more manageable in terms of cost, time, and stress. Plus, there are plenty in need of a good home! I got my dog when she was 6. I still got the reward of having to train her, and honestly she is so central to my ongoing well being while in grad school.", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "214": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1477177266, "Score": 1, "Body": "I agree with this. Availability coupled with a positive relationship is #1. ", "Permalink": "https://www.reddit.com/by_id/t3_58r1mw.json"}, "215": {"Subreddit": "PhD", "Author": "abloblololo", "Date": 1477237774, "Score": 1, "Body": "The competitive thing sounds horrible, but it seems very american. I've not experienced it in the two european countries I've sampled. The work atmosphere is one of the best things about my current uni I'd say.", "Permalink": "https://www.reddit.com/by_id/t3_546guk.json"}, "216": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1477293536, "Score": 2, "Body": "&gt; grad students, etc\n\nSure, but the grad students aren't the ones who decide.  The lab manager or professor is, and their decision is based on factors you have no control over.  Until you've joined a group, you don't know what equipment or samples are in their lab, what the layout and vulnerabilities are, or if there's someone in the group who's afraid of dogs or from a culture where they're considered dirty or dangerous.  I'm not saying this will be impossible - maybe it will work out fine - but you need to consider now that it might not be acceptable, and decide if you+your dog are going to be a all or nothing package when it comes to your graduate education.", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "217": {"Subreddit": "PhD", "Author": "BertMacklins", "Date": 1477354048, "Score": 2, "Body": "Is it just ESPRC funded or is there an industry partner too, because if there is, they offer a 'top up' to the standard funding if I think up-to a third or something like that? It might be negotiable if you are as senior as it sounds. ", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "218": {"Subreddit": "PhD", "Author": "illa_puella", "Date": 1477394490, "Score": 4, "Body": "I mean, I feel like this is a pretty obvious question. Why would you sit around passively, when you can be proactive? What is the reasoning behind your question?\n", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "219": {"Subreddit": "PhD", "Author": "SparedByTheGenius", "Date": 1477396326, "Score": 1, "Body": "It is but I am just trying to figure out how to be more proactive. Any thoughts?", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "220": {"Subreddit": "PhD", "Author": "ElizabethPhD", "Date": 1477396874, "Score": 1, "Body": "I got a gorgeous rescue puppy 6 months ago (towards the end of second year). I'm now 2 months into third year. The first year I didn't have a scholarship or savings so there's no way we could have afforded one. Thankfully that has improved a bit now that I've received a scholarship. Yes, they are a lot of work, especially the first 3-4 months. I feel like we have settled into a good routine now though. She needs at least one good walk session (30 mins) and ideally a 20 minute ball play at the local park every day or so. Plus short, frequent bursts of training / mental stimulation etc. Because a I'm social science PhD and can be home a lot this is fine and a good distraction from study / excuse to exercise / get fresh air throughout the day. So, I think as long as you are 'really' (been thinking about it non stop for a fair while) ready/keen, have given the breed etc a lot of thought, have ok money coming in and not much on campus commitment it's a great idea. I adore my pup and she  really makes me laugh and smile even on the tough days! :) good luck ", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}, "221": {"Subreddit": "PhD", "Author": "Gumeo", "Date": 1477408002, "Score": 2, "Body": "The best thing you can do is show initiative and contact some potential supervisors in the university you are interested in. Positions that are advertised are often very competitive, due to many people not being proactive and tons of foreign students that apply. In some cases it is also a policy to put up an advertisement, so the position may already \"be filled\".\n\nIf you want to show a good impression in your initial e-mail, I suggest that you check some of the most cited, and most recent, papers of the supervisor on google scholar. Then you can figure out if that is what you would like to do research in and also make comments about that you have read their papers and found X and Y interesting. Maybe they have a grant for a PhD student, or if you are a good student they are willing to make a grant application.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "222": {"Subreddit": "PhD", "Author": "justspendingtime", "Date": 1477408192, "Score": 1, "Body": "I'm not sure - there are multiple companies involved by the sound of things, but whether or not they act as partners I can't tell. I'll be sure to ask if they'll be topping up my funding! Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "223": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1477410780, "Score": 3, "Body": "Pretty much this.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "224": {"Subreddit": "PhD", "Author": "BertMacklins", "Date": 1477412008, "Score": 1, "Body": "No probs -  also worth noting that as far as I'm aware - the £14,000 is tax free. So it's not as drastic a pay cut as would first seem. ", "Permalink": "https://www.reddit.com/by_id/t3_582v20.json"}, "225": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477413183, "Score": 3, "Body": "Europe or North America?  \nYour question sounds like it might be coming from a European system, since in North America most schools/programs have formal application processes and deadlines.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "226": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477425800, "Score": 3, "Body": "In my own experience the majority of Ph.D. positions go unadvertised. Even many post-doc positions go unadvertised, but probably less so than Ph.D. positions.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "227": {"Subreddit": "PhD", "Author": "accip", "Date": 1477427569, "Score": 1, "Body": "I'd actually really would like to discuss some things with you if you still have time for another person! Just message me and let me know!", "Permalink": "https://www.reddit.com/by_id/t3_57ziyr.json"}, "228": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1477428021, "Score": 6, "Body": "It sounds cliché but unless you love your topic and have a passion for researching it, a PHD will be a hard slog. It's emotionally draining, and towards the end you have little time for socialising or relaxing.\n\nPerhaps a masters would be better? What is your field?", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "229": {"Subreddit": "PhD", "Author": "accip", "Date": 1477428505, "Score": 1, "Body": "My field was very narrow - social dynamics. Specifically, the synchronization between individuals to achieve higher productivity or prosocial outcomes (e.g., improved rapport, likeabiliy). \n\nIf i decide to do a masters instead of PhD, I'd need to do a job for a bit, so that I could actually afford a masters. ", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "230": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477429210, "Score": 1, "Body": "Perhaps a better way to frame the question: Why do you need a PhD? How will the PhD equip you for what you want to do in the future?   \nThe PhD is a 3 to x year process (longer if you don't have a Masters in the EU, in North America, it's at least 4 years), so you should make sure you aren't wasting those years when you could be using them more efficiently/productively.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "231": {"Subreddit": "PhD", "Author": "accip", "Date": 1477429592, "Score": 1, "Body": "Eh, to be fair, I have no clue why I need a PhD. Like I said, I don't want to endleslly do experiments or teach, so an academic job for me would not be suitable. But at the same time, I'm not sure how well a PhD fares when looking for jobs compared to a masters and several years of experience for, say, an advisory position at a firm (possibly marketing or hr risk management). \n\nHonestly, a PhD always seemed to me like an enigma that can achieve me everything. But that's childish thinking, so that's pretty much why I'm here, as I'm lost and clueless. :/", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "232": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477431959, "Score": 1, "Body": "You're right, you can't really compare a Masters graduate and a PhD graduate going to the job market for positions. The Masters graduate took 1-2 years to get their degree and then is going on the market, the PhD graduate took anywhere from 3-8 years (so let's say 4 years on average as a conservative estimate; I think the actual average is higher than that).   \n  \nSo you would have to compare the Masters graduate with 2-3 years of relevant work experience versus the PhD graduate with zero work experience in that same time period. Don't forget about the concept of opportunity cost (so in addition to work experience, also forgone wages, and opportunities for advancement).  \n  \nAs someone undergoing the process, I would definitely argue that a PhD has value. But the important question is what value, and to whom? It's not Thor's magical hammer. Most of the traditional value of the PhD is for those who are seeking academic jobs or jobs which rely heavily on research. If you're looking for non-traditional value, it'll first off be more of a risk, and secondly will fall on you to make the case for your added PhD value.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "233": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1477432681, "Score": 1, "Body": "Doing a PhD for want of anything better to do is a recipe for failure. You'll hate it. You said it yourself: \"I don't want to stay in academia, but rather would use my skills in an applicative manner.\" You need to go out and get a job. You can always come back to the PhD. I'm doing one after 15 years in the workforce. ", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "234": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1477433486, "Score": 1, "Body": "Are you from the US (*arse* is British but you might be a fan of Sherlock)? Have you had to work (earning money i.e.) during your bachelor's? Not to sound harsh, these questions are to contextualise. I've never heard someone say they were *exhausted* after a bachelor's. If just doing the bachelor's has exhausted you, doing a PhD - in my experience - might not be what you're looking for. To give you an idea, I'm three years in and spend around twelve hours at work on a weekday and finish things on the weekend. This might vary depending on the field, though.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "235": {"Subreddit": "PhD", "Author": "accip", "Date": 1477434681, "Score": 1, "Body": "I'm from the EU, done my undergrad in the UK.\n\nFor reference, I've done multiple research projects during my undergrad (from 2nd year onwards), 2 summer internships and I had a part-time job during all of that (so 2 jobs during 2nd and 3rd year uni summer, a part-time job and voluntary stuff during studying years). \n\nTho, the exhaustion part was more because I did not like the city I was living in - too expensive. Uni was fine, but everything else was getting on my nerves, so needed some time off. But having experienced all of that, it gives me confidence that I could finish a PhD even under stress.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "236": {"Subreddit": "PhD", "Author": "accip", "Date": 1477434872, "Score": 1, "Body": "All fair points.. How are the chances that I'd actually have to do more than 3-4 years to achieve a PhD? Eight years sounds an awful lot and I don't see what the benefit would be for doing it that long..", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "237": {"Subreddit": "PhD", "Author": "accip", "Date": 1477434966, "Score": 1, "Body": "Yeah, that's what I'm worried about as well. If I hate it - it's just going to be wasted time. And considering what everyone else wrote - I won't enjoy it, as my reasoning behind doing a PhD is lax and my energy would be better off spent at a job and possibly a masters afterwards. Cheers for the advice.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "238": {"Subreddit": "PhD", "Author": "ursath", "Date": 1477436027, "Score": 4, "Body": "Do a masters before a PhD. Undergraduate is nothing compared to Masters. \n\nYou need to understand that a PhD will open up a small jobmarket for you, but close off a very big part of it. You will be overqualified for many jobs. \n\nIt is emotionally very tough, and even with a scholarship you'll likely need part time work to cover the costs of living (UK). Nothing you have written so far suggests you want to do it. \n", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "239": {"Subreddit": "PhD", "Author": "ha-ya", "Date": 1477436110, "Score": 1, "Body": "We can't compare this issue like this it's not about which way is better, many of my friends in school which they graduated with me and after that they directly headed to the industry and I can say most of them are successful in their life. \nIn other hand some of my friends also were interesting to do masters and phd and they are very successful as well. And both parties earn very good;)\nIt's all about you and about what you want to do in life and what's your own goals, don't follow others opinion of work or of phd, just follow yourself but don't be afraid of doing anything that you might like such as a phd degree, I'm trying to be honest with you, anybody can do it because it only needs efforts and passion to produce something valuable and that what phd is all about but if you look at everything in our life in general you will find that everything needs your efforts and anything valuable and good should be coming from a person who love the thing itself.\nI am 30 years old and I have done my masters and I'm doing my phd and I have only 2 years work experience and I am happy, proud of my achievements which I call it an investment for my future!\nGood luck!!!", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "240": {"Subreddit": "PhD", "Author": "NuancetoVictory", "Date": 1477443843, "Score": 2, "Body": "Are you based in the US or Europe? I'm in the latter and in my discipline (law) I was required to pursue a masters before applying for a PhD.\n\nIf you're wanting to get into international relations or history (you mentioned them in one of your replies), perhaps look at which institutions offer quality masters degrees and check if those programmes have optional modules on research skills/methods. That should give you some early experience in terms of the kinds of methods used in humanities or social sciences. In the UK, most masters degrees have a dissertation element. Of course a masters dissertation is no where near as long or intensive or original as a PhD thesis, but if you enjoy it, that could motivate you.\n\nResearch-intensive unis in particular offer a lot of good advice to masters students wanting to pursue a doctorate. It also gives you the chance to network with potential supervisors and the kinds of research specialisms on offer in a department.", "Permalink": "https://www.reddit.com/by_id/t3_57yzcl.json"}, "241": {"Subreddit": "PhD", "Author": "NuancetoVictory", "Date": 1477444460, "Score": 2, "Body": "In the UK, some PhDs are advertised. Elsewhere applications need to be initiated by yourself. Networking with one or more universities and getting in contact with lecturers/profs with the most appropriate research interests is an essential starting point. It would be a very good idea to meet them in person before applying, to see if you've got a viable PhD idea.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "242": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477448935, "Score": 1, "Body": "First, it's important to note that no one comes into the PhD thinking \"Hey lets spend 8 years getting a degree\"  \nI think we can all agree if you're spending more than 5 years to finish up your PhD it's because circumstances have forced you to take that much time.  \nUsual reasons: research has hit a snag, problems with your advisor, problems with your school, personal problems, mental health problems (very common among graduate students given the isolated nature of the work), etc.  \nIn addition to the 8 year PhD students, there are also those that simply quit after 2 years, and they represent a fairly large portion as well (either because the school kicks them out, or they realize they have no desire to finish)  \n  \nSo after accounting for everything... maybe half of the students who start a PhD actually finish and end up getting the degree. And again it's important to note that everyone who enrolls in a PhD program on Day 1 believes that they are going to succeed.", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "243": {"Subreddit": "PhD", "Author": "codphd", "Date": 1477449936, "Score": 1, "Body": "To me, and to echo other replies, the very fact that you felt you needed to ask whether a PhD was right for you - shows that it isn't. \n\nAs a PhD student in the UK myself (that still hasn't really sunk in yet), I know that I have signed up for another three years of pain and misery having already completed a bachelors and masters. When my university initially rejected my application for a funded scholarship, I cried. Full-on broke down in tears while with my friends. That's when I knew the a PhD was definitely right for me as I had invested that much emotionally in to it, and I went self-funded. \n\nI'm three months into three years, and it's already hard work. \n\nI, like you, want to use my research and the skills I develop somewhat practically; luckily my research area (autonomous cars) should facilitate this with either a government position or one with a car manufacturer once I 'graduate' for the third time... \n\nI'd suggest, seeing as you are interested in a postgraduate degree, but found your bachelors hard work is to find a job; gain some experience and try to get an employer to pay for your fees in the future. \n\nGood luck whatever you decide, but I wouldn't suggest a PhD :) ", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "244": {"Subreddit": "PhD", "Author": "Nadaleah", "Date": 1477464841, "Score": 1, "Body": "I can attest to that feeling of yours!", "Permalink": "https://www.reddit.com/by_id/t3_56llmw.json"}, "245": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1477471152, "Score": 1, "Body": "Indeed ! Thanks for the clarifications and good luck for the PhD if you're going on that path", "Permalink": "https://www.reddit.com/by_id/t3_59da8b.json"}, "246": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1477471850, "Score": 1, "Body": "Hey, great to hear you're looking into a PhD. Before you start though, you should ask yourself, why you want to do a PhD. Don't just do it because it's \"the next thing\" to do. A PhD is a research qualification, and in your field, will probably make you over qualified unless you're sure that a long term future in academia is what you want. Most importantly (esp in the UK), you going to need to accept that you will earn about 30% of your market rate in academia. Note, not 30% less, 30% of ie 1/3. \n\nIf you're sure that you want to, you should probably be doing a dissertation as part of you MA, from that you will get the opportunity to meet supervisors etc. Talk with your supervisor about opportunties.  Your supervisor may have grants that s/he is working on that can fund a PhD, otherwise you may need to look for an external source (bursary, scholarship etc). Money is not automatic or guaranteed and it's usually quite hard to come by. On top of bursaries you'll need money for travel, conferences, equipment (?), participants (?) later on in the PhD so make sure you ask about that. ", "Permalink": "https://www.reddit.com/by_id/t3_59gdku.json"}, "247": {"Subreddit": "PhD", "Author": "cinnamontheo", "Date": 1477476982, "Score": 1, "Body": "Hey thank you so much for your response! Academia and a career in research is definitely something I wish to pursue! \nI have upcoming meetings with supervisors and was just curious what sort of topics to bring up? ", "Permalink": "https://www.reddit.com/by_id/t3_59gdku.json"}, "248": {"Subreddit": "PhD", "Author": "NuancetoVictory", "Date": 1477494524, "Score": 1, "Body": "From my own experience, scholarship/stipend applications are separate from the actual PhD application (with your proposal). Are you wanting to study a doctorate at KCL? It's worth seeing what scholarships are available for linguistics as there might be more than one stream you're eligible for. I'm not a linguist, nor am I at KCL, but just a general tip.\n\nIt's useful that you're studying an MA as it gives you a lot more scope to network with academics in your department. Look up the specific research interests of lecturers, and contact them for more advice. If you have other institutions in mind, do the same thing.", "Permalink": "https://www.reddit.com/by_id/t3_59gdku.json"}, "249": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1477502114, "Score": 4, "Body": "If you're going for funding, I reckon there's two main things. \n\n1. Write it to a general audience. Not everyone on the panel will be experts and you're asking them for thousands. Make sure they understand their investment. \n\n2. I think this is probably the key - pretend you know what you're doing even if you don't. If you have a vague idea, make it more concrete even if it isn't what you want to do, and provide a clear method about whatever that is. Once you've secured the funding they don't really give a flying fuck what you do as long as it's in the same ball park. But they won't give money unless it looks like you have a concrete plan. ", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "250": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1477506335, "Score": 3, "Body": "Go away you dumb shit troll.", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "251": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1477514511, "Score": 2, "Body": "try /r/askscience", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "252": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477515829, "Score": 11, "Body": "WOW - I just checked, and it turns out vaccination rates are also positively correlated with CO2 emissions and global warming! I knew there was a connection! DAMN YOU AL GOREEE!\n\n*rolls eyes*\n\nJust when you thought you found some corner of the internet that remained sacred from this sort of thing...", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "253": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477516132, "Score": 2, "Body": "What is the proposal for? Thesis proposal? Fellowship funding?", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "254": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477516502, "Score": 1, "Body": "It depends on what your current credentials are - GPA, research experience, first author or co-author papers, etc.. If you look good with these things, go for it. The Ph.D. experience is like the exact opposite of 'traveling the world for a few years', so have fun and just don't get too comfortable.", "Permalink": "https://www.reddit.com/by_id/t3_57bb3y.json"}, "255": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477517862, "Score": 2, "Body": "OP sounds European, where the research proposal is required in addition to the SOP. 2nd clue is having done a Masters whereas in the USA if you know you are going the PhD route and have a competitive enough profile you tend to skip that degree.", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "256": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477518694, "Score": 1, "Body": "In that case... here in the U.S. we have the 'National Science Foundation Graduate Research Fellowship Program' each year that provides ~2,000 new fellowship to early and prospective Ph.D. across several disciplines. Applicants are required to write a 'Graduate Research Plan Statement'. Generally, ~10% of applicants are successful in getting this award. Many successful applicants from previous years have published their documents online for transparency, and/or so that prospective applicants can get ideas from looking at successful proposals. Some other U.S. funding agencies make the successful proposals available by default. Maybe looking these up can give you an idea of what makes a research proposal successful.", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "257": {"Subreddit": "PhD", "Author": "hl-fervor", "Date": 1477541189, "Score": 1, "Body": "Try to emphasize how your research will be impactful. Committees looking at these tend to look for originality and that you are doing meaningful work rather than a project that's just a private obsession. ", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "258": {"Subreddit": "PhD", "Author": "SparedByTheGenius", "Date": 1477565216, "Score": 1, "Body": "Scandinavia, its more of a job application than applying to enroll etc", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "259": {"Subreddit": "PhD", "Author": "SparedByTheGenius", "Date": 1477565238, "Score": 2, "Body": "Solid Advice.", "Permalink": "https://www.reddit.com/by_id/t3_59afyj.json"}, "260": {"Subreddit": "PhD", "Author": "PimplyChuds", "Date": 1477565318, "Score": 1, "Body": "OP certainly is European(ish after Brexit). OP is from the UK! ", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "261": {"Subreddit": "PhD", "Author": "kalamano", "Date": 1477573406, "Score": 1, "Body": "Believe in yourself!\n\nYou applying for ESRC funding? If so, drop me a message.", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "262": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1477580184, "Score": 1, "Body": "btw, I should have stated where this advice comes from. I am a second year PhD student in sociology in the UK, who failed first time round to get funding, and took a year out. I wish I'd known 2 better the first time round.", "Permalink": "https://www.reddit.com/by_id/t3_59i6zg.json"}, "263": {"Subreddit": "PhD", "Author": "fakfafflepotatoe", "Date": 1477583652, "Score": -3, "Body": "sorry i thought this sub was actually for phd's and grownups\n\ni was honestly hoping to discuss this.\n\nIf you check vaccine rate versus deformity, retardation, miscarriage, abortion, autism, and mental illness you may be shocked, some climbed 400% when the vaxx rate went up 400%. [comparison image: mental health SSI cases go up 400% after 1975](https://img.fireden.net/sci/image/1461/08/1461086478192.png)\n\nA potentially huge correlation.\n\nAlso you and your trolls probably have no proof that people who had cancer previously did not have the flu.\n\nvaccines are little ufos. \n\n^^fuck ^^off", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "264": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1477583937, "Score": 4, "Body": "You're right. This is a sub for phd's. The phd's don't believe in this nonsense. Why does that mean nothing to you?", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "265": {"Subreddit": "PhD", "Author": "fakfafflepotatoe", "Date": 1477584576, "Score": 0, "Body": "https://www.reddit.com/r/AskScienceDiscussion/comments/59otfy/small_correllation_between_vaxx_rate_and_breast/", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "266": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1477614597, "Score": 1, "Body": "20 coauthors!", "Permalink": "https://www.reddit.com/by_id/t3_59qise.json"}, "267": {"Subreddit": "PhD", "Author": "arcoftheark", "Date": 1477628420, "Score": 5, "Body": "Subjectivity - you will probably deal with this as long as you work for someone else. Doesn't matter if it's from your Ph.D. adviser, your manager, etc. I know how you feel. I notice that the kind of feedback I get from my adviser depends a lot on his mood, more than he realizes.", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "268": {"Subreddit": "PhD", "Author": "sureshcbt", "Date": 1477628584, "Score": 2, "Body": "Hope these links helps\n\nhttp://academia.stackexchange.com/questions/78572/should-i-persist-with-article-that-keeps-getting-rejected\n\nhttp://academia.stackexchange.com/questions/3242/how-do-i-overcome-fear-of-rejection-when-writing-academic-papers\n\nhttps://thesiswhisperer.com/2013/07/10/achy-breaky-heart-coping-with-academic-rejection/\n\nhttp://www.sciencemag.org/careers/2008/08/if-first-you-dont-succeed-cool-revise-and-submit-again\n\nhttps://www.quora.com/How-do-you-deal-with-a-paper-rejection-from-a-major-scientific-journal\n\nhttp://blog.labguru.com/blog-labguru/i-am-sorry-to-inform-you-or-how-to-deal-well-with-paper-rejection\n\nhttp://michaelnielsen.org/blog/three-myths-about-scientific-peer-review/\n\nhttp://morganonscience.com/grantwriting/dealing-with-the-rejection-letter-part-ii/\n\nhttps://www.weizmann.ac.il/YoungPI/upload_files/nurturing/Dealing%20With%20Rejection.pdf\n\nFew comments in the above links are very good.", "Permalink": "https://www.reddit.com/by_id/t3_59qise.json"}, "269": {"Subreddit": "PhD", "Author": "Exorbit_Clamp", "Date": 1477640294, "Score": 4, "Body": "This is a tough one. If you quit then five years down the line might you regret it? Does the uni give the option to defer the the next two years? Perhaps take a year out and see how you feel.\n\n\nIf I was fully funded I would just take the pain and get it finished. Even if you ultimately fail you are still learning something (it would be a different story if you were self funded).", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "270": {"Subreddit": "PhD", "Author": "Knirkefri", "Date": 1477662711, "Score": 3, "Body": "That is a completely pointless correlation unless you have a hypothesis founded on medical research that would tie the two developments together. A million other things could account for increased cancer rates (including increase in correct diagnoses, which *is* plausibly related to increase in vaccinations, because more, better medical facilities = more, better diagnoses and more vaccinations). Your insinuated idea is no more reasonable than \"CO2 emissions are caused by vaccinations\", because there is also a very visible correlation between those numbers.", "Permalink": "https://www.reddit.com/by_id/t3_59irmv.json"}, "271": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1477673724, "Score": 2, "Body": "Maximum effort.", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "272": {"Subreddit": "PhD", "Author": "SatanakanataS", "Date": 1477673907, "Score": 1, "Body": "Does your program allow you to collect your Master's en passant on the way to getting the PhD?", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "273": {"Subreddit": "PhD", "Author": "ejc16", "Date": 1477680740, "Score": 3, "Body": "Although this doesn't count as an inspirational quote per se, I tell myself \"just take it a day at a time.\" So every day just make a daily goal towards that larger goal and focus on accomplishing that for now. No sense in getting overwhelmed with the long term- just focus on what you can work on right now. I am very much in the same boat right now and feeling totally overwhelmed, so thanks for reminding me to remind myself of this. You can do it!", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "274": {"Subreddit": "PhD", "Author": "schmoobacca", "Date": 1477682713, "Score": 1, "Body": "I quit, and I have no regrets. Granted, I hadn't put in much time but I knew it was a bad program with a bad advisor. My only regret is pursuing it in the first place when I could have better spent my time looking for work.\n\nIf you feel you can get a job you will be happy in, then leave. For me, it was hard to get out of the mindset of wanting to leave once I had decided I didn't want to be in it anymore. However, I HIGHLY recommend you find a position BEFORE leaving. I left before getting work and was unemployed and miserable for months. \n\nYou should speak with your advisor, too, as awkward as that is. The school will do whatever they can to keep you, because it makes them look better if you stay and finish, but you don't owe them anything. If you don't want to hear them out, that's fine. But they might be more willing to help push you along to finish if you make your concerns known. \n\nIf you don't have a master's, see if you can collect your master's from the time you did put in. Try to get something out of it that can be on paper and marketable to employers. ", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "275": {"Subreddit": "PhD", "Author": "fatfreefood512", "Date": 1477682801, "Score": 3, "Body": "From my seminar instructor, \n\" I didn’t know crap when I started, so give yourself some time. \"\n", "Permalink": "https://www.reddit.com/by_id/t3_59tsel.json"}, "276": {"Subreddit": "PhD", "Author": "zhanggar", "Date": 1477701419, "Score": 2, "Body": "Possibly, but already have a terminal master's so no point.", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "277": {"Subreddit": "PhD", "Author": "zhanggar", "Date": 1477701839, "Score": 1, "Body": "Yeah already accepted a position about 6 months ago, so PhD is part time now. Main reason why I started PhD cause I wanted to look for work while gaining some work experience and money. But now I've gotten kind of far.", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "278": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1477756232, "Score": 1, "Body": "would be better to have an option for finished versus still in progress. I just went with expected years to finish/ when my funding runs out. and current publications to date, but i have several more in the pipeline so probably not representative of a finished PhD. Additionally perhaps a text box for the last one (or any of them) just reckon if you're going to collect data on problems acquired, you could group them on the type of problem, although I suspect the majority will be mental health of some aspect. ", "Permalink": "https://www.reddit.com/by_id/t3_59xrsq.json"}, "279": {"Subreddit": "PhD", "Author": "Ghpaetzold", "Date": 1477769062, "Score": 1, "Body": "I did think about allowing for more detailed personal information to be provided, but here is the funny thing: I had to do a bunch of user studies for my Ph.D. with non-native English speakers and, for some reason, asking people to provide details about their answers to simple multiple choice questions seemed to scare them away of completing the questionnaire (i.e. clicking \"Submit\"). Since the survey is just a \"for fun\" thing, I didn't wanna risk it. :)", "Permalink": "https://www.reddit.com/by_id/t3_59xrsq.json"}, "280": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1477834359, "Score": 2, "Body": "I agree with you about the exercise bit, while I probably dont have enough time to dedicate to a team sport where i need to be at a place or be depended on, I can do short things throughout the day.\n\nyou said you cant run, I cant either due to a long standing injury, but I've taken up yoga during my PhD, and love it. I do faster paced flowing styles because I like more of a work out, but theres loads of different styles if you like something slower/ more stretchy. Anyhow, I guess my point is, the first 1-2 years of my PhD my social anxiety went out the roof, had 2x different therapy sessions, and suffered from probably the worst depression of my life because I didnt think I could talk to anyone around me and kept it all in. Doing yoga 5x a week has really helped, sometimes i go in the morning, sometimes middles of the day during lunch or after work. Sounds like you're in the UK- have you seen moveGB? dont know your location but it might help you find some activities, and its pretty affordable and so flexible without getting a full time gym membership. \n\nI realise this went on a full on tangent about yoga and movegb, but really its helped me so much manage my stress, feel healthier, get the motivation back for my work, and just generally enjoy life. Theres several classes a week that the others in my office go to as well. \n\nAlso on your last point, defo take time off. Im sure you know this, but you need it for your wellbeing. I obsessively worked nights and weekens my first few years, took no time off and was so unhappy. Now I go to london all the time, visit my friends, maybe a long weekend away here and there. Just to refresh. \n\nHope some of that helps, feel free to message me if ya want to chat, or just talk science (you said clinical study so was maybe assuming you do psych and thats my subject )  ", "Permalink": "https://www.reddit.com/by_id/t3_5a5dtv.json"}, "281": {"Subreddit": "PhD", "Author": "OldJdub", "Date": 1477852937, "Score": 1, "Body": "So this is highly program dependent: I can tell you my experience has been a full promise of funding (tuition is waived and I receive a stipend) for 5 years, with most who need a 6th year getting it.  Two catches: you have to \"earn\" your tuition waiver and stipend by doing work, usually a 20-hour-a-week gig as a TA or research assistant, and you still have to pay taxes on your waived tuition (this can be a very non-trivial amount of money).", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "282": {"Subreddit": "PhD", "Author": "OldJdub", "Date": 1477853534, "Score": 1, "Body": "So I left for three semesters to work in industry and then went back.  It gave me a lot of really badly-needed perspective. After returning things have been much easier: you don't mind the nitpicking and subjectivity as much because you can see it for what really is and really means.  Depending on your discipline it can be really good to finish, or it might not matter as much.  I spent a long time trawling industry job postings to see how much further I could get with a PhD: that's ultimately a big part of what pulled me back.", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "283": {"Subreddit": "PhD", "Author": "zhanggar", "Date": 1477861029, "Score": 1, "Body": "My discipline is Criminology. A PhD probably isn't necessary to get a research job at a respected think tank but would help a great deal. My current job is a research position but much more focused on data analysis than publishing results so not the best kind of experience for the job I eventually want. ", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "284": {"Subreddit": "PhD", "Author": "janbogi2011", "Date": 1477862711, "Score": 2, "Body": "Regardless, thanks for articulating positive and negative sides of PhD life. As a person who've been considering taking a PhD, this is really informative. ", "Permalink": "https://www.reddit.com/by_id/t3_5a5dtv.json"}, "285": {"Subreddit": "PhD", "Author": "OldJdub", "Date": 1477863283, "Score": 1, "Body": "So something I was having trouble with was framing \"I've spent many years doing this and don't want that to be a waste\" as \"now there's X amount of work left to do, do I want to do it?\"  Answering the second question got me further than dealing with the sunk-cost feelings.  When I was deciding I'd thought about that time already spent, but that time is gone, and that work is done.  So for me the tradeoff had been \"I have to write three papers, it'll take about 3 semesters, and it opens doors XYZ in the future or speeds up a lot of things.  Plus I get a fancy title and the satisfaction of beating it.  But then I have to deal with jumping through silly academic hoops sometimes and other disinterested adviser type stuff.\"  It's not \"boy I was really close to finishing, relatively speaking, so I should probably knock it out, otherwise I'm a terrible person and my adviser's laziness toward me will have been justified.\"  As long as you're framing it right you'll make the right decision for you.  ", "Permalink": "https://www.reddit.com/by_id/t3_59sheh.json"}, "286": {"Subreddit": "PhD", "Author": "A-girl-called-Reedit", "Date": 1477863631, "Score": 2, "Body": "My number one advice is get a good supervisor. I'd have failed without mine. Mine has sent me to so many places which have really helped me to learn. Others are obstructive and will stop you from doing well. Mine has a really great management style too, he's always happy to see me. He's never moody and he always supports me. I've learned so much from him.\n\n\nI've heard some real horror stories. I was lucky because I knew people that he knew and vetted him beforehand.\n\n\nMy process is that I saw an advert on jobs.ac.uk and applied for an established idea in the university. It involved an application and an interview. I emailed the contact and he invited me over for a chat. Before my interview I went over to talk to him about the project and he said \"possible plans are A, B, C, D\". I wrote it all down. For my interview he asked me to do a presentation on the possible plans for the project. I don't know if he explained the project so well to the other candidates, but the meeting beforehand really helped me to prepare and do well in the interview, and I was successful.\n\nOther processes are that you suggest a project and suggest a supervisor, and write the proposal to your university yourself.", "Permalink": "https://www.reddit.com/by_id/t3_5a5dtv.json"}, "287": {"Subreddit": "PhD", "Author": "janbogi2011", "Date": 1477905740, "Score": 1, "Body": "Thank you for sharing your explanation and details of how you approached your supervisor. Great to hear that you work with the right one! ", "Permalink": "https://www.reddit.com/by_id/t3_5a5dtv.json"}, "288": {"Subreddit": "PhD", "Author": "A-girl-called-Reedit", "Date": 1477906861, "Score": 1, "Body": "I would say to reduce arguments  if you're balancing 20 co-authors, when you send the draft to them for comments, specify what you want comments on.\n\nE.g. I enclose the following draft of my paper and I would like your feedback. If you do not make suggestions within 2-4 weeks I will assume you do not want to be an author. (Maybe phrase this a bit more diplomatically.)\n\nStatistician: I would like you to review the statistics in the paper.\n\nLab tech: I would like you to review the lab methods and presentation of the results.\n\nAcademics: I would like you to review your field in the intro and discussion.\n\nWhen someone questions the statistics, ask the statistician to help you reply. When someone questions the methods, get the lab tech to help.", "Permalink": "https://www.reddit.com/by_id/t3_59qise.json"}, "289": {"Subreddit": "PhD", "Author": "ProfessionalGoogler", "Date": 1477924878, "Score": 1, "Body": "I'm maybe a bit late to this. My parents have a 1 year old, Schnoodle. Despite not having to train and look after her (this makes our situation slightly different), it is amazing coming home after a rough day to receive that pure, unconditional love you get from having a dog. If you think you can make it work, it's definitely worth it. \n\nSometimes, I feel that I don't have any time to think clearly, without having work that needs to be done. Having a dog means, you have to go out for a walk. It can really clear your head. ", "Permalink": "https://www.reddit.com/by_id/t3_58piwr.json"}}