{"0": {"Subreddit": "PhD", "Author": "dmap02", "Date": 1517455713, "Score": 5, "Body": "If I were her, I’d talk to my undergrad and master’s thesis advisors and or other referees (eg committee members), seeking their input and asking if there’s anything that they could say in their LORs to offset the doctoral advisor’s potentially derogatory remarks. They could say things indirectly which would contextualize the bad LOR.\n\nShe might also ask the PIs who rejected her why. Because it’s a political situation, she may have the most chance of getting an honest answer at a conference or some other informal setting where a written trail isn’t left behind.\n\nShe may also ask the PI whether he can write an outstanding letter in her next request, rather than just asking for a letter. If he answer is no, she’s got the answer she needs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7udj8z/worried_about_supervisor_sabotaging_postdoc/dtjzp7s/"}, "1": {"Subreddit": "PhD", "Author": "mertblade", "Date": 1517481148, "Score": 1, "Body": "Her husband should talk with the Prof and kick his *ss if possible. Then, he will understand why someone should never try to ruin other's life.\n\nIt is better if she will give her previous supervisor's contact numbers. I know not writing phd supervisor as a reference seems weird, but no other choice.\n\nWhich country is it btw?\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7udj8z/worried_about_supervisor_sabotaging_postdoc/dtkdrq8/"}, "2": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1517488548, "Score": 1, "Body": "Tbh I would just go and have it out with this PI. She’s got nothing to lose. Be honest and tell him that it’s just going to reflect badly on him if he gives her a bad recommendation (can also bring up dodgy scientific practices here if she can swing that without it looking like blackmail)\nI know some jerk PIs will respect you if you stand up to them- no one cares about his respect anymore but it looks like it has to be said. \n\nAlso, if she isn’t set on doing a postdoc, she could apply for an industrial position. \n\nIt makes me so sad when I see how PIs treat their students. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7udj8z/worried_about_supervisor_sabotaging_postdoc/dtkh406/"}, "3": {"Subreddit": "PhD", "Author": "TakeMySoul2Hell", "Date": 1517491594, "Score": 1, "Body": "Gratz!", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtkj0tx/"}, "4": {"Subreddit": "PhD", "Author": "KittyKatB99", "Date": 1517494525, "Score": 2, "Body": "Well done! I’m about six months away from submitting and I’m so envious. Any tips for the final push? I’m doing a History PhD", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtkl8zk/"}, "5": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1517496009, "Score": 2, "Body": "I guess just keep at it, and take whatever help you can from supervisors, etc. in the final drafts. Also, don't submit until you're sure you're ready, take advice from supervisors and relevant colleagues on that score. Then depending on how long you have before viva, don't panic and over stress about preparing too much. There are prep things you can do, but don's stress. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtkmjyp/"}, "6": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1517499916, "Score": 2, "Body": "Congratulations Dr u/Jezturner.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtkqc1v/"}, "7": {"Subreddit": "PhD", "Author": "RubRubNub", "Date": 1517501004, "Score": 3, "Body": "Jesus Christ. Sounds like I am reading about my self 6-12 months ago when I started. \n\nI am doing neurology from a background in computer science, and I read a lot in psychology. I did go to 3 different psychologists for different problems, mainly GAD and some depression. And a friendship with a toxic friend. He is never wrong, somewhat on the the autism scale (probably asperger's syndrome: he said he learned what do different expressions mean growing up, and how to mimic them), and has BPD (people are great/Evil, I was an angel in his eyes, until I become the one is to blame for what he is feeling). He made me question myself and my world, and I don't know if he is the reason behind my disassociation attacks but I highly doubt it. I knew him for 6 years, the last 18 months of those were hell on earth. \n\nSecond psychologist helped me ditch him. I simply moved that guy into trash can and never contacted him again. I learnt it is never bad to make mistakes (you still have to learn from your mistakes), but it is awful when someone keeps trying to make you feel guilty. It prisons you in you own brain, and when you start to doubt yourself is when you start OCD, at least the obsessive part.  \n\nThen, in addition to anxiety, I had full blown panic attacks. and a lot of disassociation, also, at the beginning of my PhD?! \n\nAfter months of psychotherapy with the worst psychologist on earth, or maybe I wasn’t following, I honesty thought he hated me and/or scared of me. He was even making me nervous and made my panic attacks worse. I decided, fuck it, I went to a psychiatrist and took Citalopram 10mg. First month or so was like hell. More panic attacks, more disassociation and more OCD thoughts, bad, but nothing new. Then, after 2 months it was great. I then went on 20mg (which was the plan). Now, those 6 months are great, never had an attack or disassociation.   I am waiting to get another psychologist because I have to wait 1 year so that my insurance covers it. \n\nBefore SSRIs, I would look around you. Do you have toxic relationships that make you feel guilty for who you are? Did you move because of your PhD and don't have friends? Possibly somewhere where you don't speak their language, or you just can't make friends? Is you PhD set in its course, or are you not sure what the future holds there? I would strongly recommend going back home to your family and visiting a place where you have a lot of friends every 6 months at least if the move and no friends is the problem, this will help. \n\nFor now, I could tell you to keep hope. Believe me, I have been through hell and back. I have been convinced of many horrible scenarios, and I used to think tomorrow is not coming. but it got better when I never thought it could.\n\nAll the best. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtkrgfg/"}, "8": {"Subreddit": "PhD", "Author": "KittyKatB99", "Date": 1517503117, "Score": 1, "Body": "Thanks so much :) And congrats again!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtktp89/"}, "9": {"Subreddit": "PhD", "Author": "numinelia", "Date": 1517504381, "Score": 1, "Body": "thank you very much I will try to work with your  advice.\nCordially", "Permalink": "https://www.reddit.com/r/PhD/comments/7tn8jz/simulation_urgent/dtkv2od/"}, "10": {"Subreddit": "PhD", "Author": "sliderulewoodworker", "Date": 1517516024, "Score": 3, "Body": "Serious question: Why do you want to pursue a PhD? \n\nThe vast majority of career advancements do not require a PhD. For the jobs that do require a PhD (either in industry or academia), I've never met anyone in those roles who did receive their PhD from an online program (most of which do seem like scams).", "Permalink": "https://www.reddit.com/r/PhD/comments/7u4ote/looking_for_an_affordable_online_phd/dtl7s5h/"}, "11": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1517519049, "Score": 2, "Body": "Have a hobby that gets you away from your PhD. Ie no screens, no writing. I taught myself to crochet. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtlb2na/"}, "12": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1517525166, "Score": 2, "Body": "Congratulations!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtlhgwk/"}, "13": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1517529859, "Score": 2, "Body": "Can't wait to get there! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtlly69/"}, "14": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1517537488, "Score": 1, "Body": "Congratulations! I'm a few months away from finishing my PhD and I can just imagine the relief you feel (we don't have thesis defence here, though; we submit our thesis and then wait six months for the reviewers to get back to us).", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtlsvmj/"}, "15": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1517538509, "Score": 4, "Body": "Look up researchers who are doing artificial intelligence, and see what they're focusing on. University websites are a good place to start, and many researchers often have their own personal web page. This should give you some ideas of what's current in the field, who's doing it, and once you've made a choice you can talk to that researcher about a more specific topic.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ul7il/how_to_come_up_with_a_phd_thesis_topic/dtlttep/"}, "16": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1517554946, "Score": 1, "Body": "Is a viva the same as a defense? Congrats!", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtm5whw/"}, "17": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1517557015, "Score": 1, "Body": "The same end result as a public defender but different structure. Google viva voce. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtm6xcs/"}, "18": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1517557062, "Score": 2, "Body": "I at least only had to wait seven weeks, which is quite quick for a viva. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtm6y72/"}, "19": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1517557951, "Score": 1, "Body": "So an oral examination, but with an external committee member, and closed doors? Today I learned!", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtm7ddw/"}, "20": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1517562687, "Score": 1, "Body": "Yes. A chair who just chairs. Then an external. And because I’m on research staff at my uni, two additional internal examiners. Also chose to have my supervisor lurking behind me taking notes but not allowed to interact with me. Also the room was glass fronted so although I had my back to it, the vague sense of a huge open plan office potentially watching me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7uijx0/passed_my_viva_yesterday_with_minor_corrections/dtm9fa5/"}, "21": {"Subreddit": "PhD", "Author": "Leinanator", "Date": 1517573174, "Score": 3, "Body": "Part of doing a PhD is becoming an independent researcher. I think it is very good that you took responsibility for your project and tried to set up a meeting with experts on the subject. Maybe you and your supervisor can align your goals a little bit, if you would phrase it like: 'we need this expertise to succesfully do this project' instead of 'we can not do this project and these experts will tell you'. \n\nShe might respond positively to your emails or might not. However this does not matter as your value as a researcher does not depend solely on the opinion of your supervisor. Sometimes you have to be a little bit bold and do what you think is best! \n\nTake care and everything will be fine in the end.", "Permalink": "https://www.reddit.com/r/PhD/comments/7upipz/worried_about_ruining_my_relationship_with_my/dtmdu0c/"}, "22": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1517584880, "Score": 3, "Body": "I came up with my proposal and took the GMAT in a period of a month so it is possible ;)\n\nTry to chip away at it every day. Just start. Open a word document and start typing. Start getting together a collection of journal articles &amp; cite what you can as you go. It doesn't have to be perfect, just think of it like making a snowman -- you have to start with a tiny ball and keep pushing it. Then once it's big enough you can shape it. \n\nIt sounds like you have the scholarship on lock if you can get it done, so get it done!", "Permalink": "https://www.reddit.com/r/PhD/comments/7urxn1/working_fulltime_and_working_on_phd_proposal_the/dtmmig3/"}, "23": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1517585769, "Score": 2, "Body": "You have definitely offended her. Never put that kind of thing in writing because it serves no purpose other than to allow the person to reread things that are upsetting. From her perspective you don’t know enough to make that call, so a “strongly worded email,” from you is insulting. \n\nWith alllll of that said. Don’t do the thing she wants because it sounds like she doesn’t really care about your progress and wants to use you to “see if something works.” The solution? Say (in person) that “I really like the idea of this, but it has come too late for me. I’m happy to help you think through the design or details, but I’m too far along to pivot and make his a focus/a part of my dissertation. I want to focus on X so I can defend in time. After I graduate maybe I can return to this with you...” \n\nSomething like that. Advice to take forward.m: any time you say “no” following with two  “yeses”\n\nAlso, be willing to take a stand and change advisors if she digs in her heals. You don’t owe her shit. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7upipz/worried_about_ruining_my_relationship_with_my/dtmne3i/"}, "24": {"Subreddit": "PhD", "Author": "torqueOverHP", "Date": 1517586298, "Score": 2, "Body": "I would say this situation might lead to a conflict of interests. \nYou should speak about this to your manager / coworkers first thing. It might be decided that you contact him and go on with this, but with  the assurance that you done the right thing :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ugtrf/should_i_communicate_with_my_msc_supervisor_in_a/dtmnxbq/"}, "25": {"Subreddit": "PhD", "Author": "PurpleMuskogee", "Date": 1517587145, "Score": 1, "Body": "Thank you! Now it turns out it'll be more like two weeks to get that scholarship but... I don't know. I want to try but that seems really tight.\nI'll start what you said! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7urxn1/working_fulltime_and_working_on_phd_proposal_the/dtmosan/"}, "26": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1517597717, "Score": 2, "Body": "I just completed my entire PhD (in five years) while working full time. My dissertation proposal (25 pages +  bibliography) took about a month. I put in one hour everyday (mornings before work) and between 6-10 hours every weekend. Sometimes I read (researched) in the evenings on the couch watching TV reruns, but not every night. I usually used the longer chunks for researching/writing and the mornings for writing/editing. It's doable. Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7urxn1/working_fulltime_and_working_on_phd_proposal_the/dtn0dsu/"}, "27": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1517609014, "Score": 1, "Body": "PM the details and I will try to match you up with someone in the area.", "Permalink": "https://www.reddit.com/r/PhD/comments/7uun24/lookin_for_a_cs_phd/dtnccb1/"}, "28": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1517622079, "Score": 2, "Body": "I think I am in a similar, less severe situation in my last 9 months. Sometimes it does not make any sense that I came this far. Sometimes it feels like the path after phd is much darker and getting a full time lecturer position will not work out. Sometimes it feels like there is so much to fix, that I have postponed for so long and I just cannot comprehend this is really the final draft of it.\n\nI keep a diary, usually free flow of ideas instead of talking about my day and it helps. But here are two themes from there, that can help you too:\n\n1- (to myself) stop acting like your life will finally start after this. Your life was not on hold. You chose to do this, as an adult. There were good and bad times and it is almost done. It was not a pause in your big life plan, its a road you chose, that will take you to another place. You started at 26, you will finish at 30. You lived through this.\n\n2- sometimes i list all the shows I want to watch, all the countries I want to visit, stuff i want to try, hobbies I want to start etc. And I say, there will be time to do those things. Japan wont disappear, pianos will still exist etc etc. They are not going anywhere. I can postpone working on my thesis and have a fun time now, but I will enjoy it much more if I do them as a guilt-free Dr. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dtnnsc4/"}, "29": {"Subreddit": "PhD", "Author": "arbab01", "Date": 1517640022, "Score": 3, "Body": "Buy him some gift. That's how I showed gratitude to my Supervisor and she was really happy.", "Permalink": "https://www.reddit.com/r/PhD/comments/7uxovk/how_to_express_your_appreciation_to_advisor/dtnztuk/"}, "30": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1517641576, "Score": 1, "Body": "Thanks for your great reply! \n\nI think one of my big worries about it coming to an end is what lies beyond. Right now I feel so exhausted about this whole thing. But I do too myself once I'm finished I won't be so tired all the time, and job searching won't feel like the huge weight it would on top of finishing the PhD. \n\nI have booked myself a holiday for when I finish which has got me looking forward to finishing. I also keep telling myself that the thesis does not have to be perfect, and I don't mind getting minor corrections. \n\nYesterday I also decided to take a day off and lounge about at home. While I felt a bit guilty, it's something I really needed. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7t7yfl/depression_and_the_end_of_the_phd/dto0kgc/"}, "31": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1517664401, "Score": 2, "Body": "I have lots of experience expressing appreciation to my advisor over the years (lucky us, and hurray for nice, helpful, hard-working advisors!). \n\nI/we think that thanks in writing has more value than thanks just orally, so I often email him a brief, nice, exact thank-you message. In this case it'd probably be something like \"Thank you very much for your help with my conference paper, I appreciate that a lot!\" in reply to the last conference-related email thread. If your paper gets accepted, forward the acceptance email to him also with a similar thank-you message. (If it gets rejected, probably still forward that with a message that you still very much appreciate his effort and you will try even harder next time.)\n\nIf that still seems insufficient, and I know what he is likely to appreciate, I sometimes give him a small gift - something inexpensive, well below the bribe value, but useful - e.g., I know that he usually likes chocolate, so a few times I gave him a chocolate (a decent chocolate, but not a really expensive one - the most expensive was 300 g Milka Oreo).\n\nAnd whenever I have an opportunity to tell or write something about my advisor (e.g., to prospective students, to my institute's administration...), I try hard to convey that he is so very nice, supportive and hard-working, and that I appreciate being his student so much.\n\nBut, of course, the greatest thanks and help to a PhD advisor is to continue working diligently on the PhD and all the other reasonable requests of the advisor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7uxovk/how_to_express_your_appreciation_to_advisor/dto9mbn/"}, "32": {"Subreddit": "PhD", "Author": "Merantaz", "Date": 1517666145, "Score": 1, "Body": "If you are from a different place/country than you Professor is, just present him that is something famous from your place of origin. I would usually go for handicraft items.", "Permalink": "https://www.reddit.com/r/PhD/comments/7uxovk/how_to_express_your_appreciation_to_advisor/dtoaljo/"}, "33": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1517674586, "Score": 1, "Body": "Investigate what has stronger industry in the country/area where you want to have that career. Even if you plan on academic career, because plans change and because where there is stronger industry, it is also easier for academics to get funding and students (and thus academic institutions are also more interested in hiring professors in such subfields). I also suppose in most of the world that will be plant science, but in some (highly developed) places without much agriculture a medicine-related career could be preferred.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tthik/what_topic_to_chose_for_phd/dtogsbd/"}, "34": {"Subreddit": "PhD", "Author": "jamesisapanda", "Date": 1517682867, "Score": 1, "Body": "I finished my integrated masters in 2017, also in the UK. \n\nIt's not imperative to get applications in for around the first semester, I mean technically I didn't contact or interview for the position I am in until after summer exams.\n\nThe professors will be happy to help if you actually show interest in their area of research and are somewhat aware of your general intended area of research. \n\n... That being said, lol third year student, don't have high expectations: funding opportunities fluctuate so don't expect anything that you might find this year to still be available next year. \n\nGood luck.", "Permalink": "https://www.reddit.com/r/PhD/comments/7tc31o/is_it_silly_to_ask_for_advice_during_undergrad/dtoo4up/"}, "35": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1517703552, "Score": 5, "Body": "The Imposter Syndrome is real. It will get worse when you meet people whose research is so very developed and that you don't even really understand. \n\nYou will start out with great ideas and loads of motivation. The ideas will get pared away till you are left with a skeleton that, by the end, youu aren't even sure is yours anymore, while your motivation will wax and wane as if it's controlled by an imaginary PhD moon. \n\nBe ready to meet your monkey. It will be on your back for the next three or four years. Get used to it being there. EVERYWHERE you go and ALWAYS talking to you about what you still need to do. \n\nApart from that, enjoy it. Meet new people, share the ride. Enjoy uni life, and try and stay on good terms with your supervisor. Use your second supervisor, as they can give invaluable advise. also try and apply for as much travel funding as possible, as conferences can actually be quite good craic, especially if they are paid for. \n\nAlso look out for any opportunities of Uni swaps for a semester or two. I did one in Brazil, all paid for. It was great! \n\nEnjoy and good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7v1wpc/starting_soon_advice_please/dtp58ik/"}, "36": {"Subreddit": "PhD", "Author": "phdemented", "Date": 1517717719, "Score": 2, "Body": "I finished my PhD in 2011, and currently I work with a bunch of PhDs.  We've talked about it often, and all of us had imposter syndrome to one level or another; many of us still have it. After I graduated, was at the bar with my mid-50's PI and asked him when the dreams about showing to to an exam you didn't prepare for ends.  \"They don't\" he said.  \n\nPoint is (and, having be through it, I know it's pointless to say), but that whole thing is in your head.  You wouldn't be where you are if you weren't smart enough to be there.\n\nAs for tips, looking back from beyond the line...\n\n1) Take as many opportunities to learn new things that you can.  Go to conferences, talk to people there (don't just observe), go to sections outside your specialty.  You'll meet new people, learn new things, and you may find either (a) something you like to do better or (b) even better, something you never would have thought of that helps what you are doing now \n\n2) Work isn't life.  Live outside of work.  Don't neglect work, but REALLY don't neglect yourself. Look for things to do on campus (arts, film shows, music, clubs, sports, what ever floats your boat). Look for things around campus, in town, etc. \n\n3) Don't wait for your PI to do anything for you. It's on you to learn and to take the initiative. Some are supportive, others are just happy to have you slaving away on the bench and getting grants, and if you don't take an active stance in your own development, time can slip by. They may have a ton of useful knowledge, so don't be afraid to ask. Use the other students and post-docs as teachers as well; they've been there for a while and can help pass on institutional knowledge they've gathered over the years\n\n4) FAILURE = SUCCESS.  Experiments fail, grants are rejected, presentations are botched.  But, failure is the greatest teacher. It's hard, but take nothing personally.  Learn, observe, and grow. Accept the failures are part of the whole, and don't look at them as something to reject. I've had major experiments fail at the last minute, \"ruining\" months of work. Then, I stressed and gnashed my teeth and pulled my hair.  Looking back, those failures taught me more than any success I had. \n\n5) Find a neutral professor to act as a 2nd advisor, someone who doesn't work with your PI. It can be helpful to have someone to talk to, both to get a different perspective, or to get advice if you need it. Hopefully you have a wonderful relationship with your PI, but not everyone is so lucky. \n\n5) TRY TRY TRY to enjoy it. It's hard work, it's suffering, it's pain, but looking back I don't regret it.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7v1wpc/starting_soon_advice_please/dtpgcnl/"}, "37": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1517742990, "Score": 1, "Body": "Nicely written. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7v1wpc/starting_soon_advice_please/dtpsohi/"}, "38": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1517767828, "Score": 4, "Body": "Please engage in a conversation below!\n\nThis is based on my personal experience, and it took the joy out of doing science for a long time! If you are being forced to engage in unacceptable conversations, being looked at funny, or being touched without your permission, please report it. I waited too long say something and I was a paranoid mess for a pretty long time. I put these videos out, because I want people to know their RIGHTS. This topic seems to be brushed under the rug, and it's not OK. Unfortunately sexual predators are protected in academia more often than they should be.\n\nIf you are experiencing any kind of unwanted sexual advancements, just know it is ILLEGAL. If you feel unsafe, SAY SOMETHING TO THE CORRECT PEOPLE ON CAMPUS. If you can, keep the proof you have and take it to the Office for Access and Equity (may be a different name at your institution). Keep all text messages, emails, and if you can record. In my state it is legal to record without the other person knowing, as long as you are a part of the conversation.\n\nUnfortunately, you will experience retaliation in a lab that has no regards for the rules and regulations set up on your campus. Retaliation is illegal, and just understand the minute you report this you may need to find a new lab. It's completely OK! You did the right thing, and there is no need to be ashamed of putting your safety first. Let me know if you have any questions! The next video I make will be on how to find a new home lab if you are experiencing retaliation.", "Permalink": "https://www.reddit.com/r/PhD/comments/7v87rl/dont_be_afraid_of_reporting_sexual_harassment_any/dtq8hh2/"}, "39": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1517768401, "Score": 2, "Body": "&gt; People always tell me I should research fields / topics I like, but when telling them I like to solve real world problems, it's not narrow enough.\n\nPeople are right - if you want to get to know the state of the art in your intended field, you have to start reading research papers in that field.  I don't mean one or two papers, but dozens just to get started.  Even if you want to focus on applied work, you first need to become familiar enough with the field that you can understand and appreciate the benefits and challenges of different methods before you can select between them and apply them to specific problems.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ul7il/how_to_come_up_with_a_phd_thesis_topic/dtq926d/"}, "40": {"Subreddit": "PhD", "Author": "beardbro91", "Date": 1517789729, "Score": 1, "Body": "The problem is, that I have to come up with a topic till end of march... On top I‘m writing my master‘s thesis, which also has a deadline... Can‘t read a ton of research papers atm... :/", "Permalink": "https://www.reddit.com/r/PhD/comments/7ul7il/how_to_come_up_with_a_phd_thesis_topic/dtqso07/"}, "41": {"Subreddit": "PhD", "Author": "samclifford", "Date": 1517792939, "Score": 4, "Body": "Congratulations!\n\nIt's going to be a wild ride from here but well worth it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtqvvln/"}, "42": {"Subreddit": "PhD", "Author": "aritra91", "Date": 1517793767, "Score": 3, "Body": "Congrats!!!!! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtqwmo5/"}, "43": {"Subreddit": "PhD", "Author": "juxta-pose", "Date": 1517795645, "Score": 9, "Body": "Good for you! What will you be studying/researching?? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtqydiu/"}, "44": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1517798507, "Score": 2, "Body": "Congratulations! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtr19rc/"}, "45": {"Subreddit": "PhD", "Author": "phdemented", "Date": 1517802596, "Score": 2, "Body": "Congrats\n\nNow the real work begins :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtr5i4h/"}, "46": {"Subreddit": "PhD", "Author": "fleurdeclaire", "Date": 1517818546, "Score": 1, "Body": "Congratulations!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrftqt/"}, "47": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1517819949, "Score": 2, "Body": "Congratulations!!! Is that a normal application experience?", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrgeyr/"}, "48": {"Subreddit": "PhD", "Author": "rijjz", "Date": 1517823385, "Score": 2, "Body": "Im probably lucky but I got into a funded 3 year phd in catalysis with one interview and a bachelors degree in chemistry.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrhqkj/"}, "49": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1517823579, "Score": 1, "Body": "Holy smokes bro! Mega congrats! In the next two years I want to apply to a Fully funded program for Applied Linguistics. You are my inspiration!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrht4n/"}, "50": {"Subreddit": "PhD", "Author": "Huwbacca", "Date": 1517834838, "Score": 1, "Body": "Linguistics is crazy interesting. I always wish I could half drop out of my programme to do it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrmfka/"}, "51": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1517839820, "Score": 2, "Body": "You got this! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vetn5/just_applied_for_my_first_phd_programme_excited/dtrpkew/"}, "52": {"Subreddit": "PhD", "Author": "psychendurance", "Date": 1517842352, "Score": 8, "Body": "I’ll be getting my PhD in either clinical or counseling psychology. I haven’t picked which program yet. \n\nI study the romantic relationships/close friendships of trans individuals, and the effects these relationships have on mental health and well-being. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrrjti/"}, "53": {"Subreddit": "PhD", "Author": "psychendurance", "Date": 1517842477, "Score": 3, "Body": "Honestly not sure. Applied to two schools out of undergrad. Got accepted to a masters program, with one interview. Didn’t go because fit was poor/bad breakup. \n\nAfter one year out of undergrad, I applied to 10 PhD programs, 2 MA programs. Interviews and acceptances at both MAs, interview from one PhD. \n\nWent for my MA. Took a year off after to teach and apply again. \n\nThis round I’ve had 6 interviews and 2 acceptances so far. I feel so fucking lucky. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtrrnm5/"}, "54": {"Subreddit": "PhD", "Author": "Sheep_Thrills", "Date": 1517854016, "Score": 2, "Body": "Thank you. I'm hoping with the contemporary nature of my research will see me through!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vetn5/just_applied_for_my_first_phd_programme_excited/dts32ux/"}, "55": {"Subreddit": "PhD", "Author": "kutekittenkisses", "Date": 1517862652, "Score": 2, "Body": "Best of luck!! It’s an exciting and difficult journey, but well worth it!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vetn5/just_applied_for_my_first_phd_programme_excited/dtsc8s0/"}, "56": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1517868301, "Score": 2, "Body": "I guess it depends on the course, but I teach General chemistry 1.5 hr lectures. Including examples, I go through anywhere from 20-30 slides depending on the material and the difficulty. I also have quizzes at the end of each chapter which are 15-20 min in length. This means one 'lecture' is inherently shorter than the other. I have never practiced slides, but I have taken notes on the book topics and had my notes with me in case I miss something important. This is wholly dependent on you as an individual though. I know some professors who memorize all their lectures, and others who just wing it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dtsiefh/"}, "57": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1517879437, "Score": 2, "Body": "Wow! You're gonna do well with that tenacious spirit. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtssxnx/"}, "58": {"Subreddit": "PhD", "Author": "Netcat2", "Date": 1517880076, "Score": 2, "Body": "Socially, have a friend at another university doing a PhD, we get coffee and rant\n\nPhysically, lift some weights\n\nMentally, frequent r/nihilism to remind myself we’re all going to be dead eventually and on a cosmic scale my research is wholly insignificant (really takes the pressure off!)", "Permalink": "https://www.reddit.com/r/PhD/comments/7u9rjq/self_care_in_phd/dtstifv/"}, "59": {"Subreddit": "PhD", "Author": "psychendurance", "Date": 1517881194, "Score": 2, "Body": "Thank you! I’ve worked hard and am going to get this damn degree if it kills me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vb3p4/i_got_in/dtsuiw8/"}, "60": {"Subreddit": "PhD", "Author": "guchijj", "Date": 1517895820, "Score": 5, "Body": "congrats!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vk10r/finally_got_my_admissions_letter/dtt6jfg/"}, "61": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1517902230, "Score": 1, "Body": "Have you used lesson plans? Prior to each class session I create a lesson plan and budget time that way. The entire lesson plan typically resembles a paper outline and is 1.5 pages in length, single spaced. Usually looks like: \n\nLearning objectives\n\n- Students will understand... X, Y, Z\n\n- Students will be able to... X, Y, Z\n\n\nInstructor prep: \n\n- Print and bring X\n\n- Remember to bring Y\n\nStudents will have read: \n\n- X, Y, Z\n\nAgenda:\n\n- Warm-up writing activity (5min)\n\n- Check-ins (5min)\n\n- Reviewing previous meeting's content (5min)\n\n- Key content (20min)\n\n- Activity/small-group/unpacking/experiential (20min)\n\n- Wrap-up/assessment (5min)", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dtt9z41/"}, "62": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1517903882, "Score": 3, "Body": "Congratulations! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vk10r/finally_got_my_admissions_letter/dttapmr/"}, "63": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1517904322, "Score": 2, "Body": "Depending on your supervisor/adviser, your topic can be vague at this point. I think identifying the real world problem is a good start, and with some discussion of the research question around it. A large part of the PhD is the literature review so you can't really get into the nitty gritty until then. Sometimes the exact topic doesn't get clear until you've started with the work.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ul7il/how_to_come_up_with_a_phd_thesis_topic/dttawip/"}, "64": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1517954683, "Score": 1, "Body": "What country?  What field?", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtuf2zg/"}, "65": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1517956337, "Score": 1, "Body": "I had two interviews. First one I heard within two or three weeks. The second one took a bit like longer.  About 6-8 weeks, as far as I can remember.  I interviewed in Feb/Mar for start the following January. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtugspk/"}, "66": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1517961541, "Score": 2, "Body": "Yeah I like to do lesson plans too (/u/rhetoricetc), and then I keep a form of the lesson plan in the margin of my teaching resource which I can constantly refer to while I teach. This margin content refers to student-based learning activities, timing of teaching content, further points that might be of interest to students (if I need more content), or just content that I forgot in the teaching notes that I need to make sure I cover (usually post-print corrections).\n\nTypically, I will have a set of teaching notes with the general idea of the concepts I want to cover during that time. Then I will break up my time like /u/rhetoricetc has in the agenda. And I'll usually cover the notes plus further thought and expand on concepts while I teach.\n\nOnce this is figured out I put my timings (usually the time that I need to be finished with a section of teaching) in the margin of my notes and then I'll just work off of it.\n\nIt's a little bit hard to tell you how much to have. But my mentor always told me that with public speaking you should aim for about 140 words per minute. This can vary depending on the complexity of the topic and also if you are going to be interacting with the class, that is accounting for questions. \n\nIn the end, I wouldn't sweat it too much. If you find you don't have enough time the slides will still be there, and it forces you to be plain in your speaking. If you have too little (and I mean by at most 15mins) then people get to leave early and your students will appreciate that. If you are severely short on content, well then the diagnosis is a bit more damning...\n\nGood Luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dtultl2/"}, "67": {"Subreddit": "PhD", "Author": "chrisd234", "Date": 1517962977, "Score": 1, "Body": "No interview for me. \n\nTwo months from application completion to decision. Just got an email one day that said I should login and check my status and had an acceptance letter waiting. \n\nIf it helps, I can relate to your anxiety. I had a hint that a decision was made because the ordering of my various applications (tuition, scholarship, admission, etc) changed orders and my actual admission application bumped to the top. I called the particular department and they said A decision was made but they weren't at liberty to reveal it to me and that I should call graduate admissions. I called graduate admissions and they told me the same thing, verbatim. She did however drop a hint. \"We're explicitly forbidden from giving you the admission decision over the phone........ but if I were you I'd look into the cost of books\". \n\nA few hours later I received the email to check my admission status and it was posted", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtun57k/"}, "68": {"Subreddit": "PhD", "Author": "Zaiquiri32", "Date": 1517967213, "Score": 1, "Body": "Psychology in the United States ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtur648/"}, "69": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1517998531, "Score": 1, "Body": "2 and 3 especially. Try to work 9-5 etc, don’t let your boss overwork you. \n\nAnd spend your initial free time learning your techniques, project etc. Study and learn on your own, get experimental protocols from online/lab colleagues and then study to understand them. “Why use this stain and not this one? Why is loading order important? What are the most common problems with this technique?”", "Permalink": "https://www.reddit.com/r/PhD/comments/7v1wpc/starting_soon_advice_please/dtvc2tb/"}, "70": {"Subreddit": "PhD", "Author": "TaXxER", "Date": 1518006962, "Score": 1, "Body": "Mathematically, we at least know that the time x between interview and decision (in milliseconds) is in the set \n\n$\\{\\infty \\ge x \\ge 0|x\\in\\mathbb{R}\\}$.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtvfypp/"}, "71": {"Subreddit": "PhD", "Author": "Zaiquiri32", "Date": 1518014151, "Score": 1, "Body": "That’s great to hear. Congratulations and best of luck in your studies!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtvl6ut/"}, "72": {"Subreddit": "PhD", "Author": "NGUSG", "Date": 1518023109, "Score": 3, "Body": "I was incredibly lucky enough to hear back the same day as my interview (email an hour or two later), but I think the normal wait is around 1-3 weeks, maybe longer depending if they have more applications.\n\nJust try to relax and keep your mind busy in the mean time. Good luck with your application.", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtvucwz/"}, "73": {"Subreddit": "PhD", "Author": "RTMicro", "Date": 1518025988, "Score": 1, "Body": "I got a phone call the same day saying I got it, however I’m in the UK so I’m not sure if it would work the same in the states ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vqhqb/time_between_interviews_an_admissions_decision/dtvxk0u/"}, "74": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1518112111, "Score": 1, "Body": "Check the actual research of the place and supervisors in question. If they’re regularly publishing in top journals then it’s good. \n\nGoogle impact ratings for journals, find the top 5-10 in your field of interest and cross check with the staff publications. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/dtxvfbv/"}, "75": {"Subreddit": "PhD", "Author": "pseudonym1066", "Date": 1518117456, "Score": 1, "Body": "Maybe they're doing research which is about to be published. Maybe ask them directly ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5tp1/research_group_choice_field_activity_relevance_a/dty1u69/"}, "76": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1518119289, "Score": 2, "Body": "Thanks all for the comments! I learned a lot from my own experience this week and I was finished a bit early but had a back up plan for that - some short parts from a documentary related to the topic of that day. Lecturing for that long was really something weird for my brain heh", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dty3zok/"}, "77": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1518119359, "Score": 1, "Body": "I will have this sort of agenda for my seminars. Thanks for the tip ;)", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dty42k8/"}, "78": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1518119422, "Score": 1, "Body": "Can't wait when I will mature into just winging it hehe ", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/dty456z/"}, "79": {"Subreddit": "PhD", "Author": "ragnarok189", "Date": 1518120789, "Score": 5, "Body": "Congratulations :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dty5qqv/"}, "80": {"Subreddit": "PhD", "Author": "RupertPhD", "Date": 1518121834, "Score": 1, "Body": "A couple comments. A PhD is something you do because you want to do it, not because your manager wants you to do it. It takes most people 4-6 years of full time work to complete. Are you going to retain your industry position (and salary) while working on your PhD? If your motivation is career advancement, I would be surprised if leaving industry to get a degree and then returning to industry would be more beneficial to you than another 4-6 years of experience and advancement in that very industry.\nSecond, most PhD's end up doing work quite unrelated to their graduate research. If your company wants an expert in something, then maybe they should just hire someone who has a PhD in that topic. It would be faster.\nFinally for your actual question of publication record - it depends on the field. In some fields there are fads and buzztopics that become big for 5-10 years and then fade out as something new crops up. Is this topic one of those? Are there other research groups more actively publishing in this field, and are those publications still in high impact journals? Just something to think about. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5tp1/research_group_choice_field_activity_relevance_a/dty6wxi/"}, "81": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1518122961, "Score": 5, "Body": "Congratulations!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dty86zp/"}, "82": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1518123895, "Score": 7, "Body": "Congratulations!! get a huuuge vacation now! =)", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dty98uu/"}, "83": {"Subreddit": "PhD", "Author": "IscaNicholas", "Date": 1518131501, "Score": 1, "Body": "Congrats! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtyh4a0/"}, "84": {"Subreddit": "PhD", "Author": "Blacvelvetpengun", "Date": 1518137139, "Score": 2, "Body": "YOU ARE DR!!!!! Way to go!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtyma86/"}, "85": {"Subreddit": "PhD", "Author": "cheezburgapocalypse", "Date": 1518146081, "Score": 0, "Body": "Have you spent 6 years in the evil medical school?", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtyub8u/"}, "86": {"Subreddit": "PhD", "Author": "60MilesUp", "Date": 1518149589, "Score": 2, "Body": "At least in my field, this is pretty common. I ran into the same issue and ended up visiting one of the programs outside of the official dates. The official visit is nice because there are more activities planned, but the school is trying to recruit you so generally they'll still want you to visit even if it's at a different time. The school I visited outside of the official dates is the one I ended up attending and I don't think I would have made the same decision if I hadn't visited them at all. I would just tell one of them that you can't make it during the official visit and ask whether you can come at another time.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w9t5s/overlapping_visit_offers/dtyxaq4/"}, "87": {"Subreddit": "PhD", "Author": "phdemented", "Date": 1518149972, "Score": 1, "Body": "Absolutely ok to reschedule if they overlap. Just let one of them know the proposed date is not available, and request another. It's not a mark against you, they know you have schedules too.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w9t5s/overlapping_visit_offers/dtyxmf6/"}, "88": {"Subreddit": "PhD", "Author": "kaswing", "Date": 1518152158, "Score": 1, "Body": "? Check the subreddit name and I think you'll have your answer :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtyzbst/"}, "89": {"Subreddit": "PhD", "Author": "navayan", "Date": 1518153196, "Score": 3, "Body": "congratulations.I may be Dr too by April 2018.Thesis submitted.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtz03mv/"}, "90": {"Subreddit": "PhD", "Author": "GuillaumeDuCoin", "Date": 1518155201, "Score": 1, "Body": "Congratulations! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtz1hw5/"}, "91": {"Subreddit": "PhD", "Author": "pseudonym1066", "Date": 1518164352, "Score": 1, "Body": "What was your thesis about?", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtz6azc/"}, "92": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1518169287, "Score": 2, "Body": "No, so he’s called “Mr. Thankyou very much.”", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtz8b71/"}, "93": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1518170758, "Score": 2, "Body": "Congratulations I_Love_Dr!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtz8vpi/"}, "94": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518176744, "Score": 2, "Body": "Thanks for the advice. Seems like it's a farily decent place.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/dtzbbbh/"}, "95": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1518176866, "Score": 1, "Body": "Good. Now actually speak to the staff and students, see if there is a good working culture, which supervisors are good and which are bad. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/dtzbdfa/"}, "96": {"Subreddit": "PhD", "Author": "Uniworsal", "Date": 1518181895, "Score": 1, "Body": "How long and which field?", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtze3si/"}, "97": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1518195866, "Score": 1, "Body": "I don't know if this is really the sub for such particular knowledge of universities rankings in specific fields, maybe ask /r/science or /r/biology. I imagine those subs could give you better insight than we can", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/dtzqxm0/"}, "98": {"Subreddit": "PhD", "Author": "superfpfp", "Date": 1518200731, "Score": 1, "Body": "The MIBTP is a good scheme, I'm on the program. All three of the Universities are pretty good in my opinion, I spent three months at Warwick, no complaints really :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/dtzw568/"}, "99": {"Subreddit": "PhD", "Author": "DidntThinkNewInfo", "Date": 1518203925, "Score": 2, "Body": "Hahahaha that comment history holy shit.  10 years between comments.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/dtzzhyd/"}, "100": {"Subreddit": "PhD", "Author": "kevinhosford", "Date": 1518207888, "Score": 4, "Body": "Congrats! I was informally accepted July of last year and started in October, my best advice is to figure out a solid workflow (i.e gathering readings, making notes, etc.) so when you start you're not wasting time figuring out workflows, also maybe learn the basics of some software you plan to use or methodologies.\r\n\r\nBest of luck! We're all rooting for you!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du03lnk/"}, "101": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518209503, "Score": 1, "Body": "Thank you! Best of luck to you too :-) \n\nI've been working as a research assistant for my professor (the one that sponsored me) and I've been getting in that habit.\n\nI also just downloaded a statistical analyses software and will be learning how to use that this summer. I think the statistics part will be the biggest hurdle for me. Thank you again!  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du059fm/"}, "102": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1518209976, "Score": 2, "Body": "Start reading journals for your field. I would look at the latest issues of about ~10 leading journals for OB / Strategy / Management - read the summaries for each issue over the last couple years to get a feel for the direction of research. Then pick out articles you find interesting, read them, look up the main papers the cite, read those ... Do a lot of reading ;)\nAnd somewhere in there start writing down ideas you might have for research", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du05qsn/"}, "103": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518210612, "Score": 1, "Body": "That is great advice! I actually was told to do that by my professor before I started working for him. \n\nI've narrowed down my focus of research and am reading as much as I can on that specific topic. Preparing for the seminars in the fall is what seems a little scary right now. Thank you for your response! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du06dk3/"}, "104": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1518210859, "Score": 2, "Body": "Ok second follow up: don't get too married to one idea because once you start it could very likely change. Make sure you read pretty broadly so you have a sense of the field -- it is good to have interests but make sure you can understand what others talk about when they give talks.\n\nFor the seminars do you know your course list? I was really rusty on math going in so microecon was pretty rough for me ...", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du06mdk/"}, "105": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518211243, "Score": 0, "Body": "That is good advice too, thanks. I'll be doing a ton more reading in the summer because I am still in classes and working rn, but yeah I'll make sure to do that too. \n\nAnd I have no idea as of now, but like I said, I haven't even been formally accepted yet and this starts in August. \n\nRegardless, I should brush up on things like that to be ready. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du0703z/"}, "106": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1518211951, "Score": 2, "Body": "Cool. Do your best but there will be plenty of work when school starts, so also enjoy the summer a bit as well.\n\nEdit: &amp; good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du07p74/"}, "107": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518213056, "Score": 1, "Body": "Thanks! Appreciate the tips ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du08svl/"}, "108": {"Subreddit": "PhD", "Author": "NGUSG", "Date": 1518214697, "Score": 3, "Body": "I went from undergrad to PhD (started in October). It's a big jump and I'm still not sure what I'm doing half of the time. My advice is to take the time to read some journals in your field to get a basic understanding of what you'll be working in and you're sorted. No one expects you to know everything  (or anything) before you start, so stay calm and make sure to speak to your supervisors or other students if you're struggling with anything. Most importantly, try to take the time off between your undergrad and PhD to treat yourself and relax. \n\nBest of luck with your studies!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du0acqw/"}, "109": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518215720, "Score": 1, "Body": "Thank you, I'm going to try and relax while I finish my undergrad and in the summer before the real heavy stuff kicks in. I appreciate the comment :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du0bb6r/"}, "110": {"Subreddit": "PhD", "Author": "kevinhosford", "Date": 1518216345, "Score": 2, "Body": "Oh nice!\n\nYa statistics can be a bit of a hurdle to get to grips with, I'm assuming you're going to use SPSS which is great for big datasets, but I'd also recommend looking at Orange or RapidMiner for doing small and quick data analysis which are pretty good when dealing with simple datasets", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du0bvvp/"}, "111": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518216777, "Score": 2, "Body": "I downloaded R, that's the one that was recommended to me. They said it was hard to get started with, but is one of the more powerful ones once you do get it. \n\nI'm also thinking I should buy a reference logger to keep track of everything I've read. That way it'll be easier to sift through come writing time. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du0ca56/"}, "112": {"Subreddit": "u_PhD_in_Dumb", "Author": "mm294", "Date": 1518218913, "Score": 2, "Body": "This happened to me with a credit card. I clicked twice in their ugly app and got double-charged. Then they told me that they would send me a check before telling me that they'd refund my checking account. Turns out, they did both and I was back to where I was before I tried to make the payment.", "Permalink": "https://www.reddit.com/r/u_PhD_in_Dumb/comments/7wa986/paying_online_never_ever_ever_click_pay_twice/du0e6cc/"}, "113": {"Subreddit": "u_PhD_in_Dumb", "Author": "PhD_in_Dumb", "Date": 1518224340, "Score": 1, "Body": "I just got [done](https://redd.it/7weqeg) dealing with a CC double payment, one where I paid off the balance manually, then the auto pay hit me again for the same amount.", "Permalink": "https://www.reddit.com/r/u_PhD_in_Dumb/comments/7wa986/paying_online_never_ever_ever_click_pay_twice/du0irpn/"}, "114": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518225128, "Score": 2, "Body": "Ah I see. I asked here because I thought to get more of a PhD student viewpoint on things rather than undergraduate etc but will check those out, thanks.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du0jeow/"}, "115": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518225257, "Score": 1, "Body": "Ah that's good to hear from someone on the actual scheme. They do all seem like strong institutions. Which university and which year are you in?", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du0jild/"}, "116": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518225676, "Score": 2, "Body": "Already been on a departmental tour and spoke to a current student when I went for my interview. Also had my first email correspondance with the supervisor whose research i'm most interested in today and it was very positive. His lab seems to be very interdisciplinary, welcoming people from all backgrounds, so i'm certainly warming to the place. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du0jv91/"}, "117": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1518242063, "Score": 2, "Body": "That's good. It's extremely important to get along with your supervisor AND that they support you properly. \n\nSome supervisors will be very involved and supportive of your research, encouraging you to write articles and attend conferences to build your professional profile and skills for future career. Others will be very involved but controlling/bullying, micromanaging and simply shouting regardless of any issues and even rules governing that behaviour. Some supervisors will simply not care/avoid you for months without guidance and you will be left on your own. I'm sure there are other types that people could name.\n\nIf possible, talk to the current students, maybe buy them all coffee or lunch and ask frank questions about how they feel about it. You MUST be certain that the supervisor is someone you can work with for 3 years. A supervisor who who is friendly and cable as both a scientist [practical research/publication work] and as a manager is very important.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du0w32i/"}, "118": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1518245527, "Score": 2, "Body": "Yeah fair enough! Haha they are very different perspectives! It would probably be helpful, if you do post there, to address your post title to postgrads or researchers. Hope you find the right University for your future research!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du0xymp/"}, "119": {"Subreddit": "PhD", "Author": "superfpfp", "Date": 1518250025, "Score": 2, "Body": "I'm based at Leicester and am in my third year of study,becond year of my project. Overall it's a good scheme, first year gets a bit annoying at times.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du100jz/"}, "120": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518260936, "Score": 2, "Body": "Yes definitely seems like a good idea to investigate the supervisor more. With this programme I don't actually have to make a final decision on supervisor/project until near the end of the 1st year, which is a training year, so got lots of time. Anyway thanks for the advice, much appreciated!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du1489l/"}, "121": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518261040, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du149my/"}, "122": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518261404, "Score": 1, "Body": "Why is first year annoying? Also, it may have changed since you did it, but was there much training in mathematical modelling in the initial quantitative skill development modules of year 1? I noticed there is thematic training offered from years 2-4 through MSc courses. Do you know if there are MSc courses you can take to develop mathematical modelling skills? Sorry for the barrage of questions haha", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du14efn/"}, "123": {"Subreddit": "PhD", "Author": "tzucon", "Date": 1518261873, "Score": 1, "Body": "You're welcome. A year of training and time to learn more is an extremely useful advantage, I strongly, STRONGLY encourage you to use it to your fullest.", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du14kpv/"}, "124": {"Subreddit": "PhD", "Author": "superfpfp", "Date": 1518263427, "Score": 2, "Body": "Don't worry about the questions, it's fine.\n\nThey have changed the course since I done it, and will probably change it for when you do it.\nSo in the first year we had 3 months at Warwick, mainly focusing on maths/programing. Im useless when it comes to numbers so I hated this, along with the travelling, it got pretty annoying. They were building the underpass near Warwick which resulted in a lot of traffic, however that's been made now so it is slightly quicker by car now. The train journey from Warwick to Leicester is a right pain.\n\nFrom years 2-4 you have to attend a few seminars / workshops which are not too bad at all. Providing you remember when they are you'll be able to plan your lab work. \n\nI'm not sure about any maths/modelling training that would help. I'd recommend learning stuff like R / Matlab if you can. YouTube or sites such as Datacamp will get you up to scratch. As I said, I'm completely useless when it comes to numbers, and I managed to pass. I'm sure you'll be fine. \n\nIn a nutshell, in the first year you'll get fed up of travelling and will just be eager to get started on your actual PhD project. \n\nSorry for the essay!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du155ui/"}, "125": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518266699, "Score": 1, "Body": "Oh god I think I need to hurry up and pass my driving test haha! I guess it might not be as bad though since I'll be in/near Warwick anyway. Might actually think about on campus postgrad accomodation for 1st year.\n\nWell between what you say and the info on the website there seems to be quite a lot of opportunity to develop my computing and maths skills. That will most likely come in handy considering the research/supervisor i'm interested in. Thanks for the info, great to hear this kind of inside knowledge!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du16j17/"}, "126": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1518270534, "Score": 2, "Body": "Congratulations you fantastic person!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du18jxl/"}, "127": {"Subreddit": "PhD", "Author": "superfpfp", "Date": 1518273797, "Score": 1, "Body": "As you're based in Warwick, you'll have the least amount of travelling. Especially if you choose your 'away' project as Birmingham, you'll be able to make do with the train. Just car share with someone when you need to visit Leicester for certain days. The Warwick bunch have it easy, we all get given the same travel grant, yet the Warwick students don't have to travel as much at all, so you'll be fine lol\n\nYeah, it's a great set of skills to have, have you chosen your project? If there's anything I can advise, it's to do your mini project 1 (away university), PIPS and then your mini project 2 (home university) in that order. That will allow you to have a better transition straight into your project. I did my PIPS as my last project and needed a little bit of time to transition back to the lab. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du1apjo/"}, "128": {"Subreddit": "PhD", "Author": "edvartz", "Date": 1518280128, "Score": 1, "Body": "That definitely seems the logical order to do things in. I haven't applied for a specific project but I'm keen on the reserach in the Hebenstreit lab, which is on how the transcriptome varies stochastically and the causes of transcriptional variation etc. I like the idea of being able to keep my options open should I have a change of heart though, not that I think I will. What are you doing in your project?", "Permalink": "https://www.reddit.com/r/PhD/comments/7w5q17/how_is_the_university_of_warwick_uk_for_biology/du1fmwj/"}, "129": {"Subreddit": "PhD", "Author": "K1ngZee", "Date": 1518300394, "Score": 1, "Body": "Most wholesome post I've ever seen, I'm cracking up. Happy for you man!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/du1xkrr/"}, "130": {"Subreddit": "PhD", "Author": "Tenderhoof", "Date": 1518302061, "Score": 1, "Body": "Amazing! Congratulations! I can't imagine what it must feel like!", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/du1yz0f/"}, "131": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1518319056, "Score": 10, "Body": "I've known people in their 50s doing PhDs; it's never too late.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2cvvo/"}, "132": {"Subreddit": "PhD", "Author": "Tom_Lennon", "Date": 1518319290, "Score": 9, "Body": "It's never too late!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2d2lv/"}, "133": {"Subreddit": "PhD", "Author": "SkinnerBoxed", "Date": 1518322539, "Score": 45, "Body": "If you start right now, you will probably be in your mid 40s with a PhD. If you choose to go a different way, you'll be in you're mid 40s without a PhD. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2flws/"}, "134": {"Subreddit": "PhD", "Author": "shekib82", "Date": 1518322646, "Score": 5, "Body": "great way to think about it", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2foqn/"}, "135": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1518324682, "Score": 7, "Body": "I was 43 when I started mine.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2h5iw/"}, "136": {"Subreddit": "PhD", "Author": "purplekettle", "Date": 1518326796, "Score": 3, "Body": "Not at all. In my program we had a broad age range, from 23 to someone in their 60s. All the best!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2ilst/"}, "137": {"Subreddit": "PhD", "Author": "purplekettle", "Date": 1518326858, "Score": 1, "Body": "Many congratulations, Dr! I hope to acquire that title in a couple of months myself. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7w7eoy/i_am_dr/du2ind1/"}, "138": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1518326901, "Score": 0, "Body": "Ask yourself why. Why do you need a PhD? What will it give you that you can’t get without it. Are you look big for a job in academia? Have you spoken to anyone in academia about what the job prospects are? What tenure track is like? \n\nAlso, if you want to have any hope of finishing you need a scholarship. Completing a PhD (especially in systems) is roughly equivalent to having two full time jobs. Don’t even think you could just “do it on the side”. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2ioff/"}, "139": {"Subreddit": "PhD", "Author": "marstric", "Date": 1518328034, "Score": 7, "Body": "Started mine when I was 34 with two little kids. It's hard but doable. It takes me longer to learn new theory than it would have if I did it fresh out of undergrad. My advice: treat it like a 9-5 job. Make sure those hours are planned and productive. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2jf02/"}, "140": {"Subreddit": "PhD", "Author": "Nylonknot", "Date": 1518332215, "Score": 3, "Body": "Am 45 in May. Got a 9 year old and a dog and a mortgage and a car note and all the other stuff. I just started. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2lq8t/"}, "141": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1518333721, "Score": 2, "Body": "Part-time is doable but really tough. I’m finishing my second year of coursework in this mode, and I’ve been dedicating every single weekend and most evenings to it, after work. I find that it adds ~30 hours on top of my work week.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2mga4/"}, "142": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1518333785, "Score": 3, "Body": "Echoing your experience. Most students in my cohort are above 30, several above 40.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2mhbi/"}, "143": {"Subreddit": "PhD", "Author": "TheGreatRao", "Date": 1518339923, "Score": 1, "Body": "This is the answer I always give when students ask if they are \"too old\".  I also tell them if they want to be an Olympic Gold Medalist, they should have started training early but otherwise, age is not really a factor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2p3cw/"}, "144": {"Subreddit": "PhD", "Author": "greyfriar", "Date": 1518344011, "Score": 2, "Body": "42, and in my 2nd year.\nBest job I've ever had. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2qmix/"}, "145": {"Subreddit": "PhD", "Author": "shewhoruns", "Date": 1518347665, "Score": 3, "Body": "I started mine at 31, fresh out of undergrad,  single, and with two kids. You can start at any age with any background!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2rx43/"}, "146": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518357187, "Score": 2, "Body": "No.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2vuya/"}, "147": {"Subreddit": "PhD", "Author": "Bandgeek252", "Date": 1518360607, "Score": 2, "Body": "I was wondering the same thing. I have a full-time job and some volunteer work. The part time plan is that I take one class a semester. Do you take one class a semester? How much time does one class take you a week? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2xtrz/"}, "148": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1518361098, "Score": 1, "Body": "I take two classes per term (each term is three months, and there are three terms per year). Some classmates have chosen to do only one class per term, and extend the coursework beyond two years. That’s definitely more manageable. I would estimate each class to take about 15 hours per week of reading, researching and writing. YMMV of course depending on the program.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2y4ru/"}, "149": {"Subreddit": "PhD", "Author": "amberJL_S", "Date": 1518362621, "Score": 1, "Body": "Not too late at all! I started my MA/PhD program at 35. I *should* be able to finish my PhD around 41/42. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2z5si/"}, "150": {"Subreddit": "PhD", "Author": "TheGadfly_", "Date": 1518362931, "Score": 1, "Body": "I have a friend whose father got his doctorate after retiring in his late 50s. His only regret is not doing it sooner. Start now!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du2zdua/"}, "151": {"Subreddit": "PhD", "Author": "Bandgeek252", "Date": 1518367320, "Score": 1, "Body": "I'm planning on starting my PhD program in the fall in evaluation. Thanks for the insight. I'm extremely nervous and excited. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du32xsj/"}, "152": {"Subreddit": "PhD", "Author": "oxydis", "Date": 1518367917, "Score": 1, "Body": "Currently doing a PhD in a AI lab in Canada, there are some people definitely beginning PhD in these ages. I don't think it is too late nor do I think you'll be alone in that situation.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du33gdr/"}, "153": {"Subreddit": "PhD", "Author": "Matthew94", "Date": 1518372227, "Score": -1, "Body": "&gt; you're mid 40s \n\nyour", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du37aeo/"}, "154": {"Subreddit": "PhD", "Author": "andreasbnor", "Date": 1518379404, "Score": 2, "Body": "Currently on my second semester of lecturing undergrads in a course I've fully developed myself. Super inspiring if you're allowed to teach what you research -- which is what I do. I remember being a bit nervous the first couple of lectures, but then the feeling pretty much went away, now it's all just fun, especially if the students challenge me in some technical know-how.\n\nI spend quite a bit of time preparing for the lectures in terms of slides, quizzes (Kahoot), exercises/assignments and technical *live coding* in which the students follow along while I code some projects on the projector.\n\nHowever, I don't spend any time practicing what to say, really. Did that the first few lectures, but it takes a bunch of time, and the end-result isn't much different -- I mostly know what to say, and I bet you will too. Remember that the slides are there just as much for you as they are for the students. Use keywords in the slides that'll help you remember what you're going to say. If you can't remember the connection between your keywords and your \"script\", then why would the students connect them afterwards? \n\nGood luck, even if I didn't really answer your question!", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/du3drej/"}, "155": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1518383378, "Score": 1, "Body": "advice for fellow parent with two little ones, in 30's and semi loosing my mind trying to balance it all?", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du3hd6e/"}, "156": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1518383529, "Score": 1, "Body": "Its never too late. Do it!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du3hiak/"}, "157": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1518384286, "Score": 1, "Body": "Thanks for your story! It is really also just nice to hear from other people who are in a similar situation as I am. Otherwise my friends just joke that I'm a young brat just like my students and that I should watch out on having a crush on one of them; or my family just don't understand what is my work all about and say: this means you have even less time for us.. hah", "Permalink": "https://www.reddit.com/r/PhD/comments/7vfjxv/starting_to_lecture_this_semester/du3i78o/"}, "158": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1518392657, "Score": 2, "Body": "Congratulations! I went straight from undergrad to PhD this time last year, and it was a step up but it's not too dramatic if you've done research projects in your undergrad. Reading is the best thing you can do to get on top of what's happening in your field. Articles published in the last 3-4 years will help you the most with getting a grip on the current state of the research, but of course classical papers can be of help too.\n\nI'd also suggest dedicating some time to making a plan. Work out a fairly detailed plan for the next month (I do this every month), as well as broad, general plans for six months, twelve months, and the rest of your degree. It took me about 2 days to really plot out what I wanted to do, and the long-term stuff does definitely change, but it still helps to have a sense of direction.\n\nMotivation is something most PhD students struggle with, and one tip I have in that department is to do 2 solid hours of work at the start of your day. Sit down at your desk and do 2 hours without distractions - no Facebook, no tea breaks, nothing. Then take the rest of the day at whatever pace you like to, because you'll get so much done in those dedicated few hours at the start. Also, take weekends as much as possible. And do something for yourself, like yoga or art or whatever else you're into, every day. Those things are more for your mental health, but good mental health = better productivity with your PhD, so they're important.\n\nThat's all I've got for now. Congrats again, and good luck with your degree!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du3pnym/"}, "159": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1518392984, "Score": 3, "Body": "I'd try talking to professors in the field of human rights and seeing if any of them would be interested in taking you on as a student. I know quite a few people who are doing quite different topics in their PhD to what they did in their undergraduate degrees, stuff that's less related than public affairs &amp; human rights would be. I myself am doing a kind of biomedical tech topic with lots of deep learning... my undergrad was electrical engineering, so it's related but in no way did it prepare me for my PhD.\n\nI don't really think building up your resume with volunteer work would help your chances of getting a PhD in human rights, mostly because I don't know of any unis or colleges that look at anything other than your academics when letting you into a PhD. I never even had to provide a resume for mine, just an academic transcript and a project proposal. You'd be better off doing a masters degree or graduate diploma to bridge the gap if you can't find a potential supervisor who'd be willing to take you right away, in my opinion. Most academics just don't care about anything other than your ability to produce papers, so that would be more worthwhile from their perspective (which I think sucks, but that's a different conversation altogether haha).\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7wwmh0/does_your_undergrad_degree_matter_when_you/du3py09/"}, "160": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1518394478, "Score": 3, "Body": "My undergrad degree is in architecture and I just got a PhD in theology. Of course, I got a Master of Divinity in between. The switch from architecture to religion wasn't too bad, especially since it wasn't my first graduate degree. \n\nThe biggest hurdle most folks face in grad school isn't a change in major, it's a change in ethos. Grad school is fundamentally different from undergrad. You're expected to think, work, speak, and write differently, regardless of major. I suggest you bone up on those differences. \n\nThe earlier advice to talk to faculty in the field was spot on. The grad schools you apply to for a PhD will be far more discerning about your specific research interests and \"fit\" than your undergrad school. You need to look for a good match between your interests (or figure out what those are) and those of existing faculty. Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wwmh0/does_your_undergrad_degree_matter_when_you/du3r6mv/"}, "161": {"Subreddit": "PhD", "Author": "psychendurance", "Date": 1518398843, "Score": 11, "Body": "Tbh? You’re a freshman, and you have a ton of time. Enjoy the ride, get involved in things that matter to you, study hard but not at the expense of friendship and self care. I had about a 3.0 my first two years of college, and pulled up my GPA to 3.67, went to an MA, and now will be getting my PhD. Through that I’ve also had a job as a lecturer/prof at a local college. \n\nBottom line: keep working and keep dreaming. But take it easy on yourself. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du3utcv/"}, "162": {"Subreddit": "PhD", "Author": "p10_user", "Date": 1518402732, "Score": 11, "Body": "You're in luck, being a professor is entirely dependent on grants as well. With the experience you already have for getting grants you have a leg up on the competition!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du3y0pt/"}, "163": {"Subreddit": "PhD", "Author": "sings_in_the_shower", "Date": 1518405335, "Score": 7, "Body": "I don't think it works that way", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxn5q/need_advice_about_graduating/du405py/"}, "164": {"Subreddit": "PhD", "Author": "LazorThor", "Date": 1518405891, "Score": 1, "Body": "Try making a draft/outline of your thesis (the meet part, not intro). This will give you an idea of what is missing. Also a talking point to discuss graduation with your mentor/supervisor. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxn5q/need_advice_about_graduating/du40lk1/"}, "165": {"Subreddit": "PhD", "Author": "RushPerishable", "Date": 1518406554, "Score": 3, "Body": "Lololol I wish so badly ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxn5q/need_advice_about_graduating/du41456/"}, "166": {"Subreddit": "PhD", "Author": "LazorThor", "Date": 1518411402, "Score": 1, "Body": "Paying extra salary due to project run-ones, because they can’t update there 15 year old running critical equipment and it is slow.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wy86c/expenses_in_research/du44nyi/"}, "167": {"Subreddit": "PhD", "Author": "marstric", "Date": 1518412082, "Score": 2, "Body": "Your priority is your family, regardless of what your supervisor says. Sometimes deadlines have to slip if you have to look after sick kids, go to birthday parties, etc. instead. It helps if you have a supportive partner. I'm resigned to taking longer if I need for my PhD if this enables me to balance the rest of my life. \n\nMy dad told me that nobody on their death bed says \"I wish I worked harder\". This helps me keep perspective. \n\nHaving said all that, I don't see my friends or exercise nearly as often as I should... ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du4548p/"}, "168": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1518423960, "Score": 8, "Body": "You don't go to grad school unless you get paid to be there.  There exist a few more professionally-oriented programs where that's not true, but for an ordinary research PhD you only go if you've been offered a stipend which covers your fees, costs of living, etc.  If money's a big concern and you're interested in international politics, you could even look into doing grad school abroad at a country that paid their PhD students better (I'm assuming you're in the US).  \n\nHowever, even if you maintain your perfect GPA and get into a great graduate program and do well in that, the odds of you becoming a professor are still slim, simply because there are way fewer jobs than qualified people and it's an extremely competitive path.  If you do decide to go to grad school, make sure you also look into other careers where a PhD would be a benefit to you and make connections in those areas as soon as possible.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du4bdux/"}, "169": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1518428561, "Score": 1, "Body": "A PhD is must better paid than an undergraduate degree in the majority of cases. Honestly, I wouldn't have done one without a stipend, but they're not as hard to come by as you would think. And being in a PhD program makes it really easy to get jobs as a tutor (and at some colleges/in some programs, as a lecturer) so that's good experience and more money.\n\nOn the downside, positions in academia are hard to come by. You need more than good grades to be a professor. You need to have a PhD in most cases, a decent amount of papers, experience in teaching, general people skills, and a lot of luck. \n\nIf it's your dream, keep working towards it. You're a freshman, and you have heaps of time. Also, none of us are perfect and everyone screws up a subject somewhere along the way, so don't be too hard on yourself if your perfect GPA slips. It's not the end of your dream. And, graduate school will give you better back up options if finding that dream job still didn't work out.\n\nBest of luck to you :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du4d78o/"}, "170": {"Subreddit": "PhD", "Author": "syd_oc", "Date": 1518429538, "Score": 0, "Body": "It's never too late for now.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du4dkjh/"}, "171": {"Subreddit": "PhD", "Author": "joi1369", "Date": 1518431456, "Score": 1, "Body": "I think it could be realistic, but it will require a lot of hard work. Check out the book \"The Professor is In\" as it addresses just what it takes to become a prof in today's world", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du4ea3h/"}, "172": {"Subreddit": "PhD", "Author": "CHARLIETHECHARMANDER", "Date": 1518432813, "Score": 1, "Body": "So I recently got in trouble for turning something in right before a deadline and dropping one of my classes. My advisor was the biggest dick about it, pretty much putting me down and telling me I wasn't acting mature/not acting like a PhD student. I feel upset because the reason why I dropped a class was to be around more for my kids. The deadline was pretty much same reason. What would you have done? Have you been in situations like that? I feel as if I'm at the mercy of my advisor since it's competitive field. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du4esqv/"}, "173": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518434907, "Score": 1, "Body": "Someone has to fill professor roles, so why not you?", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/du4fn2p/"}, "174": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518435105, "Score": 1, "Body": "Software update costs (is that electronics)\n\nConference/Meeting Hosting?\n\nCloud Server Costs (electronics?)\n\n ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wy86c/expenses_in_research/du4fq69/"}, "175": {"Subreddit": "PhD", "Author": "EFDeezy", "Date": 1518441093, "Score": 1, "Body": "Consumables. I don’t know what your research is about so this may not be applicable: drugs, antibodies, anything for Cell culture, pipette tips, instrument maintenance (balances, pipettes, etc). Just go through your lab and assume that everything will break. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wy86c/expenses_in_research/du4iswh/"}, "176": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518456918, "Score": 2, "Body": "Thank you so much! That was very well written and I appreciate what you said. I will definitely start making those detailed plans for the month and then goals for the rest of the year. \n\nI really like that idea about dedicating time in the morning exclusively for work, I'm sure you can get an unimaginable amount of work done if you stick to that. \n\nIf you end up seeing this, do you have any other tips for once you got rolling in the program. I heard the first year is mostly a whole lot of reading. Did you have a similar experience? \n\nDid you get enough sleep? Sleep is incredibly important to me and I'm thinking of how I will manage my sleep once I get started. \n\nThank you again :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du4wwxr/"}, "177": {"Subreddit": "PhD", "Author": "LaNtsandLaminins", "Date": 1518462289, "Score": 2, "Body": " Broken promises suck.\nI had a similar experience where I did the genetic analysis that led to identifying a novel mutation. The clinician published the article without including myself or even my PI as authors, effectively treating our research group as a service. Massively frustrating.\n\nIn the end, it sucks but there isn't much recourse. \nBy definition You aren't an author if you haven't contributed to drafting or editing the manuscript and so the journal has no reason to add you assuming they follow the icmje guidelines. I'm sure other people in your lab will have been included as an author for less but that won't help you here, will just make you more frustrated. \n\nThe unethical approach to data is much more worrisome! That will come back to bite your PI in the end so I wouldn't even want to push to be on a paper where I was only tangentially involved for the fear that it would be retracted.\n\nSo, it sucks but try not to let it bother you (easier said than done!), in the end middle author on a questionable paper won't make a big difference on your career anyway.\n\nKarma will out- the PhD student you helped might be able to help you in the future...", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du52m8d/"}, "178": {"Subreddit": "PhD", "Author": "dmap02", "Date": 1518465895, "Score": 7, "Body": "Well as long as the author contributions say your role was doing the science whereas they were responsible for analyzing data you should be safe.\n\nI’m sick of broken promises in science too. Happens way too often, apparently. The very best thing we can take away from this is to advocate for ourselves. You may not be included, in the end, as an author - but if you talk to the PI about it, at least you will have done the best you can do.", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du56eah/"}, "179": {"Subreddit": "PhD", "Author": "andreasbnor", "Date": 1518467907, "Score": 2, "Body": "One approach would be to start reading some papers related to what you want to do, and take note of the authors and their affiliations. You'll get a feeling of which universities are well-represented within the field you want to target, and perhaps specific persons you could contact for possible supervision and questions regarding PhD programmes. \n\nRemember that a PhD is something that'll require your utmost attention for several years. Enjoying something \"enough\" might not be \"enough\" when all you do is dread opening that LaTeX/Word document you've worked on for a year, but you know you still gotta spend your weekends working on it because the rest of your week is filled with supervising undergrads, teaching, developing course(s), doing PhD courses (if you have any), and so on. This isn't an easy way out of being bored with industry work. \n\nCan't answer your question regarding career prospects, as I'm not familiar with your field. However, you should ask yourself if you already now know whether you want to continue within academia after your PhD or if you want to go back into the industry. If you want to go back, you should perhaps ask some companies related to your field what they think about PhDs versus grads/undergrads. I did something similar with companies related to my field, and they were all positive towards hiring PhDs, but they would still favour a grad/undergrad with 4-6 years of relevant work/hands-on experience. So there's that. \n\nIn terms of research experience, I suggest you start familiarizing yourself with your field through reading papers and taking note of possible research gaps, common methods and methodologies (and read up on them), interesting and recurring outlets (conferences, magazines, journals), trending topics (e.g. for a short paper or position paper) … \n\nGood luck, but remember: the PhD in itself isn't what you should desire, rather it should be to uncover something previously unknown which evidently leads to a PhD, and have a burning interest in doing so. \n\nEdit: re-worded paragraph on hiring.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxy2i/software_engineer_wanting_to_pivot_into/du58jqm/"}, "180": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1518469404, "Score": 1, "Body": "It's not even about the broken promises perse but much more about the fact that my supervisor pushed me well beyond my breaking point and is denying me the only compensation I could have gotten for it. I can't even begin to describe the anxiety I felt at that time (since pushing myself that far beyond my own limits still didn't even come close to being barely enough for him). For example, around that period I had gotten the flu for the first time in 15years, after working 2 16h days that weekend (+4h commute each day). His respons? Saying that I still hadn't finished filing my next study to the ethical committee and thus didn't seem able to do my work independently. A few months later, (3 months before the supposed end of my PhD),  we discovered that due to an error he made, all my analysis had to be rerun and all my manuscripts rewritten. I then subsequently had a burnout. My funding ended. I got a job elsewhere and am now voluntarily trying to finish in my free time. It just makes me mad that after everything he has ruined for me, he would even deny me those (small) things. Kind of like what you say about the being used as a service, without any kind of compensation. I just want some kind of recognition, even though I realise co-autorship doesn't mean that much. \n\nAbout the unethical stuff... That's something I struggle with in all my studies. At the moment, another professor has also gotten involved in my PhD so hopefully the damage can be minimal. He has previously blocked my progress by denying to give feedback on manuscripts that weren't entirely done in his (unethical) way. Since I am on a grant he has acquired, I am not allowed to publish without him. \"Luckily\" in the past following his advice has led to being rejected and \"just\" losing massive amounts of time over and over again (and subsequently pushing myself to my limits to try to make up for lost time). I really hope that one day it will come back to bite him in the end. Unfortunately, he's close to retirement and does the kind of research that looks good from afar but far from good (e.g. he's highly respected internationally, until you actually work with him and see what he does).\n\nIt is unlikely that I will get any help or compensation from the other PhD student. We have no contact whatsoever and, apart from the methodology I helped her with, we have almost nothing in common in our research. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du5a5d0/"}, "181": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1518469754, "Score": 2, "Body": "The PI is kind of the problem, I fear. I think that the broken promises are just another way of enslaving us. We don't get paid for putting in extra hours, we don't get \"extra vacation\" for extra hours (it was a struggle to be allowed any vacation at all), we often get treated in abusive ways,... Broken promises are just another way of denying compensation for the work we do. \n\nIf the PI isn't open to talking about it, I could always talk to my co-supervisor about it. I know she's very correct in these things. It would be enough if she could just point out to him that that's no way to treat people.", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du5aim9/"}, "182": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1518470586, "Score": 2, "Body": "I did have a similar experience, I read a lot. I had a slight advantage in that I did similar research in my undergraduate thesis, but it was still a lot of reading. Overall I found first year a bit hard because a lot of the time I felt like I wasn't going anywhere, because it was so much reading and ground work. I gave a seminar 6 months in and then at the end of the year I published a literature-review-style article and that was really all I physically had to show for my efforts. My supervisors were thrilled though. So even if you don't feel like you're making enough progress, you probably are as long as you're working regular hours.\n\nFor the most part, I have been getting enough sleep. I try as best I can to treat my PhD as a 9-5 job, and I do a little extra after-hours work to catch up when I've had a big week of tutoring (I teach two classes). With very rare exceptions, I stop working before 8pm so I have time to wind down and get to sleep by 11pm. I then get up at 6am and start again. I mean, I could sleep longer if I wanted to but I've never really needed more than 7 hours personally and I feel like I function better off it. Everyone's different in that regard, but yeah you can definitely keep a healthy sleep cycle as long as you put the effort into looking after yourself :)\n\nGood luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du5be57/"}, "183": {"Subreddit": "PhD", "Author": "Astro_Biscuit", "Date": 1518472826, "Score": 1, "Body": "Honestly I would quit that supervisor! I don't know who complaints procedures work where you are but a PhD is incredibly challenging even with a supportive and helpful supervisor. If there's any way you can switch to working with someone else without losing loads of money or years of work, I would recommend exploring it! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du5dqns/"}, "184": {"Subreddit": "PhD", "Author": "jaketelk", "Date": 1518493737, "Score": 1, "Body": "Wow, congrats on that publication! A lot of people I've heard about haven't gotten anything published by that point. That habit sounds manageable, thank you for sharing your experience. I will definitely look back on this once I get started for reference. You've given me some thoughtful advice :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/du5wwb2/"}, "185": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1518506723, "Score": 1, "Body": "Unfortunately there is no way to quit him and finish my PhD. (I have made a post elsewhere complaining about it in more detail.)\n\nI'm now in the best possible circumstances since the Dean has gotten involved and now another professor is my co-supervisor (and she's one of the best supervisors at our faculty) and I'm working elsewhere for 90%. This probably means I won't finish any time soon, but it also means not having to deal with this 24/7. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/du65lsc/"}, "186": {"Subreddit": "PhD", "Author": "captainante", "Date": 1518539151, "Score": 1, "Body": "You do not need a publication to get into a PhD program. One route is reaching out to professors you know, possibly from your undergrad, and seeing if they know any professors who might be willing to take on a student. Oftentimes strong letters of recommendation from faculty connections can weigh more than publications.", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/du6p3pu/"}, "187": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1518550488, "Score": 5, "Body": "If somebody (anybody) specifically writes you an email it’s probably not ever going to be too much effort to write a simple than you acknowledging the message in return. Maybe just reply thanking them for the message and saying that you love the work and the opportunity to do it? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7xbljh/should_i_answer_to_a_email_from_the_universitys/du71ij2/"}, "188": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1518551975, "Score": 5, "Body": "How did he sign off? Does he have a PhD or medical degree? If he just signed off as “John”, reply to John. If he’s got a PhD/MD etc, call him “Dr...”. If not Mr is fine, unless he’s somehow a king or something. Then you might want to go your “Your majesty”", "Permalink": "https://www.reddit.com/r/PhD/comments/7xbljh/should_i_answer_to_a_email_from_the_universitys/du7368n/"}, "189": {"Subreddit": "PhD", "Author": "Epistaxis", "Date": 1518555336, "Score": 2, "Body": "Usually university presidents use \"President\" as their honorific, so that's easy.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xbljh/should_i_answer_to_a_email_from_the_universitys/du76ynt/"}, "190": {"Subreddit": "PhD", "Author": "iapetusocean2016", "Date": 1518560766, "Score": 3, "Body": "This sounds really interesting,I will like to be part of the community.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7cpn7/"}, "191": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518560901, "Score": 1, "Body": "Wonderful! Please feel free to sign up at the link.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7cud7/"}, "192": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1518570994, "Score": 2, "Body": "Just a thought, why did you prefer an external forum over creating a subreddit? I’m thinking that having to deal with an external forum is a factor that’ll play against adoption. People here are already on Reddit by definition, and would just have to subscribe to the sub to engage in the discussions. I like your idea, but I won’t remember to go and visit an external forum after a visit or two (nor deal with the inconvenience of dealing with yet another website/login etc).", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7m4h9/"}, "193": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518572163, "Score": 1, "Body": "Good question. I did so because I'm reaching Ph. D.s who exist both on and off of reddit. It wouldn't make sense to restrict the forum to reddit when the universe of Ph. D.s  that might want to join are more universal -- reached through this and other social media platforms. And I wanted the discussion board to stand on its own.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7n7x9/"}, "194": {"Subreddit": "PhD", "Author": "teedeepee", "Date": 1518572560, "Score": 8, "Body": "I understand. However you have two sets of people in your target audience. One is on reddit, the other isn’t. None of them are on your chosen site yet. That leaves you with at least two options. You can either try to attract *both* sets to register for a new website (tough). Or, you can take advantage of the fact that the first set is already using an existing site (reddit), which leaves you to have to attract only the second set (easier). Furthermore, attracting the second set to reddit is probably easier than attracting the first set to some other website that has no utility beyond just the discussion board you’ve set up.\n\nJust my two cents. I’d love a TrueReddit-style board with the added flavor of PhD thinking, but I won’t go through the hassle of checking yet another website during my day.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7nl8m/"}, "195": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1518580393, "Score": 2, "Body": "I like the idea and will definitely check out the site. I agree with a separate site outside of Reddit, which can get overwhelmed with nonsense very quickly", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7uzs4/"}, "196": {"Subreddit": "PhD", "Author": "TheGadfly_", "Date": 1518583464, "Score": 1, "Body": "This^", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du7xfpb/"}, "197": {"Subreddit": "PhD", "Author": "marstric", "Date": 1518591669, "Score": 2, "Body": "I would have done what you did. I havent been in quite the same situation as you describe. One of my sepervisors (I have 3. Long story) is more pushy than the others mostly because I've neglected the part of my project that involves his field of expertise up till now. He wanted me to prepare a paper for a conference within a totally unrealistic time frame of 6 weeks to meet the submission deadline and at that point, I hadn't put pen to paper because of higher priorities (at least my higher priorites).\n\nI figure pressuring their students is to try and extract the most they can out of them. Many, I think, just project their own work habits onto others, and don't appreciate/understand that everyone has their own priorities in life, not just in their phd or career. \n\nI'd let deadlines, within reason, slide, if spending time with kids/partner is also a priority. Don't feel bad about it and do what is best for you.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du82knn/"}, "198": {"Subreddit": "PhD", "Author": "yay_knowledge", "Date": 1518607702, "Score": 1, "Body": "Bit late to this party, but wanted to say watch out for companies like Editage and similar online companies. If you haven't found anyone yet, I would suggest the Editing Enterprise (https://www.the-editing-enterprise.com/english/), which is a small start-up with skilled editors that also does some great community upliftment. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7qjbkx/editor/du8987o/"}, "199": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1518619938, "Score": 1, "Body": "I hope not - \nI am on the downhill side of 50 and started my PhD in September. since I am doing it part-time, I figure I will be complete around the same time that I plan on retiring.\n\nMy program has a range of early 20s - mid 60s, so I am not the oldest.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/du8h8fi/"}, "200": {"Subreddit": "PhD", "Author": "CoLab_Science", "Date": 1518632060, "Score": 1, "Body": "check out www.Co-Lab.fun", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du8to3n/"}, "201": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518643009, "Score": 1, "Body": "Terrific! I'm trying to get a conversation going in a few of the forums, so if you don't mind signing up and posting a question, an article, or comment...", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du95ggv/"}, "202": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518643146, "Score": 2, "Body": "That looks like a terrific tool. I assume that's your site?", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du95ls0/"}, "203": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518643671, "Score": 1, "Body": "PS: If we can form a community online with PhDs both inside and outside of academia, we can do very good things with it. I am excited! I just need to get the ball rolling.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du9668c/"}, "204": {"Subreddit": "PhD", "Author": "CoLab_Science", "Date": 1518645096, "Score": 2, "Body": "Yup, we should collaborate! Feel free to reach out to us at co.lab.science@gmail.com The more the merrier!", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du97rof/"}, "205": {"Subreddit": "PhD", "Author": "phdco", "Date": 1518648366, "Score": 1, "Body": "I wish that would work! It would be easier. Unfortunately, I have thousands of Ph. D. contacts who spend their time on LinkedIn, Facebook, and other sites, so I have to make it accessible to them, as well. :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7xd15t/a_new_space_for_ph_ds_the_idea_community/du9b2ab/"}, "206": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1518679832, "Score": 4, "Body": "Congratulations! I defended last week. No edits that too!! \n\nHaving said that my stress levels are already back to dangerous levels looking at the job market :(", "Permalink": "https://www.reddit.com/r/PhD/comments/7xovn2/i_have_a_phd/du9zlx2/"}, "207": {"Subreddit": "PhD", "Author": "hiccuphead", "Date": 1518681752, "Score": 12, "Body": "You have a PhD at 14 years of age? Wow, tell me all your secrets! 😍", "Permalink": "https://www.reddit.com/r/PhD/comments/7xovn2/i_have_a_phd/dua0i3n/"}, "208": {"Subreddit": "PhD", "Author": "arbab01", "Date": 1518689420, "Score": 4, "Body": "Set your routine and stick to it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dua370n/"}, "209": {"Subreddit": "PhD", "Author": "TheLaurzor", "Date": 1518701486, "Score": 2, "Body": "I have a few thoughts: \n\n1) See if the university offers grad skills workshops, writing labs to review your work, or student writing groups to keep accountability for your writing. \n\n2) Graduate level courses are generally only good for 7 years, after which they expire and you have to retake them. Check with your university policies to make sure this isn’t your case. \n\n3) I have heard of people who “word vomit” and then hire an editor to fix the  grammar and flow of the writing. If your topic isn’t too technical, this might be helpful. \n\n4) Good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dua949p/"}, "210": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1518705580, "Score": 2, "Body": "Let him/her go and we won't call the police.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xovn2/i_have_a_phd/duacaqc/"}, "211": {"Subreddit": "PhD", "Author": "sliderulewoodworker", "Date": 1518706657, "Score": 4, "Body": "I've written a couple books as well as academic/scientific papers.  #3 is my method.  It's about flow and pushing.  Don't worry about details, and don't spend more than half a second referencing or checking something.  Get your IDEA on the paper.  I'll use bold or highlights and say [reference from Agarwal paper I think] or \"previous studies found that this was significant, xx% versus xx% in the control group.\"  I know the point I'm trying to convey but often don't remember the exact numbers.  I don't let myself get sidetracked looking those up, just put a placeholder and keep it flowing.  Once your have the STORY go back line by line and put in the detail, references etc.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/duad8mw/"}, "212": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1518710097, "Score": -1, "Body": "Seems like the situation is largely your own doing. Work harder, focus, and get it finished - the story of most phds tbh. What else could anyone here possibly offer? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/duagid7/"}, "213": {"Subreddit": "PhD", "Author": "rusu-ki", "Date": 1518712548, "Score": 1, "Body": "Your uni might offer mental health support? Mine will give you a few sessions with a councillor if you need.  Don't listen to people who just tell you to \"get on with it\". Most people don't have the long wait you have had, yes phd is hard but having to do things years later is so much harder than those who dealt with it at the time. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/duaj00g/"}, "214": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518714361, "Score": 1, "Body": "Sympathy for starters...\n\nJust one of countless examples: My supervisor discussed my structure proposal with me and we make a new structure proposal together. While writing I find it illogical and try to discuss it with her again. She refuses to answer any questions for irrational reasons. I adhere slavishly to her structure proposal. She corrects my first draft and finds the same things illogical I found illogical. She has forgotten ever giving me wrong advice. My supervisor is a special kind of awful.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/duakx54/"}, "215": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518714981, "Score": 1, "Body": "I went to my counseler in 2015. He told I he admires that I stuck it out and given my analytic thinking I shouldn't have any problems continuing. So, he did not really help me substantially. I am now based 250km away from my old uni, so counseling is unfortunately out of the question.\n\n\" Don't listen to people who just tell you to \"get on with it\". \"\n\nThank you for this statement. I am often sick from anger whible writing because I know for a fact I would have finished in the normal time-frame with a better supervisor (e.g. my master thesis supervisor). There are so many mistakes which could have been avoided with normal communication and my supervisor not doing things like refusing to answer my questions.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dualk9u/"}, "216": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518715135, "Score": 2, "Body": "1) I am far away from my uni now. I will check if something is offered at my new location.\n\n2) It's fine for me. I checked this when taking the full-time job. (I am not based in the US).\n\n3) I used this strategy for my first draft a lot. It's not so easy for the second draft because it's mostly correcting details.\n\n4) Thank you very much!", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dualqa6/"}, "217": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518715196, "Score": 1, "Body": "My problem is the point where the routine is broken because I (temporarily) don't know how to proceed.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dualsml/"}, "218": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518715246, "Score": 1, "Body": "I have a similar process. I still worry that I'm much slower than others.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dualuiu/"}, "219": {"Subreddit": "PhD", "Author": "lyricalyre", "Date": 1518722009, "Score": -2, "Body": "I'm just super smart so I got it early, Please take your time to admire me in awe thanks bro.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xovn2/i_have_a_phd/duat36o/"}, "220": {"Subreddit": "PhD", "Author": "lyricalyre", "Date": 1518722070, "Score": -3, "Body": "Cool I have a job offer want to be my scullery maid", "Permalink": "https://www.reddit.com/r/PhD/comments/7xovn2/i_have_a_phd/duat5gk/"}, "221": {"Subreddit": "PhD", "Author": "TheLaurzor", "Date": 1518732427, "Score": 2, "Body": "I’ve had this happen a lot. My advisor tells me to do something that doesn’t make sense but they insist. Then when we meet again they “correct” me for doing it wrong. And I’m just thinking to myself “I knew it was wrong to begin with!” \n\nI’ve also written a paper with a post doc who would rewrite certain areas, then forget that she wrote those areas, and make little notes for me to elaborate or change HER writing.\n\nIt drives me mad but it’s the way of things sometimes. I sympathize :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/dub4bux/"}, "222": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1518747406, "Score": 5, "Body": "You will need to make sure you have copyright rights to use the image.  It may be easier to simply find one on a stock photo site and pay the license fee so you do not have to worry about copyright issues later.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xtp7v/the_college_rings_contest/dubi7mn/"}, "223": {"Subreddit": "PhD", "Author": "FtYoU", "Date": 1518764070, "Score": 1, "Body": "The issue here is that my professors are overseas ( europe ) and I doubt after all this time, any will remember me ...", "Permalink": "https://www.reddit.com/r/PhD/comments/7sfg4l/phd_after_industry_hard_decision_xpost_from/dubuoxt/"}, "224": {"Subreddit": "PhD", "Author": "hiccuphead", "Date": 1518767365, "Score": 1, "Body": "This is me down to a tee", "Permalink": "https://www.reddit.com/r/PhD/comments/7n70o3/phd_goals/dubwcym/"}, "225": {"Subreddit": "PhD", "Author": "rusu-ki", "Date": 1518771010, "Score": 2, "Body": "Sounds like that counsellor just needed to assess if you were continuing. Think you need something to re frame the work in your head? Is there anything you have access to where you are?? Cbt/hypotherapy/meditation? (Fyi I don't understand hypnotherapy just a suggestion of something that might mean you can focus on different things as you work). ", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/duby0er/"}, "226": {"Subreddit": "PhD", "Author": "cisforcaffeinated", "Date": 1518796371, "Score": 2, "Body": "Let me start out with: Hard flippin' same, man. I'm a third year in my PhD doing intense bioscience research (with behavioral and biochemical components) and I'm working with a protein no one knows anything about. I have to do all of the optimizing from scratch and yeah it's sexy, ground-breaking work but it's so SLOW. My PI is a brilliant bully and not a \"nurturing\" mentor at all. Your PI is probably out of the bench research loop. I know a lot of more established PI's haven't touched a pipette in 20 years and don't remember how much time and material you need to invest before you get any usable data. They think you're a data robot and treat you like an idiot when you can't conjure data out of thin air.\n\nI second other redditors who advise you to form relationships with other people in your lab. Because you've done so much hard work and fought for the progress you have, maybe you have more experience and expertise than you think. I have yet to produce a western blot I'm happy with but because I've done years of trials and trouble-shooting, I can confidently offer solutions and suggestions to other students in lab. Your relationship with your fellow inmates has a huge effect on how you feel about your work.\n\nTLDR: I had a mental breakdown because of a toxic lab environment and lack of progress and pressure. I reached out to others in lab and readjusted how I interacted with my PI. Check out the article \"The Importance of Stupidity in Scientific Research\" by Martin Schwartz. I have it pinned over my desk. Also mental health counseling: 10000/10 would recommend. Good luck, OP.", "Permalink": "https://www.reddit.com/r/PhD/comments/7u94vo/1st_year_bioscience_phd_tired_stressed_scared/ducdpgz/"}, "227": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1518800420, "Score": 1, "Body": "I wish I'd done that in grad school.  I'm in a different STEM field, but with similar opportunities.  I didn't realize the cash involved with scientific consultation until I finished.\n\nBut yeah, I'd go for it :)  The only trick is checking your grad school contracts and making sure there's no contract conflict with the consulting.  (The most common problematic US scenario is you are receiving a graduate fellowship that prohibits external work; some people work anyways, but they run the risk of someone reporting them to the university and the university terminating the fellowship.)\n\nAlso, depending on exactly what you are doing for the company, you should consider liability insurance and/or founding a protective legal entity for yourself (maybe an LLC), in case you accidentally do something wrong and they sue you for damages and lost profits, etc.\n\nIf you can track down a mentor in your field who provides scientific consultation, they'll give you much better advice.\n\nGood luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7xx416/advice_on_doing_independent_consulting_while_in/duci38v/"}, "228": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1518800459, "Score": 1, "Body": "It's an interesting and appropriate idea, I remember a colleague who never suffered from imposters syndrome doing just that. I can relate what steps he took, don't know if it's going to be very useful for you. \n\n\nMy colleague realized he had in demand skills, so he floated a single person company with him as the only employee ( registering it in the US was very very easy), set up standard hourly charges for himself and created a website for his 'company'. Then, during conferences he would go about meeting people who would need his services. He made a decent amount. Things to remember, this may workout great for you during taxes (since you can call yourself a business owner which as associated business payments), but it may have the opposite effect too. Your PhD progress may suffer, my colleague got so busy with consulting he took a year more to finish. You don't realize this but once you start charging people , you'll have to do a proper job of consulting, which is very different from consulting for free. You'll also have to keep meticulous paperwork which can take a lot of time. Another thing to keep in mind is if you're a foreign student this is definitely going against your immigration status.\n\nFinally, if you're still interested you should ask this question in the entrepreneurship subreddits.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xx416/advice_on_doing_independent_consulting_while_in/duci4t1/"}, "229": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518804322, "Score": 1, "Body": "Thank you. I don't know why I kept up with this nonsense. They're supposed to be rational scientists, but in the end they turn out to be irrational monsters.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/ducmdca/"}, "230": {"Subreddit": "PhD", "Author": "the_socially_awkward", "Date": 1518804690, "Score": 1, "Body": "Hey Jake Ricks! \n\nCongratulations on making it into the program. Im not a PhD student although I do dream of making it into the program in the future, right now I am focusing my time on gaining experience, so I find your story very inspiring. \n\nAre you seeing anyone cause you sounds handsome and smart! \n\nIf I were your girlfriend I would be so proud of you and treat you right. Can I get your digits? What do you like to talk about? We could text each other about different types of grasses, our favorite brands of hummus, what manure is the best fertilizer for cherry trees? Feel free to DM! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wg181/just_got_accepted_informally_at_least_any_advice/ducmrwg/"}, "231": {"Subreddit": "PhD", "Author": "Lampukistan2", "Date": 1518804833, "Score": 1, "Body": "You may be right. I would probably benefit from counseling. In Germany, I have two main possibilities. Free counseling paid by health insurance which involves long waiting periods and will be added to my file and prevents me from ever getting disability or life insurance. Expensive self-paid counseling, which I cannot afford because I will need my money for my second degree. So, it's pest or cholera for me. I am not entiteled to the third possibilty (free university student counseling that is not put into my file) is not open to me, because I'm not an official student anymore.\n\nThere are some free phone services for students. This may be worth a shot.", "Permalink": "https://www.reddit.com/r/PhD/comments/7xocmn/unfinished_phd_how_do_i_get_back_to_it/ducmxkc/"}, "232": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1518806627, "Score": 4, "Body": "Your supervisor sounds like she is supremely unethical, on top of having the emotional regulation of a toddler.\n\nFor the first reason alone, I would recommend getting out of there fast. Find someone with integrity, someone who will actually mentor you, and someone who is a god damn adult.", "Permalink": "https://www.reddit.com/r/PhD/comments/7y061l/rant_i_cant_hack_this_anymore/ducow7f/"}, "233": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1518809045, "Score": 2, "Body": "Oi vey! I'm a computational mechanics PhD (recent graduate!), I never get to talk much my work. I'll give you some quick answers to your questions:\n\nSome overview about what computational sciences are: It's very different from software engineering. Knowledge about software building definitely helps, but it isn't the core skill. It's basically an amalgamation of physics or specialized subject area knowledge (biology, chemistry, entomology, etc), applied mathematics, maybe statistics, and  computer science. \nWhat it involves is looking at an observation in nature, and modeling it (describing it) with physics, statistics, or mathematical tools. What this does is you've converted a vague real problem into a mathematical problem that you can now use mathematical tools to solve. What are you solving for ? Depends on your observation. Did you observe that ants were always swarming around sweet food ? You can model the swarming behavior of ants as a function of sweetness of food mathematically. Now the solution of that math equation tells you the swarming behavior of ants.\nThe thing is that most natural observations are incredibly complex. Used to be that you could use many many assumptions and make the problem easy, so that the results of the physics analysis was easy to solve (well not really easy, but lets say possible for humans to solve.) Like with the ant example, you could say that all the ants ONLY move in 2 dimensions (no height). Easier to solve but leads to results that may have limited use (ants may climb on each other which isn't explained by your model). BUT with greater computational power, what you can now do instead is model your problems with less assumptions, which leads to more complex equations. Equations that cannot be easily solved by humans. So instead you use concepts of applied math, mainly numerical methods, which can give you approximate solutions. Problem is that these methods require a TON of computations. So what do you do, let those damn robots earn their pay. Send it to a computer and let it crunch the numbers. Problem is, some of these equations are SO complex, it takes clusters of computers months to solve a problem (see fluid dynamics). Here you you can use your creativity in computer science to develop faster algorithms, your understanding of applied math to come up with better numerical methods, and your subject matter knowledge to change the model so that the solutions are feasible but also accurate. So, please do make sure you understand what you're getting into. Software engineering is (atleast in my belief) a very small aspect of Computational science.\n\nJust to answer your questions:\n\n\n1. Email the students, email the profs, don't worry about it. We love talking and procrastinating on our research. Be respectful, do your research on their research first. Check the professors website and learn what they do before you contact them. Maybe read a paper or two from their group (google scholars or ^^scihub )\n\n2. It's great, pays pretty decent, you learn a lot of skills that are applicable in many industries so you have job security, the research jobs are challenging and satisfying, the non research jobs pay well. You will have job security (lol if nothing else you can always go back to the software engineering field with all the numerical computing knowledge)\n\n3. This may count against you. My advice: Do a masters program first with a thesis option. Good universities generally give assistantships which comes with tuition waivers and stipends. Might be a good way to get to know the field and build research experience.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxy2i/software_engineer_wanting_to_pivot_into/ducri96/"}, "234": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1518818750, "Score": 1, "Body": "No hurry, take the time to investigate your dream more thoroughly.  (Since you have the idea that a PhD costs money, we know you don't know much about academia yet, so this is a great time to start exploring!)  Have you looked into how a political science professor spends each hour of their day?  What their worries are, what pressures they face, what their duties are?  Do they generally look like happy people, and why or why not?  What sacrifices did they make in their life for their career?  What are the pros and cons of this career versus alternative careers using a political science PhD?\n\nA big part of any career is how well you fit into the community.  Try to arrange to start attending the conferences and events that your political science professors attend, and see if it feels energizing or deeply satisfying or boring or frustrating, etc.\n\nOne thing to be careful of is separating the idealized professor's life from the reality.  The general public has a very different mental image of a professorship career compared to the real thing, and you want to be making your decisions based on real circumstances, not an imaginary idealized career.\n\nIn a few years (or more!), after you've looked into all of this, once you've decided what path you want:\n\n* don't worry about money to pay for a PhD.  Any decent program will be paying you.  They just publish tuition costs on their website for complicated publicity reasons.\n* to save money, try to avoid getting a Masters if you're planning on a PhD.  You can go straight from Bachelors to PhD as long as you are properly prepared from your Bachelors.\n* your grades don't matter much.  Grades will help some to get into grad school (and there's usually a minimum GPA cutoff you must be above, like 2.7 or 3.0), but are irrelevant after that.  To get hired from a PhD to a postdoc, they'll judge your publications and professional connections and maybe any successful grant applications.  To get hired from a postdoc to a professor, they'll judge your publications, your grant history and plans, your teaching record, your service in the political science community (organizing conferences, serving as a reviewer, etc), and your professional references.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wx803/is_my_dream_of_becoming_a_professor_realistic/dud1mk7/"}, "235": {"Subreddit": "PhD", "Author": "dmap02", "Date": 1518835467, "Score": 2, "Body": "Agree, maybe consider switching. You will otherwise be tied to her forever, asking for letters, and you have to walk the line. You may have to start over, but at least you’ll regain some sense of control over your life. Talk to the grad advisor in your depart who should be able to help you work out the logistics of a transition.", "Permalink": "https://www.reddit.com/r/PhD/comments/7y061l/rant_i_cant_hack_this_anymore/dudfh0l/"}, "236": {"Subreddit": "PhD", "Author": "Tom_Lennon", "Date": 1518840310, "Score": 1, "Body": "Set deadlines for your deliverables ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxn5q/need_advice_about_graduating/dudj6g8/"}, "237": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518916560, "Score": 3, "Body": "I doubt you need reference letter, unless they specifically ask for them.\n\nA publications list, certainly. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/duexj8c/"}, "238": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1518938844, "Score": 2, "Body": "I just completed a degree in computational electromagnetics, so I think I can help you out here.\n\nThe most important thing to understand is that computer science is a *tool* that computational scientists use to do their research rather than the actual core component of the research. As another commenter mentioned, computer science is mainly used to reduce the time complexity of the computational algorithms you use. It's certainly one of the most important technical skills you'll have to learn though.\n\nOne skill you can start learning right now is high performance computing skills. That's really the way every computational science is going these days, and it's hard to avoid solving the bigger problems.\n\nYour specific questions:\n\n1. Read papers, contact the authors with questions that are relevant to the papers, don't get disappointed by a non-response.\n\n2. The prospects are very good. If you're in the US many of the government labs and defense industry complex companies hire computational scientists. Plus, it's huge in the financial sector.\n\n3. Starting with a Master's with a thesis option is probably the best choice. Your GPA, plus enthusiasm, plus good letters should still get you into some programs, but maybe not the best.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wxy2i/software_engineer_wanting_to_pivot_into/dufdq0u/"}, "239": {"Subreddit": "PhD", "Author": "GlbdS", "Date": 1518951096, "Score": 1, "Body": "A list of publications, but no reference letter? For a PhD?\nEdit: my apology, I misread.", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dufl4kv/"}, "240": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518959441, "Score": 2, "Body": "I got that she/he is a Phd student already, and applying for a fellowship (permanent position). Is that not correct?\n\nIf not, then I apologise. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dufr6ko/"}, "241": {"Subreddit": "PhD", "Author": "alkalineacid", "Date": 1518959479, "Score": 3, "Body": "For a postdoc application.", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dufr7s0/"}, "242": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1518966001, "Score": 1, "Body": "no worries. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dufwtsx/"}, "243": {"Subreddit": "PhD", "Author": "seeatree", "Date": 1518986112, "Score": 2, "Body": "Which type of MCA are you looking at?\n\nDepending on the type - that's why I ask -  the experienced researcher with whom you will work will submit either prepare the application with you or hire you directly for a project she has already been awarded or for which she's applying. In this Casa, the PI sets the rules ... having won a project, for example, he might open a specific call for applications to that project,  and he might make any application process he wants.\n\nIf you apply for an IF, on the other hand, you'll submit the proposal yourself and, while you won't need a letter of Rec, you should secure support from your proposed collaborator a priori. \n\nIf you can give more detail on what type of mca, I might be able to be more exact.", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dughqlq/"}, "244": {"Subreddit": "PhD", "Author": "theleted", "Date": 1518986956, "Score": 1, "Body": "Correct", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dugih6n/"}, "245": {"Subreddit": "PhD", "Author": "theleted", "Date": 1518987031, "Score": 1, "Body": "Thanks for the reply. I was interested in the individual fellowship indeed. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dugijwb/"}, "246": {"Subreddit": "PhD", "Author": "seeatree", "Date": 1518992847, "Score": 2, "Body": "\nI’m sure you’re familiar with the MCA site; it can be overwhelming, though, as there’s a lot there. On the Individual Fellowships page (http://ec.europa.eu/research/participants/portal/desktop/en/opportunities/h2020/topics/msca-if-2017.html), if you haven’t done this already, access and read carefully as many of the linked documents as you can. Especially: \n* The standard proposal template: http://ec.europa.eu/research/participants/data/ref/h2020/call_ptef/pt/2016-2017/h2020-call-pt-msca-if-2016-17_en.pdf; \n* And the Standard Evaluation Form: http://ec.europa.eu/research/participants/data/ref/h2020/call_ptef/ef/2016-2017/h2020-call-ef-msca-if-2016-17_en.pdf. Note that this is labeled as the “Standard Evaluation Form,” but it is really the “Self Evaluation Form,” a mock-up you can “perform” yourself or ask a colleague to perform as a pre-submission application critique/check. \n\n\n**The selection criteria** (excellence, impact, and implementation) are where it’s at in terms of evaluation, and there’s no requirement for a LOR. However, note that the aspects named in evaluating excellence (the first criteria) are “effectively” the sorts of things that might be communicated in a LOR: \n\n&gt;The following aspects will be considered when assigning an overall score for this criterion: \n•\t Quality and credibility of the research/innovation action (level of novelty, appropriate consideration of inter/mul tidisciplinary and gender aspects) \n•\tQuality and appropriateness of the training and of the two way transfer of knowledge between the researcher and the host\n•\tQuality of the supervision and of the integration in the team/institution \n•\tCapacity of the researcher to reach or re - enforce a position of professional maturity /independence \n\nNote that \nThe institution you’ll work with is the “beneficiary” or “host” institution, and it’s highly recommended / imperative that you secure its support / endorsement of your proposal (since, in the case that you win funding, they’ll be the fiduciary party to which the EU issues is funds): \n\n&gt;The beneficiary (See Definitions ) is the host organisation located in a MS or AC that recruits the experienced researcher and ensures , through appointment of a supervisor , the necessary training of the researcher . The beneficiary signs the Grant Agreement, receives funding, claims costs, and takes complete responsibility for the proper implementation of the action. \n\n\n&gt;The European Commission policy towards researchers involves the improvement of their working and living conditions and the promotion of mobility in order to open up new perspectives for research careers in Europe . The MSCA aim to act as a catalyst in this respect. The host organisations will therefore be required to meet certain working conditions relating to the researcher, as explained in the Information package for MSCA fellows , which should be in line with the principles set out in the European Charter for Researchers and in the Code of Conduct for the Recruitment o f Researchers (Charter and Code). The beneficiary must make its best effort to implement the principles set out in the Charter and Code. Some of these principles are also reflected in the core of the Grant Agreement (for instance, the obligation for the beneficiary to ensure that the researcher is adequately supervised) and are therefore contractually binding. \n\nBottom line: You should be sure to make clear in your proposal (under Excellence/Quality of institution/quality of supervision/capacity of the researcher) that you have already established a relationship of whatever sort with the researcher who will host you, that he promises his supervisory support and welcomes you to work in his research group, and that both of you are the “right people for the job.” If it’s possible to add his letter of support and agreement to act as host – I don’t know if that’s even possible, I haven’t applied for this type – I’d do it; it shouldn’t be a “letter of recommendation” per se, but what I said, a letter of support/partnership/welcome. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dugnsnm/"}, "247": {"Subreddit": "PhD", "Author": "theleted", "Date": 1518994627, "Score": 1, "Body": "although I knew part of the documents you have mentioned, your comment is very helpful !\ncheers", "Permalink": "https://www.reddit.com/r/PhD/comments/7y6tis/question_from_a_phd_student_do_you_need_reference/dugpbtg/"}, "248": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1519014337, "Score": 5, "Body": "Plenty of friends of mine started phds and had a family during grad school. Just don’t mention it before you’re admitted. The real concern is the loss of income. Grad students are not paid well, and that might be an issue for you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yh1cd/computer_science_phd_at_asu/duh5ux7/"}, "249": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1519015325, "Score": 3, "Body": "This was me a few years ago! Here's what helped me. \n\n1. At the end of the day, it's your project and nobody knows more about it than you do. If you think some aspect of your research is worth a closer investigation, it is. If your supervisors pop up and disagree, take on board what they say but make up your own mind about where to go with the project. \n\n2. Your supervisors work for you, not the other way around. When you want to publish a paper, email them like \"attached is a draft paper. I plan to submit it in a week. Let me know if you have any feedback\" not like \"please may I send this paper to a journal????\"\n\n3. Make use of all university resources. My uni had \"graduate research officers\" who ran workshops all year round on everything from basic statistics to publishing papers to thesis submission procedure to week long writing retreats. My supervisors thought this was all a massive waste of time, and that if you need help with these things you are a dumbass who shouldn't be in a PhD. Wrong.\n\n4. Get \"supervision\" anywhere you can. Go to conferences and network. Get in email contact with other people in your field. Maybe they'll read over a draft chapter or paper. Maybe they can help you with postdocs or reference letters. Present at conferences and send draft papers for peer review. Eat up all the feedback you get and you won't feel so adrift at sea. \n\nGood luck. Your doing fine. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duh6mnf/"}, "250": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1519015881, "Score": 2, "Body": "Thank you so much! Those are some really reassuring and helpful points. Especially the second one - I mean, if they want to be listed as authors on my papers and whatnot, then it's up to them whether they want to get involved. Otherwise I might as well try to publish stuff because I've got university funding to cover a couple of papers per year anyway.\n\nI'm trying to make the most of workshops, they've been a little quiet lately but hopefully there'll be more soon with a lot of new PhD students starting now. I'm already getting a little external supervision from some guys who are sort-of-kind-of in related fields. There's no one really in my exact field, but I'm doing biomed-ish engineering and have been getting some support from people in medicine, so at least that's something. My research has actually been getting closer and closer to the medicine because at least I'm getting support there haha. \n\nThanks again for your advice, you have no idea how helpful it was to read that!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duh71sp/"}, "251": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1519017391, "Score": 1, "Body": "I'm aware of that.. but I'm not worried about it because I'm in this to help people so naturally my work is going to be done ethically. I'd be more worried about one of my supervisor's ethics than mine haha.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duh83y1/"}, "252": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1519018861, "Score": 1, "Body": " No problem! Ruts can really suck the life out of you, I've seen friends really floundering in these situations and it just sucks. \n\nNow if only someone could help me get out of my post PhD unemployed rut...", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duh92z4/"}, "253": {"Subreddit": "PhD", "Author": "sxpx00", "Date": 1519027300, "Score": 4, "Body": "My supervisor has been a-wall for nearly two years. I’m also done now, submitting in a months time. Here’s what I did to cope and what I should have done earlier. First, tell another professor that you have a good relationship about the situation. Don’t complain just inform them that you haven’t been able to get a hold of your supervisor and ask if they would be willing to give you feedback on your ideas. Not only will you (hopefully) get the feedback that you crave (and are entitled to) but you will also make someone else aware of the situation should your supervisor screw you over and blame you for the lack of contact.  To this, I would also say keep a paper trail of your correspondence. This might seem extreme but it will give a sense of control over the situation. If you are early in the writing stages consider finding a new supervisor. Another thing that could help is to arrange a committee meeting that includes your supervisor- this is a way to hold them accountable and cover your own ass.\nDon’t take it personal. Immerse yourself in what interests you. Find someone (a theorist, researcher) whose work inspires you and return to it when your passion slips. Find a soundboard to vent (in addition to Reddit) - it’s better if this person is outside of academia and doesn’t know your supervisor. I he silver lining of an absent supervisor is that you will know your work inside out because all of the ideas and decisions you made were your own and not directed by your supervisor. When people\nCompliment you on your work — and they will — you will feel proud because you did it all on your own! \nYou got this! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duhdp82/"}, "254": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1519034910, "Score": 2, "Body": "Had similar issues, with MDD, GAD, EDNOS, and more generally a mental breakdown. Seeing a counsellor, starting medication, and taking a month off was the best decision I ever made.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ylk4q/taking_a_break/duhgvpm/"}, "255": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1519037664, "Score": 1, "Body": "Thanks for this. I *know* taking a break is a good decision, but I still feel panicky about it. Hope you're in a good place!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ylk4q/taking_a_break/duhhxuh/"}, "256": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": 1519042336, "Score": 3, "Body": "Why did you respond with this comment? What did they say that prompted you to state this? What did they say that could be misconstrued as academically dishonest?\n\nI'm not trying to be combative, I'm just curious as to if they are actually doing something unethical. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duhjvgz/"}, "257": {"Subreddit": "PhD", "Author": "NapKingPro", "Date": 1519052811, "Score": 6, "Body": "It's very hard to gauge success with others because every phd project is different. For this, I rely upon hitting my goals I set for myself, satisfying my supervisor's expectations and remaining within the university's timeline.\n\nIt sounds like you're struggling with 'Imposter Syndrome'. Give it a Google. This is normal and means you are sane. Don't be intimidated by other people. Your specific skills give you strength and specialisation. Surely that is part of the goal from your studies.\n\nAt the end of the day, your phd cannot go on forever. It's never really completely done. It's just handed in. This is all a training and learning process. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yn1ye/how_do_you_know_if_you_have_been_successful/duhqmog/"}, "258": {"Subreddit": "PhD", "Author": "Astro_Biscuit", "Date": 1519062545, "Score": 4, "Body": "One of the big struggles of PhD life is most of us spent the previous decade or two being \"good\" in school, knowing exactly what we had to do to get an A and working towards it. Now we have to adjust to a system where there are no grades, no targets, and only one gigantic pass/fail test at the end of it all. You can't really compare our level with your peers because every project is different, so some people will get papers earlier, or get more conference talks, or get into more collaborations. It depends so much on your exact circumstances that all you can do is try your best, stay sane and healthy, and try to engage with your supervisor to get any feedback you can.\n\nI would say it's also worth looking back occasionally. It's easy to not notice your own progress when it's slow, and you're surrounded by professors who look like they find everything easy (they don't, they just look like it). But look back at a bit of work you did early on and see how much better you could do now. Or remember how long it took you to pick up a technique in your first year and compare that to something new you learned last week. I find over my PhD my absolute amount of knowledge/skills hasn't grown much, but the speed I can pick them up has. So one day I will make it look as easy as those professors, even though I'll still be trying something for the first time and getting bits wrong and struggling.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yn1ye/how_do_you_know_if_you_have_been_successful/duhzwc3/"}, "259": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1519070453, "Score": 1, "Body": "It was late.  I must have mixed this with another post I read about the supervisor asking the candidate to fudge numbers.  My mistake.  It just ran together late.\nDeleted as to avoid future confusion.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/dui802x/"}, "260": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1519070613, "Score": 2, "Body": "I apologize.  I had read this late at night and just finished a previous post about the supervisor asking the candidate to fudge numbers.  I guess I had the two posts flipped in my head.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/dui85ww/"}, "261": {"Subreddit": "PhD", "Author": "Bicklemurgh", "Date": 1519072769, "Score": 1, "Body": "[You may find this video helpful.](https://www.youtube.com/watch?v=2Z5TVTa_AL0)", "Permalink": "https://www.reddit.com/r/PhD/comments/7yn1ye/how_do_you_know_if_you_have_been_successful/duiacgi/"}, "262": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": 1519075427, "Score": 1, "Body": "No problem! Thanks for the clarification!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duid2qe/"}, "263": {"Subreddit": "PhD", "Author": "fr33dom-", "Date": 1519075524, "Score": 5, "Body": "I left my PhD in the past for my own reasons, and now I'm back in a different PhD program after a few years working as a scientist in industry.\n\nI think the trick to the PhD is that you have to know why you are there.  It isn't a straightforward path so there needs to be a lot of passion, determination, and self-motivation.  \n\nWhat do you want to do with your life, and does that require a PhD?  If so, I would work hard to get through it.  If not, find an alternative path.  Not to be cliche, but you just have to listen to your heart and do what makes you happy.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duid68l/"}, "264": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1519076310, "Score": 15, "Body": "I think you're experiencing 3rd year blues. This is a very common part of the PhD process. You're absolutely not alone in it. Everyone I know who's been through a PhD has been in this place. I can't say if its too much for you or you should quit or not. That's between you and your supervisor. What I can say is that \"3rd year\" blues can feel so dark. Like there is no way to make progress and you'll never finish. Like \"what the hell am I doing this all for\"? What I have learned through doing and watching many PhDs go through is that the degree is all about perseverance. If you can persevere you'll be able to do anything with that strength after you finish.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duidzh6/"}, "265": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1519081055, "Score": 7, "Body": "I agree with this post to an extent - that many of us experience '3rd year blues'. But that doesn't mean that anyone feeling like they should quit the program during their 3rd years *should* stay. There are plenty of people that should end at a masters (or simply leave empty handed), not because of their lack of work ethic or intelligence, but because academia is a crazy place (that keeps getting crazier) that not everyone should be involved with.\n\nThis in particular strikes me as a red flag:\n&gt;I've developed anxiety and have gone back to being very mentally and somewhat physically abusive to myself.\n\nMaybe OP means this as a backhanded comment, but if someone is so distraught that they are physically abusing his/herself, maybe this means they should go down some other route.\n\n&gt;I love teaching undergrads but hate writing research\n\nOP, maybe you just like teaching. Teaching is a very noble pursuit. You don't need a PhD to teach, and actually, obtaining a PhD doesn't really mean anything about your teaching abilities. It's just that we have a system in place where professors/lectures at top universities are expected to have a PhD. And if you did get a job at these top schools, you would be expected to do primarily conduct research your entire career. This didn't used to be the case, but many of the lecturer only positions at big universities are being phased out. Positions at high schools, technical schools, community colleges, etc. don't usually require PhDs. Maybe this is something to consider?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duiiprf/"}, "266": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1519081325, "Score": 2, "Body": "For myself, I can say that I've learned more during my PhD than at any other point in my life. My thinking is more refined, I'm an infinitely better writer, I've learned to solve complex problems, can work well with a team of people with diverse skillsets, etc. This is how I know my PhD has been successful.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yn1ye/how_do_you_know_if_you_have_been_successful/duiiyub/"}, "267": {"Subreddit": "PhD", "Author": "korinalb", "Date": 1519082119, "Score": 2, "Body": "I don't have any good advice but as a current PhD student I know that more than half of my peers have considered leaving and sought out therapy at least once. Maybe that's comforting? Community college professor positions don't necessarily require a PhD but you could still teach. Does your program offer the option to leave with a masters degree?\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duijosu/"}, "268": {"Subreddit": "PhD", "Author": "overthemoo", "Date": 1519086442, "Score": 1, "Body": "First of all I hope you are taking care of your self and reaching out for any help you need emotionally / physically. \n\nNext, I suggest a two week break if possible. Go do something else for a while.\n\nWith regards to academics and writing comps... sounds like you are experiencing serious growing pains. But the good news is once you put together your comps paper, you will have grown! You’ll literally be an expert on your topic. It is hard and takes a lot of time to learn all of the new skills to do and report on research. I was able to use my comp exam as chapter two of my dissertation proposal. It took me about a year to write comps and about 5 months to write my dissertation proposal. \n\nGood luck! Keep the flag flying! Teaching undergrads is fun, but being an expert in your field and teaching them will be even better! \n\n- a fifth year education doc candidate", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duini66/"}, "269": {"Subreddit": "PhD", "Author": "polymerase_404", "Date": 1519092173, "Score": 1, "Body": "Would it be financially possible to take some time off? Perhaps meet with your advisor and explain to them your concerns about your mental health. If you can, take a week or a couple of weeks off or as many as your advisor/department would let you. Getting away from all the stressors would give you a new perspective on your education. It will take you to a mental baseline where you can think things clearly and from there decide whether you would like to continue. Before grad school I had my anxiety and OCD in check but now my OCD has gotten worse and I struggle to maintain my anxiety in check so I understand your struggle with your mental health. I also have questioned whether my mental health is worth the sacrifice for graduate school and still do not have an answer for myself. I wish you luck and hope you feel better.    ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duislvt/"}, "270": {"Subreddit": "PhD", "Author": "phdemented", "Date": 1519092530, "Score": 2, "Body": "Call them and ask?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/duisxii/"}, "271": {"Subreddit": "PhD", "Author": "polymerase_404", "Date": 1519092840, "Score": 2, "Body": "I also quick my stable university job that paid well and provided benefits in order to attend graduate school. I've been worried that if I do not graduate because my research project does not work then I feel as if that my career sacrifice would have been a major mistake. Currently that project is producing no reliable results and feel like a failure since I gave up financial stability for my \"dreams\". However, the way I see it is that if I do not graduate, then at least there's some closure in knowing I tried but failed rather than spending time wondering what could have been. Sorry no real advice but adding some understanding that sacrifice you made comes with some anxiety about your success. It's a tough position to be in and I really hope you find some peace.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ylk4q/taking_a_break/duit7gk/"}, "272": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1519094195, "Score": 1, "Body": "Thank you. It's nice to hear from people going through similar.\n\nYou just reminded me of something the filmmaker Kidlat Tahimik once said: \"It's not a waste of time — to find out what you're not cut out to be.\" It's not to say that you or I aren't cut out for research; we very well could be. It's still important to recognize the trying. I'm just too fixated right now on the uncertainty of everything.\n\nHope things go well for you regardless of how the project goes.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ylk4q/taking_a_break/duiuekz/"}, "273": {"Subreddit": "PhD", "Author": "pumabrand90", "Date": 1519098710, "Score": 1, "Body": "I got out after my third year with a master’s degree and it was the best decision I ever made. Obviously every situation is different, but I love my new life and job now that I’m out of academia. PM if you have any more questions. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duiycgi/"}, "274": {"Subreddit": "PhD", "Author": "Prawldrowland", "Date": 1519099116, "Score": 4, "Body": "There's no shame at all. The first year of doctoral study is really difficult and is likely to push your stress levels beyond what you're used to. Most universities have support staff that you can talk to. Often just telling people about your feelings and being acknowledged will be enough to clear your head for a while. You have to look after yourself whilst you study. Could you build some relaxing or exercise into your weekly schedule?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/duiyowm/"}, "275": {"Subreddit": "PhD", "Author": "Its_Just_Jen", "Date": 1519099256, "Score": 2, "Body": "I had daily exercise built in to my routine, but the flu and other health issues knocked me out for 2 weeks which threw off my habit. It's getting back into it that's hard. Plus I'm spending most of my time just trying to get anything usable. My PI doesn't seem concerned but it's driving me mad.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/duiyt5n/"}, "276": {"Subreddit": "PhD", "Author": "GuillaumeDuCoin", "Date": 1519104871, "Score": 2, "Body": "Seriously go back to a daily exercise routine, it clears your mind a lot. Source: myself", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/duj3055/"}, "277": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1519110040, "Score": 1, "Body": "No matter what decision you make, consider opportunity costs. If you hate research you might be able to suffer through and finish, but you’ll have difficulty on the academic job market. (Nowadays research is an important component, even for teaching heavy institutions.) \n\nIf you don’t get a job as an academic, will your degree help you earn more in the private/public/non-profit sector? If so, stick with it (maybe), since the larger salary will be worth it. If you can earn the same with a masters, then don’t punish yourself. \n\nPhDs aren’t for everyone, and that’s ok. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duj6182/"}, "278": {"Subreddit": "PhD", "Author": "Huwbacca", "Date": 1519119515, "Score": 2, "Body": "Hey there.\n\nI guess maybe it helps to know you're not alone.\n\nMy PhD has put me in therapy as well and has pushed me to my mental tether more than anything else I've ever done.\n\nI have the exact same issue when it comes to analysis, essentially I made a mistake and torpedoed a huge amount of progress. Now I have this permanent tie of negativity to anything data related and it sounds like you might have the same sort of thing with writing. Once you form an aversion or strong dislike for a certain work task I think humans tend to default to only reinforcing that connection and aversion.\n\nI hate to do analysis, so I get stressed to do it. The stress means I make little progress, so I get more angry. I know what is happening and this makes me annoyed that I can't fight it... This keeps cycling and feeding back to the point where I sometimes become paralysed with stress. When you say you hate yourself when it comes to writing it sounds exactly the same as when I get stuck in my data-self-loathing loops.\n\nSo for me, what helps is identifiable goals to fix things, writing can be super intimidating because of the sometimes perceived \"total freedom\" that comes with it. It's easier to work to a direct goal compared to \"Go do work\" and sometimes the act of telling th scientific story can feel too open and undirected which means that rather than consider only the relevant, you get stuck on the idea of thinking not only about EVERYTHING that can be included, but you also start to stress about EVERYTHING minus 1, that must be excluded.\n\n(EVERYTHINGx2)-1 = A lot. So this is naturally a really mentally difficult thing.\n\nBut I think what is really useful is that writing can actually be SUPER formulaic. I expect that you, like most people, find writing methods sections much easier and that the process of writing introductions and discussions is much more challenging - As methods is just a blow by blow account of what you did.\n\nBut most readers have a pretty high expectation of what structure they will encounter, and if you just ape this structure you can free yourself of the sort of... paralysis by analysis that comes with an open brief.\n\nI usually stick to this approach for structuring - http://libguides.usc.edu/writingguide/CARS\n\nThis Situation - Problem - Solution triad is how I write everything. The whole intro is structured like this. Each paragraph is this, but in a heirarchy of gradually more focused specialisation.\n\neg\n\n&gt; Situation - Hearing is important to speech.\nProblem - But hearing loss?!\nSolution - We investigate hearing aids\n\n2nd para\n&gt;Situation - Hearing aids help hearing\nProblem - But the benefits differ between people\nSolution - We control for X Y Z\n\nI have a whole selection of some great writing materials as well that are pretty useful when it comes to things like: What language to use; how to phrase things; ways of structuring etc etc.\n\nDM if you'd like me to email it in case you think it'd help.\n\nBut tl;dr.\n\nYou can do this. You've already gotten really far and you're not so far off the home stretch. You've an identifiable blockage, so work towards reducing things to actionable, simple goals. It's going to be shitty grunt-work yes, it may not be fluent, beautiful scientific writing... But you'll get it done.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duja9d8/"}, "279": {"Subreddit": "PhD", "Author": "cactoidjane", "Date": 1519121071, "Score": 3, "Body": "No shame. I experienced similar thoughts and feelings, and I got help. It has changed my life. I don't feel instantly better, but I believe my counselor gave me tools to help me handle things better. It's a process.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/dujavgc/"}, "280": {"Subreddit": "PhD", "Author": "fishnoguns", "Date": 1519123422, "Score": 1, "Body": "&gt;Call someone, on the phone, not an email, not a text, not a Facebook message, call them you weirdo\n\nHow long ago did you do this? Because for a very large section of companies calling them _makes_ you the weirdo. Your script later on is all nice and good, but the most common answer to \"I'm looking for employment at ABC\" is not going to be the secretary asking you what you are looking for, it is the secretary telling you to check and apply via the website.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dujbsmm/"}, "281": {"Subreddit": "PhD", "Author": "redpill_quest", "Date": 1519126766, "Score": 1, "Body": "You're right thanks lol!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/dujd6ph/"}, "282": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519133977, "Score": 5, "Body": "[Most graduate students](http://www.sciencemag.org/careers/2017/04/phd-students-face-significant-mental-health-challenges) end up struggling with mental health issues. An early indicator is stress reactions:\n&gt; Feeling a bit more stressed than usual, struggling to feel motivated to engage with others, finding yourself less interested in things that used to excite you, all of these are examples of indicators that could result in a deeper problem if left unaddressed.\n[sciencemag.org](http://www.sciencemag.org/careers/2016/10/tackling-vicious-cycle-financial-challenges-and-poor-mental-health)\n\nYou belong. Half of what it takes to get through a PhD is mental toughness and persistence- which you are developing. \n\nYou are not weak. Take the time you need for self-care. University therapists are often cheap if not free and are well aware of the struggles graduate students face, and can teach strategies to help with coping. They can also help with the fear around communicating with your PI--which is challenging because of the enormous power they hold over grad students (we anger them, we may lose our ability to pay rent, or publish, etc...). If you are unable to do work because you need working instruments, your PI should be stepping in. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/dujhdq2/"}, "283": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519135127, "Score": 2, "Body": "&gt; You don't need a PhD to teach, and actually, obtaining a PhD doesn't really mean anything about your teaching abilities.\n\nJust want to emphasize what RevisedMonk said. Given that \"[You] love teaching undergrads but hate writing research,\" working at an institution that requires a PhD (where they'd require you to teach AND publish) may not be the best fit for your life goals. That is a useful thing to know!\n\nThat said, your comps paper is likely your first go at writing a research paper solo. It is not an easy thing to learn, so you can be a bit more forgiving of yourself. Huwbacca's advice of \"be formulaic\" is excellent, especially for your first paper. Where would you publish your comps paper? How does a paper you like from that venue present results? Follow their formula. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/duji9lq/"}, "284": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519135323, "Score": 3, "Body": "Do you need to send the job the paper itself, or is it enough to include the citation on your application as \"in review\"?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/dujif9h/"}, "285": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519135525, "Score": 1, "Body": "I know a number of grad students who do this. They (US-based) all have LLCs, which are relatively easy to set up, to do contract work on the side. The universities they are at have restrictions and maximum hours for all on-campus employment, but not off-campus employment (though the universities \"advise against\" it).", "Permalink": "https://www.reddit.com/r/PhD/comments/7xx416/advice_on_doing_independent_consulting_while_in/dujikyd/"}, "286": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519136878, "Score": 1, "Body": "When I was in a somewhat similar situation (the faculty member I did a favor for by training his student and doing field studies with the student had the audacity to send this student to talk to me about removing myself from the paper's author list 2 weeks before the submission deadline--fewer authors would give the faculty more prestige, you see). I told the student that if the faculty wanted to renege we could all go chat with the dean. I then immediately informed my advisor of the situation.\n\nIf the article is \"in press\" and not just \"submitted\" the publisher may not be able to make changes. If you are skeptical about the data being presented, it may not be worth the inquiry. Regardless, this is definitely something to discuss with your co-advisor. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7x1k9a/was_pushed_into_helping_a_colleague_during_a/dujjqe4/"}, "287": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1519147486, "Score": 1, "Body": "Hey.. First of all, well done for taking the time to express your feelings here. A d well done for seeking professional help, and advice here too. That's one of the hardest things to do, but you did it.\n\nSecondly, it is not uncommon for people to feel the way you do. Unfortunately it's almost seen as right of passage for some older generation academics to think that if you don't feel like you do you're not tying hard enough, and it's ridiculous that there's a stigma around this. That is in no way to distract from the way you're feeling, but you are certainly not alone in how you feel.\n\nI've just finished my PhD, and it was the hardest thing I've ever done. Physically, mentally, emotionally. It's a struggle.\n\nYou've taken the first steps to resolving your issues, and you should be proud of that. I'm not qualified to give advice, but I will chip in my personal opinions foe what they're worth.\n\nDuring my fourth year, there was a guy that started his PhD the same time as me and who had been struggling with progress and academic grasp for a couple of years. He is super intelligent, but just not made for academia or a PhD. Anyway, long story short, he decided to withdraw and said it was the best feeling he'd felt during the past 4 years. That is a viable option but I would approach it with caution, and speak to your supervisor or mentors before making such a decision. \nThe other option is to fight through, as you've come so far and made so much progress, just get to the end, do enough, pass and move on with something less stressful. What you choose to do has to be enjoyable, otherwise what's the point.\n\nThe fact you've made steps toward fixing this, and seeking help says a lot about who you are, and that you will succeed, but if you need more support, then that's what you need, so just try and make sure people give it to you.\n\nAll the best, and keep us updated!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dujuft0/"}, "288": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1519147718, "Score": 1, "Body": "Sounds like you have a good grasp on what to write to me.\n\nJust make sure it has more of a life sciences spin than your previous one I guess, making it more directly relevant.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yxduj/1st_year_and_transferring_from_materials_scieng/dujuovq/"}, "289": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519148342, "Score": 0, "Body": "Thanks for the feedback. \n\nWhy do you think it makes you the weirdo? Have you tried it? I was able to get multiple interviews just by talking with someone. \n\nNo doubt you will have to apply on the website, but I believe talking to someone first greatly improves your chances of getting an interview.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dujvdhr/"}, "290": {"Subreddit": "PhD", "Author": "Steel_Castle", "Date": 1519152174, "Score": 1, "Body": "I should add that they already have access to the personal statement that I wrote for materials science. My chair sent their chair my application, and they asked me to update my cv and personal statement. \n\nSo, since they already saw my research statement, should I not talk about my previous experience, since they already know? Should it just be an essay on why BioE and not MSE?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yxduj/1st_year_and_transferring_from_materials_scieng/dujzkd2/"}, "291": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1519152385, "Score": 1, "Body": "I would say keep it in, if they've asked to you only to update rather than write a new one .. So include things since you last wrote it if it's relevant. Eg any additional skills/experience that would help you in the newer position.\nBy the sounds of it, I don't think much is riding on the statement to be honest, particularly as they've seen the current one previously, but do make it more relevant to BioE rather than MSE as you say. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yxduj/1st_year_and_transferring_from_materials_scieng/dujzsnj/"}, "292": {"Subreddit": "PhD", "Author": "Tom_Lennon", "Date": 1519154355, "Score": 3, "Body": "Well, what did your advisor say in response to the crossed deadline?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/duk1y84/"}, "293": {"Subreddit": "PhD", "Author": "redpill_quest", "Date": 1519157083, "Score": 1, "Body": "But it's not uploaded anywhere. Do you mean just tell them there is a paper in review? Am i even allowed to talk about this work?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/duk4xjd/"}, "294": {"Subreddit": "PhD", "Author": "otherminds", "Date": 1519163910, "Score": 3, "Body": "He casually put me in touch with the Department Coordinator to “see what could be done.”\n\nI am waiting to hear back. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/dukck1w/"}, "295": {"Subreddit": "PhD", "Author": "Fallingstarnjt714", "Date": 1519164595, "Score": 1, "Body": "Thank you, it wasn't a backhanded comment and I feel it's integral to making my decisions. I do love teaching and I taught for 6 years in public school. My degree is in education and I know that most education universities are requiring the PhD to teach. I've been looking since I do have a masters and could leave with a second one if I chose that route at this point. I could look into a community college but I know that many aren't hiring full time. I may look into working at a couple campuses around the city that I'm currently in. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dukd9p8/"}, "296": {"Subreddit": "PhD", "Author": "Fallingstarnjt714", "Date": 1519164788, "Score": 1, "Body": "Thank you. I can't take a break as I'm already considered behind in my program. \n\nI'm  education doc student as well and my university expects us to complete comps in 2 semesters (1 summer semester and fall) and I'm behind my peers in that case. I don't come from a research program as my master's degree was classroom and practice-based so I'm okay with the fact that I'm behind others that have more experience. I just know that I\"m taking much more time and requiring excessive support to get my head around synthesizing correlational research. Back to the effect sizes! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dukdgrx/"}, "297": {"Subreddit": "PhD", "Author": "Fallingstarnjt714", "Date": 1519164850, "Score": 1, "Body": "Thank you so much. I'd love to grab any resources you have regarding results and discussion writing. That's my difficult point. Statistics aren't my friend but I'm working on fixing that! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dukdj1h/"}, "298": {"Subreddit": "PhD", "Author": "phdemented", "Date": 1519167732, "Score": 1, "Body": "Ha. Sounded blunt after I wrote it, but honestly, any other answer we give is likely a best guess. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/dukgfh9/"}, "299": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1519170519, "Score": 1, "Body": "&gt;I've been looking since I do have a masters and could leave with a second one if I chose that route at this point. I could look into a community college but I know that many aren't hiring full time.\n\nAlso, you may already know these things, but they are definitely worth considering: Even with a PhD, it is becoming increasingly more difficult to land a full time job (either lecturer or TT assistant professor). Those that do get these positions are very competitive (e.g., several journal publications, other significant achievements), and the vast majority of new TT hires are PhD graduates from top-ranked universities. Maybe try to gauge how you compare to the competition at this point as part of your decision making. Also, because of the very high demand and low supply, many TT jobs in the social sciences pay more poorly than you'd think starting off, like 45-65k USD.\n\nThus, most PhD recipients now find employment outside of academia, but even this is becoming oversaturated, especially for many non-technical fields. And more than 1/3 of all PhD recipients do not have any kind of employment immediately after graduation. I don't know how opportunities at research orientated universities compare to the number available at community colleges, but it could maybe be easier to get the community college positions - this is just speculation on my end though.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dukj12q/"}, "300": {"Subreddit": "PhD", "Author": "ladySassanda", "Date": 1519172347, "Score": 1, "Body": "Good questions. By saying the paper is \"in review\" it would not be expected that it could be found online, as it is not yet published. There are two potential negatives to listing the citation, which is why it is not a common practice: 1) Embarrassment if the work does not get accepted to the conference and 2) if the potential employer happens to be a reviewer or papers chair for the work this could impact your anonymity. However, on student admission resumes and even some CVs I have seen citations such as:\n\n&gt; [in review] Author of Paper, A., &amp; Author of Paper, B. (Year). Title of paper. Paper submitted to Title of Conference.\n\nIf the job is looking for a writing sample, this will obviously not work. This is also not something I would suggest doing for a CV or resume that is widely available (e.g., posted on your personal website). However, whether you do it for a specific job application is a judgement call. I did it when I was a 1st year student applying for an internship, but now I only include my published works. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrsy5/regarding_double_blind_review_policies/dukkwgv/"}, "301": {"Subreddit": "PhD", "Author": "IWannaRideRockets", "Date": 1519173956, "Score": 1, "Body": "Thanks for the heads up! Do you know if it's pretty uncommon for people to work at the same time?", "Permalink": "https://www.reddit.com/r/PhD/comments/7yh1cd/computer_science_phd_at_asu/dukme31/"}, "302": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1519175642, "Score": 1, "Body": "All good!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duknxo3/"}, "303": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1519175913, "Score": 1, "Body": "Thanks for your feedback! I actually work for one lecturer who's super nice and would probably be quite happy to provide feedback on my work from time to time if I asked him to. I might do that and buy him a real nice bottle of wine when I finish this thing as a thank you haha. \n\nI've been keeping a paper trail of my attempts to make contact, so if any dramas arise it's all there that I've been trying. I'm in pretty early stages (not sure what it's like for you, but for me the degree is 3 years and I'm 1 year in), so finding a new supervisor is sort-of an option. By that I mean, there's not really any other people in my field, and we do need to talk to our advisory panel to be able to change supervisors - which has been hard due to the lack of contact. My current plan is to talk to my primary advisor about changing/getting an additional secondary supervisor. \n\nIt was pretty satisfying getting top grades on my undergrad thesis despite an absent supervisor, so you're definitely right about that part. It just seems so much more overwhelming for a PhD-sized thesis, but I'll get there! Thanks so much for your advice, and your words of encouragement!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yk01i/ranthelp_stuck_in_a_rut/duko6le/"}, "304": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1519176295, "Score": 2, "Body": "There's absolutely no shame in seeking help for stress. I got 3 months into my degree before I started seeing a psychologist for stress &amp; anxiety. I did that because I went to the doctor for totally unrelated issues and when I mentioned that I was doing a PhD now, her immediate response was to ask how I was going mentally and told me how common it was to struggle in a PhD. I'm a total perfectionist, and the weight of a PhD built up so quickly and I needed someone to talk to and ways to manage it. It helped a lot.\n\nIt also helped me a lot to know that almost every PhD student and academic goes through this. The majority of us struggle with stress, anxiety, depression, or a combination of the above. So you're not weak, you're extremely normal. The strongest thing you can do is to admit that you might need a bit of help, and then seek that help out.\n\nAside from that, remember to take time for yourself. Even when things are busy it's important to exercise and find an activity that you enjoy doing. For me, I do yoga in the morning and walk my dog for exercise. I also learn Italian, read a lot of fantasy books, and draw for relaxation (probably because these things are SO FAR from what I do in my PhD). Taking time for you, even for just half an hour, can do wonders for your stress levels and ultimately make you more productive.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/dukoj44/"}, "305": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1519176776, "Score": 2, "Body": "It’s not uncommon but it’s a bad idea. Everyone I know who worked another job “on the side” didn’t do very well. They either took longer to graduate (most common), or dropped out (less common). Earning a PhD isn’t just about doing more school. If you want to be successful you have to treat it like a full time job. Now that I’m on the other side I can say that it drives me NUTS when phd students pick up side work as if they were undergrads. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yh1cd/computer_science_phd_at_asu/dukoz0n/"}, "306": {"Subreddit": "PhD", "Author": "bahzew", "Date": 1519187075, "Score": 8, "Body": "At my university, the Registrar can basically do anything (I have frequently been added/removed from classes/\"research\" outside of the stated deadlines). I would email the Registrar's office and CC your advisor and let them know about your situation. I would think it's an easy fix.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/duky5hr/"}, "307": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1519187472, "Score": 1, "Body": "Agreed. With your supervisors support, this should be as simple as submitting a signed form.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/dukyhh5/"}, "308": {"Subreddit": "PhD", "Author": "electric_ionland", "Date": 1519207921, "Score": 7, "Body": "This will depend very wildly on what program you apply for, talk to your professors in your masters program. I would also advise you to research what grad student life is like in Japan. I know this is anecdotal but I have yet to meet a not Japanese PhD student who had a good time working in Japan. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dul9ml6/"}, "309": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1519222125, "Score": 5, "Body": "\"Are the requirements less if I pay for my studies compared to a scholarship?\" Even asking a question like this should be an automatic disqualification.", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dulhdpk/"}, "310": {"Subreddit": "PhD", "Author": "royalon", "Date": 1519229761, "Score": 1, "Body": "Yeah, so I did something similar. A couple weeks into this semester I decided one class was not relevant to my research and wanted to take another class. I was still allowed to drop classes but then I found that the add period is over. A quick 15 minute meeting with the Graduate Coordinator and everything was fixed.\n\nIn other words, nothing to stress over. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/dulossf/"}, "311": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1519232319, "Score": 1, "Body": "Honestly, thank you for trying but this is actually less than helpful.\n\n1st off: This advice is 10 years old. The internet and digital culture has become ALOT more entrenched and our economy is doing the best it has in decades.\n\n2nd: This is supremely triggering to many people, and therefore adopting this strategy will guarantee they don't get a job. It is telling them that walking through a literal psychological minefield is guaranteed to allieviate their already crushing anxiety about not being employed. Great job giving yet one more thing to fear.\n\nI appreciate the thought, but this kind of advice should really be taken with a grain of salt, or simply not shared all together.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dulrlvj/"}, "312": {"Subreddit": "PhD", "Author": "kashiman290", "Date": 1519236409, "Score": 1, "Body": "I don't think I would ever want to do a PhD in Japan. Japanese work ethic is crazy and I'm sure that as a PhD student they will expect even more out of you.", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dulw53q/"}, "313": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519238693, "Score": 1, "Body": "Interesting you feel this way. \n\n1. Although the advice is 10 years old, I provide this advice to my students. My students receive good to great jobs. It is not out of date. Do my students get the jobs because they do this alone, no. They are excellent after graduating, but this helps them stand out.  \n2. I hope you recover from your fear, the advice is useful but not mandatory. It would be great to hear what has worked for you. If nothing has worked for you, why? What are you doing to improve?\n\nAll the best!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dulyoet/"}, "314": {"Subreddit": "PhD", "Author": "ich_bin_doch_geil", "Date": 1519242028, "Score": 1, "Body": "I would suggest you put some kind of disclaimer to this effect on the top of your post in large letters.\n\nAlso, patronization is not how you connect with people and help them along. I know your heart is in a good place, but you are showing your priviledge here. Please think about those who you are harming, listen, and then do all you can to alleviate their pain.\n\nAll the best to you as well.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dum2dg0/"}, "315": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1519249384, "Score": 2, "Body": "Definitely build that habit again. Your physical health is too important of a longterm concern to not take care of it, and it gives you better mental energy throughout the day. You'll probably be significantly more productive that taking 0.5-1 hours each day will pay off wonders through smarter work the rest of the day.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/dumaj14/"}, "316": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1519249592, "Score": 1, "Body": "At my university you can do late enrollment if your advisor signs a form and provides justification. It also has to go through the Dean of your academic unit, but they usually just sign if all of the minimum requirements are met. The student is then responsible for a nominal administrative fee, $75 in my case.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/dumared/"}, "317": {"Subreddit": "PhD", "Author": "jeanwong", "Date": 1519269120, "Score": 0, "Body": "My gpa would probably be within 3.3 - 3.5 after graduation.\n\nI have seen some require at least 3.5 for scholarship\n\nBut others only require a 3.0 gpa\n\nSo if I can somehow get into scholarship with my gpa, it would be great.\n\nOr do I just need a very good topic to get scholarship, regardless of gpa?", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dumt48c/"}, "318": {"Subreddit": "PhD", "Author": "jeanwong", "Date": 1519269807, "Score": 1, "Body": "I'm not saying I'll try to get a phd from Japan. It's just that I have talked to some professors there. I can also do it locally which is more likely.\n\nI'm just asking for everyone else's personal experience.\n\nFor example, how were you able to get a scholarship or funding for research.\n\nDid the job opportunities decrease but paid more after acquiring phd or did the opportunities remain the same and paid more?\n\nDid your grades help or hinder you? (I will end up with only 3.3-3.5 gpa after graduation)", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dumtpkv/"}, "319": {"Subreddit": "PhD", "Author": "RhymeSpit", "Date": 1519273950, "Score": 3, "Body": "You can certainly apply but you'll have to make a strong case for why a PhD program should admit you over other applicants that have all of the other prerequisites. \n\nMany Econ PhD programs like to see lots of math courses as there's a certain level of mathematical sophistication in graduate school economics that you're unlikely to have seen in the classes you mentioned. If you're thinking about applying in a couple of years, maybe you can take some classes at a local university of something. \n\nStill, I'd encourage you to apply as not all admits have a strong math background (but it definitely helps). I'm not pursuing a PhD in Economics but I thought about going that route at some point since I double majored in Econ &amp; Math in college. \n\nI don't know which tier of Universities you're shooting for here so I'm not going to suggest at specific programs, but if you're applying top 15, definitely try and take some more math. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc3h7/phd_prerequisite_from_different_disciplines/dumx8wg/"}, "320": {"Subreddit": "PhD", "Author": "fr33dom-", "Date": 1519276052, "Score": 0, "Body": "Don't ask us!  Directly email the Director of Graduate studies for the program you are interested in.\n\nya fuckin dum dum", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc3h7/phd_prerequisite_from_different_disciplines/dumyxi6/"}, "321": {"Subreddit": "PhD", "Author": "Vryali", "Date": 1519277453, "Score": 3, "Body": "Not helpful as far as a keep your chin up, but helpful in that you're not alone.  I've gone down so many rabbit holes it's mind blowing and compared to the rest of my cohort I worry I'm going the wrong way.  My most recent exercise I was tasked with was reviewing the last 20 years of annual reviews for a high impact journal, in a field only barely related to my original proposal, and I ended up with a lot of ideas... And a lot of rabbit holes.\n\nFirst year in the program, so hoping to figure up from down, but currently nowhere near.  Good luck, from reading other posts here over the months I think this isn't abnormal, it just doesn't feel wonderful. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/dumzzdk/"}, "322": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1519279047, "Score": 2, "Body": "You will need to be qualified to get into one with or without a scholarship, it doesn't matter at all whether you have a \"very good topic\" or money.", "Permalink": "https://www.reddit.com/r/PhD/comments/7z2hu9/tips_on_getting_into_phd_program/dun1347/"}, "323": {"Subreddit": "PhD", "Author": "Huwbacca", "Date": 1519289503, "Score": 1, "Body": "DM me an email address I can send them to!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ypvoz/leaving_a_phd/dun6pqm/"}, "324": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1519297838, "Score": 1, "Body": "Depends on what kind of framework you are building and areas of your expertise. I am in a similar situation but approaching your whole problem as a question based can ease the problem at large", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duna3q5/"}, "325": {"Subreddit": "PhD", "Author": "navin51495", "Date": 1519313140, "Score": 3, "Body": "I'm working on a similar problem, where a qualitative framework has to be developed. The problem is multidisciplinary, and each of the discipline looks overwhelmingly complex. I found that reading a large number of articles was not being helpful. So I identified profs working in each of these disciplines, took some of their courses, and asked them to share their perspective on my research problem. This really helped me narrow down my focus areas in each of those disciplines. And since profs generally like to talk about the bigger picture, it helped me define my objectives more clearly. I would suggest doing the same, get some perspective before selecting which articles to read. It's like someone telling you what the final assembled pieces of the jigsaw puzzle may/may not look like. Hope that helps.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/dunknhh/"}, "326": {"Subreddit": "PhD", "Author": "aecone", "Date": 1519341712, "Score": 1, "Body": "My antidisciplinary viewpoint includes atypical combinations of interdisciplinary domains.  Ito discusses that when “the problems are massively complex…it is nearly impossible for us to divide them into existing disciplines” .   An antidisciplinary project is described by Ito as being more than a listing of the sum of its parts.   Ito wrote  that “Interdisciplinary work is when people from different disciplines work together. But antidisciplinary is something very different; it’s about working in spaces that simply do not fit into any existing academic discipline—a specific field of study with its own words, frameworks, and methods\".  \n\nIto, 2016, http://jods.mitpress.mit.edu/pub/designandscience\n ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duofl2q/"}, "327": {"Subreddit": "PhD", "Author": "aecone", "Date": 1519342812, "Score": 2, "Body": "Try Stylish Academic Writing by Helen Sword. \"Here are imaginative, practical, witty pointers that show how to make articles and books a pleasure to read—and to write.\"\nThere are lots of useful writing style links here: http://www.hup.harvard.edu/catalog.php?isbn=9780674064485\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgufy/developing_your_own_writing_style/duogmsg/"}, "328": {"Subreddit": "PhD", "Author": "IscaNicholas", "Date": 1519344428, "Score": 2, "Body": "In my experience as a qualitative, social science PhD student, “developing a framework” would mean to clearly define my research question, taking a close look at what I’m truly asking, and find support from various disciplines to “hold up”/justify that this question is worth pursuing in the way I claim is best to pursue it. \n\nSo, if I wish to research, let’s say, why some people  feel closer to their pets than they do to humans, I’d think about what kinds of phenomenon are occurring in that situation. Maybe I decide there is some socio-cultural identity factors and some human-nonhuman communication factors going on. Then I have to look to literature in these areas to give a name to what’s going on, in each of these areas, related to my question. \n\nAs I dig in to the literature, I discover the conversations around each of these areas. I then pick the pieces of the conversations that seem to best support the way *I* am framing my research question.  These pieces all together, for all of the factors/phenomenon you believe are relevant to your research question, are your “framework”. They are things that structure your research endeavor as something valid and worthwhile. \n\nThe process of identifying your question and then discovering and exploring related literature will probably be iterative. You’ll tweak your question as you begin to learn what the real conversation is behind it. And you’ll tweak your literature reviewing as you refine your question more and more. \n\nEventually, you’ll end up at a spot where you can say “yes, this question feels right” and you can say this because you know where you and your question stand in the interdisciplinary conversation around your question, and you can defend that space that you’ve defined through your literature reviewing.  Your best defense of your question is this clear (and narrow as possible!) framework. \n\nAnd then you’ll be ready to do the fun part...collect the data to address your question! 😊\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duoi54l/"}, "329": {"Subreddit": "PhD", "Author": "iam_sherry", "Date": 1519345882, "Score": 2, "Body": "cool beans", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/duojhft/"}, "330": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1519358906, "Score": 3, "Body": "Do academic institutions advertise through recruiters? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/duovh31/"}, "331": {"Subreddit": "PhD", "Author": "LazorThor", "Date": 1519363363, "Score": 2, "Body": "Focus on finding a job on your own. Once you can once you know your value, then you can engage with a recruiter. Though you sound like a new grad, so you actually have little value to a recruiter. \n\nAlso, why on earth would consider a postdoc? It 1/2 the salary and x2 the stress.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/duoyyw8/"}, "332": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1519376301, "Score": 1, "Body": "There is often a template available on the university website, and proposal lengths do vary from University to University, or at least from country to country. Some more specific details would be helpful.\n\nFor example my proposal was about 11 pages. Others ask for 5 or 6 pages others still will give you word length.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zm023/phd_in_education_tips_to_rework_a_proposal/dup5yx6/"}, "333": {"Subreddit": "PhD", "Author": "nena_zee", "Date": 1519379475, "Score": 1, "Body": "Thank you! I'll check the website. I'm in Australia. Are you basically starting the literature review and proposing a methodology?", "Permalink": "https://www.reddit.com/r/PhD/comments/7zm023/phd_in_education_tips_to_rework_a_proposal/dup7a09/"}, "334": {"Subreddit": "PhD", "Author": "prettydamaverage", "Date": 1519380370, "Score": 1, "Body": "Ok, I'm a Kiwi at a NZ uni. For my one I displayed my current expertise on the thesis. Then outlined the new ground I was proposing to break. Then it was just writing methodology, structure, and an indicative bibliography. But I'm in the humanities so it might change a little for you. However, you should be able to email the department admin for a template or something. And they will tell you exactly what needs to be done. That is, they may say a structure in the proposal is unnecessary or a lit review is unnecessary for example.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zm023/phd_in_education_tips_to_rework_a_proposal/dup7mtd/"}, "335": {"Subreddit": "PhD", "Author": "nena_zee", "Date": 1519381853, "Score": 1, "Body": "Thank you! I just managed to find a generic template in a Google search. Ill start with that. I've submitted an expression of interest, which has been commented on by the prospective supervisors. I'm wanting to ensure a better second round. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zm023/phd_in_education_tips_to_rework_a_proposal/dup888t/"}, "336": {"Subreddit": "PhD", "Author": "nena_zee", "Date": 1519381907, "Score": 1, "Body": "Congratulations on your pathway to a PhD!", "Permalink": "https://www.reddit.com/r/PhD/comments/7zm023/phd_in_education_tips_to_rework_a_proposal/dup890h/"}, "337": {"Subreddit": "PhD", "Author": "arximidis2130", "Date": 1519386327, "Score": 3, "Body": "For the Netherlands you should try INDEED and LinkedIn", "Permalink": "https://www.reddit.com/r/PhD/comments/7zng5y/job_search_engine_stem_phd/dupa3zl/"}, "338": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1519391046, "Score": 3, "Body": "For jobs in the UK..\n\nwww.jobs.ac.uk\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7zng5y/job_search_engine_stem_phd/dupcpzy/"}, "339": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1519398987, "Score": 7, "Body": "Whatever your reason, realize that in most industries your lifetime earnings will be less with a phd. Better to have 5 more years job experience. I pursue a phd for one reason: I want a self directed research job in science/engineering. Those jobs generally require a phd.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/dupjftg/"}, "340": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1519399682, "Score": 3, "Body": "I'm seeing some flak for your suggestions, but I'm going to try it. I was involved in an aerospace startup in the middle of my PhD and we had so much success with cold calls, showing up at random meetings, and general connections. It was so refreshing after the status obsession of academia to be treated like a real person in the business world. I think the key is to not come off as whiny, \"give me a job\" but you're just seeking information, talking a bit about yourself, and heck 90% of the time you discover there is no business connection to be made, but it was still a positive connection and they might connect you to someone else.", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dupk59u/"}, "341": {"Subreddit": "PhD", "Author": "TeachInSuzhou", "Date": 1519400125, "Score": 2, "Body": "academictransfer.nl\nacademicpositions.eu\nhttps://euraxess.ec.europa.eu/jobs", "Permalink": "https://www.reddit.com/r/PhD/comments/7zng5y/job_search_engine_stem_phd/dupkm03/"}, "342": {"Subreddit": "PhD", "Author": "not_prolo", "Date": 1519402005, "Score": 1, "Body": "I was romanticising having a job in a university and after finishing my masters in sociology it was clear I like to read/write academic content, do research, do something related to creating new understanding about problems in society and organisations. But also my boss at a research centre where I wrote my master thesis said that my career at this centre depends if I am a doctoral student because when applying for research projects and grants it is necessary to have a doctoral student in the team. Also I felt like in my (very small) country there is a need for young people who are willing to do research. Another reason - back to romanticising universities and academia, I did not like the idea of working in big corporations, banks, service sector etc. To sum up - it was my very much emotive decision but then somehow all sort of things (very practical, like a salary and grants) came in place that made it clear - this is happening for real.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/dupmks0/"}, "343": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519403937, "Score": 2, "Body": "Thank you for the positive feedback. I agree with you, although it may not result in an instant connection, you never know where the discussion will lead. I also think this helps you stand out from the rest of applicants (which can be in the 100s or more). \n\nWould you let me know how it turns out after trying? Things you thought worked, things you would add?\n\nThanks again!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yrug1/helping_phd_graduates_find_a_job/dupongo/"}, "344": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519403978, "Score": 1, "Body": "Thank you :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/dupop47/"}, "345": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519404249, "Score": 2, "Body": "Thanks for the question. I think that most R1 institutions won't seriously consider you as an applicant without some postdoc experience. Also, if you know you want to go into academia, the learning curve can be steep (setting up your research program, mentoring students, writing proposals, managing budgets, etc.) and postdoc helps you to bridge that gap, and pad the resume with more papers, mentoring students, and research experiences. I don't think it's for everyone, but it is one option after finishing your doctorate. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/dupozrh/"}, "346": {"Subreddit": "PhD", "Author": "bluedwarf30", "Date": 1519404396, "Score": 1, "Body": "I haven't encountered any for entry level positions in academia in the US (postdoc, research assistant professor, assistant professor) but they are certainly involved in higher level administrative hires. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/dupp5pd/"}, "347": {"Subreddit": "PhD", "Author": "debonv", "Date": 1519406900, "Score": 2, "Body": "My research is similar to yours, using qualitative methods in a STEM field. I'm closer to graduating than I am to my first year at this point, and I remember being very lost at first, too. Diving into a bunch of papers can be disorienting, my suggestion would be: don't lose perspective, and keep your thoughts/notes organized.\n\nKeep in mind what your goal is while you're reading and researching more papers. In a PhD program, you should have both breadth (getting to know your field) and depth (your own research topic). In this exercise, you're likely building breadth knowledge, and also trying to find your topic. All the papers that you're reading don't have to be directly relevant to your research to be useful. But while in this process, you can take note of the areas that are the most interesting to you. Eventually you'll read something and find it very interesting, feeling that that's what you want to do. At the same time, since you are in an interdisciplinary area, know what your lane is to avoid getting derailed.\n\nAnd keep your notes organized. It helps to avoid becoming overwhelmed, and also ends up being more useful in the long term. There are multiple ways you can do this - keeping a master document with notes and citations, keeping a list of papers in a spreadsheet, or even using the notes function in Zotero.\n\nGood luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duprwpv/"}, "348": {"Subreddit": "PhD", "Author": "Time_Ocean", "Date": 1519418337, "Score": 2, "Body": "My supervisor was also my supervisor for my 3rd year dissertation in undergrad (UK); he said I belonged in academia and it would be a waste if I just took this degree and went back to retail. I agreed and applied, and here I am.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duq4m1v/"}, "349": {"Subreddit": "PhD", "Author": "ELDOR-King", "Date": 1519419100, "Score": 3, "Body": "If you consider your lifetime earnings, a PhD is the wrong way anyway.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duq5feb/"}, "350": {"Subreddit": "PhD", "Author": "PresidentZagan", "Date": 1519429480, "Score": 1, "Body": "It was free :D", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duqfi57/"}, "351": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1519436395, "Score": 3, "Body": "Reasons to do anything big: either you should benefit from the process, or from the result, or both. Thus reasons to do PhD: either you think you'll enjoy doing that PhD, or you think you want a job for which you need a PhD, or ideally (though likely rarely happens) both.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duql7zw/"}, "352": {"Subreddit": "PhD", "Author": "blobbo_on_point", "Date": 1519437712, "Score": 1, "Body": "I've read this twice and while I appreciate your input, it does not resemble my process/situation in any way. It looks like the complete reverse. You start with a research question, and then are going into the literature to try and understand it. I have yet to define this question, which is why I'm reading papers and going down a million different rabbit holes which seem unrelated.\n\nHence my advisor's comment that it is not a \"traditional\" process, I suppose.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duqm9lx/"}, "353": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1519437763, "Score": 3, "Body": "At least in my case, it opened doors to more interesting and better paying jobs. I also wanted to learn more and get better at (scientific) research.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duqmb45/"}, "354": {"Subreddit": "PhD", "Author": "blobbo_on_point", "Date": 1519437967, "Score": 2, "Body": "Thanks. This post is really on point and does a lot to sort out this jumble in my head. I'm developing breadth, as you put it, in areas that are completely unrelated to my field (in a strictly academic department sense) and then taking that interdisciplinary \"framework\" to apply to problems in my actual field (i.e. the discipline in which I will get my degree).\n\nThe process is already disorganized as is but I'll try and keep tabs on the ideas/concepts that I draw on.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zc45n/developing_my_own_framework/duqmgv0/"}, "355": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1519438337, "Score": 2, "Body": "I finished my masters degree and I still had questions. I wanted to do research. It was needed. There's very little on my topic, a lack I felt keenly during my masters. I was good at research. I wanted to teach. I was motivated to become good at that by all the teachers I had had (good AND bad). And I got a scholarship that made it possible at all. \n\nI had to choose between a few fields and concentrations, so I chose the one that supported what I wanted to research most directly. I talked to the faculty of the various programs personally (at the national conference, when they were all in one place) to pitch my topic and discover how open they were to my interests. Some fields were more open than others. I told them straight up that I needed financial support and two programs made me good offers. I chose the school from which my potential advisor called me personally to tell me about my admission and scholarship offer. It was a good decision. I graduate this year. \n\nGood luck to you, no matter what decision you make.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duqmrjt/"}, "356": {"Subreddit": "PhD", "Author": "schmoobacca", "Date": 1519443447, "Score": 1, "Body": "Consider a PhD in epidemiology! With a nursing background you would be a valuable asset anywhere. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/duqqvrj/"}, "357": {"Subreddit": "PhD", "Author": "lilyflower32", "Date": 1519444156, "Score": 3, "Body": "Good for you! I'm near submitting, yet it seems so far! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/duqrfyy/"}, "358": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1519459450, "Score": 2, "Body": "Yeah it felt more distant the closer I got too, just stay positive. It'll be done soon. You're nearly there. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dur0h4f/"}, "359": {"Subreddit": "PhD", "Author": "arbab01", "Date": 1519459682, "Score": 1, "Body": "Congratulations. \nTips?? \nJust don't tell people that you're a phd degree holder. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dur0kn7/"}, "360": {"Subreddit": "PhD", "Author": "Astro_Biscuit", "Date": 1519471805, "Score": 8, "Body": "Congratulations! You deserve a lovely holiday! What was your subject? \n\nWhen I was in undergrad studying physics we all made a deal after exam season that we were not allowed to discuss science for a week, and if you absolutely had to mention anything scientific you had to call it \"magic\".", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dur55fy/"}, "361": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1519473311, "Score": 3, "Body": "Thanks! Literature and linguistics, so it was completely solo. No one else I know is finishing in the next year. I think I'll look up a yoga retreat or something. It's too weird just being at home right now...", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dur5pgw/"}, "362": {"Subreddit": "PhD", "Author": "genitame", "Date": 1519485825, "Score": 3, "Body": "Why? Isn't the 'Dr' title a bit of a giveaway anways?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/durcog3/"}, "363": {"Subreddit": "PhDlife", "Author": "MisterrNo", "Date": 1519501965, "Score": 1, "Body": "That’s what I aim to do, too, however, science needs dedication. Also, the competition is so high in graduate school, especially for the top schools. It is emotionally and psychologically very demanding. If you want to have a free life out of your phd, then you might think of going an average school instead of the top ones.", "Permalink": "https://www.reddit.com/r/PhDlife/comments/7zr730/i_want_to_take_a_phd_as_a_normal_job/durqnb9/"}, "364": {"Subreddit": "PhDlife", "Author": "flower90f", "Date": 1519504068, "Score": 1, "Body": "In companies they also do science and however they have working hours on the contract and people respect it, why it does not happen in academia? You can have dedication in 8-9 hours, but i believe if one work too much one loose eficiency because feeling stressed and tired... also I have worked in one of the top 10 universities in the world and I didnt see it was because of number of hours, absolutly not, many phd and professors worked normally so it really depends of the group and bosses. I dont see the point to sacrify so much to work, specially people who study diseases like me, should be much more concern about life has an end and we can also get sick and die so I want to take it as a normal job and enjoy my free time, I really think if I dont find such mentality or flexibility in a group I am not going to do it, and is a pitty because It doesnt mesn I dont like it.. ", "Permalink": "https://www.reddit.com/r/PhDlife/comments/7zr730/i_want_to_take_a_phd_as_a_normal_job/dursfa1/"}, "365": {"Subreddit": "PhD", "Author": "mcfluffle", "Date": 1519510919, "Score": 1, "Body": "I want to do research and be at the bleeding edge. PhD seemed like the best way for me to get there.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zoaj1/how_did_you_decide_on_the_phd_track/dury6si/"}, "366": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1519513452, "Score": 2, "Body": "Congratulations! You need a change of location! Perhaps visiting friends in another town?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dus0a7r/"}, "367": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1519525338, "Score": 5, "Body": "I can't think of any useful advice for you, but I want you to know I'm really sorry.  Living in a different country is tough, dealing with US visa issues (and lack of choices) is very tough, learning how to structure projects to guarantee publishable papers is tough, PhD stress and pressure is very tough, stress that disrupts healthy sleeping and eating habits is tough, illness is tough, having an advisor who doesn't understand the challenges you are facing is tough, having an advisor who is looking for strikes against you is very tough, job hunting under visa pressure is very tough.\n\nIt sounds like things will probably get worse for you before they get better, but I'll keep my fingers crossed for you that when they do get better, they get really really really better, and stay better.  Take the time to distance yourself, breathe, and picture your longterm goal; and figure out how you are going to get there.  You will absolutely make it.", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dus9st5/"}, "368": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1519526186, "Score": 1, "Body": "Like you, I had started off using job posting search engines, but I came to realize it's often a really bad way to get a job.  By the time a job hits the search engine, (1) the current employees don't want it, and (2) nobody in the company's professional circle wants it.  On top of that, people really really don't like to hire strangers blind, so you need to submit a much better resume than you'd need for the exact same job if you knew someone there, in order for them to even bother interviewing you.\n\nSo come up with a career plan for yourself, then set about meeting your colleagues *in person* to chat and get to know them and hear what they're working on.  I started getting offers pretty quickly when I did that.", "Permalink": "https://www.reddit.com/r/PhD/comments/7zng5y/job_search_engine_stem_phd/dusahba/"}, "369": {"Subreddit": "PhD", "Author": "Tom_Lennon", "Date": 1519527505, "Score": 2, "Body": "I hear you talk a lot about interest and motivation. What are your  views on job opportunities in this field/subject matter? Will you be able to withstand a long term job/career in this? ", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dusbkc0/"}, "370": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1519538592, "Score": 1, "Body": "Do the PhD that will enable you to get the job you want when you’re done. PhDs are a means to an end—make sure that the program/discipline/etc. aligns with that you want to do long term. ", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dusjkzh/"}, "371": {"Subreddit": "PhD", "Author": "TheStripyFish", "Date": 1519546690, "Score": 4, "Body": "I quit my PhD recently and it's the best decision I've ever made. I am happier, I am not sick all the time anymore, I got an 8 hour job that I like and leaves me time to spend with my friends and family... It is a very personal decision and only you can know what's best but I would recommend not falling into the sunk cost fallacy. Hope everything turns out well for you, whatever decision you make! ", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dusnsiq/"}, "372": {"Subreddit": "PhD", "Author": "PhDHe77", "Date": 1519554878, "Score": 1, "Body": "Thanks for the reply I appreciate you taking the time to read my post. Ultimately I don't really want to work in the field my phd is in, it's not awful but it's not what I wanted to gain from a phd. However people keep advising me that if I finish my current phd I'll be able to use it to switch back to my original discipline as 'a phd is a phd'. I have my doubts about that, I'm not convinced people in the sciences really understand how different social sciences is, but I don't know. If I were to complete my current phd it would definitely be with a mind to changing disciplines after - which may or may not be possible", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dusqyj9/"}, "373": {"Subreddit": "PhD", "Author": "PhDHe77", "Date": 1519555097, "Score": 1, "Body": "Thanks for the response, and you're totally right. I think the problem is that I've convinced myself so many times over the past 3.5 years that quitting would be foolish and that I'll be able to use this phd to switch back to my original discipline after that I can no longer see the wood for the trees", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dusr1ei/"}, "374": {"Subreddit": "PhD", "Author": "davidedd", "Date": 1519555919, "Score": 1, "Body": "I am currently 39 and I'd say I'm average age within my doctoral cohort. Mine is an Ed.D rather than a Ph.D though.", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/dusrc6g/"}, "375": {"Subreddit": "PhD", "Author": "PhDHe77", "Date": 1519556204, "Score": 5, "Body": "Hi I'm in a similar position to you at the moment, 3.5 years in at a UK university and thinking of quitting, and although I don't have any particularly useful advice I just wanted to let you know you're not alone in feeling like this. As I said in my recent post I've taken a break from my studies due to anxiety and depression (is that possible for you?) and sought professional advice to work through my stress and emotions, and although I'm still not sure what I'm going to do it has helped me calm down and look at things more objectively. I suggest reaching out to whatever support services are there for you - good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dusrfsb/"}, "376": {"Subreddit": "PhD", "Author": "LeanGeek", "Date": 1519560775, "Score": 4, "Body": "Maybe sleep now and get up very early, for me If I am not functioning at least a few hours of sleep help and motivate me to wake up cause I know I have less time to get it done. Pressure helps. And I tell myself it can always be worse. Sending you good vibes!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/803zhy/how_do_you_cope_when_youre_sick_before_a_deadline/dust64f/"}, "377": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1519563241, "Score": 3, "Body": "Ask your prospective supervisor if, if you finish your current PhD, she or someone else she knows in the field would be able to take you as a postdoc or some other position, or why exactly she advised you to finish your current PhD.", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dusu8mb/"}, "378": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1519572050, "Score": 1, "Body": "If you have contacts in your previous field (masters supervisors etc) who can get you on a new PhD course, could they not get you a job in the field instead (e.g. post doc or at least technician). I appreciate your current PhD is in a  very different area but if you have relevant experience in your desired field (Masters?), you might be able to persuade employers to take you on. Then once you gain more experience in that field (maybe get some paper published), the fact that your PhD is unrelated won't matter as much. Youll still have a doctorate and be experienced in your desired field. It does seem silly to throw away your current project at this stage, even if it isn't what your interested in. It must be tough but could you not just knuckle down and get it done then look at your options. If you have to do another PhD, you'll be in an elite club of people with more that one PhD (e.g. Sheldon Cooper) ", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/duszn45/"}, "379": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1519576783, "Score": 1, "Body": "“Switching” is very hard, but not impossible. Note that’s it’s also a post-tenure project, at least here in the US. Plus, when you get hired people expect you to do what you were trained to do, so trying to do something different might miss people off. ", "Permalink": "https://www.reddit.com/r/PhD/comments/800yci/in_a_mess_help_please/dut3ntp/"}, "380": {"Subreddit": "PhD", "Author": "unico51", "Date": 1519580851, "Score": 3, "Body": "Try asking for a deadline extension, sometimes it's a best option to follow. I am quite sure everybody will understand. \n\nAdditionally, it's always good to complete the draft few weeks in advance before the submission. But then again, I don't have kids, so I can't really tell. Good luck!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/803zhy/how_do_you_cope_when_youre_sick_before_a_deadline/dut7cd3/"}, "381": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1519582745, "Score": 1, "Body": "Thank you so much for your kind words. I just hope things work out as you say :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dut9466/"}, "382": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1519582979, "Score": 1, "Body": "Thank you for the insight! Can I ask you how you came to the decision? Was there one particular thing that you decided you were done?\n\nI will try not to fall into the sunk cost fallacy. Besides, I have learnt quite a bit this last year and gotten a second author paper out of it. So it isn't a waste at all.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dut9bvh/"}, "383": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1519583417, "Score": 1, "Body": "Wow, a break sounds fantastic. I guess I could take a break as long as I return to my home country. However I would have to drop out of the PhD program first since my advisor isn't really keen on keeping me. Thank you for reaching out though\n\nI also want to say I think you're a strong person. It's not easy to make the decisions you did through depression. Being depressed definitely clouds your thoughts and for you to have made such an important sensible decision is commendable.\n\nAs the others have mentioned here before, we shouldn't fall into the sunk cost fallacy. \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/dut9qno/"}, "384": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1519585379, "Score": 1, "Body": "Very good idea! Think I'll do that. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ztztz/just_submitted_my_phd/dutbjw3/"}, "385": {"Subreddit": "PhD", "Author": "Send_Cake", "Date": 1519594637, "Score": 2, "Body": "Second year of your phd? Nothing working? Sounds about right.\n\nIn my experience, so far, you need to talk to other students and see that you are all in exactly the same position. \n\nI recently went to the doctors because of no sleep due to stress. In the end what i needed was 2 days off for a long weekend where i did no work and played some games. (I also have defence in april and report due in 2 weeks). \n\nI recommend taking a day or two off and doing no work just doing your hobbies or similar. My girlfriend and i always have nintendo switch games and a puzzle on the go nowadays so we can both escape phd stress in the evenig.\n\nTalk to others on your course about how they are doing but admit you are stressed. There are two types of phd students but hopefully not all the ones you know are the ones with massive egos (in my institute i find about 85% seem to have massive egos and are increadibly good at dressing up zero results but when i watch their talks and dig deeper i realise not only is my project harder but i am doing better, i suspect you will find the same).\n\nI mainly want you to know you arent alone. 2 weeks ago i had a whole week of stress induced headaches because of everything i had to deal with it. I think part of a PhD is experiencing this level of stress so next time you can recognise it and recognise how you came out the other side.\n\nPersonally i went to see my gp when that one happened because i literally couldnt remember what i was doing at work i was so fatigued. He has taken blood tests etc but actually just sleep and doing something completely outside work is what i needed.\n\nI promise you are not alone and it is ok to have had stuff that doesn’t work. Remember your thesis committee meetings are for you. They want to see you are trying and you are doing work. Word all the questions in such a way that you can get advice from those listening. While they may be assessing you they are likely assessing you on very different criteria than you believe. They will not get rid of someone that shows a willingness to work and learn and you show that.\n\nI fully understand what you are saying though i am dreading telling my boss i am leaving academia as i dont want to disappoint him. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ysyma/how_much_stress_is_too_much/dutjyjy/"}, "386": {"Subreddit": "PhD", "Author": "LazorThor", "Date": 1519601678, "Score": 1, "Body": "This in-line the official story of what the post-doc role is suppose to be. However, the practical application falls short. \n\nTo secure a highly coveted professor position you need to be able to generate a interesting and innovative research proposal. So experience with ‘setting up your research program, mentoring students, writing proposals, managing budgets’  is invaluable. This is addition to the experience of writing papers, mentoring, and research which is core to a PhD. \n\nFor a post-doc position you rarely see people in position to gain these professor critical skills. The role is more to reduce the papers, mentoring, and research duties of the PI or associate prof so they can focus on proposals and planning. \n\nWhat the post-doc position provides is time, and change of scenery (not always though)\n\nAnyway, good luck", "Permalink": "https://www.reddit.com/r/PhD/comments/7zgglr/i_cant_find_a_job_as_a_doctoral_student_or/dutq962/"}, "387": {"Subreddit": "PhD", "Author": "TheStripyFish", "Date": 1519641623, "Score": 1, "Body": "Well, basically my project was going nowhere and it had to be constantly changed and adapted to the new results published by other labs. This made me quite anxious, honestly. I even started therapy to try to deal with it better, but instead of giving me strength to keep going it gave me the strength to quit. It made me realize I didn't want to spend the next years of my life with that constant feeling of guilt, worry and overall unhappiness. I decided that, to me, it was not worth it.\n\nI get that, if you already have some good results, it might be harder to throw them away. You should try to evaluate how important is the PhD title for your future aspirations vis-a-vis employment as well as the emotional toll that it's taking on you and try to decide if it's worth the effort. (Maybe it is!) \n\nI don't know if this helped at all, but I'm sure you will find your way. ", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/duugzkg/"}, "388": {"Subreddit": "PhD", "Author": "franklin_river", "Date": 1519653175, "Score": 2, "Body": "Unfortunately, this is a conference submission that was sprung on me at late notice.\n\nFortunately, the gods have smiled down on me and they themselves extended the deadline! But I definitely need to get better at planning drafts well in advance of deadlines.", "Permalink": "https://www.reddit.com/r/PhD/comments/803zhy/how_do_you_cope_when_youre_sick_before_a_deadline/duumxdy/"}, "389": {"Subreddit": "PhD", "Author": "emptyblankcanvas", "Date": 1519659531, "Score": 1, "Body": "As I said, I'm only in my 3rd semester and I learnt a LOT this last year and even got a second author paper accepted at a top tier conference, so it won't even be a waste for me.\n\nI guess in my mind I feel like a failure if I quit. From where I come from, giving up midway is akin to failure for the most part. There is a lot of guilt associated with it like letting down myself, my parents etc. I know in my head that this is not true, but it still somehow holds me back. Replies like yours really do help put things in perspective that continuing something that's hurtful and not worth the effort because of the sunk cost is worse than deciding to let go. Thank you for your inputs. I hope I am as brave as you when I make a decision. ", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/duusaem/"}, "390": {"Subreddit": "PhD", "Author": "TheStripyFish", "Date": 1519660260, "Score": 2, "Body": "Here, maybe this helps: http://www.bbc.com/capital/story/20171128-why-you-sometimes-have-to-quit-to-win", "Permalink": "https://www.reddit.com/r/PhD/comments/800aot/to_quit_or_to_push_on/duuszpe/"}, "391": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1519661535, "Score": 1, "Body": "Never too late. If anything I regret doing mine so young. But I am extremely glad I did it! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7wqd5j/phd_in_the_late_30s_is_it_too_late/duuu92v/"}, "392": {"Subreddit": "PhD", "Author": "KittyKatB99", "Date": 1519666216, "Score": 2, "Body": "Everyone I know has given their supervisor stuff right up until submission. I’m in the UK so maybe it’s different here? (Not sure where you are.)", "Permalink": "https://www.reddit.com/r/PhD/comments/80dq28/how_many_drafts_did_your_supervisors_see/duuz6qo/"}, "393": {"Subreddit": "PhD", "Author": "oogidyboogidy19", "Date": 1519666496, "Score": 1, "Body": "UK too!", "Permalink": "https://www.reddit.com/r/PhD/comments/80dq28/how_many_drafts_did_your_supervisors_see/duuzhn5/"}, "394": {"Subreddit": "PhD", "Author": "otherminds", "Date": 1519668659, "Score": 2, "Body": "Thanks for all the comments! Like you all suggested, I was able to get this sorted out!", "Permalink": "https://www.reddit.com/r/PhD/comments/7yycfm/i_think_my_advisor_screwed_me_up_a_bit_advice/duv1u70/"}, "395": {"Subreddit": "PhD", "Author": "Lunachick182", "Date": 1519669917, "Score": 2, "Body": "Guess it depends on what area?\n\nI am in humanities, and my supervisors have seen multiple drafts of all my chapters. I have three weeks left and they are now looking over the whole piece. ", "Permalink": "https://www.reddit.com/r/PhD/comments/80dq28/how_many_drafts_did_your_supervisors_see/duv37ic/"}, "396": {"Subreddit": "PhD", "Author": "KittyKatB99", "Date": 1519671169, "Score": 1, "Body": "Yeah then I’d guess you should just keep giving stuff to your supervisor. I’m handing in soon and I’ll bombard my supervisor until the last minute! ", "Permalink": "https://www.reddit.com/r/PhD/comments/80dq28/how_many_drafts_did_your_supervisors_see/duv4la4/"}, "397": {"Subreddit": "PhD", "Author": "oogidyboogidy19", "Date": 1519672161, "Score": 2, "Body": "Cheers all. Uk based and humanities (education to be exact). Had one of those tutorials recently where they ripped it to shreds and said, it’s not a parting of ways yet but it could be, needs more work. So I’m trying hard to get to that point. ", "Permalink": "https://www.reddit.com/r/PhD/comments/80dq28/how_many_drafts_did_your_supervisors_see/duv5o51/"}, "398": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1519681414, "Score": 3, "Body": "Hmm, would google scholar with explicit phrase not work  ? [For example searching for survey with double quotes ?] (https://blog.hubspot.com/blog/tabid/6307/bid/1264/12-quick-tips-to-search-google-like-an-expert.aspx)\n\n\n[Also maybe this website may help you ?](http://nailsproject.net/). It sort of uses AI to find better literature.", "Permalink": "https://www.reddit.com/r/PhD/comments/80erv7/useful_resources_for_literature_is_there_a_site/duvg335/"}, "399": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1519683548, "Score": 3, "Body": "I've not experienced this - my PhD with Viva was different but much smoother. If it's all slowed down by having to go through the process again, that's a pain, but you might just have to deal with it and sit it out, I guess. At least you don't have to do a viva! ", "Permalink": "https://www.reddit.com/r/PhD/comments/80d7bb/unhappy_experience_in_phd_advise_needed/duvicer/"}, "400": {"Subreddit": "PhD", "Author": "lazarescu", "Date": 1519685697, "Score": 5, "Body": "Is your supervisor not on the hook to organise the external examination for you? From what I've experienced, this is their job. Ask them if they have found a suitable replacement.", "Permalink": "https://www.reddit.com/r/PhD/comments/80d7bb/unhappy_experience_in_phd_advise_needed/duvkirg/"}, "401": {"Subreddit": "PhD", "Author": "sharedthrowawayy", "Date": 1519772743, "Score": 1, "Body": "The supervisor asked me to offer a few names and passed it to the PhD Committee, but was not accepted. I asked him to prepare the list by himself since he knows the academics better, but no chance. I offered five other names again this time, but still been waiting.\n\nThe worst thing is, after 4 years, they realized that two lecturers did not give my marks, so I had to take another course this semester. Yes, after even submitting the revisals, now I'm taking another course!", "Permalink": "https://www.reddit.com/r/PhD/comments/80d7bb/unhappy_experience_in_phd_advise_needed/duxju0x/"}, "402": {"Subreddit": "PhD", "Author": "sharedthrowawayy", "Date": 1519772853, "Score": 2, "Body": "Believe me I wish I had a viva. The first external that withdrew literally accused me in the dirtiest way, yet had no balls to fail me since the subject is really innovative and there have not been even a single book or article written about it. She instead called me trying to absolve a country (which I had no ethnic or citizenship ties) as well as accusing me for various reasons based on personal attacks. In viva, I could clarify everything quickly though.", "Permalink": "https://www.reddit.com/r/PhD/comments/80d7bb/unhappy_experience_in_phd_advise_needed/duxjxqb/"}, "403": {"Subreddit": "PhD", "Author": "lazarescu", "Date": 1519773209, "Score": 3, "Body": "That is very poor form from the faculty in your department. I think you'd best go above them and talk to your dean's office, or ombudsman, or something like that.", "Permalink": "https://www.reddit.com/r/PhD/comments/80d7bb/unhappy_experience_in_phd_advise_needed/duxk9yl/"}, "404": {"Subreddit": "PhD", "Author": "cebeeeee", "Date": 1519779525, "Score": 1, "Body": "Hey u/Oreo_Sundaes, nearly there! Thinking of you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7rph0e/i_need_a_rant_dont_expect_anyone_to_respond/duxq1nw/"}, "405": {"Subreddit": "PhD", "Author": "1nfinitezer0", "Date": 1519852188, "Score": 1, "Body": "Look for researchers that are working on cool stuff. It should make you excited about what they're doing. Look at the psych and business departments of your target institutions.\n\nAnd then yeah, as the other comments said that a large part of an advisor's role is to help you pick out a research question that fits within their body of work and is also relevant to your interests.\n\n;D", "Permalink": "https://www.reddit.com/r/PhD/comments/72vb2z/where_do_i_start/duzbv78/"}}