{"0": {"Subreddit": "PhD", "Author": "extinctionbursting", "Date": "1443720704", "Score": 3, "Body": "Honestly? I'm in the finalizing stages of a 6yr part-time... and I've felt like this the whole way through. \n\nDoing a PhD isn't meant to be easy. I genuinely think the only reason to do one is for the love of the subject. To clarify: for the love OF the subject, not because you love DOING the subject. YOU will get virtually nothing out of it in any measurable sense. You probably won't enjoy 75% of the process (the redrafting, the footnoting, the 2ndary research, the editing, the corrections, the formatting, etc), and you may not enjoy all or any of the experiential stuff (seminars, tutorials, etc). A PhD no longer grantees a job in academia, nor is it required. You'll learn a massive amount, but no more than you would doing a 2nd degree in another subject. Your relationships will suffer, as will your bank balance and your hobbies, and possibly your health.\n\nEveryone you know should have discouraged you, and everyone you talk to should discourage you. There is no real practical advantage to doing one at all.\n\nBut that's not what a PhD is.\n\nA PhD is a significant and original contribution to the sum total of human knowledge. (That's the most common definition of what counts as a PhD.)\n\nThat's HUGE. You're not doing it for yourself. You're doing it for knowledge. You're doing it for the love of the SUBJECT.  ", "Permalink": "https://www.reddit.com/by_id/t3_3lx6t1.json"}, "1": {"Subreddit": "PhD", "Author": "jethroguardian", "Date": "1443728087", "Score": 2, "Body": "Who ultimately gives a thumbs up or down on your proposal?", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "2": {"Subreddit": "PhD", "Author": "technically_art", "Date": "1443735614", "Score": 1, "Body": "Realistically, you're not going to write a new proposal, with a new research project, in a week. So regardless of what prof. A thinks, their feedback is not actionable. Do what prof. B advises with the week - if prof. A cannot be convinced by then, have prof. B help defend it in a meeting with all three of you present and ask for concrete alternative suggestions if they do not yield.", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "3": {"Subreddit": "PhD", "Author": "confusedmarimo", "Date": "1443764778", "Score": 1, "Body": "Sadly, the prof who said nay T_T. But I feel like I shouldn't offend either prof so I'm caught in between them.", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "4": {"Subreddit": "PhD", "Author": "confusedmarimo", "Date": "1443765246", "Score": 1, "Body": "Yes! And I'm stressed to the point of breakdown. I have been emailing Prof. A with lists of potential \"groundbreaking\" research topics like he wants, but he hasn't replied to a single email (for a week alr). So I'm left with absolutely no clue on how to proceed. Without a topic, I can't even begin to write anything. And what's more, the Profs differ on what kind of proposals they want. One wants it as brief as possible; one wants it as detailed as possible w all sorts of statistical stunts included. They just don't get the urgency :'(", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "5": {"Subreddit": "PhD", "Author": "jethroguardian", "Date": "1443797324", "Score": 2, "Body": "My advice is then this --- if the prof who's judging your proposal just said it isn't good enough, then you have to change something. Start pestering that prof asap though as to either what you could do to make it more \"groundbreaking\", or get him to give you ideas for projects that he considers groundbreaking. Maybe he'll relent some too if you talk to him more in person about it. Either way you can't worry about the other prof if he has no bearing on whether your proposal gets accepted or not.", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "6": {"Subreddit": "PhD", "Author": "[deleted]", "Date": "1444126056", "Score": 1, "Body": "Neither. Don't waste your time.", "Permalink": "https://www.reddit.com/by_id/t3_3nlfxd.json"}, "7": {"Subreddit": "PhD", "Author": "confusedmarimo", "Date": "1444135900", "Score": 2, "Body": "Okay, I will do just that! Thanks loads for the advice buddy :'D", "Permalink": "https://www.reddit.com/by_id/t3_3n4dio.json"}, "8": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": "1444172647", "Score": 2, "Body": "To each their own. I love that I went to get a PhD, I love what I do, and have good prospects. \n\nI would say the following things are a must:\n\n1) Do not go into a PhD unfunded.\n\n2) Publish 1 paper per year,  (3-5 papers total AT A MINIMUM. Please take this seriously), all in journals with impact factor &gt;2-3.\n\n3) Try to be as multifaceted as possible. I got a B.S. in biology, went for a Ph.D. in environmental engineering, and picked up a lot of programming and statistical expertise along the way.\n\n4) Go to two conferences in your field every year (again, AT A MINIMUM), and at year 2 or 3 you should be giving oral presentations rather than posters. Again, this 'at a minimum' should be taken seriously. Network while your there.\n\n5) Fit in opportunities for teaching experience, both at your university and in the community.\n\nIf the above sounds like too much work, that's fine. It honestly will take 60-80 of your time every week and is absolutely not easy - most people can't do it even if they do allocate that much time. If it sounds impossible to you, then pass it up and do something else with your life. I see so many people coming out of their PhD with 0-1 first author papers published, and *in my opinion*, of course they don't have great prospects and will come to reddit to complain!\n\nTo make it in academia, you generally need to be funded grants worth $100s of thousands or even millions of dollars every few years (funding cycle). The funding agencies are just not going to give you this much money if you are not a very exceptional candidate that is dedicated, hardcore, to their research topic. And yeah, its getting even more competitive because of the current lull in the world economy.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "9": {"Subreddit": "PhD", "Author": "PhDPodcast", "Date": "1444303374", "Score": 3, "Body": "I think there is an important step: You need to be able to answer the question \"What will the PhD allow for my career that, otherwise, would not be the case?\" \n\nIn many cases, an interesting subject can be approached from many different directions in the public and private sectors. ", "Permalink": "https://www.reddit.com/by_id/t3_3nxily.json"}, "10": {"Subreddit": "PhD", "Author": "saghirhr", "Date": "1444325770", "Score": 2, "Body": "Does anybody find this article useful? I want to give PhDs a lot of useful information about their options after grad school. can you share what you'd like to know more about?", "Permalink": "https://www.reddit.com/by_id/t3_3nzw8j.json"}, "11": {"Subreddit": "PhD", "Author": "ColourlessGreenIdeas", "Date": "1444471209", "Score": 1, "Body": "First find a position, then learn the local language. Saves you from wasting your time by learning Chinese or French when you in fact needed Danish or Japanese.", "Permalink": "https://www.reddit.com/by_id/t3_3nlfxd.json"}, "12": {"Subreddit": "PhD", "Author": "mind_numbing", "Date": "1444509447", "Score": 1, "Body": "I think real life experience is always valuable in research. Just make sure you write about it in your SOP so they know why there is a \"break\" in your education on your CV.", "Permalink": "https://www.reddit.com/by_id/t3_3o8cnn.json"}, "13": {"Subreddit": "PhD", "Author": "Gradconit", "Date": "1444655353", "Score": 2, "Body": "If you have the time to dedicate yourself to it learn Chinese. I've seen very experienced academics passed over for jobs in favor of doctoral students who have not even submitted yet just because the student knew Chinese, whereas the seasoned lecturers did not.\n\nI couldn't disagree more with the previous two posters. What language you personally 'need' doesn't matter. What country your potential employers want students from does matter. ", "Permalink": "https://www.reddit.com/by_id/t3_3nlfxd.json"}, "14": {"Subreddit": "PhD", "Author": "saghirhr", "Date": "1444691332", "Score": 1, "Body": "I agree with you in that people need to think hard and long before deciding to do a PhD but there are also many people who are truly interested in doing academic work but the system is broken in terms of encouraging quantity of publication rather than quality. Peter Higgs (noble laureate) once said that he would certainly not get a job today if he were a fresh PhD or an early stage career scientist. ", "Permalink": "https://www.reddit.com/by_id/t3_3nxily.json"}, "15": {"Subreddit": "PhD", "Author": "dnk0904", "Date": "1445129974", "Score": 2, "Body": "It really depends. I am a second years PhD in computer now and only have time for playing soccer at Sunday. Most of time is working for me. Some of friends have more freetime outside so not sure about it.\n\nI don't think 30+ hours is enough for phd, 50+ for me at least. I cost ton of time for debugging and writting journal.\nI am single so no advice about relationship from nerd guy like me.", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "16": {"Subreddit": "PhD", "Author": "esshall", "Date": "1445135528", "Score": 1, "Body": "Well it's good to hear that you're able to still keep some free time for soccer. \nI should've clarified--she works 30+hrs a week at an outside job not at school to make money. Then, on top of that, she has all her schoolwork. \n\nI just hope that, should she decide to pursue a PhD (she'll get accepted to at least one, she's brilliant), that she'll have time to experience more than just her books. \n\nI get to do tons of fun things with myself and buddies, but yeah. Thanks for the input and good luck finishing your PhD. Keep it up. ", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "17": {"Subreddit": "PhD", "Author": "dnk0904", "Date": "1445163133", "Score": 1, "Body": "I think she will get some TA and RA as normal PhD student. That's part-time jobs in grad school, so maybe she doesn't need another part-time jobs.\n\nLike I said, it depends on her PhD. I know some guys work in theory have ton of free time. I have no idea about PhD in English so cannot make sure. Obviously she will read a lot but have a break in no problem.\n\nOf course some PhDs have boy/girlfriends. I even think that's somehow good point. There are a lot of pressure while doing PhD and having someone to share is better.\n\nI think if she want to do it, let her do and keep backing her.", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "18": {"Subreddit": "PhD", "Author": "DrSecretan", "Date": "1445180992", "Score": 1, "Body": "That sounds cool! I suppose the key issue could be that the specialisation involved in each person's PhD would limit the audience for each episode. However, if you ever need a PhD student to talk about UK rented housing policy, drop me a PM :-P", "Permalink": "https://www.reddit.com/by_id/t3_3p7n3e.json"}, "19": {"Subreddit": "PhD", "Author": "esshall", "Date": "1445182398", "Score": 1, "Body": "Thanks for the input, I appreciate it. I definitely am encouraging her to take whichever route she thinks is best for her, I just needed some insight for my own  sake. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "20": {"Subreddit": "PhD", "Author": "Murdolls", "Date": "1445186544", "Score": 1, "Body": "Yes, you are absolutely right, and I have taken that into account and structured the questions in a way that the podcast would be still accessible and listenable for a wider audience outside of that person's specialisation. Thus, as the host, I will be able to follow even if it's somebody way distant from my area of expertise.\n\nAnyway, PM sent", "Permalink": "https://www.reddit.com/by_id/t3_3p7n3e.json"}, "21": {"Subreddit": "PhD", "Author": "StMerry", "Date": "1445239845", "Score": 1, "Body": "What I do is I work all day Mon-Fri at uni, then work from home on Sat. Sunday is completely reserved for spending time with family, and this is a necessity.\n\nShe has got to have a day off or she won't survive her PhD.", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "22": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": "1445240945", "Score": 3, "Body": "I had my own interview a few weeks ago. It was a really fun experience. I think a typical PhD interview is going to be less like a job interview where they are trying to screen out the dead wood, but rather they are hoping to meet someone enthusiastic and ready to learn. I came out of it really raring to go. If you are generally curious and interested in the subject matter I'm sure it will be fine. ", "Permalink": "https://www.reddit.com/by_id/t3_3p8n6j.json"}, "23": {"Subreddit": "PhD", "Author": "skinnersbox", "Date": "1445250785", "Score": 1, "Body": "Thanks! This is a really good point. I hope you were successful with the interview ", "Permalink": "https://www.reddit.com/by_id/t3_3p8n6j.json"}, "24": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": "1445251479", "Score": 1, "Body": "I was even though I flubbed a basic question. Since the interview I haven't had any doubts about the PhD! ", "Permalink": "https://www.reddit.com/by_id/t3_3p8n6j.json"}, "25": {"Subreddit": "PhD", "Author": "PhDPodcast", "Date": "1445305524", "Score": 1, "Body": "I highly recommend finding people who work at the companies you are looking at and start talking to them. In general, there seem to be many opportunities but you'll be way better off with a strong network rooting for you.", "Permalink": "https://www.reddit.com/by_id/t3_3pb5t8.json"}, "26": {"Subreddit": "PhD", "Author": "wowmats", "Date": "1445459325", "Score": 1, "Body": "Could be valuable indeed, and even more so if you are not sure yet about the topic you wish to research. I would just state 2 things though. \n1) Don't underestimate how time consuming a job is, leaving you very little time to \"write and read\". You should plan some consecutive days to focus and work on your subject.\n2) Be careful to not get caught in the professional routine and the satisfaction of the paycheck. Might be difficult to leave everything (colleges, promotions and so on..) to go back to academia.", "Permalink": "https://www.reddit.com/by_id/t3_3o8cnn.json"}, "27": {"Subreddit": "PhD", "Author": "Nsfwaccount921", "Date": "1445634863", "Score": 2, "Body": "A friend of mine was told by a professor that she should consider dropping out of her undergrad as she \"wasn't suited to science\". \n\nShe is now halfway through her PhD at a world renowned university with multiple publications. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_3p3dpl.json"}, "28": {"Subreddit": "PhD", "Author": "gradschoolatemysoul", "Date": "1445644938", "Score": 1, "Body": "I'm glad my life can at least be a useful warning to someone. Had I known what I know now when I first started to have doubts about graduate school I would be better off. ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "29": {"Subreddit": "PhD", "Author": "gradschoolatemysoul", "Date": "1445645306", "Score": 1, "Body": "I appreciate your sentiment, but the problem is that even when I apply to a job and emphasize the points you listed to make me sound generally desirable, I still don't even get an interview. I think the problem is that having a PhD makes you look like 1) you might cost more, 2) you might be threat to someone who is on the hiring committee or 3) there must be something wrong with you if you're applying for said job. \n\nFurthermore, the few jobs that do say they would like someone with a PhD ALSO want you to have industry experience or postdoctoral experience (presumably because they can because there is a glut of post-docs). \n\nI have gotten to the point that I am planning to take my PhD off my resume and try to sell my grad school research as if it were a job, like saying I was a \"research assistant\" not \"graduate research assistant\" for the past 6 years. However, I'm afraid that if/when they found out I was a closet-PhD it would be seen as a dishonest and fireable offense. ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "30": {"Subreddit": "PhD", "Author": "gradschoolatemysoul", "Date": "1445645362", "Score": 1, "Body": "Thanks for the Oysir.com recommendation. ", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "31": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": "1445649827", "Score": 1, "Body": "I've been in my English PhD for two months now. I try to work Monday and Friday afternoons on the thesis, and then all day Wednesday and Thursday. Tuesday I work at my job all day and I have weekends off. This is probably not enough work though, I'm still adjusting. The other thing is, because I'm at a point where I'm mainly reading, it is very easy to get demotivated and drift onto the internet - because even when I'm doing work it feels like I'm doing nothing.\n\nAs an aside, I'm married and if we wanna spend time together I just need a heads up so I can work around it. If she gets in on scholarship that should help a huge amount.\n\nAlso depends what area of English she's in. ", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "32": {"Subreddit": "PhD", "Author": "esshall", "Date": "1445651031", "Score": 1, "Body": "Thanks for your input. I think I need to do a better job at planning ahead so she can schedule better, like you said. I appreciate your reply, thanks!", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "33": {"Subreddit": "PhD", "Author": "Uselessorgchemist", "Date": "1445722988", "Score": 1, "Body": "I guess I just realize of the bad decision I made of getting a Ph.D. Thanks for replying", "Permalink": "https://www.reddit.com/by_id/t3_3pb5t8.json"}, "34": {"Subreddit": "PhD", "Author": "Uselessorgchemist", "Date": "1445723005", "Score": 1, "Body": "Thank you for replying I will certainly do that", "Permalink": "https://www.reddit.com/by_id/t3_3pb5t8.json"}, "35": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": "1445852197", "Score": 2, "Body": "\nYou should have left word counts behind you in undergrad. Make your argument, then flesh it out if it's too thin. ", "Permalink": "https://www.reddit.com/by_id/t3_3q8yld.json"}, "36": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": "1445857783", "Score": 5, "Body": "I've taken a month off, once. As is allowed per my contract. It was two years ago, I'm still \"the one who took a month off\". Even though I'm first to arrive at the office and last to leave everyday, but no, I'm the lazy one who took a month off. ", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "37": {"Subreddit": "PhD", "Author": "boxofdice", "Date": "1445878039", "Score": 2, "Body": "I think we are all in fact workaholics. I take 2 weeks a year, one at the holidays and one in the summer, and I try as hard as I can not to feel bad about it. If you have the flu, you need to stay home and get better. Take the time to recover physically and mentally from all the self-imposed work stress. In my experience, if you don't recover properly you will have a lingering fatigue that seemingly never goes away. And next year get a flu shot!", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "38": {"Subreddit": "PhD", "Author": "polyphonal", "Date": "1445879697", "Score": 1, "Body": "I finished a few months ago (so not technically a current PhD student), but we were entitled to between 5 and 6 weeks vacation a year and most of the PhD students took 4-5 weeks. ", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "39": {"Subreddit": "PhD", "Author": "Max_Thunder", "Date": "1445890690", "Score": 0, "Body": "How is that helping them? It's never too late to ask these questions.", "Permalink": "https://www.reddit.com/by_id/t3_3pb5t8.json"}, "40": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": "1445891808", "Score": 2, "Body": "Are you doing this by distance learning? Of are you planning to live there while you study?", "Permalink": "https://www.reddit.com/by_id/t3_3qa5ei.json"}, "41": {"Subreddit": "PhD", "Author": "dnk0904", "Date": "1445907539", "Score": 1, "Body": "My best and worst experience in Japan is language. Yokohama is so nice place imo.", "Permalink": "https://www.reddit.com/by_id/t3_3qa5ei.json"}, "42": {"Subreddit": "PhD", "Author": "srivats2", "Date": "1445917165", "Score": 1, "Body": "One week in the last 3 years.... Took this weekend off due to that", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "43": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1445947810", "Score": 3, "Body": "/r/scholar", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "44": {"Subreddit": "PhD", "Author": "shiftingintosoupmode", "Date": "1445948887", "Score": 1, "Body": "Thank you", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "45": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": "1445972515", "Score": 2, "Body": "also-dont know if you use twitter, but when I work from home/dont have access to a paper the hashtag #icanhazpdf can be pretty helpful for acquiring a specific paper. I don't have access to many American journals and can often get about a 10 min turn around if i tweet asking for it. ", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "46": {"Subreddit": "PhD", "Author": "shiftingintosoupmode", "Date": "1445975444", "Score": 1, "Body": "Thanks a lot. That's really good to know ", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "47": {"Subreddit": "PhD", "Author": "ColourlessGreenIdeas", "Date": "1445976710", "Score": 2, "Body": "Seriously, fuck those guys.", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "48": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": "1445985927", "Score": 1, "Body": "I think we all necessarily go through this phase as graduate students, especially when we are expected to be applying for, and interviewing for jobs, while still trying to power through the last of our dissertation defense prep.  I posted a similarly discouraging rant a few months back when i was down:\n\nhttps://www.reddit.com/r/AskReddit/comments/304i55/serious_professors_what_is_the_most_simple_thing/cppc1ow\n\nbut, going back to school, and leaving my previous dilbert job, was still the best decision I've made in the past 15 years:\n\nhttps://www.reddit.com/r/funny/comments/2ywwsm/i_got_accepted_into_graduate_school_and_i_was/cpdsk6s\n\nI ended up taking a job at a federal lab which has been pretty good.  I get a good salary, still work on science, get to do field work, and am in the process of getting an adjunct position at the nearby university so that I can at least teach a little, and keep a foot in the academic world.\n\nI know it's easy to be discouraged, but sometimes you just have to be creative.  I applied for over 15 jobs before I found this one, and it all came about rather randomly and with a good bit of luck.  I was really getting down when after 4 interviews of \"making to the final 2 candidates\", I still didn't have a job.\n\nanyhoo... my 2 c.\n", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "49": {"Subreddit": "PhD", "Author": "kaspersen", "Date": "1446030767", "Score": 2, "Body": "Wow!  Was this in the US?  Also, how did you know you were entitled to this?  Was it a university policy that all the advisers stuck to?", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "50": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": "1446038569", "Score": 2, "Body": "The only place word count really matters in academia is when submitting to journals that specifically state it (and even then if you go over, you usually just have to pay a little extra).\n\nMost universities have dissertation requirements spelled out in some kind of departmental \"blue book\".  For my program, you had to have 3 \"publishable\" chapters of research, plus bookend chapters (a separate introduction chapter, and conclusion chapter).  It sounds like you have your three chapters, so I'm sure you're more than good.  If you're going to worry/stress about something related to your dissertation, it should be what journals you'll submit to, how publishable are your works, how do you plan to structure your defense talk, are you prepared for questioning, and even how well you've checked your references.  Is the 80k number specified in your requirements somewhere and have you talked with your advisor about it if so?\n\nI've seen people in my own department with 100-page dissertations and 3 very-minimal chapters pass.....and others with 8 chapters and over 500 pages.  It seems a bit unfair that there can be some much disparity, but as long as you meet the blue book requirements, it's really up to your advisor and committee to decide if you're ready and should pass.\n\nPersonally, I ended up in the middle of the road and had 4 publishable chapters with several appendices (~300 pages), but not because I planned it that way....it's just how it ended up.", "Permalink": "https://www.reddit.com/by_id/t3_3q8yld.json"}, "51": {"Subreddit": "PhD", "Author": "asharenko", "Date": "1446058398", "Score": 1, "Body": "I graduated with an MSE PhD ~year ago. if you aren't passionate about the research, you won't last. Change advisors, even if it means changing schools. Being excited about your research is incredibly important. ", "Permalink": "https://www.reddit.com/by_id/t3_3j3isv.json"}, "52": {"Subreddit": "PhD", "Author": "polyphonal", "Date": "1446107271", "Score": 2, "Body": "I did my PhD in the Netherlands.  PhD \"students\" are actually legally employees there, and there's a collective nation-wide document that specifies employment conditions for anyone working in universities.  All PhDs get paid the same for the four years of their contract, get a fixed amount of vacation days, and have the same arrangement for things like sick days, pensions, annual evaluations, etc.  Because of this, people tend to treat the PhD very much like a job - you are expected to show up on time and behave like a professional, which means it's good training not only for research but also for future positions in industry.", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "53": {"Subreddit": "PhD", "Author": "anak_naga", "Date": "1446139064", "Score": 1, "Body": "3 literature review chapters, 25k words sounds quite good to me. No way 5k is enough for your methods, data and analysis though, if you're doing something empirical like that. In my experience, 80k words is actually not that much and it's difficult to manage your argument in so little words, including introduction and conclusion. I don't agree with the statement that word counts don't matter any more. They shouldn't be taken as strict limits but more as guidelines on how much space you have to frame your argument. Use them to your benefit so you don't do too much but also not too little.", "Permalink": "https://www.reddit.com/by_id/t3_3q8yld.json"}, "54": {"Subreddit": "PhD", "Author": "DrUSA", "Date": "1446149706", "Score": 1, "Body": "Thanks.\n\nMy method and data is about 5k but that's because most of the data is in a spreadsheet. If I added all the cells up it would be a lot more. I know my analysis will be at least 10-15k. (Well I hope it will!)", "Permalink": "https://www.reddit.com/by_id/t3_3q8yld.json"}, "55": {"Subreddit": "PhD", "Author": "dom100n", "Date": "1446204972", "Score": 1, "Body": "You have to consider that you can learn French much faster, in fact you can learn two languages with the same amount of time that would take for you to learn chinese.\nYou could learn French and Italian (for example) instead of learning chinese.", "Permalink": "https://www.reddit.com/by_id/t3_3nlfxd.json"}}