{"0": {"Subreddit": "PhD", "Author": "abloblololo", "Date": 1452031457, "Score": 1, "Body": "Um, you've only taken some fairly introductory math and you already know you want to do a PhD in it? I like math, a lot, and I don't think I'd want to do a PhD in it.\n\nAs for what you're missing, it's hard to say because it would depend on what you want to do your PhD in (applied vs pure math), but I can tell you that your list looks more like a physics major than a math one. A few things that popped into my head of thing you might want to study are Algebra (several courses), Topology, Differential Geometry, Functional Analysis, Complex Analysis, Fourier Analysis (!!) etc.\n\nReally though, you need to talk to an advisor at a university you want to study at, and maybe you should aim for getting a bachelor's degree first? You'll need to write a thesis to get some research experience at the very least.", "Permalink": "https://www.reddit.com/by_id/t3_3zfymc.json"}, "1": {"Subreddit": "PhD", "Author": "qwerty622", "Date": 1452044816, "Score": 1, "Body": "fair enough. maybe i should say what steps should i take to determine whether or not a math phd is for me in terms of classes and research. the classes i think you have me some good starting points so thanks for that. as for research, how would i go about pursuing some at a meaningful level? in terms of going back and getting an undergrad degree, i'd rather just take night classes or something to that effect.", "Permalink": "https://www.reddit.com/by_id/t3_3zfymc.json"}, "2": {"Subreddit": "PhD", "Author": "rigneja", "Date": 1452216642, "Score": 1, "Body": "Mine is in EE and I surely had a gpa", "Permalink": "https://www.reddit.com/by_id/t3_3xuekl.json"}, "3": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1452335014, "Score": 6, "Body": "IMO you are missing the part where it is really hard to get a job as a Profesor. I don't know in your field but in engineering you would have to do a post doc after getting your phd, maybe even two and you might still find it hard to get an academic position and tenure would be extra hard. There are far more phd students than positions available after graduation. And if you get a phd you'd be overqualified to work in the industry. \n\nHaving said that, if you prefer to work in academia and money is not an issue then go for the phd, you'll love it.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "4": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1452342666, "Score": 4, "Body": "It's not \"financial suicide\": it's simply not a lucrative path.  The majority of PhDs who want into academia do a postdoc for a few years, which is also underpaid relative to industry, so your lost potential earnings are over a much longer time frame than 4-6 years.\n\nLooking at the data that you posted from McGill: the salary they reported for the lowest quartile (132k$) is for people with an average of 7.0 years after their final degree (i.e. their PhD).  The lowest quartile has probably only been in the job for a couple years at most, suggesting that they did something else (low-paid postdoc, or industry work?) for 4-6 years.  This means you're looking at 30k for 4-6 years, 50k? for probably another 4-5 years, and only then, more than a decade from now, would you potentially be in this &gt;100k range.  I suspect that after a decade in the finance industry, you could be making &gt;100k too, and that after a decade of making more than twice as much as you could in academia.  \n\nIt's a trade-off, and certainly not the end of the world, but it's not a choice that everyone would or could make.  Plus, as the other comment says, this is ignoring the fact that most faculty positions get hundred of applicants, so the odds of you getting one of these jobs is statistically very low and you'll almost certainly have to move to get one.  If you do decide to go for it, make sure you develop as many marketable industry skills as you can during your PhD so you have options afterwards.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "5": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1452353661, "Score": 2, "Body": "If you are in a STEM field then they pay your tuition and they pay you a nice annual stipend too, so it's definitely not financial suicide in that case.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "6": {"Subreddit": "PhD", "Author": "steam1901", "Date": 1452357078, "Score": 1, "Body": "Hmmm yes that's probably exactly what I was missing. Thanks, this was helpful.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "7": {"Subreddit": "PhD", "Author": "steam1901", "Date": 1452357221, "Score": 1, "Body": "Yea I guess it must be kinda shitty to be stuck in that spot where you're not getting a job as a Professor and cant be employed in the industry because of the PhD.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "8": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1452422548, "Score": 3, "Body": "Who exactly do you expect to be explaining this to for the rest of your career?  You might have to put a note on your CV or bio during job applications, but it's not like anyone else ever asks you what the exact abbreviation for your doctorate degree was.", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "9": {"Subreddit": "PhD", "Author": "MaestroWu", "Date": 1452422788, "Score": 1, "Body": "Fair enough. That's the kind of feedback I was exactly after. Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "10": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1452440325, "Score": 1, "Body": "Which country are these programmes in? In some places, like the UK, the DSc is a kind of \"higher doctorate\" degree which is awarded in recognition of a sustained high profile contribution to a field over quite a number of years. It's sometimes \"earned\" by submission of applications and supporting evidence but also sometimes conferred as an honorary degree. \n", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "11": {"Subreddit": "PhD", "Author": "MaestroWu", "Date": 1452450843, "Score": 1, "Body": "This is in the US; I'd just thought that here, at least, people might be less familiar with non-PhD doctoral programs. ", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "12": {"Subreddit": "DoctorZoidbergPhD", "Author": "[deleted]", "Date": 1452472082, "Score": 1, "Body": "\n# *DOWNLOAD MOVIE \"Terminator Genisys 2015\"  PC yify MOV subtitles yts youtube*\n\n&gt; . \n\n&gt;  Description movie **Terminator Genisys 2015**:\n\n&gt;  When John Connor, leader of the human resistance, sends Sgt. Kyle Reese back to 1984 to protect Sarah Connor and safeguard the future, an unexpected turn of events creates a fractured timeline.\n\n&gt; .\n\n\n***\n## █ ► [**WATCH** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n***\n## █ ► [**DOWNLOAD** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n***\n## █ ► [**ONLINE** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n\n. \n\n***\n## █ ► [**WATCH** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n***\n## █ ► [**DOWNLOAD** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n***\n## █ ► [**ONLINE** ***Terminator Genisys 2015***](https://ssshorts.ru/609j?source=reddit&amp;keyword=Terminator%20Genisys%202015)\n***\n\n&gt; . \n\n&gt; .terminator: \ngenisys \n2015 \nrating\nterminator: \ngenisys \n2015 \ndvd \nrelease \ndate\nterminator \ngenisys \n2015 \nyoutube \nmovies\nterminator: \ngenisys \n2015 \nmovie \nposter\nterminator \ngenisys \n2015 \ndvd \ncover\nterminator: \ngenisys \n2015 \nfree \ndownload\nterminator \ngenisys \n2015 \nfull \nmovie\nterminator: \ngenisys \n2015 \ndownload\nterminator \ngenisys \n2015 \ndvd\nterminator \ngenisys \n(2015) \nfull \nmovie \ndownload\nterminator \ngenisys \n2015 \nrated\nterminator \ngenisys \n2015\nterminator \ngenisys \n2015 \nvodlocker\nterminator \ngenisys \n2015 \npictures\nUpcoming \nEnglish \nMovie \nTerminator \nGenisys \n(2015) \nOfficial\nterminator \ngenisys \n2015 \nonline\nterminator \ngenisys \n2015 \nmatt \nsmith\nterminator \ngenisys \n2015 \ntorrent\nNew \nUpcoming \nHollywood \nMovie \nTerminator \nGenisys \n2015 \nTrailer \nTerminator \nGenisys \n(2015) \nEnglish \nMovie \nOfficial \nTrailer \nTerminator \nGenisys \n(2015) \nHollywood\nterminator \ngenisys \n2015 \nkickass\nterminator \ngenisys \n2015 \nhdrip\nterminator \ngenisys \n2015 \nfull \nmovie \nonline \nfree\nterminator \ngenisys \n2015 \nfull \nmovie \nonline\nterminator \ngenisys \n2015 \nwikipedia\nterminator: \ngenisys \n2015 \nmovie\nterminator \ngenisys \n2015 \ntorrent \nkickass\nTerminator \nGenisys \nDVD \nRelease \nDate \nNovember \n10 \n2015\nterminator: \ngenisys \n2015 \nmovie \nonline\nterminator \ngenisys \n2015 \nyoutube\nTerminator \nGenisys \nDVD \nrelease \ndate \nannounced \nfor \nNovember \n10 \n2015. \nSee \nthe \nmovie \nstats \ntrailer \nmovie \nposter \nand \nmore. \nJohn \nConnor \nfinally \nhas \nthe \nsentient\nterminator \ngenisys \n2015 \ntrailer\nterminator: \ngenisys \n2015 \nimdb\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .\n\n&gt; .[FULL.. MOVIE.. \"Max.. 2015\".. .. XViD.. srt.. imdb.. FLV.. 720p.. DVD5.. free](https://www.reddit.com/40e4g6),.. [STREAM.. MOVIE.. \"Steve.. Jobs.. 2015\".. .. megashare.. youtube.. dailymotion.. movie4k.. bitsnoop.. sumotorrent.. download](https://www.reddit.com/40e3pi),.. [FULL.. MOVIE.. \"Home.. Sweet.. Hell.. 2015\".. .. youtube.. direct.. link.. high.. definition.. streaming.. no.. pay.. high.. quality](https://www.reddit.com/40e4wu),.. [STREAM.. MOVIE.. \"Dark.. Moon.. Rising.. 2015\".. .. 1280p.. HQ.. full.. 480p.. FilmClub.. without.. signing.. video](https://www.reddit.com/40e50e),.. [FREE.. MOVIE.. \"Bajrangi.. Bhaijaan.. 2015\".. .. bitsnoop.. HQ.. movie25.. MOV.. MP4.. DVDRip.. how.. download](https://www.reddit.com/40e52j),.. [FULL.. MOVIE.. \"The.. Wave.. 2015\".. .. rarBG.. english.. download.. android.. srt.. torrent](https://www.reddit.com/40e48m),.. [STREAM.. MOVIE.. \"The.. Danish.. Girl.. 2015\".. .. 720p.. BrRip.. for.. mobile.. MOV.. HQ.. Dub.. no.. pay](https://www.reddit.com/40e4sc),.. [ONLINE.. MOVIE.. \"Detective.. Byomkesh.. Bakshy!.. 2015\".. .. for.. mobile.. viooz.. DVD5.. solarmovie.. 1280p.. iPad.. 1280p](https://www.reddit.com/40e45j),.. [WATCH.. MOVIE.. \"Beasts.. of.. No.. Nation.. 2015\".. .. Tubeplus.. streaming.. 480p.. dubbed.. extratorrent.. VHSRip.. now](https://www.reddit.com/40e2uo),.. [STREAM.. MOVIE.. \"Phantom.. 2015\".. .. vumoo.. film.. full.. MOV.. DVDRip.. without.. signing.. english](https://www.reddit.com/40e3tb),.. [FREE.. MOVIE.. \"Get.. Hard.. 2015\".. .. BDRip.. trailer.. Tubeplus.. english.. movie.. DVD5.. PC.. film](https://www.reddit.com/40e4qr)", "Permalink": "https://www.reddit.com/by_id/t3_40e58g.json"}, "13": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1452517113, "Score": 3, "Body": "That stipend sounds reasonable at least for my field in a relatively low cost of living environment. I'm not sure how you're calculating the payoff salary, however. The PhD is not some sort of 1960s union card where you necessarily automatically get a job at a set salary the moment you graduate.  Hundred thousand dollars a year is a salary for a full professor in my field. So after 3 to 4 years for a PhD, then you actually have to find a tenure-track position. Again in my field which is booming that's not such a big problem; in other fields like history it's a terrible problem. But even then we're talking about maybe a dozen years to reach the salary level that you indicate.", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "14": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1452517265, "Score": 3, "Body": "Post-Docs for years in many disciplines\n\nThen To get a job as an \"assistant Profesor\" in the American system.\n\nThen about 6 years to P&amp;T\n\nThen about 6 years to full professor\n\nEven then you may not reach that salary level of $100,000", "Permalink": "https://www.reddit.com/by_id/t3_403gjt.json"}, "15": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1452692630, "Score": 0, "Body": "The latter. I mean I could go on with this, but basically the latter. ", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "16": {"Subreddit": "PhD", "Author": "Typhoon323", "Date": 1452711265, "Score": 4, "Body": "1) Find recent papers within your research area\n\n2) Read Abstracts to determine which articles are most applicable to your research area\n\n3) Read and take notes on the most applicable articles \n\n4) Look up articles which are cited in the applicable articles \n\nRepeat until you have a new idea to research\n\nOR\n\nRepeat until you think you have a sound understanding of the current state of your research area", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "17": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1452716522, "Score": 3, "Body": "I went into a phd not really knowing what it was going to be like. Much like you. I had no real intention of staying in academia but building up my CV, I guess, to work in Research and Development and Standardisation.\n\nHad I known what a PhD would actually be like. How stressed I am. It's something that you really can't explain to anyone who hasn't really been through it. I don't know if I would have done it. But at this point, I'm less than a year away from completing it - so may as well just knuckle down and make sure that the last 3 and a half years of my life were not completely wasted.\n\nAlso, looking around, a PhD isn't really that special. I've seen some of the theses that got accepted and ugh. A PhD will impress people who know nothing about it - I guess I'm just banking on the fact that that's the majority.", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "18": {"Subreddit": "PhD", "Author": "CoolEngineer", "Date": 1452718383, "Score": 1, "Body": "Thank you for the time you took to share this. I really appreciate it. ", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "19": {"Subreddit": "PhD", "Author": "CoolEngineer", "Date": 1452718409, "Score": 1, "Body": "Thank you ", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "20": {"Subreddit": "PhD", "Author": "jackford3", "Date": 1452719590, "Score": 2, "Body": "Look on the bright side, if you're completing the PhD in less than five years, that's pretty darn good. It also depends on what your PhD is in... If you're doing computer science or advanced mathematics, then you'll land on your feet. On the other hand, if you're getting a PhD in, say, literature or political science, then you should know there is pretty much no market for that outside of academia, in which case, disclosures seem vitally important. ", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "21": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1452734130, "Score": 4, "Body": "I don't think you can generalize across all the disciplines and every program.\n\nMy field of Communications is in a boom right now. Almost full employment in industry and tenure track for PhD grads. 3-4 years for completion.\n\nHistory, American Studies...not so good.\n\nAnd it really matters which program you come out of. If you get your PhD in political science from Harvard chances Of landing a TT position are much higher than if you got it from third ranked school ", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "22": {"Subreddit": "PhD", "Author": "JEZTURNER", "Date": 1452770434, "Score": 3, "Body": "also, \n\n2.5 if the abstract is interesting, read the conclusion too. if you like both, read the whole thing. \n\n3.5 cry when you realise that this one article has unearthed another 10 things to read. \n\nAnd then there's the write up of that reading and notes. Don't just describe but also criticise, analyse, relate to your own work. ", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "23": {"Subreddit": "PhD", "Author": "Lattice_Bowel_Mvmnts", "Date": 1452776175, "Score": 3, "Body": "I spent 6 years in industry before quitting and going back for a PhD.  The only unsatisfying aspect of my life so far has been wasting the time in industry NOT doing a PhD for it's own enjoyable sake, and the potential superior opportunities actually working with the fundamentals instead of clicking the buttons on someone else work.\n\nOf course, this can't be broadly applied, and I have no idea what programs all these endlessly complaining graduate students come from, but in engineering or science, you aren't going to be doing anything substantial or different without the doctorate.  People like to point out how lucrative and interactive the job market is for engineers with only a BS.  That is largely a lie.  High starting salary that quickly tapers off.  The work is 99.9% red tape paper pushing.  Did that for 2 years.  The MS makes it a bit better, but the bottom line is that the people who created the methods and discoveries you use for design work are the real leaders.  Sure, going to management gets you more money, but that is a MUCH less respectable job!  Completely devoid of any technical activity at even the simplest of levels.\n\nI obviously was smart enough to enter a PhD program, but I sure as hell wasn't smart enough, at that point, to work on what I do now.  And I sure wasn't going to get there through self study, or an industry position interested purely in minimal investment for maximal profit and my 60 hour a week attendance. \n\nWhat a gigantic pool of human talent preparing for the next fundamental advances in applied science that will actually make a difference instead of the same old CAD and FEA GIGO.\n", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "24": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1452778929, "Score": 6, "Body": "ProTip: An experiment-based research PhD is 95% just reading papers.  *There are no shortcuts.*  You should read 500 before you choose your PhD program, and another 500 before finishing your dissertation.\n\nNearly all research problems can be solved by reading papers:\n\n* Not sure how to tie your work in with previous work?  After reading enough papers, you will have a rough mental map of all important problems in your field, and then you can read targeted papers to bridge your work to the nearest major problem.\n* Can't think of a research proposal?  After reading enough papers, you will understand gaps and weaknesses in your field, as well as hot topics, and you will find a gap that matches your skillset and tools.\n* Your advisor is treating you like crap?  That might be because you joined a PhD program before you read your first 500 papers.  Finish reading them, and you will be a much more competitive candidate who can attract the interest of the top 3% of advisors in your field, who will treat you decently.\n* Not sure how to write an abstract/introduction/etc section?  After reading enough papers, you will realize that there are standard formulas for this in your field; you just fill in the blanks for your particular project.\n* Reviewers hated your paper but didn't give good reasons why?  It's because your paper wasn't written like other papers in your field.  You will write papers like the papers you read.\n* Audience asks tough questions at your conference talk?  Reading enough papers will immunize you.\n* Reading papers is too much work?  That's because you haven't read enough papers, and you haven't got good at it.  By dissertation time, I could read about 7 papers per day and still do a good job without burning out.\n\nHow should you read a paper?\n\n* You are reading to extract key terms and information.  It's not a novel. \n* (First you need to learn about key concepts, statistics, and methods in your field; we will assume you already did this.)\n* Find papers via Google Scholar, etc.  Find the nearest 20-70 on your specific topic.  Try a range of keywords for searching, and revise after browsing some papers.  Select your papers based on title and brief skim of abstract.\n* Read the abstract.  Make a note for this paper: what is the (1-2 word) subtopic of this paper compared to your pile of papers?  The goal is to cluster papers on the same subtopic.\n* If this subtopic will not help your research, make 3-4 notes of the contents of this paper, then set it in the \"not very relevant\" pile and move on.\n* If this topic will help your research, then read the Introduction and confirm the claimed findings in the paper's methodology section.  Write a 2-4 sentence summary in your own words, of the paper's research problem, approach, and scientific contributions.  This summary will serve two purposes: 1. To remind you what the paper is about, and 2. You can copy it almost verbatim into a \"Related Work\" section of your own paper.  Skim the rest of the paper for trustworthiness red flags, like bad formatting, lack of methodology description, lack of references, too little explanation of formulae, nonsensical real-world application, etc.\n* If you have any questions while reading the paper, make note of them.  Even if you can't find the answer now, having the question written down will remind you later that this part of the paper was never clear and you didn't just forget it.\n* After you've read the pile, draw yourself a diagram (shapes and arrows) of all the subtopics you found and how they relate and feed in to each other.  This will help you structure your \"related Work\" section.\n\nGood luck :-)", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "25": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1452779829, "Score": 2, "Body": "Your advisor should have a clear, written policy on this issue, as well as on the issue of whether your advisor must pre-read and approve all publications before they can be sent to review.  For example, some advisors must be automatic last-authors because they provide funding and they use publications from your funded time to acquire new funding; failure to follow this policy in these groups is cause for termination.\n\nIf your advisor must be automatic last-author, don't worry; readers will understand why.", "Permalink": "https://www.reddit.com/by_id/t3_40xhos.json"}, "26": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1452783764, "Score": 2, "Body": "Self-funded: Hmm, I never heard of a PhD student who was required to last-author their advisor unless they were funded by the advisor.  In this case, you may wish to \"notify\" your advisor that this new paper is going out for review, with a reminder of a few similar precedent cases in your group/department, rather than \"ask\".\n\nBTW: Make sure you take care of your career.  It can be really hard to get a proper PhD education for self-funded students, because they are not exposed to the professional pressures that funded students are.  Without careful correction, this can result in lower-quality research, longer time-to-degree, and lack of professional character.\n\nGood luck :-)", "Permalink": "https://www.reddit.com/by_id/t3_40xhos.json"}, "27": {"Subreddit": "PhD", "Author": "jackford3", "Date": 1452802291, "Score": 0, "Body": "We should all be so lucky to view a PhD as an end in itself and feel that our PhD actually makes a difference. If the endless complaining you reference is any indication, I am not sure your view is broadly shared. It can't objectively be said that many or even most PhDs make a difference, whatever that means. I am not arguing that there aren't people--like yourself--for whom a PhD makes perfect sense. I am just questioning whether or not grad programs should disclose meaningful information about where their PhD students end up--much in the same way law schools or even undergrads are being pressured to demonstrate their value. Is there anything wrong with that?\n\n", "Permalink": "https://www.reddit.com/by_id/t3_40tmsp.json"}, "28": {"Subreddit": "PhD", "Author": "CoolEngineer", "Date": 1452804627, "Score": 1, "Body": "I am saving this response, for my own use and for further sharing with others. Thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "29": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1452805896, "Score": 2, "Body": "As far as the programs I have had liberty to see in the states, a PhD requires the student to keep and hold a GPA above a 3.5 throughout the entire journey.  If the student makes a C in a class, then that student doesn't pass.  So, I'm postulating that I haven't seen a title is because it is expected of the student to be the highest GPA awarded.", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "30": {"Subreddit": "PhD", "Author": "Octopi_are_evil", "Date": 1452933836, "Score": 3, "Body": "I have had a pretty stressful time of it too. I suggest seeing if your uni has any form of confidential support that can help you out. Maybe see if you can get some cognitive behavioural therapy? I also do a lot of exercise (like you) and I do some creative stuff (adult colouring, crochet, photography) which can help with the anxiety. It's really key to remember you aren't alone. Well done for asking for advice, do you have anyone close you can talk to? PhDs are incredibly draining but it sounds like you have the motivation. Hang in there and be kind to yourself. Start a diary of your achievements no matter how small either work or personal so you can see what you've accomplished! ", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "31": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1452951599, "Score": 2, "Body": "I don't really know how much help or advice I can give b/c I'm only a first year (but I did do a master's first so I have some graduate experience). I tend to be a pretty positive and happy person in general. I have not always been that way and I still have my bad days. In general I'd say that the biggest contributing factor is that I make an effort to see the positive side of things. I make it a huge priority in my life to **get enough sleep** (when I get over tired I get super depressed and jaded and negative and unproductive, it is awful and directly tied to sleep. When I'm well rested, I feel like I can take on the world). Additionally, music is a big mood changer for me so I have several playlists to put me in a particular mood. I choose **happy and upbeat songs** that just make me want to get up and move. I would also suggest finding out **when and how you work best**. Who gives a shit if you work 100 hours a week or 20, as long as you get your work done. A lot of times the people who tell me they work 70/80 hours a week are the same people who get super distracted at work or they don't plan their experiments well so that incubation periods overlap with something else. They spend the majority of time socializing, on reddit, eating, really anything but work so it takes them twice as long to get anything done. I also recommend if you don't have one already, **get a hobby you enjoy**. Something that relaxes you, I like to knit. Here is the \"easier said than done\" part that I am still working on myself. **Go out and meet new friends that aren't in your program**. Join a volunteer club or take a painting class, boxing class, really just do anything you enjoy where you can meet and engage other people. Lastly, I think it is important to **celebrate the little things** and see the beauty in the every day things in life. Oh, your PCR worked? Score! It is snowing outside? Look how pretty it is! Also, be excited to see other people and eventually they will be excited to see you too. \n\nHope some of this helps, these are the things I do to keep my sanity. ", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "32": {"Subreddit": "PhD", "Author": "wifichick", "Date": 1453004503, "Score": 2, "Body": "Yup. Fat princess adventures (vid game) caught me today. ", "Permalink": "https://www.reddit.com/by_id/t3_41asdz.json"}, "33": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1453029630, "Score": 2, "Body": "Unfortunately I don't think this is something anyone can really answer for you. In my experience, academics vary hugely in response times for things like this and also bureaucracy can play a part depending on the institution. Patience is key! You will know either way eventually. If you have any other applications planned you should put this one out of your mind for now and focus on making those as strong as possible. \n\nBest of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_41buny.json"}, "34": {"Subreddit": "PhD", "Author": "Aleksand0r", "Date": 1453033606, "Score": 1, "Body": "May not be what you're after but some UK universities offer fully funded, with pay, scholarships and you can apply directly from bachelors. I'm currently doing that myself and although I sometimes feel beneath my peers who have at least one masters degree, I'm able to hold my own and am making good progress. My programme is completely self directed, within the scope of the project of course, and doesn't involve classes or any sort of directed learning. ", "Permalink": "https://www.reddit.com/by_id/t3_3wvb3f.json"}, "35": {"Subreddit": "PhD", "Author": "Webby911", "Date": 1453041913, "Score": 2, "Body": "It'd be overkill... like how Princeton doesn't have an honours program.Same thing with a PhD it's already like the hardest thing you'll ever do, how could it possibly be harder.", "Permalink": "https://www.reddit.com/by_id/t3_3ydw0q.json"}, "36": {"Subreddit": "PhD", "Author": "tripreality00", "Date": 1453047449, "Score": 2, "Body": "This was my assumption and understanding. Was just hoping to hear others experiences. Thank you for the response. ", "Permalink": "https://www.reddit.com/by_id/t3_41buny.json"}, "37": {"Subreddit": "PhD", "Author": "esgresh", "Date": 1453048609, "Score": 1, "Body": "Are these still available? I'd be interested and could pay p&amp;p. I am based in Leeds ", "Permalink": "https://www.reddit.com/by_id/t3_41e3ic.json"}, "38": {"Subreddit": "PhD", "Author": "kill_andrew", "Date": 1453049713, "Score": 1, "Body": "Yep! I'll PM you.", "Permalink": "https://www.reddit.com/by_id/t3_41e3ic.json"}, "39": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1453050965, "Score": 1, "Body": "Ah fair enough, in my case I applied for two PhD positions and was accepted for the second. The first was a highly competitive four year programme with thousands of applicants in which I applied to a committee and I found out over a month later that I hadn't made the shortlist. My successful application was directly to my current supervisor and she was much faster in replying with my interview offer. I can't exactly even say that's a trend since I wouldn't be much of a scientist if I did, but it does suggest that popular programmes with more applicants may take longer to process.\n\nHope that helps a little.", "Permalink": "https://www.reddit.com/by_id/t3_41buny.json"}, "40": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1453058577, "Score": 2, "Body": "This sounds like a good idea. They do have a help center for graduate students that I've heard a few others use. What can I expect if I make an appointment and how should I prepare.", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "41": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1453104670, "Score": 1, "Body": "Interested what others here think of the pomodoro technique. You can get a chrome extension and block all the website you want it to (facebook, reddit, email, so on) during the work phase, and then they're back up during the break phase. \n\nHowever, that being said-- my other officemates and I have found that when we use this, we end up taking the breaks unnecessarily. (e.g. takes about 5-8 min to fully start up in your work/ writing) then when you're on a roll, you get a cue (bell) and fell like, ah sweet, now I need to go make some coffee, chat to my office mates, check facebook whatever. Whereas, sometimes I just find I work best at my own, uninterrupted pace when I'm being self discipled. But perhaps thats just my problem, and also being in a generally rather social office of as well. ", "Permalink": "https://www.reddit.com/by_id/t3_41foa1.json"}, "42": {"Subreddit": "PhD", "Author": "drjohnproofreading", "Date": 1453134529, "Score": 1, "Body": "Thanks for your reply. Yes, it can interrupt your flow, but the breaks are only 3-5 minutes. It's much harder to do this in a busy office or with others, but I have found that it can focused my working activity and helped me get a lot more done in a short amount of time. The times can change, depending on how you work. When I started with my PhD I did 45 minutes working and 15 minutes break. It depends what works for you.", "Permalink": "https://www.reddit.com/by_id/t3_41foa1.json"}, "43": {"Subreddit": "PhD", "Author": "jackford3", "Date": 1453190760, "Score": 2, "Body": "That's a tough situation. Talk with advisors. I left a PhD program, but before I did, I totally hit the wall just like you describe. I was blunt, and told a professor honestly how exhausted I was. This professor was a PhD research slave driver, and I expected him to declare me a failure. Instead he was surprisingly empathetic and accommodating. He shared with me a deeply personal story about a time in his grad school career when he burned out and almost lost his then girlfriend, now wife. When I told a different professor who I was TA-ing for, I felt like she took me under her wing and shielded me from any unnecessary work. I feared that telling her would make her look down on me or doubt me. In reality, sharing that with her somehow forged a relationship that led us to be oddly loyal to each other. You're clearly juggling a lot and working hard. If you're sincere, I imagine people will recognize your effort and cut you some slack--perhaps work with you on the scheduling of those prelims. Who knows? You're only human, and although few admit it, I think everyone goes through those times when they have exactly zero fucks to give (I for one have approximately two fucks to distribute, at best, over the course of a good week). If that doesn't work, however, I'll offer three other suggestions. Even if you think you don't have time, I think (1) and (2) might help you recharge, enable better productivity when you do work, and feel less of a wall. 1) maintain a non-PhD related hobby that isn't reading or looking at a screen in which you can zone out and experience \"flow\" 2) leave the electronics at home and go for a long walk--preferably in secluded nature or with a non-grad-student-friend. 3) it seemed to me PhD students are struck with debilitating self-doubt and an impostor syndrome. Believe in yourself. Don't worry; everyone on this planet is pretty much faking it. Get sleep and just keep trucking. . . Alas, you may not want to take advice from me. Ultimately, I determined that we all must choose which walls to break through and which walls to pass by, and I wasn't sure if I even wanted to be on the other side of the PhD wall. ", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "44": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1453204885, "Score": 2, "Body": "This is some pretty solid advice, especially about having the hobby outside of the PhD that can take your mind away from things. \n\nIf it is any help, I recently just failed my Viva - suffering the ignominy of that, and have to now gain the confidence and motivation for a complete rewrite and a devising of a new project, all while my amount of shit to give has drastically decreased. Also have to field a part time job in the University and all the other stresses of life, ie rent, credit card bills, and a mental illness. The joys.  ", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "45": {"Subreddit": "PhD", "Author": "jackford3", "Date": 1453208366, "Score": 1, "Body": "I'm going to venture a guess that your mental health issues--what sounds like the most serious of your problems--are probably seriously exacerbated by grad school and all the other stresses that you're facing. In any case, sorry to hear that. ", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "46": {"Subreddit": "PhD", "Author": "captainbananaman", "Date": 1453218915, "Score": 2, "Body": "Don't worry. Once you start rolling, you'll be surprised by how much momentum you gather. I was pretty much the same when I started preparing for quals. But it gets better. There is light at the end of the tunnel. Take it a day at a time. And most importantly, join a group of other students preparing for the exam. ", "Permalink": "https://www.reddit.com/by_id/t3_41asdz.json"}, "47": {"Subreddit": "PhD", "Author": "bunnysuitman", "Date": 1453224370, "Score": 1, "Body": "I actually started with really good momentum and then the bottom fell out...almost done, going to finish early, but *blerg*", "Permalink": "https://www.reddit.com/by_id/t3_41asdz.json"}, "48": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1453226377, "Score": 1, "Body": "No need for apologies, I wasn't looking for that. Keeping the motivation and dedication levels are the most difficult thing at this stage. I have other things, outside of my PhD life, that keep my spirits up!", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "49": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1453238174, "Score": 1, "Body": "I think it helps to be a little selfish, learn to say no, and don't beat yourself up about it. For instance, don't do so many article edits when they don't have your name on them or work on proposals more than a minimum amount. If you go to your advisor and the professor of the class you teach and explain that your critical exams are coming up, then they should let you off for a while or reduce the load on you, or you say \"here's my comments, but I only had time to quickly skim the proposal because I was so busy last weekend.\" If you are the one who is always agreeing, then you get more work handed to you, and though you think everyone should love you, you don't really get appreciation for doing any of that. I spent a lot of time maintaining this multiuser research facility and helping other students with their fabrication issues but I realized that the department didn't care or appreciate what I was doing in the lab and that helping other students doesn't even get me a mention in the acknowledgements. So I stopped doing any of that, the lab went to total shit for 8 months, and that was the right decision because finally the department hired half of a new lab manager who is holding it together at least. With my newfound free time I'm actually getting research done and things are looking up for me. Also, watch out for advisors. They will dump their work on anyone who will say yes. There's a student in my lab who is supported on a research scholarship who is grading the papers for my advisor's class, and my friend lost two entire summers, prime research time, to leading high school robotics projects and teaching programming - all unpaid. Yes, maybe fun for a summer and outreach is a nice cause, but 50 hour weeks all summer is too much - and what is the real result? A delayed graduation, stress as her advisor yells at her for having so little research progress, and that same advisor pads his grant proposals' outreach section with his summer program that he conceived and managed which was almost a complete disaster from being underfunded until he found some chump to save his ass.", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "50": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1453311296, "Score": 1, "Body": "I found it most useful as long as I didn't stick myself to it rigidly. Its more like forcing myself to really focus for 20 minutes because I tell myself that after that I can address all the other nagging things in my head. Often just forcing myself to get started for 20 minutes got me going and then I didn't take breaks and worked for a couple hours. Something about making yourself really focus for 20 minutes removes the dumb reddit cravings for a while.", "Permalink": "https://www.reddit.com/by_id/t3_41foa1.json"}, "51": {"Subreddit": "PhD", "Author": "StringerBell9", "Date": 1453314684, "Score": 1, "Body": "I use OneNote to record notes, copy links/citations as they appear on PubMed/ScienceDirect etc. \n\nAt least that way I will have a database of what I've taken notes on. Scribbled notes often get lost and forgotten. ", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "52": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1453380097, "Score": 1, "Body": "What's with the user name? ", "Permalink": "https://www.reddit.com/by_id/t3_41vz3x.json"}, "53": {"Subreddit": "PhD", "Author": "drjohnproofreading", "Date": 1453388916, "Score": 1, "Body": "Yes, I know what you mean. I can spend hours not doing very much. Having a time plan helps me focus and push myself, otherwise I end up making a snack, checking my website hits or posting on social media. It's amazing what you can get done in one 25 minute session when  you focus.", "Permalink": "https://www.reddit.com/by_id/t3_41foa1.json"}, "54": {"Subreddit": "PhD", "Author": "dny6", "Date": 1453400097, "Score": 2, "Body": "What field? Physics has arxiv which is super duper useful for staying up to date.\n\nOther than that, I would download software for managing libraries of papers that allow for notetaking/highlighting/comments (Sente on Mac).\n\nMy profs usually spend their mornings reading one or two papers AFAIK", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "55": {"Subreddit": "PhD", "Author": "dny6", "Date": 1453400268, "Score": 1, "Body": "As someone who has gone to therapy (not grad school related) and had a PI who went through therapy in graduate school, DO IT. It rescued my PI from dropping out ", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "56": {"Subreddit": "PhD", "Author": "dny6", "Date": 1453400318, "Score": 1, "Body": "PCR worked? nice jokes mate ", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "57": {"Subreddit": "PhD", "Author": "CoolEngineer", "Date": 1453406300, "Score": 1, "Body": "Thanks. Engineering.  Will check if there's an equivalent or similar software for Windows.", "Permalink": "https://www.reddit.com/by_id/t3_40rw2j.json"}, "58": {"Subreddit": "PhD", "Author": "ColourlessGreenIdeas", "Date": 1453412518, "Score": 2, "Body": "When I started my PhD four years ago, I was among the worst 20% of all public speakers in my graduation class. I had serious mumbling and pacing issues (was super-quick) and couldn't look anyone in the eye.\n\nThe PhD was the single best thing that could have happened to me. I was a TA and gave a few conference talks, which helped me to improve my speaking skills drastically.\n\nIn December, I defended my PhD thesis. I received the best possible grade for my defense talk and one of my colleagues admitted he was literally blown away.\n\nMy skills are still by no means perfect. The occasional stammering will happen from time to time. But people are very forgiving for that - if you don't let yourself be bothered and continue to speak on with confidence. The single most important thing that I learned: Practice your talk. Over and over, until the words flow out naturally.\n\nEven if you can't imagine it now, giving a talk will eventually be fun. I promise you.", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "59": {"Subreddit": "PhD", "Author": "ForgottenPotato", "Date": 1453413177, "Score": 2, "Body": "Thank you very much. I take every word to heart. I've since decided that I do want to take on a PhD but still every boost of confidence matters. Congratulations on your result! ", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "60": {"Subreddit": "PhD", "Author": "ColourlessGreenIdeas", "Date": 1453413492, "Score": 1, "Body": "Thank you very much! I wish you all the best for your PhD. :)", "Permalink": "https://www.reddit.com/by_id/t3_3vrv3y.json"}, "61": {"Subreddit": "PhD", "Author": "insomniac365", "Date": 1453423330, "Score": 1, "Body": "Hey I can hope right? \n\nSide comment, if your PCR isn't working there are a lot of troubleshooting methods you can use to address this. The first thing I'd do is check the primers to make sure they are right, (I tend to mix up the letters a lot) as well as the annealing temperatures. If they are fine, I'd check the quality of your template and I'd try a gradient PCR to see if the annealing temperature is the problem. Also, I don't know how temperature careful you are in your lab but I'd also check the integrity of your dNTPs and Taq. Finally, if all of that is fine, I'd shift your primers up or down stream a few bases to see if that works better. ", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "62": {"Subreddit": "PhD", "Author": "electromagneticmulch", "Date": 1453584094, "Score": 1, "Body": "Other than the first bullet point absolutely none of those are related to achieving a PhD. ", "Permalink": "https://www.reddit.com/by_id/t3_41vz3x.json"}, "63": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1453677623, "Score": 1, "Body": "Yeah but we PhD students are here for each other, right?\n\nGood luck OP.", "Permalink": "https://www.reddit.com/by_id/t3_41vz3x.json"}, "64": {"Subreddit": "PhD", "Author": "fruitbooploops", "Date": 1453783364, "Score": 1, "Body": "how to B?", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "65": {"Subreddit": "PhD", "Author": "fruitbooploops", "Date": 1453783538, "Score": 1, "Body": "were you this dedicated throughout undergrad?", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "66": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1453785079, "Score": 1, "Body": "No I wasn't. I had a very vague interest in the subject when I was an undergrad, but I got involved in undergrad research anyways to get my toes wet. This helped steer me in the right direction for my PhD.", "Permalink": "https://www.reddit.com/by_id/t3_3m611a.json"}, "67": {"Subreddit": "PhD", "Author": "nonickleft", "Date": 1453912677, "Score": 1, "Body": "My wall: 8 MSc theses supervision, about 20 ECTS worth of teaching, and wrote three articles (now published, main author on two) during a period of a year. At the same time I was collecting data for another two articles. I had so much to do that when I broke my ribs I decided not to take morphine as it clouded my mind. \n\nHow long did it last? A year. It was building up to it over time, but that year was tough as hell.\n\nWhat can you do? Hard to say since every situation is different. But, see if there are any formal routines or regulations that you can use. How are hours registered? How much administrative duties are you contractually obliged to do? How are the hours counted for these? Make sure to get away from \"random other projects\" if these involve people who you feel leech on your work.\n\nRemember ... in the end no-one is going to stand up and defend your lack of progress in your thesis. Act accordingly.", "Permalink": "https://www.reddit.com/by_id/t3_41jytb.json"}, "68": {"Subreddit": "PhD", "Author": "nonickleft", "Date": 1453913560, "Score": 1, "Body": "Losing grip on reality like that is not easy. Knowing that it is not healthy not to slow down, but feeling stressed about doing so is incredibly frustrating.\n\nIt is hard to know what you are doing from your description. In my case it got so bad that I had to take sleeping pills (three occasions) to get back on track again. But quick fixes need to be replaced by long term solutions. \n\nTry to identify the root cause of why you are behind. Is it that you are not effective? Do you prioritize correctly? Are you involved in lots of projects that do not contribute to a thesis? What is the level of accepted quality? Do you need to change something in your environment?\n\nIn my third year, I had 0 publications. Coming up to my fourth, I decided to switch institution because of reasons related to the questions I listed. Fast forward a year and I now have 3 published papers and two more in second round of reviews (of which one in a A* ranked journal).", "Permalink": "https://www.reddit.com/by_id/t3_4166zu.json"}, "69": {"Subreddit": "PhD", "Author": "nonickleft", "Date": 1453914059, "Score": 1, "Body": "I use mind-mapping software (xmind). Nodes are topics, and then quotes from the text, and source in the hidden comment.\n\nI prefer this because I can adapt the \"notes\" to my specific needs of the article I am writing at the time. More static notes quickly become too much to be of any use. Takes a lot of time but it is worth it.", "Permalink": "https://www.reddit.com/by_id/t3_3y65pz.json"}, "70": {"Subreddit": "UNEMPLOYED_GUY_PhD", "Author": "OrangeSn0w", "Date": 1453980871, "Score": 1, "Body": "Start at the job centre ", "Permalink": "https://www.reddit.com/by_id/t3_432h63.json"}, "71": {"Subreddit": "BrianHasaPhD", "Author": "bobawesome", "Date": 1453984697, "Score": 1, "Body": "A pretty huge...", "Permalink": "https://www.reddit.com/by_id/t3_42xih9.json"}, "72": {"Subreddit": "PhD", "Author": "Typhoon323", "Date": 1454020216, "Score": 2, "Body": "Are you okay? Are you still delirious?", "Permalink": "https://www.reddit.com/by_id/t3_433soj.json"}, "73": {"Subreddit": "PhD", "Author": "fruitheart", "Date": 1454071945, "Score": 1, "Body": "Í'm definately not okay in general but I'm not delirious anymore haha", "Permalink": "https://www.reddit.com/by_id/t3_433soj.json"}, "74": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1454077388, "Score": 1, "Body": "Are they offering enough to live on?  $28,000 is fine in Bloomington IN, but won't come close to covering costs in NYC.  \n\nAs long as the offer will cover your cost of living and health insurance, go where you'll get the best experience and best-fitting advisor.  Your experience will drastically change the salary of your next position 5 years from now, much more than the differences in your offers now.\n\nSource: Multiple friends completed chemistry PhD's.", "Permalink": "https://www.reddit.com/by_id/t3_43834o.json"}, "75": {"Subreddit": "PhD", "Author": "Typhoon323", "Date": 1454095390, "Score": 3, "Body": "If you're not okay in general, you should be talking to someone.\n\nAlso, I'd reconsider applying to a PhD program right now.  Earning a PhD is extremely stressful, so be sure you're in a state where you can handle whatever is thrown at you.", "Permalink": "https://www.reddit.com/by_id/t3_433soj.json"}, "76": {"Subreddit": "PhD", "Author": "missusamazing", "Date": 1454120573, "Score": 1, "Body": "My applications took between one and two months to get responses from, but I believe this is because I submitted them near the deadline.", "Permalink": "https://www.reddit.com/by_id/t3_41buny.json"}, "77": {"Subreddit": "PhD", "Author": "missusamazing", "Date": 1454121281, "Score": 1, "Body": "Money was a major consideration for me. I'm not a Chemistry PhD student, but here's my experience:\n\nI applied for a program offered by the University I was working for, with the intention of my work covering my tuition, so that I could be a part time student and work full time (making $$$), which would be the best of both worlds, for me. \n\nI also applied to a R1 that was out of state that offered a significantly better program and overall was a much better university. I wrestled with the idea of paying out of state tuition, not having a full time job, moving, etc. They gave me a graduate assistantship with a decent stipend (more than typical because I already have a master's degree, ~10k/semester), and tuition is totally covered.\n\nI went for the R1. Even though it's a temporary income loss, I believe the weight of the University's name and the quality of the program will pay off. ", "Permalink": "https://www.reddit.com/by_id/t3_43834o.json"}, "78": {"Subreddit": "PhD", "Author": "missusamazing", "Date": 1454121561, "Score": 1, "Body": "I had this problem, too. I was interested in a DPA program, but I didn't see the relative value of having that over a PhD, so I didn't go for it.", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "79": {"Subreddit": "PhD", "Author": "MaestroWu", "Date": 1454143204, "Score": 1, "Body": "Thanks. I think I've decided to apply, and see what happens. ", "Permalink": "https://www.reddit.com/by_id/t3_40as3f.json"}, "80": {"Subreddit": "PhD", "Author": "banaramajama", "Date": 1454169756, "Score": 1, "Body": "You can't make a major decision in your life, i.e. accepting a phd position, based solely on the fact that you don't want to hurt someone's feelings. Yes, it is not a nice thing to do to the school to turn them down after you've already accepted. But you can't select the course of the next five years based on that reason. \n\nI am a 2nd year phd student. I initially accepted a position at one school, but the next day I got an offer from a school with a professor who I REALLY wanted to work with. I turned down the first school. I had even paid the deposit at that time. I felt bad and it wasn't easy, but it had to be done. I'm happy with my decision. ", "Permalink": "https://www.reddit.com/by_id/t3_3wyfmq.json"}}