{"0": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470015265, "Score": 1, "Body": "Um...so he is conducting unethical experiments on mice with no real strategy?? I would be so freakin' pissed off if mice are being tested on just because he is too afraid to let go of the project. I might just end up reporting this tbh.", "Permalink": "https://www.reddit.com/by_id/t3_4ux2t8.json"}, "1": {"Subreddit": "PhD", "Author": "terra_sidd", "Date": 1470029253, "Score": 1, "Body": "Yes, that's what I've observed so far. But I've been seeing too many students applying with a GMAT in the PhD program of business majors, hence the confusion. ", "Permalink": "https://www.reddit.com/by_id/t3_4uh8hx.json"}, "2": {"Subreddit": "PhD", "Author": "terra_sidd", "Date": 1470029280, "Score": 1, "Body": "Thanks so much.", "Permalink": "https://www.reddit.com/by_id/t3_4uh8hx.json"}, "3": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1470039521, "Score": 8, "Body": "This is some awful shit... A time lapse would usually at least have the same pose! ", "Permalink": "https://www.reddit.com/by_id/t3_4virqx.json"}, "4": {"Subreddit": "PhD", "Author": "JakeNewman08", "Date": 1470044259, "Score": -2, "Body": "Cheers grubberlang. What a wonderful world we live in", "Permalink": "https://www.reddit.com/by_id/t3_4virqx.json"}, "5": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1470063059, "Score": 1, "Body": "Best of luck", "Permalink": "https://www.reddit.com/by_id/t3_4uh8hx.json"}, "6": {"Subreddit": "PhD", "Author": "DustyDraft", "Date": 1470072894, "Score": 2, "Body": "/r/suggestalaptop", "Permalink": "https://www.reddit.com/by_id/t3_4uv031.json"}, "7": {"Subreddit": "PhD", "Author": "renee83", "Date": 1470076917, "Score": 2, "Body": "I didn't dawn on me until after my allergy that what he had me do was wrong in every aspect....Once I talk to me director, I will let him know that I had to sacrifice upwards of 400 mice for a project I know didn't work.", "Permalink": "https://www.reddit.com/by_id/t3_4ux2t8.json"}, "8": {"Subreddit": "PhD", "Author": "renee83", "Date": 1470077134, "Score": 2, "Body": "I agree..Luckily, I didn't have to take out loans because the program pays me. I also have full medical. dental and vision insurance too, which is a big plus!\nThe sad part is, I actually do love science, but I can't conduct it int he way my P.I. wants me to because it isn't getting me anywhere. Having a PhD I think would bolster my chances if getting into a law school, especially since they are rare to come by in the law field. It is difficult think about all of the time lost doing this, but I am unhappy. Once I talk to the director, I'll have a better idea of what to do.", "Permalink": "https://www.reddit.com/by_id/t3_4ux2t8.json"}, "9": {"Subreddit": "PhD", "Author": "whatismylifehalp", "Date": 1470078195, "Score": 1, "Body": "I would suggest taking a couple of years to work and to figure out what you want.\n\nI entered a Ph.D. program straight from undergrad, and now I'm thinking about leaving because I'm not sure that this is what I want in my life. It was so easy to consider doing the Ph.D. as \"the next logical step\" toward becoming a scientist, but I think I was naive regarding the reality of being a scientist. I severely underestimated how my values and interests would change during my first year out of college. \n\nIf I could do it again, I would definitely take time off before graduate school. Life after college is *so different*, and I think it's important to really know yourself and what you want before committing to a graduate program. However, this might not be the case for you-- there are lots of people who I'm sure DO know exactly what they want after college. But if you can't pinpoint (1) a specific project or set of projects you want to work on, (2) the skills you want to gain as a graduate student, and (3) the specific career you want after your Ph.D., then I would say wait. If you pick the wrong program, you might be kicking yourself for 5 years, or have to deal with leaving a program. But it's really unlikely that you would regret taking a year or two to work, because really, what are you losing there?\n\nAlso, if your final goal is a Ph.D. (someday), don't pay for a masters. That just doesn't make sense.", "Permalink": "https://www.reddit.com/by_id/t3_4t6rsm.json"}, "10": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1470087596, "Score": 2, "Body": "The fact that you got sunburnt in your final year gives me hope that I will get outside at least once.", "Permalink": "https://www.reddit.com/by_id/t3_4virqx.json"}, "11": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1470088860, "Score": 4, "Body": "In most cases, your advisor doesn't have enough time to hang over you and tell you to keep working. Self control and work ethic is my own (and others) biggest challenge.\n\nGetting yourself to write the paper is harder than writing the paper. Getting yourself to analyze the dataset is harder than analyzing the dataset.\n\nI believe that the primary thing that will determine how successful you are in your PhD, is your ability to wake up everyday at a reasonable hour (8am?), so that you can get into the lab/office to work at a good pace every single day. Set up a guideline for yourself to follow (e.g. 9-10 hrs a day, with a half day on Saturday, and Sunday is for exercise, running personal errands, grocery shopping, etc.) and do whatever you have to do to follow it. Another method is to agree to yourself to work 50 hours a week and then track this. The hardest part is just keeping track of it. If you keep track of it, the itch to follow your guidelines will follow. It's easy to be lax in the beginning because there isn't much pressure. The idea is that you don't want a lot of pressure to form, so you stay ahead of the game.", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "12": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470093182, "Score": 2, "Body": "\"The idea is that you don't want a lot of pressure to form\" is probably going to be my motto the entire time. Thanks!!", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "13": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470093245, "Score": 1, "Body": "Yes please report him this is so unethical and backwards it's unbelievable. I am a big proponent of not wasting any lab animal life for meaningless science. Where was your animal care department at??", "Permalink": "https://www.reddit.com/by_id/t3_4ux2t8.json"}, "14": {"Subreddit": "PhD", "Author": "shewhoruns", "Date": 1470130811, "Score": 1, "Body": "Thank you so much! This wasn't too late; I just started yesterday. I'm especially grateful now to start before everyone else because the PI is around and available for questions. ", "Permalink": "https://www.reddit.com/by_id/t3_4u53bu.json"}, "15": {"Subreddit": "PhD", "Author": "Tsingya", "Date": 1470155917, "Score": 1, "Body": "Oooh I hope it all goes well! Glad I could help in a teeny tiny way :)\nAnd ask ALL the questions! You'll be fine! ^_^", "Permalink": "https://www.reddit.com/by_id/t3_4u53bu.json"}, "16": {"Subreddit": "PhD", "Author": "Lady_Pug", "Date": 1470170464, "Score": 1, "Body": "Yep, my biggest regret is choosing my supervisor. To put things in perspective, when testing the normality assumption she once wasn't sure whether to calculate the distribution of each group separately or of the sample as a whole. ", "Permalink": "https://www.reddit.com/by_id/t3_4r2xeb.json"}, "17": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470193836, "Score": 6, "Body": "If you feel alone, you should really get well acquainted with others in your department. Go out to their parties, their friday night drinks or whatever they do. It will help you because they become great friends and great colleagues with whom you can discuss normal life and graduate life.", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "18": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1470199104, "Score": 2, "Body": "Seems like you aged normally enough. I was expecting your face to get wrinkly, your hair to fall out, and for you to lose 40 pounds.", "Permalink": "https://www.reddit.com/by_id/t3_4virqx.json"}, "19": {"Subreddit": "PhD", "Author": "corngarden", "Date": 1470228614, "Score": 1, "Body": "This is good. I recently read a book that really helped me in my research and dealing with my advisor, who is much like yours. It was called the unwritten rules of phd research. I would highly recommend it! It is fairly [cheap](https://www.amazon.com/gp/offer-listing/0335213448/ref=sr_1_2_olp?ie=UTF8&amp;qid=1470228573&amp;sr=8-2&amp;keywords=the+unwritten+rules+of+phd+research) online. Best of luck! ", "Permalink": "https://www.reddit.com/by_id/t3_4qg81z.json"}, "20": {"Subreddit": "PhD", "Author": "corngarden", "Date": 1470229325, "Score": 4, "Body": "Yes, I can empathize with you! Thankfully they shove a bunch of us into an office together. I find time to toss a disk with other students or put my research down for a little while. Most people I know don't care about my research, although, they alway seem to ask \"how is your research?\" even if they don't care, haha. I hate that question now. Anyway Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "21": {"Subreddit": "PhD", "Author": "thinkevolution", "Date": 1470248636, "Score": 2, "Body": "I have a great relationship with my colleagues.  Can't hang out much because I have kids and a full time job too...just more that my family or those not in my cohort really glaze over if I talk about my topic or process.", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "22": {"Subreddit": "PhD", "Author": "susanhashotpants", "Date": 1470271427, "Score": 3, "Body": "I'm just so sick of people asking \"are you done yet?\"", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "23": {"Subreddit": "PhD", "Author": "weetziebat21", "Date": 1470312635, "Score": 3, "Body": "Completely and it sucks. I have a family also and live at a distance from my uni so spend all my time in various libraries surrounded by strangers. Sometimes it is nice, but there are days (a lot of them!) when I don't say one single word to a person who is not in my immediate family. \nFurthermore, family(and especially partner) has no interest in finding out what I am doing. I asked him once what I was researching and he couldn't even start, not even the general area! So frustrating even for someone who likes keeping to myself and my thoughts, so I do feel for you OP!", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "24": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1470327182, "Score": 1, "Body": "This is normal. I feel like nobody values my PhD except for me. Not even my advisor, by which I mean he is not really thinking about my graduation, only about his own career. But that is ok for me, just keep working and I chatting with a couple people in my school in related areas.", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "25": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1470327645, "Score": 1, "Body": "Well, if you're past classes, past quals, and have read enough and been in the lab enough to have an ok background in your field, then you might actually be able to get out in 1.5-2.5 years by changing topic to something closely related and grabbing at low hanging fruit to get a couple papers out. A lot of people I talk to say that the content of their dissertations were from the last year of their PhD only. I think your advisor situation is bad, but if you have a fully stocked lab to work in so you have supplies, and are experienced enough on techniques, you should be able to come up with some research topic!", "Permalink": "https://www.reddit.com/by_id/t3_4ux2t8.json"}, "26": {"Subreddit": "PhD", "Author": "Tserman", "Date": 1470334442, "Score": 1, "Body": "Starting my PhD as well in September! Hope you have a great start :) May i ask on what subject? ^^\n", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "27": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1470334508, "Score": 2, "Body": "You have mandatory classes for your PhD? Where do you study? I don't what advice to get you as I've never heard of people having mandatory classes before. ", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "28": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470336789, "Score": 1, "Body": "Doing a project involved with genetics!", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "29": {"Subreddit": "PhD", "Author": "happy_and_proud", "Date": 1470341331, "Score": 7, "Body": "In the US most PhD programs has mandatory classes (mine have 20 hours of mandatory classes).", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "30": {"Subreddit": "PhD", "Author": "MajoranaFermionCakes", "Date": 1470342386, "Score": 1, "Body": "Yes, but only because I moved countries for my PhD. So all my friends from my degree (my bestie included) are in country A, my family are all in country B (but we're not close anyway) while I'm in the basement lab of country C. So I don't have anyone to bore anyway, since all my 'friends' are lab people.", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "31": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1470342911, "Score": 1, "Body": "À class?  I only have seminars and they are great. I get a lot of input from my student colleagues and it's more an exchange of ideas rather than being lectured by a prof. ", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "32": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1470345017, "Score": 1, "Body": "Wow TIL! ", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "33": {"Subreddit": "PhD", "Author": "leercup", "Date": 1470370723, "Score": 1, "Body": "My tip? Don't do it, haha.", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "34": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1470384667, "Score": 1, "Body": "Is it because in the US you can enroll in a PhD programs having only a BA (/BSc), whereas in Europe (AFAIK -- I know it's the case in Belgium and in quite a lot of other countries) you absolutely need a MA/MSc?", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "35": {"Subreddit": "PhD", "Author": "happy_and_proud", "Date": 1470386090, "Score": 1, "Body": "While you can go BSc to PhD immediately in US, classes are required even if you have masters, only less hours. The 20 hours is for students who have masters, for BSc to PhD route I think its 50 hours of classes.", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "36": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1470388110, "Score": 1, "Body": "Oh wow...\n\nCome to think of it, we do have a \"doctoral formation\" too, but you earn credits by publishing papers or presenting at conferences.", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "37": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1470404528, "Score": 1, "Body": "LOL! Too late to turn back now :p", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "38": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1470444912, "Score": 1, "Body": "It definitely depends on the program, most PhD students will take some classes but they aren't necessarily mandatory. For my program I took a few classes my first year but we don't have a required number of courses needed to graduate. The only thing required is a seminar for your first year or two, but it isn't really a class.", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "39": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1470488393, "Score": 1, "Body": "A friend recently switched from Religious Studies to Sociology. She was studying a sociological topic in religion, and had issues with her supervisor, so transferred to a new supervisor in the department of Sociology in a different university for her last year.", "Permalink": "https://www.reddit.com/by_id/t3_4waylm.json"}, "40": {"Subreddit": "PhD", "Author": "ravan46", "Date": 1470494786, "Score": 4, "Body": "You probably need to go to class. The easiest grad school classes are ones where you show up, and possibly do a semester project. Everyone get's A's in those classes, but the minimum requirement is you show up.\n\nIf you don't think you'll have enough time then don't take the classes. ", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "41": {"Subreddit": "PhD", "Author": "AntDogFan", "Date": 1470614609, "Score": 1, "Body": "You can go straight to a PhD from a BA/BSc but it's not very common in my experience. That said in my field most people need the skills picked up from an MA before going onto a PhD but this isn't always the case.", "Permalink": "https://www.reddit.com/by_id/t3_4w4ggb.json"}, "42": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1470694013, "Score": 2, "Body": "Doesn't matter (or only marginally matters).  \nMore important (in order): your publication record, letters of recommendation, prestige of your phd granting institution in your field and overall, your research pipeline for next 5 years, communication skills, who your advisor was (if they are well known and liked in the field)", "Permalink": "https://www.reddit.com/by_id/t3_4wr0pp.json"}, "43": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1470695040, "Score": 1, "Body": "Thanks for the advice. \n\nI've been considering this a lot lately. I'm at the tail end of my PharmD-MS beginning to look at PhD programs, and was just worried about prospects. \n\nI pretty much have all of the things in your list at my disposal, but was just apprehensive about what a single degree-granting university could mean for me looking for academia jobs. The one thing that was missing was the outside training, but my PI has been very good about getting me out and working under our collaborators for the things our lab doesn't necessarily specialize in, which I have been hoping to use as my self-imposed diversity requirement.  \n\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4wr0pp.json"}, "44": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1470712036, "Score": 2, "Body": "Nice write up.  Hopefully the data gathered will be shared some day.", "Permalink": "https://www.reddit.com/by_id/t3_4ws1q5.json"}, "45": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1470778925, "Score": 9, "Body": "Your site is a shitty ad for nonsense for-profit \"schools\". Go away", "Permalink": "https://www.reddit.com/by_id/t3_4wym05.json"}, "46": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1470789807, "Score": 6, "Body": "I'd save the novel research for later, and here's why: you dissertation work is going to be shredded in multiple directions by committee members who don't understand or care about the significance of your contributions but are upset you didn't spend a chapter on their pet idea and citing their postdocs even though this work is only tangentially related to your thesis topic.\n\nAlso, basic traditional research will be much more defensible to a committee.  No committee ever rejected work because it was \"boring\", but committees love to pick holes in daring projects with a few small flaws.\n\nOf course, it's your career path and only you know all the details, so you'll have to choose the option that helps you the best.", "Permalink": "https://www.reddit.com/by_id/t3_4wzgl6.json"}, "47": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1470790665, "Score": 1, "Body": "Wanting to refocus isn't weird at all. My experience has led me in all sorts of different directions.\n\nMy B.S. was in Psychology &amp; Communications, M.Ed. in \"Social and Comparative Analysis\", and am now a PhD student in a medical school (\"Clinical and Translational Science\"). There are some overlaps among these programs, but the real benefit has been learning new things while being able to draw from past experiences. When it's all said and done, maybe I can make a case for teaching overlapping subject areas that I'm really interested in. Or maybe I spread myself too thin across different subjects and don't get to teach anything.  Moving from CS to math is probably less of a risk in general.  That's fairly common, and might strategically set you apart from CS purists, depending on where you might end up teaching.", "Permalink": "https://www.reddit.com/by_id/t3_4waylm.json"}, "48": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1470791738, "Score": 3, "Body": "That's sound advice, and hits close to home for me. I'm familiar with the politics of dissertation committees (used to freelance in dissertation consulting in a previous graduate department). It is difficult to separate the passion from the pragmatics when it's my own research.  Thanks for a strong dose of good medicine!\n\nPerhaps it would be better to keep my own pet projects on the periphery for now. The results can always be published later, and elsewhere.", "Permalink": "https://www.reddit.com/by_id/t3_4wzgl6.json"}, "49": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1470793999, "Score": 1, "Body": "I have used RefWorks also. Try Mendeley: If you're writing a paper with many refs, it's worth the extra click for the ease of inserting and formatting refs within documents. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_4u9uwh.json"}, "50": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1470795355, "Score": 3, "Body": "Get the easier work done faster, then you can move onto what's more interesting to you more quickly.", "Permalink": "https://www.reddit.com/by_id/t3_4wzgl6.json"}, "51": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1470797969, "Score": 1, "Body": "You sound eerily like my PhD mentor...  good advice, for sure.", "Permalink": "https://www.reddit.com/by_id/t3_4wzgl6.json"}, "52": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1470849223, "Score": 1, "Body": "Don't be afraid to switch advisors even after working with one for a couple years.", "Permalink": "https://www.reddit.com/by_id/t3_4vecwv.json"}, "53": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1470849479, "Score": 1, "Body": "Don't think a hands off advisor is necessarily a bad thing. Better to have no boss than one who actively works against you like mine.\n\nIf your problem is really just motivation then I suggest connecting with classmates and being involved in the community. You can also find motivation strategies online.", "Permalink": "https://www.reddit.com/by_id/t3_4v3llt.json"}, "54": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1470851386, "Score": 1, "Body": "Thank you for your response.  That is encouraging and helpful.  ", "Permalink": "https://www.reddit.com/by_id/t3_4waylm.json"}, "55": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1470863748, "Score": 2, "Body": "You are fine with 2 years experience. Explain to your profs that you need lots for accounting PhD. You will need 700+ GMAT.", "Permalink": "https://www.reddit.com/by_id/t3_4x3hxr.json"}, "56": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1470872462, "Score": 1, "Body": "I'm in a similar situation: BS, MEd, and now working on PhD - all at same university. I play up that these studies were all within different departments, which perhaps adds a sense of *some* diversity.\n\nPerhaps the best strategy will be to establish collaborations with researchers at other institutions. For example, adding co-authors who can contribute to ongoing publications (especially 1st author pubs).  The traveling work helps too.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_4wr0pp.json"}, "57": {"Subreddit": "PhD", "Author": "WishforNana", "Date": 1470879414, "Score": 1, "Body": "Should I ask my employer when the time comes or find more professors. I'm not going to think about applying unless I get a 700+ score but I'm not super worried. I test well and got 95th percentile on the LSAT and so far the GMAT questions make more sense that that stuff ever did.", "Permalink": "https://www.reddit.com/by_id/t3_4x3hxr.json"}, "58": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1470885734, "Score": 1, "Body": "Any PhD program would prefer academic references. They don't care what your employer thinks.", "Permalink": "https://www.reddit.com/by_id/t3_4x3hxr.json"}, "59": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1470986664, "Score": 2, "Body": "Amphetamines?\n\nMore seriously though, if she takes notes on paper you can't go wrong with a super nice Moleskine notebook. I see on their website they can even be personalised: [click](https://store.moleskine.com/bel/fr-fr/PERSONNALISER/C176?gclid=Cj0KEQjw57W9BRDM9_a-2vWJ68EBEiQAwPNFK9vlXvTwoe-0PCD44-6q7bCnRb6qz82gE9bFMALZn7EaAts18P8HAQ). \n\nIf she's really overworked, and depending on how much that costs in your area, a visit at the spa / a massage could help.", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "60": {"Subreddit": "PhD", "Author": "theoldentimes", "Date": 1470997693, "Score": 2, "Body": "&gt; you can't go wrong with a super nice Moleskine notebook\n\nseriously, though, this is a difficult area: I generally hate it when people buy me notebooks. Having said that, they don't usually buy me moleskines. I think the super-nice gift note books occupies a difficult position though: do I use it every day, or do I keep it as a special memento?\n\n &gt; a visit at the spa / a massage could help.\n\nnow you're talking", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "61": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1471005169, "Score": 2, "Body": "You have to try Moleskines! That and the [Fisher Space Pen](http://www.spacepen.com/) and you're guaranteed to be the coolest person in the lab.\n\nOne problem with the spa idea is the pricetag. In Belgium, it's usually much more than whatever the € equivalent of 30$-50$ is unfortunately...", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "62": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1471011022, "Score": 5, "Body": "Amazon gift cards. As a PhD student myself, I find that I spend my money almost exclusively on books from Amazon. It may not seem like the most thoughtful gift, but it is definitely pragmatic.", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "63": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1471013512, "Score": 1, "Body": "this this this", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "64": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471023447, "Score": 0, "Body": "massage", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "65": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1471024974, "Score": 1, "Body": "&gt; phdstudent.com\nI thought this site just helps phd students with their graduate work.", "Permalink": "https://www.reddit.com/by_id/t3_4wym05.json"}, "66": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1471026742, "Score": 1, "Body": "What do y'all think of something like  Yeti (or, let's be real, the Ozark version of the Yeti)? Potentially engraved? Or unengraved + notebook and /or nice pen?", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "67": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1471026766, "Score": 1, "Body": "Same :( Massages are not cheap. I will check out those pens!! I appreciate it!", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "68": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1471026811, "Score": 1, "Body": "I honestly am thinking about it. I am about to start my PhD program and am looking at $400 worth of texts...so I get it!", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "69": {"Subreddit": "PhD", "Author": "Squirrel127", "Date": 1471026852, "Score": 1, "Body": "I agree with massage/spa day if she's into that. If it's too expensive, buy nice high quality products (could recommend if needed) and have a girly night with her at yours ", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "70": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1471030316, "Score": 3, "Body": "With a budget like yours I'd buy something like a MacBook Pro : durable and lightweight, but able to do some computing (R and such) without any problem. Also the battery life is amazing !\nThat's what I'm using for 4 years now, and it was a very good investment so far.", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "71": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1471038635, "Score": 2, "Body": "after the first seminar.  \nunless the syllabus explicitly states: READ THIS BEFORE CLASS", "Permalink": "https://www.reddit.com/by_id/t3_4xf4sd.json"}, "72": {"Subreddit": "PhD", "Author": "nellasbean", "Date": 1471045569, "Score": 1, "Body": "I would like to do this as well. Currently setting my website up. School starts in a weak.\n\nHORROR.", "Permalink": "https://www.reddit.com/by_id/t3_4xfa65.json"}, "73": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1471076116, "Score": 1, "Body": "On piratebay", "Permalink": "https://www.reddit.com/by_id/t3_4xf4sd.json"}, "74": {"Subreddit": "PhD", "Author": "Dazza3500", "Date": 1471107345, "Score": 2, "Body": "Why do you want to do a PhD? Can help a bit more with some context ", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "75": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1471109905, "Score": 2, "Body": "A PhD is very different than a bachelors or a masters degree. A big part of a PhD is the work that you do (research) and not the classes you take. In fact, in many universities in the US, the coursework for a masters or a PhD degree is the same. It is about 1.5 years of the same courses, after which you grab your masters degree, or spend an extra 3-5 years on your research project and get the PhD. This is why more companies pay for their employees to get a masters degree than a PhD. Generally a PhD in STEM is paid for anyways (research or teaching assistance stipends), so not much need exists for external funding. I have seen rare cases where a company will pay for a PhD (higher than a graduate student stipend) but they either make your research project something they are interested in, or ask for a commitment for the same number of years as your spent on your PhD for you to work for them. Both of these cases are exceedingly rare. Specially since some companies want to hold back publications for a little while and many universities have rules against that sort of things.", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "76": {"Subreddit": "PhD", "Author": "bandinterwebs", "Date": 1471116611, "Score": 1, "Body": "Thanks for the suggestions! And of course - we both just have different ideas about it :)", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "77": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1471136050, "Score": 5, "Body": "When the hell did 33 become 'middle aged'...", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "78": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1471136369, "Score": 5, "Body": "Don't worry you're not going to know everything. If there's something that somebody is talking about that you don't understand then either ask the person or write it down and look it up later. That was especially hard for me since I wasn't trained in my field before starting but after a year it's gotten a lot better. \n\nAlso make friends with all the non-academic people you see regularly. The technicians, the librarians, the academic officers. They don't directly affect your grades or research but if you're a big meanie then nobody will want to let you know the little tips to making things work. \n\nLastly remember to have something else to do besides academic work. It sucks if all you think about is work and if you can't find a good way to relieve stress then it will drag you down. ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "79": {"Subreddit": "PhD", "Author": "hematita_rast", "Date": 1471136777, "Score": 1, "Body": "Hey thanks for your reply! What was your PhD about?", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "80": {"Subreddit": "PhD", "Author": "Obsessivefrugality", "Date": 1471137071, "Score": 1, "Body": "I'd think for a student 33 is well beyond middle aged. ", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "81": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1471139369, "Score": 1, "Body": "I would make a statistical guess that the average graduate of the CS PhD programs are in their late 20s or early 30s.  Leaning more toward 30s than earlier unless they are just rock stars.  \n\nIn a different argument, I would say that the period of age description might vary in different cultures but school doesn't impact that variation at all.  ", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "82": {"Subreddit": "PhD", "Author": "MasterHorse", "Date": 1471139426, "Score": 8, "Body": "Let me share some of my experiences.  The PhD life can really be emotionally draining and will affect a person's social and mental being.  There will be times where it actually will take a toll on the relationship.  \n\nAs a matter of fact, I recently ended a relationship with a person that I was dating for 1.5 years.  We were both in a engineering PhD program; however, she started hers last year while I was in my 3rd year.  It became a long distance relationship once she started her program.  The 3rd year is the hardest because you're in limbo -- it's too late to quit yet you are not close to finishing.  \n\nI noticed that my personality and hers were slowly changing and tiny issues started to accumulated.  Eventually we broke it off since our future became very uncertain since we both wanted to pursue our own careers.  Upon reflection, I became my worst enemy.  I notice that I was becoming increasingly critical of everything while she became less tolerant towards my personality flaws.  The stress was indeed driving me to the brink.  I also have stomach and anxiety issues now.  The relationship was becoming toxic and that very apparent when we were physically together.  We would just argue and be spiteful towards each other.  We eventually decided it would be the best to end it and stay friends.  I don't regret my decision, but I do wonder whether the relationship was salvageable.  \n\nWith that said, I would recommend talking about what your future plans are and what your true emotions are for each other.  Unfortunately, a PhD will change a person and you will notice a divergence in personalities/expectations as time goes on.  ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "83": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": 1471140047, "Score": 1, "Body": "Sounds like you're a bit ahead of yourself here. You still have a few years of undergraduate study if I'm not mistaken. Your thoughts on further study, for good or bad, will be different by the time you get to considering and starting a PhD.\n\nI'm 40 and started my PhD this year. I don't have any children, and I am doing the PhD full time (though I do a bit of consulting on the side). This means I can be at the university most days, take part in the discussion and scientific life in the centre, and carve out lots of time for my research without having to stress. If I had to work full-time as well, the stress would not be worth it.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4xjnjy.json"}, "84": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1471141399, "Score": 1, "Body": "I'm doing a PhD in plant biology. Looking at chloroplast development ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "85": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1471147389, "Score": 2, "Body": "Thanks for the insight. I appreciate you taking the time to share your story here. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "86": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471154101, "Score": 4, "Body": "It's interesting to see a topic like this. I just finished up my 4th year of my Engineering PhD. I have chronic right sided abdominal pain and horrible GERD, along with a variety of other things that are perhaps too detailed to go into. But to be honest, it is only recently (up to a year) that I began to wonder about my issues being stress-induced and psychosomatic. Even now, I really have no clue if my issues are 10% or 90% due to stress.\n\nThe stress and physical pain cause someone to be more reclusive. I've been in a relationship with the same person for the entire time. While we aren't necessarily on bad terms, it has affected our relationship quite a bit. Most of the time when she does things, it's with other people - we dated for several years before the PhD program and this was never the case before. When you are stressed or in chronic pain, you just do not at all want to go out and do things. \n\nI'll try to give insight, but take what I say with a grain of salt, because I don't even have my own situation worked out well.\n\nI think the question of whether or not to stay together is mostly your decision, since you are the one most inconvenienced by the other persons’ situation. What if it continues to be this way even after the PhD program? – if he wants to pursue academic or government research, it usually continues to be stressful. I feel confident that you leaving the situation probably won’t fix anything for him; it could actually reduce his personal stability. It's important to have other people around us to keep us sane. If he goes in to school, talks to his professor to give some updates, then goes home and sits in isolation, the picture will get darker with one less person in his life. However, if you are extremely unhappy and you can’t hold your feelings back, it’s probably best to leave him. Are you outwardly frustrated with him multiple times a week and blame him for the way things are? In these cases, you may be right, but it’s probably best to leave him if this happens all the time, but only you know the truth to this.\n\nWhenever somebody is subject to a lot of trauma/stress, the mind seeks ways to shield itself from the associated misery. This is why people who are abused or experience traumatic events are more likely to develop addictions. It may explain why your boyfriend just wants to sit inside and play video games. It takes his mind off of the problem. But this causes a vicious cycle, because the video games just equate to lost time and falling behind in the PhD, which leads to more stress. Remember the final exam you had that you put off until the night before and started freaking out about it? For those getting their PhD, there can be long stretches of time that feel just like this, but continuously.\n\nA few times a year, my PhD advisor asks me what I do to de-stress. He reaffirms that it is necessary to exercise (or something like this) in order to stay physically and mentally healthy doing what we do. Your boyfriend would probably benefit immensely from some sort of physical or mental de-stressor, such as aerobic exercise, meditation, yoga classes, etc. For some reason, these things are like the magic bullet for what your boyfriend is going through. You can’t de-stress the same way with video games, television, movies, etc. 12 hours of video gaming doesn’t have the same effect as a 30 minute jog, or a 30 minute yoga session. Actually, from personal experience, 12 hours of video games only certainly makes the situation/stress worse. Many people with mild or moderate stress turn to these things (exercise, yoga, etc.), and your boyfriend probably needs them moreso, but it sounds like he’s not using any of these things from your description of him. If you decide that it is worthwhile to stay with him, you could probably help him a lot by trying (and you may need to try hard…) to get him onboard with some of these activities that are regularly planned, like a jog every morning, or yoga classes 3 nights a week - Youtube also offers Yoga classes  ;)\n\n\nIt also seems obvious that if your boyfriend can't get a handle on things, he should stop doing what he's doing. But this is a very hard thing for a person in his situation to acknowledge.\n", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "87": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471155861, "Score": 1, "Body": "Wow, sounds exactly like what I'd write. I've had my Macbook Pro for 4 years as well and it still functions great... and I use it ~10-12 hours a day. I've never had a similarly positive experience with a PC laptop, which have always broken down or slowed down in 1-3 years. It's also a lot easier to code with a Mac than a PC, at least for 99% of the things I do.", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "88": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471173958, "Score": 3, "Body": "I'm really sorry that both of you are going through this.  I'm afraid your boyfriend's misery is quite common: for most people, getting a PhD means getting one's academic work and personal worth criticized and unappreciated for years at a time.\n\nWhen I was working on my PhD, I had some relationship issues like you are describing.  It drove me nuts when anyone expected me to \"just cheer up\" or \"please let's fix the problem so we can move on\".  I perceived this caring as \"impatience\": as the worst form of someone not understanding and not caring about me and my goals.  Research was (and is) a huge component of my life, and maybe the system was broken but there sure wasn't anything I could do to fix it at that time, and I was dealing with it as best I could.  Asking me to cheer up was to de-legitimize the source of my pain (broken academia) or ask me to leave it.  Research is my purpose in life, and I didn't want to spend time around people who weren't going to support me in striving after my purpose.  *I only went through that pain because I could see the endgoal and I had decided it was worth it.*\n\nThat was kind of garbled, but, perhaps your boyfriend has a similar perspective?\n\nAnyways, feel free to PM me if you have more questions.", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "89": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471174675, "Score": 2, "Body": "How is your literature background?  I generally recommend people read 500 papers before they start a PhD, and another 500 papers during the PhD.  90% of PhD problems can be solved by having read more papers.\n\nRemember, you don't have to read the whole thing like a novel.  Just read the Abstract, maybe the Intro, write down notes and questions and keywords along the margins, and skim the rest.  And after you've read 20-50 papers on one subtopic, draw yourself a little diagram showing how all the papers' research questions and contributions fit together.", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "90": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1471175844, "Score": 1, "Body": "Yeah, I totally agree coding on UNIX is far easier !\nI tried a lot of ultrabook before my Mac (bought and get rid of a Dell, Asus and MSI ultrabook).\nI did not want anything Apple related, but I finally tried it and I really really love it !", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "91": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1471176081, "Score": 1, "Body": "Just want to add : an i5 is better for the battery life, you may want to think about it.\nThe performance gap is not huge but the battery life really improves with an i5.\nIf you use R and matlab it does not scale extremely well with multiple cores (at least for R, I never used matlab but I heard it was the same).\n\nFrom the laptops I tried, I had a better experience with slightly less powerful ones because I value battery a lot. But an i7 will of course have better performances ! Just a matter of priorities :)", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "92": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1471179024, "Score": 1, "Body": "Well, you can specify the number of worker cores when you use R, but the scaling depends on how well the library you use handle multiple cores.\nI think with most mainstream library it's totally fine, I tend to use some library that are not well supported so it end up with bad multi core support.\n\nNever got to use matlab, I don't know how it differs from R, and what are it's perks. Like you, I use R because that's what I'm comfortable with even if it's not always the best tool for the job !", "Permalink": "https://www.reddit.com/by_id/t3_4xf2hs.json"}, "93": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1471192168, "Score": 2, "Body": "When my father died on Valentine's day... It took me a couple of months to really get back into doing research a lot. I was 4 yrs into my degree when this happened so I already had data, you just have to try and get something done.. anything so you don't lose steam. I would make a list on what I would get done that day and then do it. Then continue from there.", "Permalink": "https://www.reddit.com/by_id/t3_4xnw7k.json"}, "94": {"Subreddit": "PhD", "Author": "madamovaries", "Date": 1471198813, "Score": 2, "Body": "I'm sorry to hear that, that sounds really tough. So I suppose I should just try to do something, even if it's something small, every day.", "Permalink": "https://www.reddit.com/by_id/t3_4xnw7k.json"}, "95": {"Subreddit": "PhD", "Author": "hematita_rast", "Date": 1471199131, "Score": 1, "Body": "thanks for your advice, especially about the diagram. I am curious though, what was the topic of your PhD? ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "96": {"Subreddit": "PhD", "Author": "FreyjaVar", "Date": 1471200126, "Score": 1, "Body": "Yes try and do something even if it's small. It may help to set smaller weekly  goals so everything doesn't seem quite as overwhelming.", "Permalink": "https://www.reddit.com/by_id/t3_4xnw7k.json"}, "97": {"Subreddit": "PhD", "Author": "ariezee", "Date": 1471240134, "Score": 1, "Body": "Saw this at a fitness post. Might be relevant.\n\n\"Forget motivation.  It's a fickle and unreliable little state that isn't worth your time.\n\nBetter to cultivate DISCIPLINE than to rely on motivation. Force yourself to do things, to get out of bed, to go the gym, go to work harder and smarter; force yourself to do stuff when you don't feel like doing anything.  Go write.\n\nMotivation is fleeting, and it's easy to rely on because it requires no concentrated effort to get. Motivation comes to you, you don't even have to chase after it.\n\nDiscipline is reliable; motivation is momentary. The real question isn't how to keep yourself motivated, it's how to train yourself to work without it.\"\n\n#getmotivated #redditfitness\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4xnw7k.json"}, "98": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471275134, "Score": 1, "Body": "Usually if you spend a few months working in a lab doing research that is enough to ask the Prof for one, given that you had some mild or moderate interaction. The letters are usually due late November or December in the U.S. (not sure where you are applying) so that is enough time to do your best at work for 3 months before asking for one.", "Permalink": "https://www.reddit.com/by_id/t3_4xsy7k.json"}, "99": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1471278157, "Score": 3, "Body": "Don't forget to make time for yourself. A lot of people will say they work 50-60+ hours a week during their PhD, but that is totally unnecessary and you will wear yourself out quickly. Have a hobby, go out and do things with friends, anything you enjoy that isn't work related.\n\nAlso don't be afraid to ask questions! Something I struggle with is feeling like I'm bothering someone by asking them things, but most people are happy to help and it's generally better to ask than waste a lot of time and resources when you're completely new to something.", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "100": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1471279706, "Score": 2, "Body": "It's always best to sit down with your potential letter writers, and tell them your plans. Feel them out, do they feign fake enthusiasm, or do they seem to genuinely care about your success? Pick the letter writers who are most excited to speak about your research potential. Usually once you bring up the topic of PhD, your potential letter writers will give you a sense of whether or not they think you'd be a good fit. If they start giving you advice, or tell you that they think you have a potential for this sort of work, then that is a good sign, and that would be the time to make the ask (would you be interested in being one of my letter writers) and gauge their reaction.  \n\nOh and letters from Professors &gt; letters from people with PhDs &gt; letters from people in industry", "Permalink": "https://www.reddit.com/by_id/t3_4xsy7k.json"}, "101": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471316262, "Score": 9, "Body": "not normal where I am.", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "102": {"Subreddit": "PhD", "Author": "hematita_rast", "Date": 1471318294, "Score": 1, "Body": "yo thanks for the advice. How much time per week did you spend on PhD-work?", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "103": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1471320068, "Score": 2, "Body": "I'm still in the program, but about 40 hours per week. Some nights I'll send emails or work up some data that I didn't get to during the day and occasionally I'll go in for a few hours on the weekend, but generally I plan my days/week out so I can work from 9-5 ish and then go home and leave the work behind  for the night. ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "104": {"Subreddit": "PhD", "Author": "hematita_rast", "Date": 1471329051, "Score": 1, "Body": "yeah about 40 hours is what I hope/expect as well.", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "105": {"Subreddit": "PhD", "Author": "ghostsofaviation", "Date": 1471346332, "Score": 7, "Body": "...yeah...can you get a new supervisor? ", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "106": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1471349753, "Score": 4, "Body": "This doesn't sound on any level normal.  Is there any other information?  If you don't want to reveal the school, can you tell us some of the work required to complete the program?", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "107": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1471349859, "Score": 3, "Body": "Ph.D. is primarily about research.  You can do it for personal enrichment, but we have the Internet now if you want to learn more on your own?  Seems like a big investment for someone who doesn't seem to like the process.", "Permalink": "https://www.reddit.com/by_id/t3_4xy2x3.json"}, "108": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471354455, "Score": 1, "Body": "A STEM field.  Afraid I can't say more :-/  ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "109": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1471355536, "Score": 4, "Body": "1) Document everything. Write it all down, keep a journal with a log and dates and times and so on print any emails that you get from him that could raise eyebrows. It may be helpful in the future. \n2) Most institutions have someone you can go to, to talk about your supervisor in case the relationship breaks down. It might be your co-supervisor, or your supervisors boss, or a counseling service or something. Have a gentle chat, raise your concerns, but be nice and factual. \n\nAnd be open to things changing. My supervisor and I got off to a rocky start, but things worked out and now we're actually friends. \n\nGood luck! ", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "110": {"Subreddit": "PhD", "Author": "nellasbean", "Date": 1471363961, "Score": 1, "Body": "Had a similar situation a few years ago as a technician. One of the grad students in the lab ended up speaking with her former PI about it, who had some connections to other faculty in the department. The PI told them and the other faculty had a group sit down with the PI who was being ridiculous.\n\n...it honestly didn't change much. Everyone who was in the lab, except the grad student who said something, has quit and moved on. One grad student changed advisors despite being a year and a half into the program. Another dropped out altogether. Myself and the other tech became technicians in other labs at a different institution.\n\nDon't waste your life in a shitty situation, it isn't worth it. Try and fix it or move on.", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "111": {"Subreddit": "PhD", "Author": "sharkbaitohhaahaa", "Date": 1471364191, "Score": 1, "Body": "Not normal\n\nI never talked to my supervisors students prior to starting as I worked a few summers for him. \n\nLong story short, I had to get a new supervisor\n\nWhoever said document everything was right. I did this and had to end up going to HR. It worked out in my favor, though it was tough\n\nI hope your experience is better than mine. Also, if he threatens you or anything write that shit down or screenshot it or whatever. Save everything. Threats are straight up bullying and most institutions have rules against that.", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "112": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1471366762, "Score": 1, "Body": "Thank you for your reply. We ended it. He looked terrified when he said 'I can't go back to the stress of having a relationship'. Ouch. It hurt. My brain understands it isn't my fault, but heart hasn't caught up. Your reply has made it a lot easier though, so thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "113": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1471366820, "Score": 1, "Body": "Thank you for sharing. We ended it. Reading about other PhD experiences has been very helpful for overcoming the emotional drain. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "114": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471369997, "Score": 2, "Body": "Well, I'm sorry to hear that and I hope the best for you.\n\nSomeone once told me that at MIT, in the department of my major discipline, only 1 of the professors there (out of several dozen) was married. This is probably not a coincidence. It's something to keep in mind if/when you go through periods of wondering if the breakup was your fault - i.e., it probably wasn't.", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "115": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471376443, "Score": 2, "Body": "With a Ph.D., most of your learning is independent (on your own) anyways - you usually take as much or less coursework compared to a masters degree.", "Permalink": "https://www.reddit.com/by_id/t3_4xy2x3.json"}, "116": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1471384462, "Score": 2, "Body": "Thanks everyone. So far he has been fine with me, but I have concerns moving forward. I am looking into transferring into another field, as the entire department is kind of the same as him and some of the issues the students have are department-wide. I didn't really get into this hoping to improve this department, so I don't want this to waste my time or distract me.", "Permalink": "https://www.reddit.com/by_id/t3_4xxcw6.json"}, "117": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1471388691, "Score": 1, "Body": "Just remember that in order to *get* the PhD you need to deliver a novel contribution to the field, explain that contribution in detail, and (depending on the institution) defend it in an oral exam.  If you think you can do that then go for it. There is no strict obligation to go through peer review and get published.", "Permalink": "https://www.reddit.com/by_id/t3_4xy2x3.json"}, "118": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1471398603, "Score": 3, "Body": "When I was researching and applying for programs, I got the impression you were applying for a specific advisor that would be interested in your research and career goals. I didn't have any publications either when I applied and that was never even mentioned by the admitting committee when they discussed my application. \n\nBut, I don't know if that's different for your field. Publishing is more important during and after your PhD, and I think conferences are more of a networking tool than a requirement for admission. \n\nSo, don't worry about it? Do make sure you connect personally with the advisor you'd have in whatever program you're applying to. If they never spoke with you before you applied, they're probably not going to hire you. Likewise, if you don't like them (a situation I am currently in), or don't get along with their other graduate students, then you've got a very long and difficult road ahead.", "Permalink": "https://www.reddit.com/by_id/t3_4y312k.json"}, "119": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1471401599, "Score": 2, "Body": "If your grades and test scores are good you'll be fine. Many come straight from undergrad, many have no research or teaching experience. Your experience is middling, not poor.", "Permalink": "https://www.reddit.com/by_id/t3_4y312k.json"}, "120": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1471405632, "Score": 1, "Body": "Can you present anywhere (local conferences) before application season? That might help a little. ", "Permalink": "https://www.reddit.com/by_id/t3_4y312k.json"}, "121": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471465496, "Score": 2, "Body": "I think you'll be fine in getting admitted, but know - and know well - the uphill battle you face trying to become a professor of psychology.", "Permalink": "https://www.reddit.com/by_id/t3_4y312k.json"}, "122": {"Subreddit": "PhD", "Author": "niffin88", "Date": 1471469596, "Score": 1, "Body": "Make time for friends and activities outside of your program so you can maintain some perspective. \nWork efficiently/smart — killing yourself working 15-hour days isn't helpful or sustainable, so figure out your goals and priorities so you can allocate your time/energy wisely. \nThink seriously about how you're going to fund yourself for the length of the program so you can budget accordingly and minimize financial stressors.\nAnd have fun! ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "123": {"Subreddit": "PhD", "Author": "coolchameleon", "Date": 1471470088, "Score": 1, "Body": "I honestly can't - i am out of my education and have 0 spare time (2 jobs)", "Permalink": "https://www.reddit.com/by_id/t3_4y312k.json"}, "124": {"Subreddit": "PhD", "Author": "mowertier", "Date": 1471478837, "Score": 10, "Body": "The catch is that you have to work for it. You teach, conduct research, or do some other kind of work for the university/department to pay your way.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "125": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1471481511, "Score": 7, "Body": "I not only didn't pay for a phd, but I made decent money during it: 40k a year tax free. It depends on the program, school, country, and your individual successes. \n\nBtw: social sciences; Canada", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "126": {"Subreddit": "PhD", "Author": "Dixzon", "Date": 1471481764, "Score": 4, "Body": "Usually you will have to either be a TA, or get funding for your research in order to get the stipend, but no catches besides that. I got my doctorate last year and made about $24,000 a year in the process, and I never have to pay any tuition ever. ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "127": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471485843, "Score": 12, "Body": "As mowertier pointed out, the catch is that getting a PhD is a job. Many of us left much higher earning jobs to pursue a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "128": {"Subreddit": "PhD", "Author": "nemesis18082", "Date": 1471488404, "Score": 8, "Body": "In engineering (and maybe other stem field), it's unheard of paying for a PhDs. Most programs won't accept or let you stay in if you're not making progress worth funding. Granted, most engineering PhDs also give up a $50-70k salary that they could get with a BS where as a PhD living spend is generally $20-30k.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "129": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1471499781, "Score": 7, "Body": "Typically in STEM (science technology, engineering, and math) a PhD is funded. This means you get your tuition paid for, health care, and a stipend. This comes either from the department in which you do your PhD  (in exchange for you being a TA for a class) or it comes from your thesis advisor (I'm exchange for doing research.) In most STEM fields, classes are a minor part of a PhD. You take classes for 1 - 1.5 years, and the rest of the time is spent on your research. Your research becomes a full-time job (for many of us, it was upwards of 60 hours a week spent in the lab).\n\n\nSo yes. It is paid for, but you get very little money (~30k, but really depends on your institution) for the work you do. On the plus side, you get a degree at the end.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "130": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1471505683, "Score": 2, "Body": "Your stipend will depend on your field/department. I've seen as low as $12K a year in the US (with tuition and health care remission). But ~$20K+ is more common. If you're doing anything in STEM/research-related, you should never have to pay for a PhD. Humanities are often a different story though. ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "131": {"Subreddit": "PhD", "Author": "el_matt", "Date": 1471514633, "Score": 6, "Body": "This is the norm for most science PhDs (and many others, I'm sure) in the UK. The leader of the group that took me on as a student allocated enough funding to pay for my \"tuition\" (a nominal fee since most PhDs funded this way are research based) and a stipend. I was paid around £13,000 ($17000) untaxed and didn't have to spend any money out to the university. There were also opportunities to earn extra cash by being a demonstrator (kind of like a TA, I think) which was about 4-8 hours a week at £15 per hour.\n\nI think this only works because most science PhDs in the UK are untaught- that is to say we don't usually go to more than a few lectures per year and spend the rest of the time working in the lab. We also typically get everything done and dusted in 3 or 4 years, rather than the 5-7 which is standard elsewhere.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "132": {"Subreddit": "PhD", "Author": "KleineKeizer", "Date": 1471523060, "Score": 3, "Body": "In the Netherlands, PhD is a job. You get a fair wage.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "133": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1471529464, "Score": 2, "Body": "Yes, programs held by reputable universities offer tuition waiver, health insurance and a stipend in exchange for working x number of hours a week.\n\nBut, it's not \"free\". There's opportunity cost. If you're good enough to get into a top program (and top programs have better funding), then you're probably good enough to get a higher paying job. So that would be 5 years of making sub-optimal earnings (depending on the field, you might still be making less after the PhD -- those who are deadset on staying in academia and can't land a tenure track position). \n\nSo you have to make sure that you actually want/need that PhD and that you love doing research.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "134": {"Subreddit": "PhD", "Author": "MasterHorse", "Date": 1471537578, "Score": 2, "Body": "One should NEVER pay for a PhD.  The title does not carry much weight in this society to actually pay for it -- PhD is just a means to train you to do research and teach.  With that said, it is crucial that you look for a program where funding (stipend and tuition) is secured.  You do not want to be in a position where you are always looking for funding since this will adversely impact the way you perform in research and teaching.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "135": {"Subreddit": "PhD", "Author": "bluechemist", "Date": 1471544577, "Score": 2, "Body": "You can do a PhD in a company too though. I don't know if it's common in the US but here in Europe, it is quite common. ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "136": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471545305, "Score": 2, "Body": "OP, have you looked into what is required of the student, to get a PhD?  It's nothing like being in school or like taking college classes.  It's a high-pressure job, where you manage your own time, and negotiate politics and pet projects between powerful professors to achieve the committee support (e.g., signatures) and funding necessary to make progress in your research and toward your degree.  Non-profit research is a massive worldwide industry cycling billions of dollars per year, and a doctoral researcher is a cog in the wheel to helping their advisor control an ever-larger share of that funding.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "137": {"Subreddit": "PhD", "Author": "MasterHorse", "Date": 1471547998, "Score": 1, "Body": "I guess I should clarify: A typical student who comes straight out of college with debt should NEVER pay for a PhD.  There just isn't much return on investment since there's an opportunity associated with it.  I'm all for chasing your passion, but one should be pragmatic.\n\nedit: deleted unnecessary \"you\"", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "138": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471550187, "Score": 0, "Body": "No problem: if you want, you can absolutely do this.\n\n&gt; I've been doing a lot of independent reading / research\n\n*This is key*: reading a large amount of literature in your topic, before you start applying for PhD positions.  Personally, I recommend that people read 500 papers before applying, and another 500 papers while working on the PhD.  I'm sure you already know this, but you don't read them like a novel; you read the Abstract and Introduction, and skim through the rest, taking notes as you go.\n\nHonestly, that should just about do it.  Afterwards, write some emails reaching out to professors whose work you respect from the massive batch of papers you've just read.  You could go to a few conferences, too, to meet and chat with people in person.  Have questions prepared about their work, like, \"I saw your journal article on X, and noticed that you used Y technique.  But what about Z technique, that Smith et al just published?  It would eliminate problem P that technique Y suffers from.\"  As you get chatting with them, mention you'd like to do further work on this topic, and see where the conversation goes from there.\n\nIf you and them reach an agreement about you joining their lab as a doctoral researcher, then there will be a formal application stage, but that's mostly just paperwork shuffling.", "Permalink": "https://www.reddit.com/by_id/t3_4ydxb8.json"}, "139": {"Subreddit": "PhD", "Author": "GoodGuyGlocker", "Date": 1471553454, "Score": 1, "Body": "No, I don't know much about it and would love any further insights you or r/phd can offer. I am not asking for myself but for my son, who is a rising undergrad junior at a tier 1 research university.\n\nI have personally spent a career in STEM and what you describe sounds typical of my field and probably most professional fields, where participants are required to sell ideas, win endorsements, secure funds and navigate organizational politics and personal egos.  I shouldn't be surprised that those things are required of PhD candidates and they really are good skills for a young person to hone.\n\nIf you have some specific personal experiences or lessons learned (horror stories?) that you can share, I'd love get an unvarnished picture of life as a full time PhD student.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "140": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471554720, "Score": 1, "Body": "/r/GradSchool has many PhD's, and it's more active than /r/PhD, so I'd recommend scrolling through the posts over there.  \n\nBy the way, I wouldn't push your son towards a PhD more than making him aware of the option.  PhD students can and do commit suicide from the stress, and that's not something you want any responsibility for.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "141": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1471555437, "Score": 2, "Body": "I'm so sorry!  I wish you both the best luck in moving on with your lives.  Leaving a relationship because of PhD stress is a very heavy thing, and I encourage you to take time to recover and find peace before embarking on your next relationship.", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "142": {"Subreddit": "PhD", "Author": "bellcrank", "Date": 1471564381, "Score": 2, "Body": "It's called an assistantship in most places.  The stipend isn't a lot, but you typically don't pay social security tax on it, which helps a little.  Tuition is waived and health insurance is provided so long as the assistantship meets a minimum percentage of FTE employment.  Where I work it's 33.3%, with a maximum of 50%.\n\nIt's the most common rout students take in my institution to do a PhD.  It can be surprising to learn that this is offered if you don't have experience with STEM grad school, but it's how it has worked for some time.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "143": {"Subreddit": "PhD", "Author": "GoodGuyGlocker", "Date": 1471567598, "Score": 1, "Body": "I was very surprised to learn about it. I'm familiar with expensive STEM grad school classes taken part time and aware of the high cost of medical and law school, so this seems bizarre.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "144": {"Subreddit": "PhD", "Author": "bellcrank", "Date": 1471572211, "Score": 2, "Body": "It's a byproduct of grant funding.  I write grant proposals and put students into the labor cost.  A lot of grant agencies see students as a plus because the project would be used to bring up the next generation of scientists.  The universities are happy because the tuition costs are covered directly by the grant, so they don't lose out on the waiver.  This sort of arrangement is not typical where there aren't funded science projects to draw from, so you don't often see them in the humanities or professional degrees.  ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "145": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471582889, "Score": 3, "Body": "You are basically advising to educate oneself to the level of a 3rd year PhD student. Good luck with that!", "Permalink": "https://www.reddit.com/by_id/t3_4ydxb8.json"}, "146": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1471607888, "Score": 7, "Body": "À 12 pager?  First time 10 minutes. Then reread=30 minutes underlining and adding notes. ", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "147": {"Subreddit": "PhD", "Author": "LadyStreetTheFirst", "Date": 1471609125, "Score": 6, "Body": "When I first started my PhD it would take me a couple days to a week maybe to read and fully understand a paper. But that's cause I moved from chemistry to geochemistry so there was a lot of background I had to learn. Now I just skim what I need to know or I'm looking for. Usually starting with conclusions then moving to the section that will explain the conclusion I'm after to greater detail. If you're struggling now, don't worry it will get easier ! 😊", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "148": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1471611412, "Score": 2, "Body": "Not sure why you're being downvoted. Same as you, if I'm reading it for general information (i.e. a paper in the field but not *exactly* on my research topic), around 1 minute a page. If there's info I want to remember and/or cite later, then closer to 4-5 minutes a page for a second reading.\n\nIt really depends on the paper though. You sometimes have super dense papers with quite a lot of (badly-explained) equations, and at the other side of the spectrum some people just can't seem to get to the point.", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "149": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1471617021, "Score": 1, "Body": "My process: read abstract, read intro, look at figures and read figure captions, read conclusions. Generally takes 20 minutes a paper.", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "150": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471620761, "Score": 1, "Body": "Nothing stopping your partner from a) looking for H1B visa and b) working for cash", "Permalink": "https://www.reddit.com/by_id/t3_4yhklf.json"}, "151": {"Subreddit": "PhD", "Author": "cheezburgapocalypse", "Date": 1471621387, "Score": 2, "Body": "Ditto. I am on control engineering, so aside from implementation I read a lot of maths paper. I can finish some papers within 20 mins in the first read, but sometimes it takes me half an hour and a serious headache to understand an equation or lemma.", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "152": {"Subreddit": "PhD", "Author": "bellcrank", "Date": 1471624669, "Score": 4, "Body": "Depends on the paper and the purpose of reading it.", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "153": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1471633910, "Score": 2, "Body": "Read abstract; cite. 2-3 mins. ", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "154": {"Subreddit": "PhD", "Author": "DisgruntledGradStude", "Date": 1471634298, "Score": 1, "Body": "There, there grad student.  Don't worry about this shit man.\n\nI'm pretty sure this is a common occurrence in grad school... same thing kinda happened to me: neither adviser knew anything about the project I was doing (it was in between both of their specialties, so they figured that if they collaborated that they would know about it... absolutely not).  They also have \"collaborators\" who work on things totally different.  Basically, I've driven the entire project ever since they changed directions for the 3rd time... it's all a bunch of useless and, in the grand scheme of things, meaningless things that will probably get cited once or twice if i'm lucky.  I'm already planning my exit.  As soon as I get a job offer, I am gone!  I can't deal with people who act like they know everything to keep up the farce of intelligence just to impress others.  On top of that, my advisers are hard to work with due to their personalities\n\nHopefully things work out for you! \n\nGood luck, and there, there.\n\nP.S. Get a job and never look back at academia again(!)", "Permalink": "https://www.reddit.com/by_id/t3_4xmaty.json"}, "155": {"Subreddit": "PhD", "Author": "DisgruntledGradStude", "Date": 1471638974, "Score": 1, "Body": "If you really want a PhD, stay with a PhD in CS... the job market is much more friendly to CS degrees than mathematics PhDs.  \n\nBut, if you want to be a professor, then it doesn't matter which major you major in (just know that those jobs are sparse).", "Permalink": "https://www.reddit.com/by_id/t3_4waylm.json"}, "156": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471652679, "Score": 4, "Body": "nothing to do with PhD... I would not mention your PhD program.", "Permalink": "https://www.reddit.com/by_id/t3_4ylnp0.json"}, "157": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1471656653, "Score": 3, "Body": "\"family reasons\"", "Permalink": "https://www.reddit.com/by_id/t3_4ylnp0.json"}, "158": {"Subreddit": "PhD", "Author": "cola_twist", "Date": 1471657138, "Score": 2, "Body": "It depends on the paper and what I am looking for. If it is a basic report of findings in an area I am very familiar with, maybe 20 to 60 min. If I am trying to pick up on a new area and it is a leading and very highly cited article, maybe two or three weeks with endless re-reads, notes, and looking to citing articles to check on definitions and concepts. ", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "159": {"Subreddit": "PhD", "Author": "goldenspirals", "Date": 1471657772, "Score": 1, "Body": "Working for cash is not exactly a viable solution when their partner may also be trying to gain career-relevant experience.", "Permalink": "https://www.reddit.com/by_id/t3_4yhklf.json"}, "160": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471657888, "Score": 1, "Body": "H1b. option c) go back to Canada", "Permalink": "https://www.reddit.com/by_id/t3_4yhklf.json"}, "161": {"Subreddit": "PhD", "Author": "nomdeprune", "Date": 1471659574, "Score": 7, "Body": "I feel your pain. Two years into my phd I walked past a bookshop on my way into uni and saw a book in the window on my topic. I dealt with it by going through the book in detail, finding the few aspects I disagreed with and then spelling out the differences between my work and the book. I was lucky to have the time to do it, and I ended up with a better thesis. Good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_4ymm7n.json"}, "162": {"Subreddit": "PhD", "Author": "chemkidao", "Date": 1471665222, "Score": 1, "Body": "In Canada you can expect 4 years of funding, which means benefits (dental/health/eye), free tuition, and around $1100 a month for living. This was at a Faculty of Education. You will also have duties/work as part of the deal, which is either a RA (grunt work for a prof such as transcription), TA (marking, some teaching) or teaching (usually 2 sections per semester). If you go beyond the 4 years you have to pay around $2400 a semester. If you have your thesis handed in but have to defend in the following semester, you don't have to pay.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "163": {"Subreddit": "PhD", "Author": "chemkidao", "Date": 1471665730, "Score": 1, "Body": "Since no one has talked about supervisors I will. My advice is to be careful who you pick as your supervisor. A newer prof will be more involved in the latest research, is actively publishing, and grant writing, whereas an older prof is likely to not be actively doing much, but will know a ton of people, have more time for you, and likely will be generally more knowledgeable than younger/burned out profs. With a new prof its easy to piggyback on their research or research group, but the older profs have their virtues, especially since they are established, with tenure, and will have more contacts. They may even be a better judge of your abilities, since if they are nearing retirement they are unlikely to take on a graduate student unless they think you're worth it, whereas younger profs might be doing it for points or were compelled by the Dean to supervise students. It doesn't take long to find out which profs are commendable and which are not. Who your supervisor is will matter for your later job hunting, another reason to pick a veteran prof.", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "164": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1471666581, "Score": 6, "Body": "Tough one but you need to cite it. I'm sure there are some differences, no? Just emphasize these and you're all good.\n\nIt's just a dissertation, remember that. A handful of people will ever read it...", "Permalink": "https://www.reddit.com/by_id/t3_4ymm7n.json"}, "165": {"Subreddit": "PhD", "Author": "Ohhhlala9", "Date": 1471672817, "Score": 1, "Body": "Depends on the program, but I'm doing my PhD in art history in the states and I am fully funded; I do have to TA/RA for my first two years while I take courses but my stipend starts at 25K a year for five years plus you are typically able to get grants to add to that. But in the humanities at least it is super competitive because there are so few spaces (they only accepted two of us this year). ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "166": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1471687110, "Score": 2, "Body": "Cite it. Perhaps add a footnote explaining what happened and stating how scientific production shifts and how now we have to deal not only with published papers, unpublished preprints, but also blog posts and twitter timelines.\n\nAt the same time, talk about it to your advisor. Don't worry, it's going to be ok !", "Permalink": "https://www.reddit.com/by_id/t3_4ymm7n.json"}, "167": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1471706716, "Score": 1, "Body": "Try this http://pomodorotechnique.com/. . Works for me. ", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "168": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471711488, "Score": 3, "Body": "Somewhat of a generalization, but this is how I would sum up my experience reading papers throughout my PhD.\n\nYear 1 of PhD: 5-8 hours to understand &gt;80% of content\n\nYear 2 of PhD: 4-6 hours to understand &gt;80% of content\n\nYear 3 of PhD: 2-3 hours to understand &gt;80% of content\n\nYear 4 of PhD: ~1-1.5 hours to understand &gt;80% of content\n\nHowever, like many others stated, there comes a point where you know what you are looking for and you know where to find it. I don't usually spend &gt;30 mins on a paper unless I'm having a discussion on it or I'm reviewing it. It only takes me 4-5 hours to peer review a paper (thoroughly read, give comments), which I do regularly for a few journals - this is less time than it took me to read it in my first year of my PhD.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "169": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1471714827, "Score": 3, "Body": "Lie. Call in sick that day.", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "170": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1471719726, "Score": 1, "Body": "I already have an undergrad in Computer Engineering and a Master's in Computer Science so I'm covered on the 'job market' front.  Most of my studies were focused on industry.  I also have ~8 years industry experience, 3 of it in embedded real-time development and then the other 5 in web application development.  \n\nMy choice of PhD is for future teaching.  Someone gave me some advice at my school to do a PhD in Computer Science with a 'dual' advisor scenario where there was a mix of CS algorithms linked in trying to solve/prove research projects in Mathematics.  \n\nStill not sure what I'm going to do, but at least I have a ton to think about and figure out.  Thanks for your input!", "Permalink": "https://www.reddit.com/by_id/t3_4waylm.json"}, "171": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1471729780, "Score": 3, "Body": "Financial difficulties = just keep your plans to yourself. When companies have financial difficulties, they layoff their employees.", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "172": {"Subreddit": "PhD", "Author": "Jrg315", "Date": 1471732999, "Score": 3, "Body": "You have nothing to disclose, just some ideas that have no existence outside of your mind. From what you described, you haven't written a research proposal, you haven't reached out to a potential advisor, you haven't been invited to apply by that potential advisor, you haven't formally applied for a program, you haven't been given an offer of admission, you haven't secured funding, and you haven't registered as a student. In other words, there are a lot of steps between where you are now and starting a PhD, so there's really nothing for you to disclose. I say don't worry about it!", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "173": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1471743391, "Score": 1, "Body": "Don't ever reveal your study plans while you are still applying for jobs. Nobody wants to hire you if they know you are gonna leave soon. Just stick with the generic result and then when time comes just take a day off. Only reveal your plans when you are about to quit. ", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "174": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1471744524, "Score": 1, "Body": "thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "175": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1471750083, "Score": 1, "Body": "a quick question, is funding from the deparment, the school, or the PI?", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "176": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1471773423, "Score": 1, "Body": "forgive me here, as I dont know the american phd system. In the UK at least (or my uni) I had to apply with with a topic in mind, not just an area. I suppose narrow it down to the sub areas you are interested in. and think of some questions, Think of some ways you can tweak work that has already been done involving different populations, areas, materials, and so forth. I dont really know your area, but I work in the sciences, and some of my studies are replication studies and others and novel but they al go together to build a coherent story. You're doing a PhD you're not expected to make any amazing new brilliant studies (bonus points if you do), you're adding slightly to the knowledge of the world and building your skill set as you do. Think of studies that will also allow you to pick up knew skills, (coding, if you dont already.. and so on). again, sorry if not very relevant. Just speaking from my side of the experience. But again, I applied with a topic in mind. Also, expect your topic to chance and morph as your PhD goes on, mine has changed significantly from the proposal I applied with.", "Permalink": "https://www.reddit.com/by_id/t3_4yu2gm.json"}, "177": {"Subreddit": "PhD", "Author": "NewPhDGuy", "Date": 1471777397, "Score": 1, "Body": "Thanks! I knew what field I wanted to do research in, just hadn't narrowed down to a specific topic.  I think that my perception of how to do research, and what it entailed was really misunderstood.  I thought that i could approach it as a research project one does for an MS or BS class, only more intense.  The part that I am missing is the \"quantifiable data\" part to support my findings.  While I have a lot of experience in my field, I do not have a lot of experience in research.  \n\nI appreciate your \"pick up a new skill\" comment. I will keep that in mind as I move forward.  Keep the advice coming!\n", "Permalink": "https://www.reddit.com/by_id/t3_4yu2gm.json"}, "178": {"Subreddit": "PhD", "Author": "iamthekmai", "Date": 1471795971, "Score": 2, "Body": "Well workers don't have that many rights here but I know if I asked two weeks in advance I can take vacation days off. I could say anything I wanted e.g family is in town, friend is graduating, etc. Or nothing at all and I usually didn't have a problem getting that day off. ", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "179": {"Subreddit": "PhD", "Author": "forams_galorams", "Date": 1471801163, "Score": 2, "Body": "As an undergrad striving to disseminate papers more effectively (I really struggle with the dense language, takes me a few days to get to grips with one on subject areas I think I'm solid on), what would you all say are the best methods for improving this skill? Did you start by taking notes? Or focusing on certain sections? \n\nI currently try just powering through the whole thing in order, looking up unfamiliar concepts I feel are integral as I go along, but it's a real labour and someone recently pointed out to me I can pick and choose which bits to read. That just feels wrong, I've always been the sort of person who wants the fullest understanding of what's put in front of me. I guess there must be something to cherry picking sections though, I'm never going to be an expert on everything. ", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "180": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1471885970, "Score": 2, "Body": "If you recently have been accepted into the PhD program, then I'm not sure how you are ready to choose a topic for a dissertation.  How many papers have you published?  If you have 0 papers under your belt, then I would work with the grad students in your field who are publishing papers and help them.  The first few years of a PhD student is mostly reading, reading, reading, and some publishing.  Until you are intimately familiar with the broad subject of your area and the depth of some part of your subject, you aren't prepared for dissertation (in my opinion).  \n\nEdited:\nNow that being said, that doesn't mean you can't have an interest area.  Study your interest area, understand where they have gone, see if you can look at it differently.  Try out of the box thinking!  Remember, failures are only failures if you didn't learn from them.  For example, I have a huge interest and love for applied and computational mathematics.  But I am a computer science graduate student.  Finding a healthy mix of both areas to complete a PhD has been fun.  I'm getting close to an area and a topic for my dissertation but haven't yet finalized that.", "Permalink": "https://www.reddit.com/by_id/t3_4yu2gm.json"}, "181": {"Subreddit": "PhD", "Author": "bmckune", "Date": 1471886774, "Score": 1, "Body": "I agree with ShadowHunter on this one.  You want them to be a 2nd year PhD student before applying.  In a world where one does absolutely nothing and has the fortitude and attention span of a saint, you could do this.  \n\nMy suggestion, if you can go straight to graduate school then attempt a Master's in this area.  If during it you find you love it and want to teach and continue research, you can always transfer into the PhD program.  ", "Permalink": "https://www.reddit.com/by_id/t3_4ydxb8.json"}, "182": {"Subreddit": "PhD", "Author": "NewPhDGuy", "Date": 1471907915, "Score": 1, "Body": "Recently may be a stretch, it's been over a year at this point.  I already have a masters in the subject and have been working in the the field for over 15 years. I know the subject matter intimately.  \n\nI think that maybe my problem is that I have too much practical knowledge and it is getting in the way of any creativity. ", "Permalink": "https://www.reddit.com/by_id/t3_4yu2gm.json"}, "183": {"Subreddit": "PhD", "Author": "Srapher", "Date": 1471912534, "Score": 1, "Body": "Having done this myself, the pace is certainly different. At least to begin with. You now have the space to pursue your own, focused mastery. Enjoy it.", "Permalink": "https://www.reddit.com/by_id/t3_4xj8qj.json"}, "184": {"Subreddit": "PhD", "Author": "Srapher", "Date": 1471913207, "Score": 1, "Body": "Been using the Nexus for just over 2 years now. It's become my academic lifeline. Managing notes, reading, docs, e-mails and music is fine. I switch between the tablet and laptop pretty easily.\n\nHighly recommend if you have a long commute to carry on that idea you just had as you were getting on the bus.", "Permalink": "https://www.reddit.com/by_id/t3_4tqv4x.json"}, "185": {"Subreddit": "PhD", "Author": "Jrg315", "Date": 1471950881, "Score": 2, "Body": "Just take a vacation day. And if they ask why you need that day off, say you have some personal errands that can only be taken care of on that day or you have an appointment that can't be rescheduled (all of which is true). If you're not entitled to a day off, take a sick day.", "Permalink": "https://www.reddit.com/by_id/t3_4yq51m.json"}, "186": {"Subreddit": "PhD", "Author": "josistats", "Date": 1471993974, "Score": 3, "Body": "Take the test anyway? ", "Permalink": "https://www.reddit.com/by_id/t3_4z6sdf.json"}, "187": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1472006685, "Score": 2, "Body": "You can do it!", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "188": {"Subreddit": "PhD", "Author": "futureroboticist", "Date": 1472028524, "Score": 1, "Body": "How much stipend do PhD students get? I'm ssuming you are talking about the USA.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "189": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1472043734, "Score": 1, "Body": "Yes, in the US. The stipend really depends on the school and department. It is generally between 25-33k a year (but you get free health, vision and dental insurance). Another thread on this subreddit was about a website that keeps track of stipends across schools and departments.", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "190": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1472044697, "Score": 1, "Body": "I've only skimmed and ctrl-f the post (sorry but it's quite long) and couldn't find any mention of you taking meds. Do you go with your ADHD untreated? I'm an adult too and am receiving meds, which have vastly contributed to me being able to work and do my PhD. I have no problem (or much much less problems than before) concentrating when other people are around if I'm well-rested, etc.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4z6sdf.json"}, "191": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1472070479, "Score": 1, "Body": "I would argue that as a blog post that hasn't been peer-reviewed the 2014 publication doesn't nearly reach the level of academic rigor that your thesis reaches.\n\nAs others have said, don't ignore its existence, but you should be fine if you include and discuss it.", "Permalink": "https://www.reddit.com/by_id/t3_4ymm7n.json"}, "192": {"Subreddit": "PhD", "Author": "cisforcaffeinated", "Date": 1472126177, "Score": 5, "Body": "Leave. Do as much research as you can, get recommendations from professors/PI's you already know, and do your PhD elsewhere. Personal experience. It looks a little funny if you do undergrad and post-grad work at the same place unless your field literally exists nowhere else.", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "193": {"Subreddit": "PhD", "Author": "lacanimalistic", "Date": 1472129966, "Score": 1, "Body": "I remember one of my lecturers saying when he was applying for funding from the Irish Research Council, the only thing they really pressed him on, rather than the content, was that he was doing his PhD in the same place as his undergraduate. I think he still got the funding, and he's now teaching permanently there, but still it does illustrate your point.\n\nThe thing is of the two people I know of that have written on or are writing on more or less exactly the area I want to research (mysticism/negative theology [and the intersections thereof with poststructuralist theory] in relation to Virginia Woolf), one is a lecturer in a Anglican training college [i.e. absolutely nothing to with literature going on there at all], and the other (who I've met at a conference and who's work looks amazing) is still a research fellow.\n\nI feel like I could be grand enough with a supervisor familiar enough with Woolf studies and the theoretical end of things, but at this point I feel like I'm out of my depth trying to find a suitable supervisor and department (where I could get funding) beyond my own.\n\nI'm starting a 1-year taught masters now, so I have some time, but only some.", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "194": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472146744, "Score": 3, "Body": "You don't necessarily have to rely on a single department that fits every need. You could find a place that has resources in your various subfields throughout the university and work with professors in different departments. Plus (at least this is my experience) you may have a fair amount of latitude in choosing your dissertation committee. So forge those relationships with the lecturer and fellow, even if you don't wind up where they are, and they can still guide your research when the time comes.", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "195": {"Subreddit": "PhD", "Author": "Lady_Pug", "Date": 1472146761, "Score": 2, "Body": "I did my undergrad and PhD at the same university and although I agree with all the comments above, the best advice I could give a potential PhD is to choose your supervisor carefully. I think it's better to know them, know how they work and their supervision style. This has such a great impact on both the quality of your research and your experience completing your PhD. Even though I knew lots of the academics I ended up choosing a supervisor who I didn't actually know and I got unlucky. I learnt way too late that my supervisor's style was not suited to my own which led to many problems. If you know the academics then you're in a better position to make a good call. ", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "196": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472147058, "Score": 1, "Body": "Yes, you can do it! I have to constantly remind myself that dissertation proposals are just provisional, and they're not nearly as worthy of my perfectionism and overthinking as I imagine. Just bang it out! All you gotta do is show them that you have a concrete enough sense of how the project is going to take shape that you'll be able to start your research with some direction. If it's not up to par, then someone will definitely let you know, and then you'll have their feedback to go forward!", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "197": {"Subreddit": "PhD", "Author": "lacanimalistic", "Date": 1472147675, "Score": 1, "Body": "See it's this bit which would be a pull-factor for me for staying. I have a fair idea who in the department I would and wouldn't work well under. (eg. I had a great supervisor for my undergrad dissertation who suited my style and I got on well with, and was actually the one who suggested after looking at my work that this would be a viable area for doctoral research, which was reassuring as the idea had already crossed my mind)", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "198": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472147676, "Score": 1, "Body": "If you haven't already, try having a frank conversation with your advisor about how specific you need to be, and for what purpose you need to choose it right now. Is there something official you'll have to submit soon, or does he or she just want you to be able to tailor your course enrollments/term paper topics in anticipation of it? \n\nMaybe your practical experience can serve as a source of inspiration unto itself? Have you encountered anything that hasn't worked well, or has begged further questions, etc?", "Permalink": "https://www.reddit.com/by_id/t3_4yu2gm.json"}, "199": {"Subreddit": "PhD", "Author": "lacanimalistic", "Date": 1472148096, "Score": 1, "Body": "[Also, I don't know if this is a relevant factor but I'm also going into my masters in the university I was in for undergrad]", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "200": {"Subreddit": "PhD", "Author": "Criibon", "Date": 1472150387, "Score": 1, "Body": "Formulate a one minute, five minute, 20 minute and 1 hour speech that explains your project/research. It will help you understand what you are doing, will help you think on your feet and introduce your \nself at conferences and also spare you from a bored gaze when people ask what you are studying and you get lost in details (might just be me). \n\nAlso, don't be shy and don't sell your self short. Make connections everywhere. Speak to the big names at conferences, they have been new researchers aswell. Follow up connections you have made, for example via email. There are more subtle structures in academia then you would think. \n\nAnd breath. This is just what you do, it is not what you are. ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "201": {"Subreddit": "PhD", "Author": "Criibon", "Date": 1472150569, "Score": 1, "Body": "As a phd-student with caviar taste, I really wouldn't want anything practical. I would love something pretty that I wouldn't buy for my self, or, as have been pointed out, a massage or spa visit. ", "Permalink": "https://www.reddit.com/by_id/t3_4xbvv1.json"}, "202": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1472157869, "Score": 1, "Body": "Have you reached out to people you may want to work with? You could try collaborating with researchers that need someone like you. I don't know if it would lead to any paid work but if you're just itching for some more research experience, that's where I'd start. I'm sure you can find someone working on something you're interested in that could make use of your skills, just tell them what you want out of it too. ", "Permalink": "https://www.reddit.com/by_id/t3_4zgc90.json"}, "203": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1472157937, "Score": 1, "Body": "Every time you accomplish a new goal, take a shot of tequila! ", "Permalink": "https://www.reddit.com/by_id/t3_4ypcjk.json"}, "204": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1472158058, "Score": 2, "Body": "Suppose I should cite my sources...\n\nhttps://www.youtube.com/watch?v=jZuktUfF0nE ", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "205": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1472160678, "Score": 17, "Body": "An old professor used to like the saying, \"When you get your bachelor's, you think you know everything. When you get your master's, you realize that you don't know anything. And when you get your doctorate, you realize that nobody knows anything, and there is only a small handful of people in the world who care about the same topic as you.\"", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "206": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1472163486, "Score": 3, "Body": "Yup. Everyday i learn more and more...how much more there is to learn", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "207": {"Subreddit": "PhD", "Author": "cisforcaffeinated", "Date": 1472177055, "Score": 3, "Body": "This is excellent advice. It's supposed to be YOUR work in the end and just piggy backing on more than resourced may hinder more than help. Example: I'm doing neuropharmacology. My PI's expertise is neuropathic pain. I'm using her resources and guidance to get started, but ultimately I will know more about my project and the tools required than she will. I will be my own off-shoot, not a clone of her work.", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "208": {"Subreddit": "PhD", "Author": "fleeingslowly", "Date": 1472192481, "Score": 1, "Body": "It depends on your definition of 'read'. I read the abstract, the intro, and then the conclusion. Then I go back to the center to catch anything that might explain how the author got from the intro to the conclusion that wasn't covered by the intro and conclusion. When taking notes on an article for a class, it goes 30min to an hour or so per article (unless it's really short). If I'm just taking notes for my thesis then chances are, there's only one or two relevant issues in the article so it goes much faster. \n\nCaveat: articles well outside my field or in highly theoretical terms can take longer. Also those in a foreign language which I'm not quite fluent in.", "Permalink": "https://www.reddit.com/by_id/t3_4yi4k1.json"}, "209": {"Subreddit": "PhD", "Author": "fleeingslowly", "Date": 1472193211, "Score": 1, "Body": "In my experience, it looks a little weird but I'm watching someone in my department do it now and he is progressing a lot faster because he essentially did half his phd research while still an undergrad (but was forced to take some grad seminars twice because we only offer so many a semester). Still, we do work in a rather esoteric field of study and our advisor is one of the only experts in the world so I can see why he didn't change. \n\nOn the other hand, I couldn't find anyone who remotely specialized in the region I wanted to study so I applied to anywhere that was even close but made sure the place I went was okay with me exploring beyond my advisor's region of interest. It meant I had to do a lot more leg work on my own, but I already had two MAs going in so it didn't slow me down. \n\nIn general, I think you should share some commonalities with your advisor's research but it doesn't necessarily have to be the exact same region/person/topic. Make the expert on your field your outside committee member when the time comes. ", "Permalink": "https://www.reddit.com/by_id/t3_4zh11e.json"}, "210": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1472206439, "Score": 2, "Body": "[This is him?](http://www.polymtl.ca/recherche/rc/en/professeurs/details.php?NoProf=122) ", "Permalink": "https://www.reddit.com/by_id/t3_4zn8x2.json"}, "211": {"Subreddit": "PhD", "Author": "oceanpulse", "Date": 1472217512, "Score": 3, "Body": "Haha but there's nothing wrong about that. It's the whole point actually. If a PhD doesn't make you feel more stupid you're doing it wrong. ", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "212": {"Subreddit": "PhD", "Author": "fleeingslowly", "Date": 1472225779, "Score": 1, "Body": "Most likely, your department will have a political/networking undercurrent which most new phds don't notice. This can lead to blunders that will delay your phd. \n\nTalk to current and older phd students and ask their advice so you can find out which professors secretly (or not so secretly) hate each other, which topics are verboten with your advisor and committee and which professors have screwed over students etc. It's better to change your advisor early and not to horribly offend your committee member right off the bat (both of which I've seen happen). ", "Permalink": "https://www.reddit.com/by_id/t3_4xltag.json"}, "213": {"Subreddit": "PhD", "Author": "alexanderlaheij", "Date": 1472229947, "Score": 1, "Body": "yes, I send him an email, but have no response yet :/", "Permalink": "https://www.reddit.com/by_id/t3_4zn8x2.json"}, "214": {"Subreddit": "PhD", "Author": "esgresh", "Date": 1472230350, "Score": 2, "Body": "I stopped smoking during a period when I was pretty stressed (not my PhD). I chewed a lot of nicorette to begin with. I wad going through a really tough time so started putting the money i spent on cigarettes in a jar and would treat myself to something else instead - dinner with friends, movie, spa day...etc i did gain a fair amount of weight but that has always been an issue for me. I also drank a lot of coffee. \n\nVaping wasn't a thing then but might be worth a try to help until you are ready to quit altogether.  ", "Permalink": "https://www.reddit.com/by_id/t3_4zorzt.json"}, "215": {"Subreddit": "PhD", "Author": "PhDGoddess", "Date": 1472267530, "Score": 1, "Body": "It's almost impossible to have a relationship while doing a PhD. You are so wrapped up in the work, the stress, the fears, the guilt, that even trying to be with another is unfair to both people. \nIt's a sad reality I think", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "216": {"Subreddit": "PhD", "Author": "PhDGoddess", "Date": 1472267721, "Score": 1, "Body": "PhD Island of isolation...I can't even send smoke signals over to the island of misfit toys for some commiseration. ", "Permalink": "https://www.reddit.com/by_id/t3_4vw4j6.json"}, "217": {"Subreddit": "PhD", "Author": "kixstix", "Date": 1472299319, "Score": 1, "Body": "I suppose so. I have a few friends that managed to make it through and I had been hoping against all hope that we could make it too... Especially with the end in sight. Its still hard for me to understand. ", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "218": {"Subreddit": "PhD", "Author": "Zw13d0", "Date": 1472302500, "Score": 1, "Body": "It's the same here in Belgium. ", "Permalink": "https://www.reddit.com/by_id/t3_4y903t.json"}, "219": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472305864, "Score": 6, "Body": "First of all, I would definitely pursue those referrals and cast the widest net that you can. \n\nBut honestly, no one knows what the odds are of getting accepted into a PhD program. Every application year is different. Different pools of applicants, stuff going on behind the scenes that has nothing to do with you (like potential advisors being on sabbatical, or not taking on advisees, or funding, or inner-departmental negotiations about which program in the department can take how many students this year). \n\nReach out to people by e-mail, make plans to visit the campus if time and money permits, write a killer personal statement--just do everything you can to make your application as strong as it can be, and hope for the best. If it doesn't work out this year, there's always next year, and that's not necessarily a reflection on you or your potential as a researcher. ", "Permalink": "https://www.reddit.com/by_id/t3_4ztt7u.json"}, "220": {"Subreddit": "PhD", "Author": "PhDGoddess", "Date": 1472321996, "Score": 1, "Body": "My own experience has been difficult.  When you are writing, or researching or prepping for your comprehensive exams, your entire world is wrapped up in this one single thing.  There is so much pressure. Pressure to finish. Pressure to succeed. Pressure to get so much done in so little time.  When you take a break you feel guilty for not working.\nI also have found that you want to talk about your work, but realize it is so all encompassing that you try really hard not to talk about it.  I also always feel like when I am with people who are not in the midst of this process, that its hard to relate to them.  They have stories about work, going out with friends..basic real world kinda stuff.  Whereas (My diss is a historical piece) I end up wanting to talk about a discovery...or a piece of a conversation from the papers of someone long dead...who has no connection to other people's stories or interactions.\nIt's incredibly isolating.  That's not because people do not want to be with you...cause they do.  It almost feels like a bubble around you. I wish that I could succeed in a relationship...that there was someone. The PhD journey is lonely and one in isolation. I too am almost done...but the pressure seems even more intense.  It would be so unfair to bring someone into this mix.\nEven with the end \"this close\" I have no clue what the next stage is.  Will I get a job?  Where? Is it fair to ask someone to change their world for yours?  Is it fair to maybe ask for a super long distance relationship?  Or is it fair, if you don't get a job, to ask someone to remain with someone broke, mired in debt and feeling like a failure?  \n", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "221": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1472328215, "Score": 3, "Body": "Getting accepted into *any* PhD program isn't hard... getting accepted into a reputable program, with a strong research department  that has enough worldwide pull (as well as the rigor to prepare you) to land you your dream tenure-track or industry job upon graduation, is a lot harder.  \n\nThe latter depends on how strong your letters of recommendation are, your test scores, if you have the relevant academic background, writing and communication skills, and also at the end of the day a bit of luck too.", "Permalink": "https://www.reddit.com/by_id/t3_4ztt7u.json"}, "222": {"Subreddit": "PhD", "Author": "shewhoruns", "Date": 1472379624, "Score": 2, "Body": "I'm three weeks into research and classes haven't even started. I'm a first year. I feel dumb constantly. :/", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "223": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1472381538, "Score": 8, "Body": "An advisor occasionally presenting work done by one or more of their students is a perfectly normal thing to happen, and yes, you are being dramatic about it.  Like it or not, you work for your advisor and your university, and the work you produce does not belong to you personally but to the person who employs you.  Obviously your advisor should give you due credit for the work, but presumably your name is first on the poster and it's still going on your CV so that will happen to some extent anyways.  Telling him what you \"think of this behavior\", especially since you don't have the experience to know what is the accepted norm in your field, is overstepping your role as an employee/supervisee.  \n\nHowever... If you feel that he communicated badly about who was going to the conference then that's a perfectly reasonable thing to bring up (calmly) next time.  There's no need to make a big fuss about it; next time you're submitting to a conference you can simply say \"last time there was some ambiguity about who was going to present the work; could we clarify that now in advance?\".  ", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "224": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472390652, "Score": 4, "Body": "I dunno...I don't work in a lab, but this talk of your research being the intellectual property of the university gives me pause. I could be wrong, but I'm not getting the impression from your post that this \"professor\" is your advisor and that you're employed to work in his lab. I do, however, understand the PhD as your time to build YOUR OWN body of work which you can take with you into your career. And conferences are the grad student's best opportunity to build networks, make connections based on your research, and get your face out there. It just sounds like he's doing a really poor job of being your teacher: a resource to help you launch your career. \n\nOf course, you'd have to be really delicate about addressing it. Based on the relationship you have with him, do you feel it would be out of bounds to ask why he'd rather present it himself--y'know, just so you can have a sense of what goes into these kinds of decisions for future reference and so you can know what IS the accepted norm for when you're in that position. Or, at the very least, you could ask if you could still attend the conference, even if he does the presenting on his own. ", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "225": {"Subreddit": "PhD", "Author": "mouse_trap_queen", "Date": 1472396336, "Score": 2, "Body": "Same!", "Permalink": "https://www.reddit.com/by_id/t3_4zkqe0.json"}, "226": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472408445, "Score": 13, "Body": "I'm right now in that situation. I started a PhD in chemistry because when I finished my career I considered I knew about chemistry very superficially, but I wanted to know real chemistry.\n\nI got what I wanted, now I now a lot in the way I wanted to know. But it has been 7 years long, still I haven't finished, and in the meantime I have lost my passion for chemistry. Everyday gets harder to enter in the lab to work, and when I finish, in the next few months I hope, I don't feel like working as a chemist anymore. The reason for this are my bosses, and the way they manage the research group and people, not on the subject by itself. I guess that changing my group could improve things, but now I'm afraid that any other boss will be like them, so I feel reluctant to keep in the research business. And also I cannot just leave, because of a bureaucratic trap. I have expended 11 years learning and preparing for a very specialized job I don't want to do anymore... Sounds ridiculous.\n\nI don't know if this situation is something you had in your mind when you asked, or you were thinking on something different. I'm not here to cry or get a pat in my back, just sharing my experience, as it sounds close to what you are asking. If you want to ask something go ahead, and if it is not what you had in your mind, sorry for bothering.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "227": {"Subreddit": "PhD", "Author": "Polite_Users_Bot", "Date": 1472408448, "Score": 3, "Body": "Thank you for being a polite user on reddit! \n\n --- \n\n*This bot was created by [kooldawgstar](http://reddit.com/u/kooldawgstar), if this bot is an annoyance to your subreddit feel free to ban it. [Fork me on Github](http://www.github.com/kooldawgstar/PoliteUsersBot) For more information check out /r/Polite_Users_Bot!*", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "228": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472418762, "Score": 1, "Body": "I’m exactly on the same situation as you are, so I perfectly understand you.\n\nWhen my director recruited me, she offered me a research project that sounded really interesting. One of my greatest fears was to feel alone if it turned out that I didn’t know about the topic, and she seemed reeeeally supporting. So I enrolled. Now, after more than 7 years, I’m still working on that. She doesn’t know anything about my topic. I’m completely alone and I have to manage my research to get results on my own.\n\nThe project she designed (and presented to the local government for founding and they accepted) was half copied from the bibliographic research of a former student on a different subject, that turned out that vaguely shared some properties. She added some new references and extracted some conclusions about what to do, and just presented that. Now, I’m finally writing my thesis and when I write my bibliographic revision it turns out that all her conclusions are wrong. I’ve been expending 7 years doing something extremely difficult that doesn’t work well because instead of doing what every paper claims that work, she decided to do what all papers claim that doesn’t work, but she decided she would work. It wasn’t unresearched, it was researched and they claimed that it wasn’t good, and she didn’t let me change anything, I had to stick to her *wonderful* plan and now I have to find a way to defend what I did and why I did it, knowing that I shouldn’t have done it. Isn’t life wonderful?\n\nIn 7 years I have only published **one** paper. I wrote the second in September 2010, she only had to correct it and send it (because she has to correct everything… but only the literature, that’s what she likes. Not the real data, not the procedures… She changes the literature). She started to do it in December 2015. Still isn’t approved because she likes to fiddle so much with grammar and syntax that all journals ask her to rewrite it again (wordy, verbose, obscure are literal terms used to describe the paper by editors). I have material to write 3 more papers, but she doesn’t want to do it (she expends her time reforming her house, and travelling abroad for weeks, and that kind of things). And she doesn’t know anything at all about half of my research. And she is not going to learn; she clearly stated that “she doesn’t like those computer things” (I’m completely alone on that part). She makes us work 8-9 hours on the lab and, afterwards, you get “homework” to do for the night. She thought that we expended too few time on the lab daily so she forbid us to take a 15 minute rest on the evenings. You see people that are working on my topic and are multicountry teams with 12-15 people and a lot of founding. I am alone doing that, without help, and with less than 1% of the money that people have. They keep publishing my things because people do real research on my field, and meanwhile my boss prefers to give speeches about liberty in the third world than doing her job, to the point that I get anxious every time I have to search a paper on my field because I fear I will find something of my work already published again and I will have to start again to get enough to defend the thesis…\n\nSo… yeah, perhaps this is the tread of the rants, but I really know how you feel. I know what it is to have an incompetent supervisor and the problems that they give. And I also feel really alone. After 7 years my family is starting to understand now what my situation is, after years of claiming that “this is normal, everywhere is the same. It will be worse n the future”. Not even my friends understand me, and I’ve even lost many of them in the last years. Only my team mates (everyone working in a very different field, because in my lab, instead of working on something specific, everyone gets something at random depending of the mood of the supervisor when they arrive) understand the situation, because we are all living it.\n\n**I can only tell you that if you want a PhD, you will get it. It doesn’t matter if your research changes the world or it is just a bunch of data that you managed to tie together in some dark way. Very few people is going to understand your effort, but it will pay anyway. If you want to be a doctor, just go ahead and finish it. You don’t need to be the first, you only need to cross the end line. You will get your academic title, you will know yourself better than when you started and you will strength your will and motivation to support hard times. That’s all I can offer you, but that’s all I have right now.**\n", "Permalink": "https://www.reddit.com/by_id/t3_4xmaty.json"}, "229": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472418986, "Score": 1, "Body": "I'm happy to have read your response, as I've been having the same physical symptoms you have for a couple of years. I know I'm under stress, but I had never related both of them together (perhaps because I'm always to the limit, so there are no relax times to compare to). I always thought that this was just a different problem, and never thought it could be related to stress.\n\nThanks for sharing, you really never know when you're helping someone.", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "230": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472419556, "Score": 2, "Body": "I cannot advice you how to manage that situation. My last relationship was just before I started my PhD. What I can tell you is that in all this time I haven't had any relationship. It was simply impossible. I haven't had time, and the few times I had I was so stressed and tired it was impossible to be nice and jolly as many people expect you to be. My mood has clearly bittered and I have lost many friends meanwhile. It's difficult to connect with another person when they cannot really understand what you're passing through, even if the truly want to help.\n\nIt shouldn't be like this. It should be a normal job. You spend some hours working and afterwards you relax at home with your people. But that's not real. Sometimes, if your boy is stressed, trying to do anything about the problems just adds more pressure to it. He knows that you are worried about him and not being able to feel better just increases the pressure.\n\nSometimes, finding a simple hobby that you two could perform for a few time, something he really likes, might bring all those thoughts from his mind for a while. But for that to work, he really needs to want to do it, and making him wanting it can be more a problem than a solution.\n\nPatience, is the best advice that I can offer you. It's poor, but it's the only thing I know that could work.", "Permalink": "https://www.reddit.com/by_id/t3_4xlx85.json"}, "231": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1472424570, "Score": 3, "Body": "Just finish.  ", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "232": {"Subreddit": "PhD", "Author": "killafamilyofdogs", "Date": 1472426419, "Score": 2, "Body": "Sounds like you need a serious break from it all to find out what you want to do in the long run. Try and remember why you got into the field in the first place and ask yourself, is it the field you're becoming detached from, or is it your situation?\n\nI've been in many ups and downs about my field and about choices I've made in life. Sometimes sinking so much time and effort into something can really drain a person, even despite all the progress you've made. Maybe take a year off and separate yourself from it all for a while. You might come back more refreshed than ever. ", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "233": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472432749, "Score": 1, "Body": "I think the same. I need some time for myself, to see what I want to do with my life and how I want to focus my career. The point is that right now I cannot afford that. I'm writing my thesis right now (finally), although I haven't yet finished all laboratory work. If I stop now, I'm risking that my results might be published by someone else (it's a competitive field), so they would not be valid for my thesis. So I'm just focusing on finishing this, as soon as possible.\n\nOnce finished, I'll take some time to think about what I want to do, as it is the only way I think everything can be fixed.\n\nThe ironic thing is that I started doing it because I wanted to know more. I rally loved chemistry, science, working with analytical instruments to discover things... And I'm good at it, I know it. But now that I have what I wanted, it is more a chain than a blessing.", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "234": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1472442903, "Score": 1, "Body": "are you a prospective student?", "Permalink": "https://www.reddit.com/by_id/t3_4zn8x2.json"}, "235": {"Subreddit": "PhD", "Author": "Soggy_Biscuit_", "Date": 1472457170, "Score": 3, "Body": "Hey OP, bit late to reply but there is an academic at the University of Sydney, Australia who is doing a project on academics who chose to leave academia. Her name is Ruth Barcan, I believe the project is in a relatively early stage but all the data has been collected and presented at at least 1 conference that I know of (which I attended and is how I know about it) if you want to look it up.", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "236": {"Subreddit": "PhD", "Author": "DrDesign", "Date": 1472463753, "Score": 1, "Body": "One of the best skills a person can get is to know when to quit and that you shouldn't take your work personally, especially in a PhD because it will be a monster that is hard to contain.\n\nIt's not like you can never do this again. Why would you make yourself so miserable over a piece of paper? Research should be something you thoroughly enjoy and allows you to open a new path in your career, otherwise it was just lost time. This is an investment in yourself, treat it as such.", "Permalink": "https://www.reddit.com/by_id/t3_4xmaty.json"}, "237": {"Subreddit": "PhD", "Author": "DrDesign", "Date": 1472474728, "Score": 3, "Body": "I'm not sure what field you are in but in my field (soft side of engineering) that's a red flag, it's your data and you should be credited for it. Like ashley says, conferences are important for networking and if no one knows your face and accomplishments then you're one step behind in meeting with people.\n\nHowever, I would not confront him with this because you were the one to willingly hand over your work to him. Stay on good terms with that person and just let this event be a valuable lesson for the future.\n\nNext time, let him know you want to gain the experience of presenting and debating with outsiders about your data, so you feel you should present it yourself. He should not be able to deny you that as your promotor.", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "238": {"Subreddit": "PhD", "Author": "DrDesign", "Date": 1472475029, "Score": 1, "Body": "His phone no. is right there, just give him a call?", "Permalink": "https://www.reddit.com/by_id/t3_4zn8x2.json"}, "239": {"Subreddit": "PhD", "Author": "Laptopbutt", "Date": 1472476916, "Score": 2, "Body": "What do you mean specifically by careers? The PhD is starting to be viewed as a more versatile degree. \n\nMy story (Ph.D. Program in Toxicology) is somewhat similar /u/javier1287. I was interested in biochemistry and preferred the PhD programs to that of an MD or PharmD. I'm in my 6th year and finishing in April and it has been a tough journey mostly because of my PIs and their lack of structure and guidance in my research project. Bench research has become monotonous for me and while I feel like an expert in my field, some minor experiments I can't seem to get to work hold me back from getting my degree currently. I won't be doing bench work after I finish.\n\nHowever, while I may not continue along the traditional PhD career path (academia/tenure) I found some interest in pursuing intellectual property law with my PhD. Law firms look for PhDs in biomedical sciences, physics, engineering, etc. to do patent prosecution and may even pay for you to attend law school (although that is becoming less common).", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "240": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472479064, "Score": 1, "Body": "Perhaps I didn't said the correct word. I'm from Spain and sometimes this kind of concepts related with studies take a different meaning depending on the country. After finishing high school, I studied chemistry 5 years at university. That's what I called career, and I think it is not the correct word for that in English. After that, I realized that I had learn a lot of things, but only in a superficial way, like if they had told me what could be done, but not how to actually get it done. That's why I decided to start the PhD, as it allowed me to do real chemistry, in a laboratory, and use real instruments to solve problems (not just some examples in books about 19th century issues). If I focus just on that, I got what I wanted.\n\nI don't know what I will do when I finish (in a few months, I hope). Probably I will only need a temporal break to relax and see things different. Some days I wake up and I don't feel like working never again on a laboratory (but anyway I go there and I do what I have to do). I know that my PIs are the problem, and probably changing them would improve the situation, but I'm afraid that their way of doing things is more extended that it should and in any other place would be essentially the same (I see too many people around with similar problems).\n\nWhen I finish, I will calmly study my options and decide what to do. I'm sure I don't want to continue at the university. I've seen enough of it to know that I would not adapt to some things that are common there. Perhaps I will work for a private laboratory, perhaps research if I feel like dealing with it, or perhaps quality control... Or perhaps I could just break with it and try something different. I like photography and I'm good at it. Taking some studies about that is feasible and would allow me to work professionally at it. I will think about it seriously in a few months, when everything finishes.", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "241": {"Subreddit": "PhD", "Author": "Laptopbutt", "Date": 1472492207, "Score": 2, "Body": "I see. I'm from USA so there might be some differences in our situations regardless. I think of career as your employment after you have attained your terminal degree. \n\nThe PhD is no joke and you deserve to give yourself some time to relax and reflect once you're done. I know many people that have taken time off. Working towards a PhD typically physically and mentally defeat people so most people I know take a long vacation after they are done.\n\nI don't regret pursuing my PhD even if research is not my end goal. If you are like me, it is the science that is the most intriguing so I will never separate myself from that. I don't regret pursuing the degree because I have learned an endless amount about science, about myself and about what I am ultimately interested in pursuing long term. ", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "242": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1472496441, "Score": 3, "Body": "In an overly-generalized way, conferences are for networking, and peer-reviewed journals are for describing your work in great detail. If you express to your advisor that you'd like to be able to go to conferences in the future to meet other leaders in your field that will probably go a long way. The fact that your advisor (as one of the contributing authors) is presenting your first author work should not be of great concern. Believe it or not, your advisor probably contributed more to this research than you think, although probably not as much as you have.\n\nIf you go to your advisor and tell them that by not going to this conference misses a good learning and networking opportunity, then it will probably go much better then if you start talking about intellectual property stuff which will sound more like whining than actual productive talk.", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "243": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472558954, "Score": 2, "Body": "I have learned a lot, and I still like researching on my own projects. I can say that at least that knowledge is something I got from the PhD. Having to do everything by yourself, even if extenuating, at least teaches you valuable things.\n\nI'm curious by nature, and I believe this is never lost. I think I might have lost the will for working in research, but not the spirit of researching. Perhaps after some rest things will look different.", "Permalink": "https://www.reddit.com/by_id/t3_500iso.json"}, "244": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472560455, "Score": 2, "Body": "In my field and country, this is common. When you work, the results don't belong to you, but to the research group, and is the PI who decides how they are used. Of course, if they present a poster with your data you have to be given credit and appear as an author. The same thing happens with papers, and of course your data is your for your PhD, for example. Even when I leave the laboratory, all my laboratory notebooks, notes and research result will remain in the lab. I can keep copies of those things for my personal use, but the originals remain in the lab and their use are tied to the PI will. In my experience, as long as you get cited as an author and you get the recognition for having done it, he can present it on your name without any problems. You can prove that the poster is yours for your curriculum or whatever you need it to be proven. You get the recognition for your work, but not the fun of presenting it.\n\nI don't know (and I'm curious about it) if in other countries is just the same. Perhaps it depends on the place your data belongs to you or to your research group. Anyway, and if you want my personal opinion, I believe that morally you have the right to present your poster, as you have been the one doing the hard work, but sadly the world works in the way it does, and it's hard to change it.", "Permalink": "https://www.reddit.com/by_id/t3_4zyr01.json"}, "245": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1472596649, "Score": 3, "Body": "Just get a \"B\".  ", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}, "246": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1472612742, "Score": 1, "Body": "Sometimes it is good (for both the advisor and the student) to have someone come in with a complementary background. For instance, compared to other students, you may be able to 'bring something to the table' that no one else can because your expertise is non-overlapping with others. I would just focus on the fact that you are willing to learn and want to take an interdisciplinary (very cool word to use in academia right now) approach to the research, and that you are very interested in it. As a final thing, just make sure that you are upfront about your knowledge base. They will only see you as a disappointment if you lie about your abilities and it shows later on. I've seen a few people go down in flames for these reasons and it's never pretty.", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "247": {"Subreddit": "PhD", "Author": "everythingfeelsblack", "Date": 1472614272, "Score": 1, "Body": "Great! Thank you this is very helpful", "Permalink": "https://www.reddit.com/by_id/t3_50eqc6.json"}, "248": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1472628187, "Score": 1, "Body": "Yep.", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}, "249": {"Subreddit": "PhD", "Author": "carbearnara", "Date": 1472656669, "Score": 3, "Body": "Not sure what type of program you're doing, but my advice would be to sit down and have a conversation with your adviser. Without knowing the details of your program, most likely your adviser will have much better suggestions and be able to provide much better support than we can. ", "Permalink": "https://www.reddit.com/by_id/t3_50gtd5.json"}, "250": {"Subreddit": "PhD", "Author": "javier1287", "Date": 1472657228, "Score": 2, "Body": "It's hard to know, because each situation is different and it depends not only on you but also on your supervisors, the kind of PhD you are doing, the state of the art...\n\nPerhaps you should talk with any student who is finishing or just finished in an area similar to yours. They will know better your situation and give you better advice. Perhaps in your field some tactics are better than others, or perhaps your supervisor might help you if s/he knows about your situation.\n\nAnyway, a good planning is always a good way to improve your results. Try to schedule time to do different actions (bibliography search, work development, writing conclusions...). This way you won't be missing any part and it will help you to progress.\n\nI'm afraid that right now I can't give you better advice. Sorry.", "Permalink": "https://www.reddit.com/by_id/t3_50gtd5.json"}, "251": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1472664330, "Score": 2, "Body": "Action items for a \"B\" include:\n\n1. Show up every day\n2. Do the homework\n3. Take the tests", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}, "252": {"Subreddit": "PhD", "Author": "Biodiv", "Date": 1472667964, "Score": 1, "Body": "Awesome and true", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}, "253": {"Subreddit": "PhD", "Author": "endlessashley", "Date": 1472676625, "Score": 1, "Body": "You may be able to unofficially audit the undergrad course while you're taking the grad one. By that I just mean talking to the undergrad prof. and see if they'd be okay with you attending some lectures.", "Permalink": "https://www.reddit.com/by_id/t3_50dig7.json"}}