{"0": {"Subreddit": "PhD", "Author": "Saelie", "Date": 1485909651, "Score": 1, "Body": "I mean #1 might work for you but what's to say it would work for everyone? One of the many reasons I chose to do a PhD is because I'm not well-suited to the 9-5 life. Different approaches work for different people, I think it's important to discover what works best for you :) ", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "1": {"Subreddit": "PhD", "Author": "Saelie", "Date": 1485910041, "Score": 3, "Body": "Well don't write yourself off before you've even tried, apply for funding from the relevant research council(s). Get yourself some good references and show them you mean business with a killer \"statement of purpose\" (or whatever they decide to call it). Grades aren't everything. Also have a look at other trusts/scholarships, maybe private funds, there are sometimes (rich) family scholarships for very specific research, etc., depending on your topic there could be something in that.  \n\nI probably wouldn't take out bank loans to fund a PhD, as it's quite a significant risk. But maybe that's just me. ", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "2": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1485917092, "Score": 2, "Body": "How much loan are you talking about? I'm not totally familiar with the UK context, but are there TA opportunities or is it a strict 3 years and you're out. \n\nI took 5.5 years, but taught a lot to supplement my income since I had a few kids during my program. Any chance you could teach more and extend your program for a year (to offset your costs)?", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "3": {"Subreddit": "PhD", "Author": "mgrosvenor", "Date": 1485920724, "Score": 1, "Body": "I can report what I've found got me my PhD and what I've observed from 10 other PhD students around me. I can also tell you what I've seen fail, which is why I wrote it down. \n\nThe reason for this advice is twofold:\n1) a PhD is a marathon not a sprint. You cannot finish it in a mad rush at the end. You need to find a way nibble away at it bit by bit over the years. Working steadily week by week, treating like a job is a good way of doing it. \n2) As the PhD progresses, the stress is going to build. You'll have invested years and years of your life into this thing and the fear of failure will grow. If you start out by working weekends and late nights at the start you'll burn yourself out into a pile of wreckage. \n\nIf I can add personally, choosing to do a PhD because you don't like the 9-5 (or 10-6 or whatever)  is not a great reason to do one. A PhD is a qualification in research, it is a 3-5 year apprenticeship in being a postdoctoral researcher. After that period you're going to have to either get a job and do the 9-5 or become a postdoc and do the 9-5. A best, you're delaying reality for 5 years, at worst you're setting yourself up for failure. \n\nBut I'm just some stranger on the internet. WTF do I know. ", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "4": {"Subreddit": "PhD", "Author": "missgoozie", "Date": 1485932874, "Score": 1, "Body": "Thanks for the encouragement! I have been looking into more 'random' foundations but have yet to find one. Still on the hunt though. \n\nAs for loans, I know it's a risk but I don't really have another option if I don't get funded :/", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "5": {"Subreddit": "PhD", "Author": "missgoozie", "Date": 1485933021, "Score": 1, "Body": "Thank you for your comment! I believe there are TA opportunities but I'm not sure how to go about getting one. That will be a question for my supervisor I guess. \n\nI know that this is a naive question, but after the 5.5 did you truly feel like it was worth it? I'm concerned that I'm going to put all this time and effort into my work and then not get anything out of it (job, publishing etc).", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "6": {"Subreddit": "PhD", "Author": "Lightandlab", "Date": 1485944085, "Score": 1, "Body": "Depends on you mostly. If I were you I'd keep applying for funding till the end and never give up. I also have a friend in my lab who started her PhD on a loan but later in her second year she got a grant. So keep your options open. While on loan it might also work as a positive pressure to make you more focused and productive. Again that's my opinion, others may take the pressure as a pain too, so think wisely. \n\nSince you are in UK you can talk to me if you need help or someone to listen about anything. I am a PhD student as well started my PhD very recently.", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "7": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1485948112, "Score": 1, "Body": "There's a lot of missing details here:\n\n* Are we talking loans of $4000/yr or $25,000/yr?\n* What are you trying to get out of your PhD?\n\nI don't know much about UK humanities PhD, but in the US, acceptance without funding is called \"soft reject.\"  Here are some reasons against pursuing a PhD despite a soft reject:\n\n* You're free (or worse, a cash source if you're paying tuition), so your advisor doesn't have any skin in the game.  It's unlikely you'll be subject to the same professionally-developing pressures, duties, and expectations as funded students.  Your professor might not spend as much time or effort on you, or take you seriously.\n* Without vigorous professional development experience, you have a snowball's chance in hell of landing a professorship in an already super-competitive job market.\n* Without vigorous professional development experience, your colleagues aren't going to take your career seriously, and you may find yourself excluded from professional events.\n\nA reasonable alternative would be to decline this offer, spend a year or two improving your CV, publishing papers, going to conferences, meeting other professors at conferences, and then try again (especially talking to professors at conferences).  Please don't be mislead by the prestige of the university from your current offer.  That's nothing compared to a good vigorous education with professors that are working intensively with you.", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "8": {"Subreddit": "PhD", "Author": "Saelie", "Date": 1485949581, "Score": 1, "Body": "Well all I can say is I've been doing this for a while now, and it's going pretty well, and I don't work a fixed schedule. You can obviously still nibble away at it bit by bit and work steadily week by week over the years, but just not work the same fixed hours day in day out. I'm not saying one should chill out and play video games all day long for the first 2 years. \n\nThe fact that I don't like the 9-5 is obviously not the main reason I'm doing this, but the freedom which the PhD affords me in being able to work the hours I feel like is greatly appreciated. Makes me able to live life the way I feel like, and be happy, from day to day. I really like my topic so can work on it when I feel like it and it ends up being consistent work regardless, I don't have to 'force' myself into working on it 9-5. I enjoy working on it on the weekend, too, though I try to take it a bit easier on those days. Maybe I'll get bored of it eventually and will have to revert to something like you describe but it hasn't happened yet. I'll probably have to get a 9-5 job eventually, yes, but I'll deal with that when it comes. :) \n\nI don't know, maybe we're just caught up in semantics here and I took the ''9-5'' too literally, as I guess since I'm still working on it daily, just not literally from 9 to 5, it kind of amounts to something similar. Perhaps your PhD, unlike mine, was in a STEM subject (like most people on this subreddit), in which case I feel like the literal 9-5 may make more sense as you have to do more practical stuff etc.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5qwkkw.json"}, "9": {"Subreddit": "PhD", "Author": "emzzie43", "Date": 1485957583, "Score": 2, "Body": "Not sure if you need a professional, but could advertise around uni. Students are cheap labour :P", "Permalink": "https://www.reddit.com/by_id/t3_5rfgiq.json"}, "10": {"Subreddit": "PhD", "Author": "dierkie", "Date": 1485965525, "Score": 2, "Body": "You can try Way With Words", "Permalink": "https://www.reddit.com/by_id/t3_5rfgiq.json"}, "11": {"Subreddit": "PhD", "Author": "robocaller", "Date": 1485966458, "Score": 2, "Body": "Very true, but I'm deep in Europe. There is an English teaching department, so that may prove fruitful. Needless to say, for an accurate transcription (certainly not legally binding accurate, but accurate), my options may be limited. Good idea though.", "Permalink": "https://www.reddit.com/by_id/t3_5rfgiq.json"}, "12": {"Subreddit": "PhD", "Author": "the_scruffalo", "Date": 1485991556, "Score": 1, "Body": "4 years is normal for completion of a full time Arts PhD. Double that for part time study. And for either, add on any medical or other interruptions.", "Permalink": "https://www.reddit.com/by_id/t3_512fzo.json"}, "13": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1485994435, "Score": 1, "Body": "Why is it so rare for responses in this subreddit...?", "Permalink": "https://www.reddit.com/by_id/t3_5rcu2t.json"}, "14": {"Subreddit": "PhD", "Author": "missgoozie", "Date": 1486017641, "Score": 1, "Body": "It would be £4,000 per year and I want to go into academia but only for a little bit because I would really like to end up in museums. \n\nThanks so much for the 'real talk'. I actually didn't know that about American programmes. ", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "15": {"Subreddit": "PhD", "Author": "missgoozie", "Date": 1486017695, "Score": 2, "Body": "Thanks so much. I appreciate the support :)", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "16": {"Subreddit": "PhD", "Author": "MrBarneySir", "Date": 1486030744, "Score": 1, "Body": "Depending on what you're working on, an appropriate podcast might be a good idea. I mean, it's still kind of like working, but it also gives you a bit of downtime. You probably won't be able to give articles etc. your full attention when driving anyway.", "Permalink": "https://www.reddit.com/by_id/t3_5rgezj.json"}, "17": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1486061958, "Score": 2, "Body": "I'm in my second semester of my Econ phd studies and I'd also like to know the answers you get to this question. Otherwise, I'm thinking of just getting my Master's and going straight into something non-academic then. ", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "18": {"Subreddit": "PhD", "Author": "Whatisacynic", "Date": 1486074348, "Score": 1, "Body": "Endnote -&gt; OneNote -&gt; Word", "Permalink": "https://www.reddit.com/by_id/t3_5rcu2t.json"}, "19": {"Subreddit": "PhD", "Author": "Dacamented2016", "Date": 1486096085, "Score": 1, "Body": "There are apps that can read from pdf files iirc.", "Permalink": "https://www.reddit.com/by_id/t3_5rgezj.json"}, "20": {"Subreddit": "PhD", "Author": "StringerBell9", "Date": 1486119472, "Score": 1, "Body": "Why EndNote first? The OneNote clipper functionality is quite useful. ", "Permalink": "https://www.reddit.com/by_id/t3_5rcu2t.json"}, "21": {"Subreddit": "PhD", "Author": "StupidEconomist", "Date": 1486125023, "Score": 1, "Body": "I guess it all boils down to what sort of job you want to do. After a masters it will be mostly analysts I presume. I have a few friends who are doing that. They say its all fun to start with, as they find the job easy, but upward mobility is a problem after a few years, as all the \"boss\"es have PhDs.", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "22": {"Subreddit": "PhD", "Author": "kohopf", "Date": 1486156401, "Score": 2, "Body": "Not econ phd, but there is always a valid answer to such a question: personal connections, spend your remaining time on networking", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "23": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1486164577, "Score": 23, "Body": "Just so you know, it isn't just get a Phd -&gt; Become a professor\n\nIt's: get a PhD -&gt; Maintain a good publication record -&gt; Enrol as a postdoctorate researcher -&gt; Maintain a good publication record -&gt; Find a job as a senior lecturer -&gt; Maintain a good publication record -&gt; Be promoted to associate professor -&gt; Maintain a good publication record -&gt; Be promoted to professor\n\nThere is a LOT of work in order to become a professor that usually spans a few decades. Can take about 20 years or so after getting your PhD in order to become an associate professor, and that's if you manage to maintain a good publication standard.\n\nAlso, the grass is always greener. Do you have a master's degree, or have you ever gotten your hands dirty in academia as a graduate student? It's entirely different to how life is as an undergrad. Be prepared to not like it.\n\nMost universities allow you to enroll in a Master's thesis program then upgrade to a PhD if you find the scope to be too large for a Master's thesis. This could be a good way to find out if you like academia or not, since you don't have to fully commit to the 4 years or so of a PhD and if you find out it's not your bag, you can arrange a quick exit with a Master's degree.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "24": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1486165433, "Score": 16, "Body": "OP, please listen to /u/sadmoody.  Getting a PhD to ease into a professorship career with flexible schedule is just as much nonsense as moving to Hollywood to ease into a career as a wealthy world-famous actor.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "25": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1486166378, "Score": 2, "Body": "Not econ, but a STEM field with a surprising number of PhD's who don't know what to do with themselves afterwards, and who sit around grumbling, \"all the job ads wants extra skills I don't have...\"  So I thought long and hard about which parts of research I love and which parts I don't like, and I came up with a \"role\" to sell my work to companies that need my research, and so far it's going very well.  ProTip: many companies that need scientific research don't actually understand which research or skills they need, so if you can step in and take charge and explain it to them, things will go very well for you.  Be creative!  Think of an economic demand for your favorite skills, and start knocking on doors until you get there.", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "26": {"Subreddit": "PhD", "Author": "trishka", "Date": 1486166429, "Score": 3, "Body": "I already have my Masters degree in Accounting with a focus on Taxation. I loved school. I've been non-stop focused in my career since I graduated University in 2004, in other words I'm familiar with hard work and long hours. My career focus has been corporate tax with the last 7 years in international tax. I've written numerous memos and presentations to educate non-tax peers on various tax matters. I love tax and enjoy seeing the results of my hard work. \n\nOn glass door and various other sites, starting salaries for teaching positions in accounting are over 100k. Even though this is would be a pretty good pay cut from my current path, it would be plenty to make me happy and I think I would enjoy teaching more than pleasing shareholders. \n\nWhat other advise and thoughts do you have to share? I will take any/all positive and negative feedback. ", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "27": {"Subreddit": "PhD", "Author": "greyfriar", "Date": 1486171907, "Score": 3, "Body": "I don't think it's too old. I'm 40 and started my PhD in October. Granted, that's about where our similarities end. I did opt for a career and money, but it was because I hated uni (dropped out) and it turns out that for most actors, money comes from temping jobs. However, I graduated zoology two years ago, and after a bit of relevant work, started a PhD in environmental microbiology.\n\nYou hint that you'd be doing it because you want to, and that's pretty much the best reason. I look at my project as pretty much my dream job with a 3 year contract. Once it's done, I know that I want to stay in research, and I'm pretty sure I'd like work as a lecturer (and most positions include required research, anyway). \n\nAs far as I can tell, it's ensuring that you can generated good turns on investment (e.g. well written, high impact papers), and cultivate a good reputation as an academic that matter in the job market. I don't see my age as a barrier to employment. Neither does my 40 year old colleague who just completed his PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "28": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1486172812, "Score": 8, "Body": "That's awesome that you're so interested. A few other things that I need to point out about being a professor from what I see.\n\nTeaching isn't what makes up most of your time. You'll be teaching (of course), supervising students, applying for funding (SO MANY applications for funding), doing a shit-tonne of administrative work because they university constantly thinks that axeing administrative staff and shifting their workloads onto researchers is a good way to save money, and finally doing your own research and writing publications (since that's what keeps you at the university). \n\nThe MAIN reason you should be there is to conduct research. Without the spark and initiative for your own research you will ultimately fail as a professor. If you love teaching - it might not be enough. You might enjoy being a tutor or a TA more than you'd enjoy being a professor based on what you've said.\n\n(apologies if I'm coming across as too negative! Just trying to paint a more realistic picture of how things are on this side of the fence!)", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "29": {"Subreddit": "PhD", "Author": "trishka", "Date": 1486177726, "Score": 2, "Body": "Negative is good, this will help fill my pros and cons list. Do you think this is the case for all areas? I find article after article on the shortage of accounting professors, I'm not saying I'm anti research but haven't put as much thought into the research side of work as I have the teaching side. Sadmoody are you a professor/PHD student? What field of study? \n\nThere is a professor with a background and interest that is perfect for me at the university I'm interested in applying to. I intend to hopefully sit down with her and get more feedback on the accounting specifics field. \n\nI could just end up teaching at a community college with my masters degree if it turns out a PHD isn't for me. ", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "30": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1486181001, "Score": 6, "Body": "I'm currently in the last month of my PhD (and I'm procrastinating some writing in order to reply to you :P ). I'm doing mine in engineering, so maybe there will be a bit of difference between my experience and yours as far as methodology goes, but I don't think there will be much difference in terms of the expectation of quality research output.\n\nTalking to the professor with the background you're interested in is a great idea! Take along some hard questions and ask her what she doesn't enjoy about being a professor (as well as what the good parts are, of course!). \n\nIn the interest of full disclosure too, I'm nearing the end of my PhD, not too interested in sticking around in academia, so I may have a bit of a soured view of academia in general. My supervisor tells me that this is common towards the end of a PhD, but, take my negativity with a grain of salt :)", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "31": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1486193867, "Score": 1, "Body": "I use zotero for managing the PDFs/citations and have a project set up in scrivener which contains all my notes (the scrivener project folder structure is the same as the zotero database structure so finding things is easy).I complete a Cornell template within scrivener for every paper I read, this has been modified to include 2 additional sections, one is a list of questions or ideas I had about my own work while reading this paper, the other is space for a paragraph of \"thesis ready\" text about the paper, so I write that as soon as I've finished reading. ", "Permalink": "https://www.reddit.com/by_id/t3_5rcu2t.json"}, "32": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1486200657, "Score": 8, "Body": "&gt; I'm not saying I'm anti research but haven't put as much thought into the research side of work as I have the teaching side.\n\nTeaching-only positions do exist but they will definitely not be paying anywhere nearly as high as the $100k you quoted.  If you get a job at a research-oriented university (which will probably be in the $100k range), research will be a far higher priority than teaching in terms of what gets you hired, evaluated positively, and tenured.\n\nYou mentioned\n\n&gt; flexible schedule of a professor\n\nbut you might want to see how many hours professors (junior or senior) work in your field before you get too excited about this.  Most professors have \"flexible\" schedules, in that they can \"flexibly\" work evenings or weekends on top of the workweek to try and keep up with the demands of supervising students, applying for research grants, staying familiar with current state of the art, writing papers, and yes, teaching.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "33": {"Subreddit": "PhD", "Author": "StupidEconomist", "Date": 1486215012, "Score": 1, "Body": "This is great advice. Was talking to a silicon valley \"insider\" yesterday, who said that they get two kinds of people. One with economic knowledge without the computer firepower, and then IT people, and they tend to hire the IT person and train them with some econometrics, which is why most of their models fail. So I guess an econometrician with machine learning badges should be a good sell. ", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "34": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1486228167, "Score": 1, "Body": "I would say that it isnt impossible. In my department there was a guy who had been in the oil industry for 30 ish years, finished his PhD in 18 months and then got a position as a lecturer straight off the bat. \n\nIt helped that I think his previous employers had an interest in his project and so data was freely available and subsequently our department was in dire need of staff. \n\nHis experience more than made him suitable, academically speaking. He topped up his teaching practice during his PhD by being the equivalent of a TA. \n\nI would say that the stars aligned in his case though, so I wouldnt expect the same.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "35": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1486238627, "Score": 1, "Body": "£30 for three days: gusset shot in album. \n\nThey've already been on 2 days, I'll wear them the third day just before shipping to freshen them up!", "Permalink": "https://www.reddit.com/by_id/t3_5s2p1s.json"}, "36": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1486240127, "Score": 1, "Body": "That's incorrect. Business teaching positions will pay 100k. You'll be teaching 4-4 loads through, if you go to a purely teaching school.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "37": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1486240566, "Score": 2, "Body": "Majority of Business PhD graduates skip the postdoctorate researcher step, and skip any type of lecturer step (if we're talking about the USA), and get a job as an Assistant Professor straight out of PhD. If we're talking about tenure track accounting positions, if you get hired in the T50, you're looking at base 140k plus 2/9 summer support. If you can get a job at a T10, base can be close to 200k, with 2/9 summer support.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "38": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1486255533, "Score": 1, "Body": "Hell yes!!!", "Permalink": "https://www.reddit.com/by_id/t3_5s2dt8.json"}, "39": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1486255568, "Score": 1, "Body": "I love any view that shows off your mound and cameltoe 👌🏾✌🏾", "Permalink": "https://www.reddit.com/by_id/t3_5s2e39.json"}, "40": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1486262331, "Score": 1, "Body": "Do only publications where you are the first author count ?", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "41": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1486263299, "Score": 1, "Body": "Kind of. You should have quite a few where you're the first author. But if you're supervising students, you'll generally be placed as an author on a whole bunch of papers. First author credits means your input to the research can't really be questioned and shows you've put in the majority of the work.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "42": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1486272152, "Score": 1, "Body": "Thanks", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "43": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1486273300, "Score": 1, "Body": "We make you memorize it?  Give you a month to hand in a doctoral level research paper instead.", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "44": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1486273328, "Score": 1, "Body": "How bad are your oral exams going to be?", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "45": {"Subreddit": "PhD", "Author": "[deleted]", "Date": 1486273664, "Score": 1, "Body": "Good luck, I think these exams are nothing more than a formality, and academic hazing.  I understand what you are going through though, I just finished my oral exam two weeks ago.  I basically became paralyzed by self doubt and anxiety for a month.", "Permalink": "https://www.reddit.com/by_id/t3_5p9mel.json"}, "46": {"Subreddit": "PhD", "Author": "zachcarmichael", "Date": 1486283204, "Score": 1, "Body": "Wut.\n\nI would memorize the outlines for your responses and key references. Odds are if you remember the few big names in your field that wrote most of the references you read you will be fine. Then from there it's only a matter of filling out your memorize outlines with supporting evidences that you recall on the spot for your arguments.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "47": {"Subreddit": "PhD", "Author": "cramur", "Date": 1486290211, "Score": 1, "Body": "I highly recommend books [A PhD is not enough](https://www.amazon.com/PhD-Not-Enough-Survival-Science/dp/0465022227), and [PhD grind](http://www.pgbovine.net/PhD-memoir.htm), they answer a lot of questions and I wish I've read it before starting my PhD.\n\nDepending on your field, it might be the case that you would get a good position right after your defense, especially since you already have a lot of industry experience and willing to teach. Furthermore, a lot of universities practice 'equal opportunity' policies which forces them to not discriminate based on gender, age, or race. So this might be a good part that by your defense you would be in your early 40's.\n\nIt might be a good idea to find someone from your target field and talk to them about their path to their current position, how many postdocs they had to do and so on. Maybe you will find out that some of them don't even have a PhD degree, I don't know. A lot of these things depend on your field.\n\nIf I were you, though, I would consider other ways to scratch that teaching itch. Getting a PhD is a daunting and not that rewarding. But then again, it's a nice change of pace and might be your 3-5 years vacation.", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "48": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1486315605, "Score": 1, "Body": "Glad I thought to reshare then!", "Permalink": "https://www.reddit.com/by_id/t3_5s2e39.json"}, "49": {"Subreddit": "PhD", "Author": "Wowplays", "Date": 1486326258, "Score": 1, "Body": "that's the plan I've made a pneumonic device for each paper to remember the name of each major person so yeah it's not terrible just strenuous.", "Permalink": "https://www.reddit.com/by_id/t3_5r28ba.json"}, "50": {"Subreddit": "PhD", "Author": "SelectUsernameHere", "Date": 1486350313, "Score": 8, "Body": "I know so many people who changed their topic entirely in the first year, and so loose a bunch of work. It's common. You'll have to make adjustments, sure, but it's not enough to throw in the towel. Talk to your supervisor first about what's going on and how you feel.", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "51": {"Subreddit": "PhD", "Author": "AdvPhys", "Date": 1486355447, "Score": 3, "Body": "You need to set your self a detailed, but also flexible time lime with both hard and soft deadlines. Work out what you know and what you need to know and directly target the gaps in your knowledge.\n\nFrom my experience, most of us felt miles behind in that first year, the ones that appeared to be ahead were sometimes not as far as it seemed.", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "52": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1486358194, "Score": 13, "Body": "6th year PhD student here. I don't have any advice to offer, but I can absolutely relate to everything you've said here. My current strategy is to focus on defending first, and worry about everything else afterward. You're not alone in grappling with these career questions + loathing academia.\n  \nDon't shoot yourself! ", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "53": {"Subreddit": "PhD", "Author": "phd_fail_job", "Date": 1486358413, "Score": 6, "Body": "Thanks. Knowing I'm not alone is sometimes better than advice. ", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "54": {"Subreddit": "WitchPhD", "Author": "jonnysunshine", "Date": 1486363067, "Score": 1, "Body": "Is that angora?", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "55": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1486369744, "Score": 12, "Body": "5 months is nothing in the grand scheme ", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "56": {"Subreddit": "PhD", "Author": "AntDogFan", "Date": 1486370483, "Score": 5, "Body": "First, you shouldn't measure your progress against someone elses. Second, your project will not have a steady identifiable progression, some times will be a struggle others will be easier. Third, lots of people take time at the beginning it does not mean you won't finish strongly. Fourth, there are a lot of people who are able to talk a good game but that hides the reality that they are struggling just as much as you, it might be that they are just better able to hide it (at least from your perspective).", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "57": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1486389999, "Score": 3, "Body": "Everything you said resonates with me as well.\nFifth year, last semester student here.", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "58": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1486395256, "Score": 1, "Body": "Hell yeah!", "Permalink": "https://www.reddit.com/by_id/t3_5s2e39.json"}, "59": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1486402443, "Score": 2, "Body": "Absolutely apply. The aura varies from school to school. You have a wide range of jobs available - each with the corresponding aura. Look for a friendly place!", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "60": {"Subreddit": "PhD", "Author": "StupidEconomist", "Date": 1486432502, "Score": 1, "Body": "What are your research interests?", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "61": {"Subreddit": "PhD", "Author": "phd_fail_job", "Date": 1486435534, "Score": 1, "Body": "My doctoral work is mostly applied economics - with a focus on health economics. I can teach labour, health, econometrics, intros, applied micro. I've done interdisciplinary work with people in medicine. \n\nI find myself drawn to pretty much any sort of applied micro research. Avid reader of the Journal of Health Economics, labour journals, AEJ: Applied, etc.  My problem as an economist, I think, is that I like data analysis more than I like economics. I am a solid \"generalist researcher\" but terrible academic economist. ", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "62": {"Subreddit": "PhD", "Author": "phd_fail_job", "Date": 1486435822, "Score": 1, "Body": "Thanks. The department in question seems friendly enough. I just don't feel committed enough to the field for it to be worth my time or theirs. What's the point of applying if, in the off-chance that I'm successful, I just bow out a year later due to stress and misery. ", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "63": {"Subreddit": "WitchPhD", "Author": "WitchPhD", "Date": 1486443946, "Score": 1, "Body": "Good eye!", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "64": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1486448840, "Score": 2, "Body": "at least 3 years. fuck are you stressed about exactly? you will have a 3 year contract with decent pay. you can literally do nothing and still be fine.", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "65": {"Subreddit": "WitchPhD", "Author": "jonnysunshine", "Date": 1486483038, "Score": 1, "Body": "I try to spy with my good eye!", "Permalink": "https://www.reddit.com/by_id/t3_5hbu27.json"}, "66": {"Subreddit": "PhD", "Author": "StupidEconomist", "Date": 1486484505, "Score": 2, "Body": "Okay don't shoot yourself yet. I believe you can have a great career ahead. I am in my 3rd year, but I have already given up ideas of joining the \"Academic world\". I hate the idea of sitting in my high tower and publishing papers about topics that has almost no relevance to the real world. I like to see the results of my work having a direct impact on something. \n\nI think the way to infiltrate the non-academic world is to learn to sell ourselves, which being PhD students, we have never been taught. I have been talking to a few \"insiders\" at Silicon Valley, and they said that Econometricians with considerable computing-firepower is highly valuable to them. By computing-firepower I don't mean STATA, even SAS is getting too limited for big data. (These were exactly what one person at Amazon said). He said that the future of Econometric Analysis is merging it with Machine Learning. But that's for the future, now I think SAS and STATA knowledge with good applied microeconomic work will land you a great non-academic job.\n\nSince we are all materialistic to some degree, read this [link](https://www.econjobrumors.com/topic/how-much-do-amazon-pay). ", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "67": {"Subreddit": "PhD", "Author": "kautze", "Date": 1486591681, "Score": 2, "Body": "as others previously mentioned this will vary...I think in general, though, $25 per hour or higher is what you should look for (for working 40 hour weeks, approx.)", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "68": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1486603714, "Score": 1, "Body": "I would be surprised if people even picked an adviser in 5 months, much less a topic for dissertation. The standard length of a phd is 4-5 years. 5 months is nothing.", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "69": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1486604165, "Score": 2, "Body": "I don'y know where you are located, so take this advise with a pinch of salt. I work at a teaching hospital and see a lot of potential for the type of work you have done. Most teaching hospitals and private ones require data scientists/analysts/statisticians to work on their data and help them drive their policy. A lot of the work you do will have real world impact. Even places like Cleveland Clinic and Johns Hopkins are puttingg out such jobs. If academia is not your thing, then please look into these positions. Coding/scripting with statistical knowledge combined with your subject matter expertise could make you a tempting prospect.\n\nPlease don't shoot yourself.", "Permalink": "https://www.reddit.com/by_id/t3_5sc81u.json"}, "70": {"Subreddit": "PhD", "Author": "JanusByfringes", "Date": 1486614711, "Score": 1, "Body": "It is the second time I am hearing the number $25 per hour and I am a bit confused because everyone I know tells me that internships are a way to make money, but as a PhD student one makes ~$32 per hour at my school, after counting the tuition in. So I would be loosing both time and money. I should accept as low as $32 just to break even. In my opinion at least.", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "71": {"Subreddit": "PhD", "Author": "kautze", "Date": 1486616301, "Score": 2, "Body": "Ok, $32 is reasonable. I just stated $25 b/c this number at my school does NOT consider tuition and is what TAs and RAs are paid per hour. At my school though TAs and RAs are paid this amount for only 20 hours of work per week,not 40. At an internship, you will be working at least 40 hours per week (I am assuming), so if I made $25 at an internship, I'd make more b/c I'd be paid for more hours.  If you feel strongly about this, then just negotiate hourly rate to get the rate you are comfortable with. ", "Permalink": "https://www.reddit.com/by_id/t3_5p2gb4.json"}, "72": {"Subreddit": "PhD", "Author": "Prawldrowland", "Date": 1486628361, "Score": 1, "Body": "In my experience this advice is true. Everybody has a different trajectory during a PhD. It took me until 3 years in (out of 5) to gain a confidence in my area of study. Your literature review will help you feel more confident. Being honest about what you don't know is a good behaviour to maintain throughout your study, it will help you identify areas that you need to dig deeper into instead of blithely glossing over. ", "Permalink": "https://www.reddit.com/by_id/t3_5sbp3m.json"}, "73": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1486652776, "Score": 4, "Body": "If you are into listening to podcasts, I would recommend Hello PhD and PhD career stories", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "74": {"Subreddit": "PhD", "Author": "Lightandlab", "Date": 1486657855, "Score": 1, "Body": "Are they PhD blogs?", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "75": {"Subreddit": "PhD", "Author": "a5ph", "Date": 1486666092, "Score": 1, "Body": "Write That PhD. It's a page on FB. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "76": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1486667674, "Score": 1, "Body": "Thanks! Looks good!", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "77": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1486667682, "Score": 1, "Body": "I'll check them out!", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "78": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1486680330, "Score": 1, "Body": "oh wow, these are great. Wish I knew about these in the beginning of my PhD!\n", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "79": {"Subreddit": "PhD", "Author": "OceanTad", "Date": 1486680779, "Score": 1, "Body": "Thanks for that. Fantastic page ... didn't know a thing about it until you suggested. ", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "80": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1486687267, "Score": 1, "Body": "Also, quick advice, look at international options too! I don't know if you may be able to find another adviser say in Germany or the US or something, whose work you appreciate, but you may be able to find a financially better option someplace else.", "Permalink": "https://www.reddit.com/by_id/t3_5rblba.json"}, "81": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1486687721, "Score": 3, "Body": "I had to suffer through this myself.\n\nDo you know that professors get paid a small bonus for serving in committees? Could you imagine what it would be like if there was no supplement?\n\nSomeone should make some kind of scheduling website so that instead of emailing each professor asking if he can do it on XX day at XX time, you would just send them a link and they would select when they are free. Unfortunately, I doubt the professors would want to go through with such a system, I'm willing to bet they would think it's too tedious and time consuming.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "82": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1486688030, "Score": 2, "Body": "I didn't know they got paid, huh! \nMan, I wish they would atleast make an attempt to help me out, instead they try their best to be a pain. I know its boring to hear about my work for one hour but lets just do this and get it over with. I took a week emailing and meeting them to find a potential date, book the room and so on, and today my own adviser tells me she'll be going on a conference instead and will have to cancel. The other goddamn professor is leaving the country the week after for a vacation and the department doesn't allow Professors to Skype in unless they're not affiliated with the department or if they're on a sabbatical.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "83": {"Subreddit": "PhD", "Author": "Poly_blue_6", "Date": 1486689317, "Score": 3, "Body": "Could you try a doodle poll? You put up a bunch of times and then people state yes or no if they are available.  ", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "84": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1486689405, "Score": 3, "Body": "I thought of doing this but my adviser is VERY against the idea (she thinks its too unprofessional, she's also very old and so is part of my committee). She thinks emails and meeting with Professors is the only Professional way to do it.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "85": {"Subreddit": "PhD", "Author": "mosquem", "Date": 1486690110, "Score": 3, "Body": "Try When2Meet if that doesn't work. It might just be the word Doodle that's throwing her off; I bet you can find a professional sounding alternative!\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "86": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1486690611, "Score": 4, "Body": "It totally depends where you are re: \"getting paid\". I sure as shit don't get paid extra for my supervision and committees. ", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "87": {"Subreddit": "PhD", "Author": "shorthairedlonghair", "Date": 1486690909, "Score": 6, "Body": "I am convinced that the only reason they have an \"Analytical\" section on the GRE is to be sure you can pull your committee together at the end of your program on a certain date at a certain time in a certain room with the requisite number of committee members and dissertation readers.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "88": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1486695374, "Score": 2, "Body": "Thank you! I haven't heard about it but I'll definitely check it out. And yeah, I think you're right", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "89": {"Subreddit": "PhD", "Author": "zhanggar", "Date": 1486696565, "Score": 2, "Body": "Well my comprehensive exam question was delayed by a month. The grading of it was also delayed by weeks and it's happened twice now. Very frustrating because progress is so slow.  Professors just don't seem to care much.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "90": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1486706776, "Score": 3, "Body": "It took me four months to schedule my prospectus defense. It was a pretty awful experience. ", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "91": {"Subreddit": "PhD", "Author": "garbleflickle", "Date": 1486753546, "Score": 3, "Body": "I'm making a committee member teleconference in during Spring Break. Only way I could make it work.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "92": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1486755368, "Score": 1, "Body": "Oh I wish oh wish that i could do the same :(", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "93": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1486782003, "Score": 7, "Body": "I'm not gonna be able to help much here but I just wanted to give you an internet pat-on-the-back. Good for you man. Good for you.", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "94": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1486787849, "Score": 10, "Body": "Massage and the sex. ", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "95": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1486795637, "Score": 3, "Body": "I'm in Australia so we don't have personal statements on anything we apply for so I can't help either. r/gradadmissions is very active as is r/gradschool however people sometimes get angry there when these posts are more relevant to gradadmissions. Good luck dude, you're exactly the kind of person we need in science!", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "96": {"Subreddit": "PhD", "Author": "HigHog", "Date": 1486805695, "Score": 8, "Body": "My husband got me a beautiful new notebook. (As in, I went and bought one using our joint account and then told him it can be his valentine's day gift to me).", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "97": {"Subreddit": "PhD", "Author": "DropNote", "Date": 1486808557, "Score": 1, "Body": "Do it lol, I have a professor who's mom just finished her PhD. I think she was in her 50s or 60s. ", "Permalink": "https://www.reddit.com/by_id/t3_5rx57r.json"}, "98": {"Subreddit": "PhD", "Author": "Returnofthemacdaddy", "Date": 1486815241, "Score": 4, "Body": "Do all the chores around the house, make dinner, and draw her a bubble bath. I have dreams about this lol. To credit, my SO has done this a few times and not just on holidays.", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "99": {"Subreddit": "PhD", "Author": "ayeayefitlike", "Date": 1486832923, "Score": 2, "Body": "Am interested to see the results. I'm going to apply for PhDs next year - I struggled with undergrad with undiagnosed dyspraxia and ADHD, worked full time in a related job for two years before getting an entry level job in university support alongside a part time MSc. will be going back full time for a funded MSc next year too, but spent half of last year juggling my MSc and very serious illness including a lot of hospital time and operations so whilst I'm doing well my grades have just never been outstanding. It makes me very anxious when applying that I'm not going to be good enough for funding.", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "100": {"Subreddit": "PhD", "Author": "floridaflyboy", "Date": 1486838192, "Score": 2, "Body": "Look into finance.  If you know where you want to live, find a firm that does financial advising, wealth management, or estate planning.  If you're getting a PhD in Econometrics and Applied Microeconomics, I would say you could be the poster child for taking complex micro econ topics and watering them down for clients so that they buy and invest their money in your company's products and services.\n\nYou might also look into doing some consulting.  Many smaller firms need to outsource certain professional projects and you could fill their void very easily with your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "101": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1486840865, "Score": 0, "Body": "Books. Especially the very expensive reference ones. Whatever her field is, it probably has an Oxford dictionary or encyclopedia of X. They're invaluable ", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "102": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1486841484, "Score": 2, "Body": "Some random thoughts:\n\n- Fountain pen (e.g. Lamy Safari)\n- Fancy notebook (e.g. Midori traveller notebook)\n- Nice meal out somewhere", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "103": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1486842794, "Score": 1, "Body": "^^this^^ \n", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "104": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1486851880, "Score": 3, "Body": "My supervisor has waited 6-8 weeks on our papers I think.\n\nEdit: when you calculate the time period, subtract a couple of weeks for the Christmas and new year period when most offices would have been closed.", "Permalink": "https://www.reddit.com/by_id/t3_5tgwg6.json"}, "105": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1486878917, "Score": 1, "Body": "Highly dependent on the journal.  \nFind someone who sits on the ERB or who knows the journal really well and find out what the usual wait times are.  \n", "Permalink": "https://www.reddit.com/by_id/t3_5tgwg6.json"}, "106": {"Subreddit": "PhD", "Author": "scrossman414", "Date": 1486895380, "Score": 2, "Body": "As above have said, depends very much on the journal and Christmas slows everything down. Having said that I would say there is no harm in an email to the editor just to check in. Perhaps you could ask your supervisor to do this for you?", "Permalink": "https://www.reddit.com/by_id/t3_5tgwg6.json"}, "107": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1486898912, "Score": 1, "Body": "Some take 6 months. It varies between journals.", "Permalink": "https://www.reddit.com/by_id/t3_5tgwg6.json"}, "108": {"Subreddit": "PhD", "Author": "elfradlschneck", "Date": 1486904947, "Score": 3, "Body": "Thanks everybody for the replies. I looked at the back issues and it seems like most papers in the journal take 2-3 months from submission to publication, a few take 4 months or so. I will wait just a little longer (because of Christmas) and then eventually ask my supervisor to send an email to the editor.", "Permalink": "https://www.reddit.com/by_id/t3_5tgwg6.json"}, "109": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1486925162, "Score": 5, "Body": "qualtrics.com  \nit's the gold standard for academics, but you need an (paid) account to take advantage of the features (usually institutions will pay for this and provide their faculty and phd students with accounts)", "Permalink": "https://www.reddit.com/by_id/t3_5tlsj1.json"}, "110": {"Subreddit": "PhD", "Author": "codphd", "Date": 1486930827, "Score": 2, "Body": "I've always used Google Forms; it's free to try and use, plus you can export the data in to a spreadsheet and then (I guess) into SPSS easily. The best way would be to give it a go, I'm pretty sure it has all of your response types and it's pretty easy to use. www.docs.google.com/forms", "Permalink": "https://www.reddit.com/by_id/t3_5tlsj1.json"}, "111": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1486939817, "Score": 7, "Body": "Remember the professors are normal people, just like you. \n\nOf course, they want a good research candidate, but they also want someone that they get on with and can have normal conversations with. Research is not 100 percent about work, whatever field you are in. ", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "112": {"Subreddit": "PhD", "Author": "rhendricks100491", "Date": 1486940616, "Score": 3, "Body": "Hi, congrats on an invitation to recruitment weekend! The biggest advice I usually give to people visiting for phd programs is to try to get a feel for the ethos of the program - do the grad students seem happy? How are interactions among faculty members and between faculty members and students? Can you picture yourself working with these people for a while? \n\nI wrote a blog post to people visiting my department's PhD open house, but I hope it will be helpful to you!\nhttps://rosehendricks.com/2017/02/07/dear-future-grad-students/", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "113": {"Subreddit": "PhD", "Author": "rhendricks100491", "Date": 1486940708, "Score": 0, "Body": "That's really kind of you. I think the gifts in this shop are all pretty great - https://www.etsy.com/shop/sparkofsunshineshop", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "114": {"Subreddit": "PhD", "Author": "rhendricks100491", "Date": 1486941209, "Score": 2, "Body": "I follow lots of PhD student blogs!\nOf course, I think mine can be pretty helpful: rosehendricks.com\nBut also:\nhttps://alisoninnes.wordpress.com/\nhttps://alyciaphd.wordpress.com/\nhttp://gradlogic.org/   &lt;-- especially love this one!\nhttps://heidirgardner.wordpress.com/\nhttp://jameshaytonphd.com/\nhttp://phdtalk.blogspot.com/\nhttps://phdingthebalance.wordpress.com/\nhttp://www.raulpacheco.org/\nhttps://theresearchwhisperer.wordpress.com/\nhttp://writepublishthrive.blogspot.com/\nhttp://fromphdtolife.com/\nhttps://patthomson.net/\nhttp://www.phdadventures.com/\n\nHappy reading! I'll be interested if you come across others that you really like.", "Permalink": "https://www.reddit.com/by_id/t3_5t01tk.json"}, "115": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1486953213, "Score": 2, "Body": "Recruitment weekends are all about trying to get you to come to the school. You don't have to prove anything to them. If there's anyone you're particularly interested in, just briefly look over their current research for some talking points but these weekends will mostly be informative and fun with the goal of you accepting their offer. \n\nI stressed out way too much when I went to mine and realized too late that I had the wrong mindset towards it. Go, make friends, have some free drinks, and enjoy the trip. ", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "116": {"Subreddit": "PhD", "Author": "partysoberUNT", "Date": 1486960175, "Score": 2, "Body": "If it is a personal statement, I would address it succinctly by saying you developed a substance use disorder, and subsequently entered into long-term recovery - which marks the drastic improvement and current trajectory. \n\nIf it is not a personal statement (but rather an SOP or research statement) don't address it at all. In my master's personal statement I was very candid about my own long-term recovery from a substance use disorder, as it is critical to who I have become. \n\nAnother word of advice - don't refer to yourself as a recovered addict. You are a person in recovery from a substance use disorder. Linguistic choice, and resulting implicit bias, is important. \n\n(Source: currently a 2nd-year MSW candidate, PHD applicant, at an Ivy)\n\n(edit: also, check out collegiate recovery programs via a google search: \"Association of Recovery in Higher Education\")", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "117": {"Subreddit": "PhD", "Author": "Bambi1322", "Date": 1486962189, "Score": 1, "Body": "Sciences? Arts?", "Permalink": "https://www.reddit.com/by_id/t3_5tqopr.json"}, "118": {"Subreddit": "PhD", "Author": "EaterOysters", "Date": 1486962300, "Score": 2, "Body": "Thanks for the reply. I've read your blog post and there were other good links at the bottom. Appreciated.", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "119": {"Subreddit": "PhD", "Author": "EaterOysters", "Date": 1486964077, "Score": 1, "Body": "I don't have an offer in hand yet. The way I interpreted it was I meet with professors, if they like the interview/chat then my odds go up.  It's no news to me that they're trying to get me to come, since they're fronting over $1000 for the plane ticket and hotel.\n\nI just want to create a good impression. Thanks for your input.", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "120": {"Subreddit": "PhD", "Author": "EaterOysters", "Date": 1486964157, "Score": 2, "Body": "I understand that, but I want to present a good image. I'll keep your post in mind not to be 100% business with nothing else. Thanks.", "Permalink": "https://www.reddit.com/by_id/t3_5too8v.json"}, "121": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1486972850, "Score": 1, "Body": "Depends if it is a large taught/research program. Taught: very little difference to your undergrad. Research: treat it like a job, as far as that is possible. \n\nDo a 9-5 ish and try and respect your down time / weekends. With a PhD this is prett critical, as you will drive yourself into the dirt if you dont. For a short (3 month?) research project, probably not as important.", "Permalink": "https://www.reddit.com/by_id/t3_5tqopr.json"}, "122": {"Subreddit": "PhD", "Author": "Acid-Catalyzed", "Date": 1486974949, "Score": 1, "Body": "Thank you. I agree that the choice of wording in reference to myself is important. ", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "123": {"Subreddit": "PhD", "Author": "Acid-Catalyzed", "Date": 1486975103, "Score": 1, "Body": "Thanks man. I don't often bring these things to light, so it's nice to hear. ", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "124": {"Subreddit": "PhD", "Author": "Acid-Catalyzed", "Date": 1486975217, "Score": 1, "Body": "Thank you. ", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "125": {"Subreddit": "PhD", "Author": "grubberlang", "Date": 1487000539, "Score": 8, "Body": "This is the PhD sub. ", "Permalink": "https://www.reddit.com/by_id/t3_5tqopr.json"}, "126": {"Subreddit": "PhD", "Author": "BryanRyan02", "Date": 1487003334, "Score": 2, "Body": "I use doodle poll all the time, very simple, and my committee members dont mind, this has helped me schedule things in just a couple of days.", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "127": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1487004091, "Score": 9, "Body": "So,  basically: go to meetings, be prepared for them, do good work, do it on time, find out how to communicate.\n\nThanks for that super useful info I'm sure no one had thought of that before /s ", "Permalink": "https://www.reddit.com/by_id/t3_5tsc5e.json"}, "128": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1487009951, "Score": 1, "Body": "Please make your committee members talk to my committee members ", "Permalink": "https://www.reddit.com/by_id/t3_5t42y9.json"}, "129": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1487018430, "Score": 2, "Body": "Defo not click baits judging from the title alone /s", "Permalink": "https://www.reddit.com/by_id/t3_5tsc5e.json"}, "130": {"Subreddit": "PhD", "Author": "Infectious_Pen", "Date": 1487029074, "Score": 1, "Body": "Disclaimer: I'm not starting grad school for a couple more months, but I've been interviewing places and asking other people's opinions.  \nMake sure you love what you're doing :). If you love it you'll want to work hard at it and everything will fall into place after that. It won't be easy, but don't overwork yourself. \n", "Permalink": "https://www.reddit.com/by_id/t3_5tqopr.json"}, "131": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1487062786, "Score": 3, "Body": "I couldn't even read this article. I just read the subtitles. Perhaps in doing so i'll miss some important information. However, from the subtitles it looks like 'be a generic good student and dont be an idiot' will make you have a good relationship with your supervisor. This is under the assumption that your supervisor is a gold star supervisor. I've have plenty of problems with my supervisor that would not be solved by these generic solutions. Wheres the advice on the balance in-between ownership on the project or handing conflicts on how things should be done? What about controlling supervisors, or absent supervisors? Again, im probably missing all the golden information in this so correct me if im wrong. I just dont think every phd-supervisor relationship can be solved by some generic '' be a good student'' bullshit bulletpoints ", "Permalink": "https://www.reddit.com/by_id/t3_5tsc5e.json"}, "132": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1487105655, "Score": 5, "Body": "Different labs have different policies.  Some labs restrict lodging to like $40/night so students have to find roommates.  Most of my conferences end up around $700-$1600 for a week but it depends what part of the world they are in and what fees the conference charges.", "Permalink": "https://www.reddit.com/by_id/t3_5u2t54.json"}, "133": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1487109255, "Score": 3, "Body": "try and book the flights as early as possible, to minimize costs. use google flights to find the best flight.  \nmake sure you get early bird conference registration price  \nlodging: if money is really an issue you can stay at a non-conference hotel that is close by. it tends to be significantly cheaper.\n  \nat the end of the day, conferences are expensive.", "Permalink": "https://www.reddit.com/by_id/t3_5u2t54.json"}, "134": {"Subreddit": "PhD", "Author": "drarch", "Date": 1487163900, "Score": 2, "Body": "That's about right. I would recommend inquiring with your advisor about travel reimbursement. I've managed to get every conference I go to reimbursed. I make sure that I'm involved somehow, even if it's just a poster presentation, so that they know its critical for me to attend. Then just submit it early and hope for the best. In two years, it's paid for four conferences. ", "Permalink": "https://www.reddit.com/by_id/t3_5u2t54.json"}, "135": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1487173283, "Score": 4, "Body": "I would stick with the advisor. I believe in my field, at least, Georgia Tech gets a lot more people than they need, and you compete for spots. Those who don't make it leave or master out ", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "136": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1487175241, "Score": 11, "Body": "Great and supportive advisor every time. Hopefully s/he is well known and productive. ", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "137": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1487175399, "Score": 3, "Body": "I agree. The university you go to doesn't matter, it's your mentor that future jobs will look at.", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "138": {"Subreddit": "PhD", "Author": "iamjacobsparticus", "Date": 1487176736, "Score": 3, "Body": "It depends on field. In the hard sciences you are attached to your adviser, in the social sciences you have more freedom to work with a bunch of different people because the projects are smaller, and having other people in your department (or similar departments) to work with is helpful. School matters for reputation, and while a more minor consideration the difference in coursework quality you get is important too.", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "139": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1487179478, "Score": 6, "Body": "Great advisor.", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "140": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1487180637, "Score": 1, "Body": "Have you talked to the department head about this? If you keep the problem between the two of you she has no pressure on her to get it done", "Permalink": "https://www.reddit.com/by_id/t3_5u8xub.json"}, "141": {"Subreddit": "PhD", "Author": "aiapplicant", "Date": 1487182072, "Score": 1, "Body": "That's what I'm thinking too. Thank you everyone for the *seemingly* unanimous opinion. It's how I'm leaning as well.", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "142": {"Subreddit": "PhD", "Author": "Z10201Z", "Date": 1487185826, "Score": 7, "Body": "A bad advisor will make your life miserable during graduate school. Miserable.", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "143": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1487185927, "Score": 6, "Body": "My fourth child was born two days before I defended.  You can't put your life on hold for this.  Also, the stress is there because you aren't taking ownership of the process.  You have to directly deal with the school in any manner to get this done.  Ideally, you try one last strong push with your advisor, that's still your quickest path to completion even if it doesn't seem like it.  If your relationship with your advisor is already at this level, talking to an administrator can't make it worse.  This is your life, your success, and if your advisor is being absent you can't let that happen.  I wish you the best in starting your family as well as completing!", "Permalink": "https://www.reddit.com/by_id/t3_5u8xub.json"}, "144": {"Subreddit": "PhD", "Author": "Danteal56", "Date": 1487187282, "Score": 2, "Body": "What field are we talking?", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "145": {"Subreddit": "PhD", "Author": "More_Momus", "Date": 1487187732, "Score": 2, "Body": "I very recently had the exact same decision to make...I went for the advisor, and am incredibly happy. I don't have the retrospect to say that it was definitely the right choice, but I feel like it will turn out that way. \n\nMy 'worst case' scenario (not that it's bad at all), is I'll get the other things with my Post-doc. Hopefully, I'll have networked enough--through myself or with the help of my awesome PI--that I can have a good choices at the other schools as well. ", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "146": {"Subreddit": "PhD", "Author": "Double_Helix_", "Date": 1487189092, "Score": 1, "Body": "Biochemistry ", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "147": {"Subreddit": "PhD", "Author": "zwynorthern", "Date": 1487200099, "Score": 1, "Body": "Been there. Thought of quitting, but did my final defense eventually and now a happy mom with my first born (not on job market though). Try to get proposal done first ( probation is a good excuse to push your advisor), and then move on what you want, have a family ( pregnancy and deliver r no joke, taking care of a newborn brings you tears and joy at the same time), maybe a gap year to help you rethink the whole thing from different angle. It's your life, don't let your advisor mess up your blueprint of your life, she obviously has some issues herself. \n", "Permalink": "https://www.reddit.com/by_id/t3_5u8xub.json"}, "148": {"Subreddit": "PhD", "Author": "Krampman", "Date": 1487203777, "Score": 2, "Body": "*Knew", "Permalink": "https://www.reddit.com/by_id/t3_5ubbf0.json"}, "149": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1487207428, "Score": 10, "Body": "*potential PhD student\n\n\"Candidate\" is a specific term in the doctoral context to refer to post-proposal and course work students who haven't yet defended their dissertations. ", "Permalink": "https://www.reddit.com/by_id/t3_5ubbf0.json"}, "150": {"Subreddit": "PhD", "Author": "flagellumullum", "Date": 1487210844, "Score": 1, "Body": "(This doesn't really answer what you asked about, but it feels relevant)\n\nExperience obviously varies across fields, but the thing that most surprised me (initially) was that I was basically looked down upon for having worked in the industry instead of continuing academic / research oriented work after my undergrad degree (I worked as an investment banker and now am pursuing a finance phd). \n\nI only bring this up because the first draft of my application essay highlighted my work experience, which was basically a negative. This is likely obvious to most people, but I would say try to find ways to illustrate how skills from your work experience will translate to skills as a researcher.", "Permalink": "https://www.reddit.com/by_id/t3_5ubbf0.json"}, "151": {"Subreddit": "PhD", "Author": "jarede312", "Date": 1487213746, "Score": 5, "Body": "I'm definitely interested in seeing some replies here. I'm in a very similar boat. ", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "152": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1487238158, "Score": 1, "Body": "We use \"Provisional PhD Candidate\" for the pre-proposal stage in New Zealand. But it's one in the same, really.", "Permalink": "https://www.reddit.com/by_id/t3_5ubbf0.json"}, "153": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1487246078, "Score": 1, "Body": "All the postdocs I've met are glad to be in the position- how many have you spoken with?", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "154": {"Subreddit": "PhD", "Author": "fatfreefood512", "Date": 1487256745, "Score": 1, "Body": "Lol it's actually amazing. There's a shortage of accounting professors. \n\nhttp://www.byuaccounting.net/mediawiki/index.php?title=Main_Page", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "155": {"Subreddit": "PhD", "Author": "rgoodwi3", "Date": 1487260204, "Score": 1, "Body": "Yep. We're actively looking for two accounting PhDs for open positions at my uni. Hard to get the and hard to keep them. ", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "156": {"Subreddit": "PhD", "Author": "Double_Helix_", "Date": 1487260717, "Score": 2, "Body": "At least a dozen from several institutions. Many that are now exceeding five years, published well, but have no secure faculty prospects and have been making a mid 40K salary into their late 30s/early 40s. ", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "157": {"Subreddit": "PhD", "Author": "ZebraSweet", "Date": 1487271190, "Score": 1, "Body": "I guess it just depends on the person. The postdocs in my lab and surrounding labs all have secured professorship positions, love what they do, and haven't ever complained. But it comes down to how much do you love research?", "Permalink": "https://www.reddit.com/by_id/t3_5u95w2.json"}, "158": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487284282, "Score": 1, "Body": "It varies. An average of 18% PhD graduate will eventually work in academia. ", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "159": {"Subreddit": "PhD", "Author": "scrossman414", "Date": 1487288793, "Score": 4, "Body": "Really sorry to hear your having such a difficult time. A PhD can been lonely and thankless at times but there are moments where something works and you get a result that makes it feel worth it!\n\nI'm wondering if there is a wider community of PhD students in your university? It definitely makes the whole process easier if you have people around you that are in the same situation. Perhaps there are other first year students that are studying physics but in a different department that you can talk to? Interdepartmental meetings and Facebook groups can be good places to start with. \n\nI would also say that if you find that your anxiety is really affecting your life there is no shame in talking to someone about it - maybe your supervisor or a doctor. It's also worth noting that if you decide in a year or so that you are really not happy and that it's not for you, you can pull out at any time. I know people who have been in a PhD for 2 years before switching to a different program and starting the whole process again. \n\nGood luck with it and I hope you manage to sort this out!", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "160": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1487294065, "Score": 1, "Body": "This article is terrible - its written in a pedantic tone with a narrow professor point of view. It says work hard, give writing to the professor on time and without grammatical errors so that they can check it. What's the professor's job? Respond to emails and do corrections on time. What about all the typical supervisor problems like being abusive, sabotaging research, changing project frequently, trying to control the project, not providing resources to the student to succeed, isolating the student, using the student as a political tool, ignoring the student's career in order to further their own, and simply not mentoring the student to turn a good, hardworking student (though unskilled in independent research) into a full fledged and competent PhD? If only the world was as simple as he makes it out to be.", "Permalink": "https://www.reddit.com/by_id/t3_5tsc5e.json"}, "161": {"Subreddit": "PhD", "Author": "pyrofoam", "Date": 1487304313, "Score": -8, "Body": "Leave if you don't like it.  ", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "162": {"Subreddit": "PhD", "Author": "the_scruffalo", "Date": 1487323488, "Score": 4, "Body": "You shouldn't be working 24/7. When working, split your day up into chunks with milestones i.e. if I write x anount of words I get to walk around the block / watch an episode of a series or documentary. I start my day with a run and walk the dog. Something disconnected completely from your research. It will follow you around though because you're so involved with it. Sometimes I can't take a day out in a museum or have a chat with friends without feeling guilty or noticing something which connects to and reminds me of my research. Heck, even walking the dog I start thinking about work or worry about it. But thats because you care about it. You're working very hard. Maybe too hard. Cut yourself some slack. Treat it like any other actual job - breaks, holidays and sick days apply. \n\nMost people I know go the other way, constantly in meetings, everyday catching up with friends and avoiding the inevitable. I have little sympathy for these folks who make a job of talking *about* their PhD rather than *doing* it. But human interaction is absolutey key to stay sane. Maybe you could set up a research group in your field or a more general PhD peer support group.\n\nAs for the anxiety and depression - exercise cannot be underestimated. Don't be afraid to talk to a doctor or use your university councilling and student wellbeing support services. You've already reached out, follow it up with help IRL.", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "163": {"Subreddit": "PhD", "Author": "moranr7", "Date": 1487326355, "Score": 3, "Body": "I had something like this in my 2nd year - with regards to my work environment being lonely/isolated, my lab moved and I stayed.  I was the only comp. Bio person in the department.  About 6-8 months were rough as fuck.  Then things changed, people arrived, met new people etc..  I rode through it and I am on the last stage of my PhD.   Times get tough, but it's getting through those rough times really showed me how much I wanted a PhD.  Don't give up just yet, make things better.  Your mental health and happiness is just as important as your work.  They are not mutually exclusive.  Spending time to get into a good frame of mind can only help your research.  So take time from the research to do this and get where you need to be.  Make it happen :) .  I am big into sports and exercise myself - this is so crucial for my mental health.  I am too busy focussing on the sport when I play, to think about anything else - which is great.  Try to find a team hobby or exercise class.  ", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "164": {"Subreddit": "PhD", "Author": "Deadbeat_student", "Date": 1487328789, "Score": 3, "Body": "I worked in my field for a couple of years. My experience showed me that I still have more to learn. The best way for me to learn is to be emerged in research and surrounded by people that challenge me. My phd program provides that. ", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "165": {"Subreddit": "PhD", "Author": "padme0723", "Date": 1487332523, "Score": 3, "Body": "I'm with you--I'm doing this for myself too. I'm doing a creative writing PhD and I don't want to become a teacher. I just want to be able to write a novel with incredible resources and support. ", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "166": {"Subreddit": "PhD", "Author": "malagasyhafa", "Date": 1487334294, "Score": 5, "Body": "My dad, 63, was working and doing his PhD at the same time. Most of his colleagues successfully got their doctor degree, while him, slowly turns away from it. I do not know what the exact reason behind that change, he stops talking about it.\nHe convinced me on pursuing my study on higher level, \"differentiate yourself from the crowd\" he said. And here I am, 4-1/2 years later, with accepted papers, about to graduate. I guess i am doing my PhD for my dad...", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "167": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487341090, "Score": 1, "Body": "For me it's really an insatiable need to learn. This PhD is my 5th college degree", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "168": {"Subreddit": "PhD", "Author": "need2getaclue", "Date": 1487343155, "Score": 5, "Body": "I want the Phd so I can always look back on my life and know I achieved something great.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "169": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1487344390, "Score": 2, "Body": "I started because I was interested in the field, and wanted to learn more and pursue a career in it. Now a few months from submission, still true, even though it's stressing me out at the moment, it's annoying when the rules we forcing you to finish when you are on the verge of a significant brealthrough.\n\nEDIT: also I have an urge to leave a positive mark on the world, and this is one day to do that", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "170": {"Subreddit": "PhD", "Author": "eddotman", "Date": 1487344468, "Score": 8, "Body": "I want to learn cool stuff, build something neat, and then get a nice industry research job.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "171": {"Subreddit": "PhD", "Author": "olorinii", "Date": 1487344476, "Score": 10, "Body": "I did it for several reasons. \n1. People call you Doctor.  Hellasweet.\n2. All of your weird behaviors become eccentricities.\n3. Get paid to teach, study, and write.  ", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "172": {"Subreddit": "PhD", "Author": "iseedoug", "Date": 1487344884, "Score": 1, "Body": "So basically don't suck. k thanks.", "Permalink": "https://www.reddit.com/by_id/t3_5tsc5e.json"}, "173": {"Subreddit": "PhD", "Author": "LegDay2017", "Date": 1487362343, "Score": 2, "Body": "Money.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "174": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1487362640, "Score": 0, "Body": "Or not American.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "175": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1487363195, "Score": 1, "Body": "Time off not thinking about your PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5tc4bz.json"}, "176": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487364893, "Score": 2, "Body": "Not at all- it's called scholarships", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "177": {"Subreddit": "PhD", "Author": "Tinky91", "Date": 1487365356, "Score": 2, "Body": "Because my surname is Payne. I will be Dr Payne.....", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "178": {"Subreddit": "Playful_PhD", "Author": "Flat_Sixx", "Date": 1487365683, "Score": 1, "Body": "😘😘😘 yummy 💦💦💦", "Permalink": "https://www.reddit.com/by_id/t3_5unkdq.json"}, "179": {"Subreddit": "PhD", "Author": "Laptopbutt", "Date": 1487365783, "Score": 2, "Body": "Honestly, I wanted to dive into the nitty gritty of understanding the human body so it was purely for intellectual satisfaction. Unfortunately, my research project has turned me off from bench work later on and I think I could be happy doing any type of work post graduation.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "180": {"Subreddit": "PhD", "Author": "codphd", "Date": 1487367261, "Score": 3, "Body": "In my case it's the combination of three things. Firstly, considering my PhD is about consumer perceptions and acceptance of autonomous cars, I saw it as a good route into employment in the car industry; which has been my dream since I can remember. Secondly, my secondary school headteacher always said her masters was the best thing she ever did; I completed my masters and wanted more. Lastly, but perhaps most importantly, I have the full support of my family and doing a PhD has allowed me to stay with them a while longer. ", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "181": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487367482, "Score": 1, "Body": "I'm asking myself that question more and more. But I've been working in higher education for 25 years, so....", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "182": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487369727, "Score": 2, "Body": "I have worked full time through all my degrees (except BS)", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "183": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487370142, "Score": 4, "Body": "I don't really give a shit what you would do. I already have a career", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "184": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1487370462, "Score": 2, "Body": "Pretty sure 5 degrees shows an incredible amount of focus on self development.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "185": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487370799, "Score": 1, "Body": "Thanks, and I tend to agree.... If all degrees are in the same general field then there is no lack of focus", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "186": {"Subreddit": "PhD", "Author": "garrix94", "Date": 1487376081, "Score": 1, "Body": "and what about the other 82% haha", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "187": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487379019, "Score": 1, "Body": "They're doing fine... eve,n though their dreams didn't come true. ", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "188": {"Subreddit": "PhD", "Author": "rhendricks100491", "Date": 1487385119, "Score": 1, "Body": "It's definitely for me - which is such a privilege to be able to say. I finished undergrad and knew I had so much to learn still, especially research questions that I wanted answers to. Now in my fourth year, I know I continue to become a better thinker. I've gained so many reading, communicating, and problem solving skills that I feel confident will make my life better regardless of where I end up. \n\nAnyone else working on a PhD feel like you have improved the way you think (in ways that might be hard to objectively measure)?", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "189": {"Subreddit": "PhD", "Author": "rhendricks100491", "Date": 1487385446, "Score": 2, "Body": "I agree (I can identify really strongly with your situation). I think when it starts to get in the way of your non-academic life like your marriage and family plans, you need to go to someone else (I'm assuming you've tried to be blunt with your advisor without success). \n\nAnother potential resource is talking to your advisor's former students - they may have faced similar issues and might have advice to offer - things they did or said that did or did not work.\n\nSeriously, wishing you the best of luck - it's a really hard position to be in. ", "Permalink": "https://www.reddit.com/by_id/t3_5u8xub.json"}, "190": {"Subreddit": "PhD", "Author": "MauriceChevalierEh", "Date": 1487387232, "Score": 3, "Body": "I love working in museums and need to make my resume more competitive. At the moment I have had a number of consecutive short-term contracts and really want to keep doing this type of work. Ultimately I want to work doing a combination of academia and museum work. ", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "191": {"Subreddit": "PhD", "Author": "garrix94", "Date": 1487392039, "Score": 1, "Body": "what're they \"doing\"", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "192": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487428681, "Score": 1, "Body": "Professionals in public sectors, educational developers or researchers in universities, lecturers, private sector research or professionals, etc. They do what most university graduates have access to in terms of jobs but usually with higher responsabilities and wages. ", "Permalink": "https://www.reddit.com/by_id/t3_5uegnb.json"}, "193": {"Subreddit": "PhD", "Author": "mind_numbing", "Date": 1487436885, "Score": 5, "Body": "Wouldn't the dept. be happy that they have all these spare funds now that you are employed?\n\nIf you don't intend to work in academia, isn't it better for everyone that you join industry sooner than later.\n\nAlso, work experience would look better on your CV when you find a good job at the end of your PhD. Just my 2 cents, have been in a similar position myself.\n\nSpeak to your adviser about your goals and reassure your commitment to theirs.", "Permalink": "https://www.reddit.com/by_id/t3_5ut2p8.json"}, "194": {"Subreddit": "PhD", "Author": "zhanggar", "Date": 1487437631, "Score": 1, "Body": "Some faculty were concerned that I was not going to finish or be less likely to finish if I wasn't on campus like I wasn't committed to the program anymore. I believe one person had refused to serve on my committee. My adviser is fine with it though. ", "Permalink": "https://www.reddit.com/by_id/t3_5ut2p8.json"}, "195": {"Subreddit": "Playful_PhD", "Author": "Flat_Sixx", "Date": 1487458254, "Score": 1, "Body": "****grins****\n\n✋💥✋ ....... 🍺😚", "Permalink": "https://www.reddit.com/by_id/t3_5uutn6.json"}, "196": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1487463206, "Score": 1, "Body": "I think you need to not worry about pragmatics and realise what you really want. Then, the path will be abundantly clear. ", "Permalink": "https://www.reddit.com/by_id/t3_5ut2p8.json"}, "197": {"Subreddit": "PhD", "Author": "mind_numbing", "Date": 1487476862, "Score": 1, "Body": "As long as your adviser is fine, that's the only thing that matters, imo.", "Permalink": "https://www.reddit.com/by_id/t3_5ut2p8.json"}, "198": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487511140, "Score": 4, "Body": "Accept the first and wait for the second one to give you some assurance. You can always unregister, can you?", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "199": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1487521451, "Score": 3, "Body": "Can you transfer to another institution? See if your supervisor has collaborators. I too was in a very similar situation for my undergrad and my work suffered. Now I'm not there anymore I'm thriving. Feeling happy is a very important thing in work, life and love. If you're a sad person, you will isolate yourself, chicks won't want to be with you and it's just a vicious circle. I'd say go somewhere else or try to expand your social circle, which I know can be very difficult. Find a house share maybe and move in with some new people", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "200": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1487534864, "Score": 4, "Body": "This is a really tough one, really tough. From my experience, anybody that has attempted to do a PhD without funding has found it very very difficult, though it can be done (part time, grant searching, and continually applying to AHRC and the like). \n\nSomeone else offered advice of taking the first, and waiting to see what happens with the London Uni. That is what I would do as well. \n\nHaving said that, if you have stable income now, and want to trust in the universe that the funding will come through, then wait - but I certainly wouldn't hold your breath on funding. It is VERY competitive, especially in London. \n\nNo matter how good a candidate you think you are, there are more than likely a host of equally, if not more, qualified candidates. ", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "201": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1487565366, "Score": 2, "Body": "Your uni is not in London I suppose? \n\nI'd say accept the first offer, the only one you have. And then build your thesis into a collaboration with the London Institute? If you've got a good relationship with those people they should understand that funding is scarce and it's only logical you go where the money is, + that your research is valid (since they agreed to work with you in the first place). Surely the London institute is publicly funded and as long as they're thoroughly credited they'll agree sharing their data with you.", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "202": {"Subreddit": "PhD", "Author": "gand-me-ungli", "Date": 1487568985, "Score": 2, "Body": "Go where the money is.", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "203": {"Subreddit": "PhD", "Author": "tacofixestanks", "Date": 1487582060, "Score": 2, "Body": "Say yes now. You can say no later if the London funding comes in. Don't do self-funded. You will end up with a debt you will never be able to pay off on your future amazing humanities ECR salary. Source: ECR in humanities working three jobs and still earning under £20k a year. Did a partial funded PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "204": {"Subreddit": "PhD", "Author": "robocaller", "Date": 1487584395, "Score": 2, "Body": "One in the hand is worth two in the bush. \n\nI started a PhD without funding for two semesters and was working and it was very very difficult. When I found out there was s funded position at a partnering institution, I applied, was accepted, and jumped ship. I'm better for it now. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "205": {"Subreddit": "PhD", "Author": "scientits2", "Date": 1487593811, "Score": 2, "Body": "Absolutely agree with the others that have said to accept the first and wait on London. I wouldn't take a chance on a non funded PhD. It could easily affect the length and productivity of your PhD work.\n\nIf the timeline on determining funding is short you could also ask for an extension on accepting the first offer. I was able to do this while waiting to hear from programs I was waitlisted in. ", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "206": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1487617133, "Score": 1, "Body": "Why? Bachelors, Masters, PhD. Anything else is overkill", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "207": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1487617770, "Score": 1, "Body": "BS, 2 different MS, professional doctorate, now academic doctorate", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "208": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1487618636, "Score": 1, "Body": "What field?", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "209": {"Subreddit": "PhD", "Author": "ReddRepublic", "Date": 1487622173, "Score": 1, "Body": "I find that I am massively better at brainstorming / organizing thoughts on paper than I am typing them. I also remember writing course summaries as an undergrad to memorize stuff for exams, which worked very well for me. For literature, I write notes on the printed paper itself but also work with a reference database (Mendeley for me). The best of both worlds.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "210": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1487624792, "Score": 3, "Body": "Personally, writing stuff by hand definately better for learning, but if it's notes that you will need to reference at a much later date, type them up so that a) you can easily search them, b) copy pasta them into your thesis should they be relevant", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "211": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1487630723, "Score": 1, "Body": "Highlight in PDF -&gt; notes in Google Docs -&gt; notes in Zotero (-&gt; forget 99%) works for me.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "212": {"Subreddit": "PhDResources", "Author": "LeonPoole", "Date": 1487630951, "Score": 1, "Body": "In the past few days, the largest web archive of scholarly journals with clear indications of malpractice and predatory strategies was taken down with no explanation, as reported by Editage:\n\nhttp://www.editage.com/insights/bealls-list-of-predatory-publishers-and-journals-no-longer-available\n\nThe website, widely known as Scholarly Open Access (scholarlyOA), was maintained by Dr. Jeffrey Beall. Below, we explain why this is important to everyone (not only scientists!), and how the community could create and maintain a new archive based on technology that is free and minimally resilient to (possibly) attacks from parties with interest in this business.\n\n\n**Why is this important?**\n\nScientists learn from their first day on the job that anything they say will be scrutinized, reviewed, criticized. The whole point is to construct on top of previous knowledge. To make this work, scientific journals are peer-reviewed: upon a submission, peers review all claims made in a paper and evaluate whether the arguments presented are convincing.  This guarantees that any scientific paper published in a peer-reviewed journal has a minimal standard of quality. One of the problems with this system is that it costs money, and thus papers are usually made available behind a paywall. A little over than a decade ago, some people started to question why science should be behind a paywall, especially given that most of it are created by publicly funded institutions and projects. It was the start of the (peer-reviewed) Open Access Journals, which charge institutions and authors for publication fees, and then make scientific papers free to download.\n\nThis also ignited the emergence of journals with low standards, promising certainty of publication in exchange for a fee. Often, the peer-review process of such journals is, to say the least, questionable. In extreme cases, some publishers would use names that resemble those of reputable journals and try to fool some researchers. We refer to such practices as \"predatory.\" This practice not only harms the ideal of how science should be conducted, but also creates uncertainty as to which papers can actually be trusted when you are conducting your research.\n\nThis is what motived Dr. Jeffrey Beall in creating the Scholarly Open Access (scholarlyOA). As the good scientist that he is, Dr. Beall did not simply present a list of journals that he believed were predatory open access publishers; he also published, for each entry in his list, a blog post containing all the information that led him to believe that the journal or publisher should be on that list. Also, comments were open to everyone, and in many cases, people would either contribute with more evidence or explain and refute the presented evidence. In other words, this was a joint effort of a large scientific community. It is also worth commenting that, at least in a few cases, journals were removed from the list after observing an improvement from the publisher's end.\n\nEvidence is what drives scientists, and transparency is what makes a claim trustworthy. By presenting users with the evidence that would characterize a journal or publisher as predatory, scholarlyOA was leaving up to the scientists the final decision of trying to publish or not in the journals listed. It has not been confirmed that there were threats, or by whom. It is hard to believe, however, that the website would be removed without any notice to the community. Regardless, Editage reports that it is unlikely that scholarlyOA is changing host or being moved somewhere else.\n\n\n**How can we have a free web archive resilient to third-parties attack?**\n\nWe want to propose a method by which a project similar to scholarlyOA could be created and maintained by the people. From here on, we will use the term \"publisher\" to refer to both publishers or stand-alone journals. Here are the keystone aspects for such a system to work:\n\n* Maintainers must be anonymous.\n\n* Anyone, anywhere, must be able to replicate all records at any time, and be able to save a copy of the entire website locally.\n\n* For each candidate publisher to be included in the list, there must be an associated Evidence Page in which evidence is recorded.\n\n* Both evidence in favor and against the journal may be added to the Evidence Page.\n\n* Each evidence must be indexed by time. Records cannot be deleted, even. If anything changed, the change should be logged.\n\n* Anyone should be able to submit their evidence to the Evidence Page of all publishers; a code of conduct and ethics should apply.\n\n* Public comments should be allowed; a minimal code of conduct and ethics should apply.\n\n* Although numerical scores could be used, the ultimate decision whether to include the journal or not in the final list should be made by the maintainers.\n\n* In the actual list, it must be crystal clear (i) that the list represents probable predatory publishers and (ii) where the Evidence Page is for each record;\n\n\nBased on these guidelines, we believe that most of the key features from scholarlyOA will remain. Given that such information will be created by the community - and to the community -, replication of the data (second item) will likely ensure that the project is not discontinued (unless nobody is interested). And the anonymity of the maintainers, given the current level of security provided by privacy software, will likely mitigate possible lawsuits. In the event of a maintainer(s) being compromised, however, others could emerge.\n\nTo implement this idea, there are free options available that would satisfy all conditions above. We provide a few points below as to how.\n\n* Instead of using a hosting service, maintainers could create a git repository (e.g. on GitHub). Almost no knowledge will be required from users, as the web interface of all git services now provide embedded text editors.\n\n* No prior knowledge should be assumed from the users. In this regard, using a git repository seems ideal. All the webpages could be stored as markdown documents. Most git web services render markdown to HTML automatically.\n\n* In this sense, the actual list could be a file, and each associated Evidence Page would be a file linked from an entry of the list.\n\n* Anyone would be able to contribute to this archive by using Pull Requests. Because most of the git services hosted on the web do set up Pull Requests automatically, this does not require any prior knowledge from the users.\n\n* Issue tracking services can then be used to keep track of discussions related to any claim against a publisher. Github, for instance, has this feature implemented for free.\n\n* By cloning the repository, any user would be able to replicate the\n  entire website, including all evidence for each entry in the list.\n\n* Comments could be made in the Pull Request which originally added the publisher to the list. Alternatively, an Issue could be opened in the git project web page for each publisher, and comments would be added to the corresponding Issue.\n\n\nIn the idealized model presented above, even if the archive is shut down, anyone who has cloned the repository will be able to re-upload it. If GitHub is forced to block our repository by some legal decision, it might be sent to another git web host, or even to a self-hosted solution inside a Tor hidden node.\n\nAlthough comments in Issues or Pull Requests are not copied by cloning repositories, tools that backup all such data already exist, such as https://github.com/ejmr/save-github-issues.\n\nMirrors of the repository could also be created. In other words, this structure creates an inherently decentralized system from the start.\n\n\nWe hope people appreciate the importance of an archive such as scholarlyOA. If you have other ideas, better ideas, critics, then please comment. If you want to implement this, comment. Maybe this can go somewhere. But it will depend on all of us.\n", "Permalink": "https://www.reddit.com/by_id/t3_5uxpzt.json"}, "213": {"Subreddit": "PhD", "Author": "lcrc2016", "Date": 1487635058, "Score": 3, "Body": "LOL", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "214": {"Subreddit": "PhD", "Author": "lcrc2016", "Date": 1487635811, "Score": 3, "Body": "To get visa to stay in Europe for many years... and get the cool PhD.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "215": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1487643244, "Score": 1, "Body": "Writing stuff by hand makes me remember it however it's rarely worth the time compared to typing it up and just studying it.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "216": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487644630, "Score": 1, "Body": "Handwritten notes are best for me. I tried digital annotations of work but I found it harder to keep track of. When I handwrote notes in books and on articles, I somehow visually remembered it. I'd remember where I wrote it on the margin (e.g. top) and I'd flip through the pages until I found it.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "217": {"Subreddit": "PhD", "Author": "alnumero", "Date": 1487644763, "Score": 2, "Body": "Research shows that writing things by hand always leads to better long-term retention, and I've found this to be true as a graduate student (4th year ABD here). I, personally, really like writing in the margins of my articles and really messing them up. Just helps me visualize the information better.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "218": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1487645284, "Score": 12, "Body": "ONE OF US!! ONE OF US!! ONE OF US!! ONE OF US!! ONE OF US!! ", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "219": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1487645390, "Score": 1, "Body": "As somebody else mentioned Zotero all the way.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "220": {"Subreddit": "PhD", "Author": "bharathbunny", "Date": 1487645624, "Score": 1, "Body": "I was an under achiver in school, but I have always loved to learn. I worked as a software dev for a bit, but I was miserable. A PhD was the only choice that made sense to me, and it has made me quite happy.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "221": {"Subreddit": "PhD", "Author": "aussie_surfer_doctor", "Date": 1487654165, "Score": 1, "Body": "Lack of a better idea. ..seriously. ..", "Permalink": "https://www.reddit.com/by_id/t3_5e5oa2.json"}, "222": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1487664360, "Score": 2, "Body": "My project is in a high impact and undeveloped area of physical sciences. The PhD is interesting in that respect, but also gives me a ton of transferable skills alongside the qualification itself through training events, teaching etc.\n\nOverall, it ticks the box of being both interesting in the present, and useful for the future.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "223": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1487671183, "Score": 2, "Body": "I would accept the offer with the funding.\n\nIt's very unlikely that the benefits of the other position will outweigh the stress associated with self-funding. Funding is incredibly competitive and sometimes down to sheer luck (it's bad enough in the sciences).\n\nAlso, consider that there is a difference between 'getting on well with' and 'working well with' a supervisor. The former doesn't guarantee the latter.\n\nYou're right, the London position may allow you to grow in different ways. But I would argue that the largest contributor to your growth is simply completing the PhD.\n\nFinally, I'd jut like to mention that I have three friends who ended up declining job offers for the hope of waiting for something better. That 'better' thing never became possible (due to lack of funding, someone else getting the job etc), and all three deeply regret their decisions.", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "224": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1487671793, "Score": 1, "Body": "I guess it depends on what you're writing your notes for.\n\nFor example, if you're running models on a computer and noting down your observations, it's really nice to be able to cut and paste diagrams into a program such as OneNote or EverNote.\n\nFor papers, my personal preference is on the computer, because you can search, re-arrange, and cross-reference much more easily. It's sometimes nice to write a 'crib sheet' of notes for something important though. For example if there's an experiment you're going to conduct, having your entire method of conducting and analyzing on a side of A5/A4 is second-to-none. Especially if you can pin it up where it's easy to see!\n\nReading printed-out papers is nice, and it may be easier to write notes on that paper as you go along. Just remember that those notes need to eventually wind up on a computer.\n\nIf the unlikely event of having to prove you've done your own work comes up, it's magnitudes of order better to have a digital copy of everything you've done. Although, you can always scan everything in, too.\n\nOverall, it really depends on what you intend to do with your notes!", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "225": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1487672526, "Score": 2, "Body": "A bit late, but thought I'd reply anyway. \n\nFirstly, you can't work yourself too hard or it will almost certainly burn you out, make sure you have a good work/life balance and make sure you give yourself enough time and energy to pursue your other interests. There will be times when you will be working ridiculously hard to get something finished for a paper/conference, go to test beams (depending on your field) etc, but don't let this become the norm.\n\nAlso I was lucky enough to work in a large group, but still you need to speak to people outside your field at some point. What really helped me was joining a student society, you should be able to find one that is happy with head students and it's a great day to meet new people and take your mind away from work, just look for some activity you are interested in and join.", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "226": {"Subreddit": "PhD", "Author": "sedermera", "Date": 1487678620, "Score": 2, "Body": "I wanted to continue doing research in a similar environment as I'd been in the two years before. I had met PhD students and they were my heroes, I wanted to be like them.\n\nLooking back, I don't think I'd make the same decision again. Getting into a PhD did not turn me into the people that I admired. Instead, they had special qualities from the beginning that made them succeed in their PhDs without sacrificing their health.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "227": {"Subreddit": "PhD", "Author": "Shellout", "Date": 1487679076, "Score": 1, "Body": "Well done, \n\nI'm prepping for an interview about my project (why the uni should accept me onto the course, is their money going to good value etc.) so I'm right, right, riiiiiiiiiight  at the other end (beginning) of the process. \n\nCongrats, (Dr?)", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "228": {"Subreddit": "PhD", "Author": "AphroditeAnadyomene", "Date": 1487691437, "Score": 2, "Body": "Thank you for your advice. My thoughts have been leaning more towards accepting the fully funded position since posting this while I panicked. It's a great chance, they're willingly investing in me, and waiting for a mythical \"better\" may ruin that opportunity. I did also forge good contacts with people within that London department, it doesn't seem unlikely that I could still be in touch and get feedback. ", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "229": {"Subreddit": "PhD", "Author": "yourewelcome_bot", "Date": 1487691440, "Score": 1, "Body": "You're welcome.", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "230": {"Subreddit": "PhD", "Author": "hamstercide", "Date": 1487691493, "Score": 1, "Body": "Congratulations", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "231": {"Subreddit": "PhD", "Author": "AphroditeAnadyomene", "Date": 1487691595, "Score": 1, "Body": "Hmmm, I'm very grateful for all these thoughts - thank you so much for taking the time to share your insights. The initial panic having settled, it's sunk in a little more that this uni is investing a lot - London won't run away. Now, or later in case their conclusion is negative. ", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "232": {"Subreddit": "PhD", "Author": "__your__name__here__", "Date": 1487692322, "Score": 2, "Body": "You can definitely ask the professor to put you in touch with their current students. For your second question, you can ask the current students in the lab since they will be able to tell you how often they have meetings, how often the professor in around, what hours they typically work, etc. If you feel comfortable you can also ask other grad students not in that professor's lab, since the professor's students may not want to tell you anything bad in case it gets back to their boss. If that professor has a reputation for being awesome or terrible, other students may be more willing to let you know.", "Permalink": "https://www.reddit.com/by_id/t3_5v6eg9.json"}, "233": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1487693532, "Score": 1, "Body": "Oh, my, so there is life after viva... \nThanks and conratulations!!", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "234": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1487697703, "Score": 1, "Body": "Well, that's another really good point. Your connections to the other university don't need to disappear if you take the funded position. Anyway, I'm glad you are panicking a bit less (don't worry it's normal!), all the best on your PhD journey!", "Permalink": "https://www.reddit.com/by_id/t3_5uxtgt.json"}, "235": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1487710489, "Score": 0, "Body": "Get a job! \n", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "236": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487733235, "Score": 1, "Body": "Already do. I worked full time while being full time in the program (2 classes/term for us). I'm eager to respond to the challenge from my committee: \"Your doctorate really gives you the opportunity to make changes in your community. Go do it!\"", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "237": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487733256, "Score": 1, "Body": "So far that life has been napping and pizza. So...not that much different from what I did before.", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "238": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487733261, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "239": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487733307, "Score": 1, "Body": "Thanks! (Yes, Dr.). Good luck with your interview. Academics like to have a mentally stimulating conversation. I'm sure you'll give them that when you interview. The path may look long, but you'll be at the end of it before you know it!", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "240": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1487733328, "Score": 3, "Body": "I was told there would be a welcome gift basket? Or is that the letter I received from my student loan provider?", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "241": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1487736447, "Score": 1, "Body": "I am in my final months and trying to finish my phd. Loneliness and isolation are pretty standard feelings for me now and have been in the past. I talked to my therapist about this a few weeks ago. I have a really supportive live in boyfriend and I was sharing with her that I don't feel like he gets it and she said he didn't. It's true. There is physical loneliness but the process is isolating. It's just a weird existence. Not many people get it. The best thing I can offer is that it is temporary. What helped me was to volunteer in the community with homeless kids. It was the one thing that got me out of my head. It was a place that I felt like I wasn't defined by my academic work and was truly in the moment. This was helpful in getting me connected with something that made me feel more grounded. ", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "242": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1487736961, "Score": 1, "Body": "I should add that the beauty in volunteering with them is that they didn't understand the stress and nonsense of academia. Granted their world is a tough place too but that gave me perspective. And the real joy was in doing stuff like art and music and playing basketball or just talking to them about their crushes in school. I still do it and it has probably saved me from self combustion.", "Permalink": "https://www.reddit.com/by_id/t3_5uiffm.json"}, "243": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1487737472, "Score": 1, "Body": "I can relate to it all. Delays, micromanaging, contentious relationships and crippling anxiety and my feeling unable to be an adult and the meltdowns. I can't say I have figured it out. I am months from defending my phd and i am in this same boat again. What has helped in the past for me is that there are parts where i have to choose to push back and there are times when I have to accept things and realize I will drive myself crazy trying to make things happen. I wish things happened differently but I am ok with where I'm at. Be lucky you got married and are thinking about having kids. This process saw me through my late 20's and 30's although I took a break to work for a few years. I am now 41 and ready to rip my hair out. It's ok though. You'll be ok. You are an adult it's just doing a PhD is an insane endeavor and it makes you insane. If it wasn't so insane, more people would do it.", "Permalink": "https://www.reddit.com/by_id/t3_5u8xub.json"}, "244": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1487738188, "Score": 2, "Body": "I am leaning towards not referring to it in writing, specifically when applying. I am not an expert on this by any means but I am too in recovery and suffer from bipolar and am working on finishing my phd by the skin of my teeth. I had some issues over the years (relapse) and was hospitalized a few times in 2012 for a manic episode. I feel like these things are things that you can discuss with advisor, graduate chair, psych services, counselors, etc as needed as they are then protected by HIPAA and FERPA. My first reaction is to hold off on this but I am not sure why or how to approach it. Let me give it some thought. It is past my bedtime (what else is new.) Let me chew on it. Also feel free to PM me in the meantime. \n\n\nAlso, way to fricken go. ", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "245": {"Subreddit": "PhD", "Author": "chiaratara", "Date": 1487738614, "Score": 2, "Body": "I had the kicked out of high school and barely graduating and then almost failing out of college and then making a turn around through a MA degree followed by a A\"suspicious\" period in my mid to late 20's. \n\nThe person who talked about it in their personal statement, I am curious as to whether the personal statement for the MSW might encourage this sort of disclosure. Tying in personal experience/personal narrative to the field, interests, areas of interest, etc.", "Permalink": "https://www.reddit.com/by_id/t3_5tbaxf.json"}, "246": {"Subreddit": "PhD", "Author": "RhymeSpit", "Date": 1487741689, "Score": 2, "Body": "haha, don't worry a B in E&amp;M won't kill your chances for grad school admissions. \n(1) You'll have many more classes to get A's in and those will be more important.\n(2) Grades don't matter nearly as much recs and research experience for grad school.\n(3) If you go to a top STEM school in the states, top PhD Astro programs will recognize the difficulty of the school and will probably give you some leeway with that GPA thing. \n(4) I know it may seem like the end of the world when you do poorly on an exam in college, but it really doesn't matter. Taking it pass/fail would be more of a red flag to admissions committees down the line and withdrawing is kind of extreme if you're only doing it because you want an A instead of a B. Just stick with the class and do your best, mistakes happen bud.", "Permalink": "https://www.reddit.com/by_id/t3_5vgmxo.json"}, "247": {"Subreddit": "PhD", "Author": "Shellout", "Date": 1487757182, "Score": 1, "Body": "Thank you. On the tram to the uni now! Time to get intellectual!  ", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "248": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1487765371, "Score": 2, "Body": "Haha. I thought this as well but there are many, many, many areas of research still available. I've been doing my phd for a year and I have come across at least 10 different other potential phds; through doing the lit review.", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "249": {"Subreddit": "Playful_PhD", "Author": "LawyerDaggett", "Date": 1487765476, "Score": 1, "Body": "Free the nipple!", "Permalink": "https://www.reddit.com/by_id/t3_5o6qzo.json"}, "250": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1487765724, "Score": 5, "Body": "There are holes and new grounds for business. I'm doing my PhD in computer systems, so lots of new ground there, but my mum is doing hers in international business looking at Western small to medium sized enterprises establishing themselves in China and the challenges they face.\n\nPhD's are such a tiny piece of human knowledge that you will find the limits of knowledge and push them out a *little*.", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "251": {"Subreddit": "PhD", "Author": "carnivorous689", "Date": 1487766425, "Score": 5, "Body": "Well.. All PhDs are equal but some PhDs are more equal than others", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "252": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1487768719, "Score": 2, "Body": "Buyers get plenty of it ;)", "Permalink": "https://www.reddit.com/by_id/t3_5o6qzo.json"}, "253": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1487783709, "Score": 1, "Body": "Business research is very much alive and blooming. However when you do a PhD in Business you would be choosing a specific area of business (ie. management, marketing, accounting or finance) and then within that area, you would have to choose a sub-discipline. So the scope of what you're studying as a PhD in Business Administration is not nearly as wide as what you would study at the undergraduate level.  \n  \nWhat kinds of research is being done?\n  \nPick up an issue of Harvard Business Review and pay special attention to the articles written by professors. Those would give you an idea of what is being researched. Then, if you find it interesting, look up the source for the original research article (HBR summarizes research findings for non-academic audiences). ", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "254": {"Subreddit": "PhD", "Author": "bwc6", "Date": 1487789925, "Score": 8, "Body": "Here is a different way of thinking about it that might be helpful: Physics and chemistry will never change. Once you make a discovery, it's discovered forever. Even biology takes hundreds of thousands of years for slight changes to occur. In business, there can be huge changes to the field in one person's lifetime. For example, how do you manage a private spaceflight company? Nobody was even asking that question 50 years ago. Because of the ridiculous pace of technology, there will be new markets appearing *by the time you graduate from college.*", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "255": {"Subreddit": "PhD", "Author": "codphd", "Date": 1487792632, "Score": 1, "Body": "My Business PhD focusses on Marketing; particularly consumer perceptions of Autonomous Vehicles and how the technology might diffuse in to the marketplace. I'm rather excited with where that research could take me in terms of a future career. I'd say Business research is well worth doing!", "Permalink": "https://www.reddit.com/by_id/t3_5vhz9u.json"}, "256": {"Subreddit": "PhD", "Author": "Shatana_", "Date": 1487800134, "Score": 2, "Body": "But I bet the pizza was better not being spiced up with dread and guilt =) ", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "257": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1487835244, "Score": 1, "Body": "Also, I'm a huge dork (duh, PhD!)- and I love alliteration. No shame about it!", "Permalink": "https://www.reddit.com/by_id/t3_5vp4s2.json"}, "258": {"Subreddit": "Playful_PhD", "Author": "igauna7", "Date": 1487862755, "Score": 1, "Body": "Great ass!", "Permalink": "https://www.reddit.com/by_id/t3_5unkdq.json"}, "259": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1487862801, "Score": 1, "Body": "Why thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5unkdq.json"}, "260": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1487890004, "Score": 1, "Body": "Don't worry at all about a \"late\" start to a phd. Lots of people don't get around to doing them immediately after their degree. From what I've seen, it's a 50/50 split (in my lab at least) of people who started immediately after uni and people who were in industry.\n\nWe have quite a few older students too (like in their 50's). They're just as good and there's really no shame or a problem that they've started *late*. It isn't a race. Make use of the time while you're not studying, pick up some skills, and who knows how handy they'll be when you actually get accepted!", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "261": {"Subreddit": "PhD", "Author": "Kagemand", "Date": 1487891723, "Score": 4, "Body": "Might not be relevant because I'm in Europe, but in my country I don't think you will get to defend unless they are going to grant the degree. You would have to basically rick-roll and nothing else at your defense to get it rejected by then.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "262": {"Subreddit": "PhD", "Author": "peri_neuronal", "Date": 1487894495, "Score": 2, "Body": "Hey! \n\nI really wanted to answer you on this one, because what you're going through sounds so close to where I was a few years ago. \n\nDuring my masters, I applied for funding for a project which was an amazing fit - I was already working in the lab group, they'd all given me such great support, and I loved the project. I didn't get the funding for the project, and I was absolutely devastated at the time. \n\nI was really upset for a quite a long time, and felt like everything was slipping away from me. I frantically applied for projects which 'sort of' fit the bill, but weren't anywhere near perfect. I was shortlisted for a few, and even interviewed for one - again, I was unsuccessful. \n\nI thought it was all over for the PhD dream. I just focused all my efforts on finishing the masters, and came out with a distinction. \n\nI started waiting tables and bar-tending for a while, and felt pretty directionless. Out of the blue, I found an amazing PhD programme which was a bit out of my comfort-zone but sounded amazing... So I just went for it. \n\nI got through all the interviews, and I'm now around 6 months into the programme. I have a few rotations at the start of the programme which have been an excellent way to gain lab skills, and through the rotations I've found a project which I've become more passionate about than any of my previous research projects. I just got accepted to undertake that project for the full 3 years. \n\nI didn't start my PhD until around a year and a half after my Masters, and while it's been hard work, I don't think it's anything you should worry about. If you truly want something, you'll manage. I've learned so much in these past 6 months and feel like I've achieved so much. I couldn't have dreamed I'd be capable of it while I was taking food orders and cleaning down tables. \n\n\nIt's a bit of a long ramble, but I just wanted to illustrate to you that you can absolutely find another project. At the time seems like the end of the world to be 'rejected' from something you thought was perfect. However, it's possible to find another project, one that fits you perfectly. \n\n\nDefinitely don't give up, I'm so thankful that I didn't. Keep going with an open mind. ", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "263": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1487894739, "Score": 8, "Body": "I'm in New Zealand. If you pass with minor (or major) corrections but they do not ask you to resubmit, then it just needs to pass the scrutiny of the elected person (usually your supervisor) who needs to understand what changes were required and if they've been met. If they have, then you're all good.\n\nMost will come away with minor corrections. If you need to do more than major corrections, then it's a failing not so much on you, but on your supervisor who should have picked up on it before submission.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "264": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1487920549, "Score": 2, "Body": "Out of nearly 30 students that began in my school when I did, five of us went straight from a bachelor's or master's degree. That's less than 20% (FYI, this is in natural and environmental sciences). Around eight started after taking a year or two out of studying and doing something irrelevant, and the rest (over half) had some form of experience other than a degree.\n\nThis is not a reflection of who applied. Around half the people I met on the interview day were intending to come straight from their first degree. I understand that I'm not able to quote exact numbers, but it was a noticeable proportion of people, compared to a minority.\n\nMy point is that it's not always a straight road, and actually seems to be the exception rather than the rule, in my school at least. I hope you're able to start seeing that what you're going through is normal; keep working and most importantly don't give up on your dreams. The only thing worse than not getting accepted, is knowing that you might have been.", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "265": {"Subreddit": "PhD", "Author": "Paloma_91", "Date": 1487953539, "Score": 1, "Body": "I don't believe so, as long as they are minor corrections. For my MA, I just had to send the revised version to my chair to ensure that I actually made the corrections. I assume it is probably a similar process at the PhD level.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "266": {"Subreddit": "PhD", "Author": "stephella", "Date": 1487960957, "Score": 1, "Body": "It really cheers me up to hear others took a similar way. All of my friends from uni who are interested in a phd-programme went there straigt (I've been the only one who had been rejected) - hearing I'm not the only one encourages me a lot to pursue my dream. Thank you for your kind words :)!", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "267": {"Subreddit": "PhD", "Author": "stephella", "Date": 1487961334, "Score": 1, "Body": "Thank you so much! Your post literally made me tear up. I have not expected to get an answer which is that supportive. As bad as it sounds, I am really glad to hear someone's going through this, too. I've felt really lonely as all of my uni friends went to different countries (I'm from Germany) and pursued their dreams. I have been the only one that got rejected from a program as I did not want to take place in the one provided by my chair. And all you ever read on the internet is how people got accepted. I'll definitely give it another shot. I really hope I'll manage to make it just like you did. I really have to thank you again! You kind of made my day by sharing you story!  ", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "268": {"Subreddit": "PhD", "Author": "stephella", "Date": 1487961548, "Score": 1, "Body": "Thanks for sharing! Every time I went through my uni's library all I ever saw were phd-students who were about my age now. I've never even heard of anyone starting their phd studies that late in their biography. I know times have changed but I always feel like I need to be really fast in reaching my goals to compete with all those other students around. May I ask what field you are working in?  ", "Permalink": "https://www.reddit.com/by_id/t3_5vshb8.json"}, "269": {"Subreddit": "PhD", "Author": "ReddRepublic", "Date": 1487961771, "Score": 1, "Body": "What field of study was that? With top grades you can always go for consulting, though I imagine that's not what you have in mind.", "Permalink": "https://www.reddit.com/by_id/t3_5vyigu.json"}, "270": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1487962003, "Score": 1, "Body": "If you are overqualified, try to lie about your PHD and simply don't include it into your CV, that might raise your chances.\nWhich field is your PHD in? \n", "Permalink": "https://www.reddit.com/by_id/t3_5vyigu.json"}, "271": {"Subreddit": "PhD", "Author": "Retro21", "Date": 1487963345, "Score": 1, "Body": "I think you know the answer already. 100,000 words is a lot, it's not easy and at times it is downright torture for the majority. ", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "272": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1487963610, "Score": 1, "Body": "I don't really know, especially that there are other options as well. I am also considering taking a one year course in conference interpreting. Not sure what would be good for me :( :( ", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "273": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487966494, "Score": 2, "Body": "Books?? No. It's all about scientific articles and the way you manage' those. You can't say anything that isn't backed up by literature. Phd is a school of compliance, not creativity...", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "274": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1487966822, "Score": 4, "Body": "Don't do it", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "275": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1487968121, "Score": 1, "Body": "Okay, not books, but articles, that is what I meant anyway.\nI am doing something similar with my masters, finding out something really small backed up by a huge body of literature from articles. ", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "276": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487970549, "Score": 2, "Body": "You will never regret earning a diploma... You might regret the road to get there. Especially if you fail. A phd is a lot of commitment... the real question is: what do you want to do when you grow up ? ", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "277": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1487972441, "Score": 1, "Body": "Well, if we look at it that way (BA, MA), it would already be my 3rd diploma. Well, the road there... It pays as good as a lower blue collar worker job, so not sure about regretting the path. I can quit at any time. I am just wondering how well I would do. Sure it is commitment, but atleast I would only have to focus on one thing, or more like, one subject, unlike during my BA (Russian language and literature, Finnish language and literature). But that really throughoutly. \n\nOh, please, do not ask that question.\nI like to be with people, I like attention, I love languages, I speak many of them, I enjoy speaking them, I am doing some translating and language teaching and I like it, and I love finding out about interesting things of linguistics. \nBut dunno, dude. :(:(\n\n(I'm 23.) \n\n", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "278": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1487973014, "Score": 3, "Body": "You're 23??? Do it! I'm 48 for Christ sake and halfway through my PhD. A PhD is research mainly. But at 23, please, please do it if you feel you are capable of. DO IT!!! You can blame me if it doesn't work out. Each diploma is an average increase of 10000$ a year in income. And the freedom if you ever work in academia !!! It will be painful but worth it. Believe me. I spent the last 25 years in higher ed... Come on... 23? Do it!!!", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "279": {"Subreddit": "PhD", "Author": "nightwica", "Date": 1487977293, "Score": 1, "Body": "Well, yes... I did bachelors 18-21, masters 21-23, and I'm graduating this summer. \n\nExactly, research mainly, and sitting in a library is fun for 2 days in a week, but not more, for my taste.\n\nThank you for your encouragement! :) \n\nAlso, garlic :3 ", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "280": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1487981039, "Score": 1, "Body": "I'm in the US, and the procedure at the two schools I know is to make the changes and send the revised dissertation document to the committee. Once they're happy they'll sign your page and you're done (deal with each committee member individually). No re-defense.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "281": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1487981155, "Score": 2, "Body": "So good to hear a positive story! I hope to join you soon on the other side. Good job!", "Permalink": "https://www.reddit.com/by_id/t3_5v9131.json"}, "282": {"Subreddit": "PhD", "Author": "gand-me-ungli", "Date": 1488010623, "Score": 1, "Body": "No.", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "283": {"Subreddit": "PhD", "Author": "br_shadow", "Date": 1488022859, "Score": 1, "Body": "PhD is not another diploma you get to be more competitive for a job, PhD is a life commitment and passion for an unanswered question only you can solve. You do not have the love for it. Don't pursue it.", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "284": {"Subreddit": "PhD", "Author": "drnasa", "Date": 1488040625, "Score": 1, "Body": "No re-defense in a pass with revisions. After you defend you're essentially done. I have to make a few minor revisions to my dissertation. But, all the paperwork has been signed off on (defense complete and signatory page). The committee notes the changes required on the approval form. My chair will verify when the revisions are done. No re-defense necessary! Just checking off some boxes on some forms.", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "285": {"Subreddit": "PhD", "Author": "pd-andy", "Date": 1488041511, "Score": 1, "Body": "Thanks for the replies everyone, it was just a nagging question I had!", "Permalink": "https://www.reddit.com/by_id/t3_5vtspi.json"}, "286": {"Subreddit": "PhD", "Author": "_________________--", "Date": 1488047883, "Score": 1, "Body": "- Freedom \n\n- Academia\n\nHmm.", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "287": {"Subreddit": "PhD", "Author": "jdorian112", "Date": 1488061521, "Score": 2, "Body": "ALWAYS pick an Advisor over a school/program for a PhD.  A bad advisor will make your life a living hell.  In more prestigious schools (since they have a higher applicant pool/demand), the advisors will treat you like shyt.\n\nTerrible advisors are what made me leave my PhD program\n\n", "Permalink": "https://www.reddit.com/by_id/t3_5u801d.json"}, "288": {"Subreddit": "PhD", "Author": "Panda-Sushi", "Date": 1488102544, "Score": 2, "Body": "I do both, however nothing works better personally in terms of retention that the physical act of writing. I keep notebooks and fill these with reflections, thoughts and questions that arise about anything PhD related, when i'm not sitting down to 'work'.\n\nWhen i'm at my desk notes go straight into my thesis document. You'll be amazed at how quickly you get your word count up, and imo it's easier to re-write rubbish than a blank page.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "289": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1488109775, "Score": 2, "Body": "Try finding some professors in the field and messagint them to see if they have a place/know someone who is offering a place, obviously you need to keep the funding situation in mind. If you on me I might be able to find something for you.", "Permalink": "https://www.reddit.com/by_id/t3_5w3xq7.json"}, "290": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1488136695, "Score": 1, "Body": "Yea I think I've decided to use Google Keep for quick notes/ideas that I can open on any cpu, and regular notes that I think will be relevant now or later for my thesis are all in a document. I tried writing and even though it did feel more interactive and I retained info a bit better, sifting through papers to find a note or carry around a binder with notes + a laptop started to bug me too much.", "Permalink": "https://www.reddit.com/by_id/t3_5v6sd7.json"}, "291": {"Subreddit": "PhDDs", "Author": "werr2333", "Date": 1488151045, "Score": 1, "Body": "[More](http://amateurandceleb.blogspot.com/2012/04/sarah-de-herdt-lab.html?zx=6c07a5cbb5956214)", "Permalink": "https://www.reddit.com/by_id/t3_5wd5jz.json"}, "292": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1488154021, "Score": -1, "Body": "No. ", "Permalink": "https://www.reddit.com/by_id/t3_5wc8rn.json"}, "293": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1488158805, "Score": 2, "Body": "I just read that some guy did (or is doing) his diss as a series of rap songs. [found it here](http://m.huffpost.com/us/entry/us_58ada717e4b03d80af710656)", "Permalink": "https://www.reddit.com/by_id/t3_5wc8rn.json"}, "294": {"Subreddit": "PhD", "Author": "freeze_inthe_breeze", "Date": 1488167848, "Score": 1, "Body": "Thats pretty cool! ", "Permalink": "https://www.reddit.com/by_id/t3_5wc8rn.json"}, "295": {"Subreddit": "PhD", "Author": "IvyChem", "Date": 1488169658, "Score": 5, "Body": "Go where you see yourself being happy, go with your gut.", "Permalink": "https://www.reddit.com/by_id/t3_5we90q.json"}, "296": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1488180160, "Score": 2, "Body": "It sounds like you're thinking about the PhD in a good way, in the sense that you're doing it in order to learn new skills for the future. That's a great start in your decision making process.\n\nWhere you live is important. Life isn't all about work, and there's something to be said here about enjoying your downtime. It's surprising how much a location can influence moods. You say it's 'shallow', but I personally disagree and think it's actually really important.\n\nThen again, so is your supervisor. Have you worked much with them? It's incredible how much a student-supervisor relationship can change over time, and it you'd be surprised at how willing some people are to listening to your needs (e.g. not being as hands on).\n\nAs somebody else has mentioned, you should listen to your gut, too. Whatever you choose, you'll always wonder if the one you didn't go for would have been better. And I can almost guarantee you'll think you've made the wrong choice at some point. Your gut will tell you which choice will minimise those feelings.\n\nMy thoughts are a little scrambled as I've just woken up. Let me know if you'd like any elaboration ☺\n\nEDIT: Would also like to mention that I had to choose between two projects at the same university. Hardest decision ever, but I went with the most interesting project that happened to have someone I work with well supervising it (stayed at the same university). Hope that helps!", "Permalink": "https://www.reddit.com/by_id/t3_5we90q.json"}, "297": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1488180622, "Score": 2, "Body": "4 best years of life for... I would say you've been incredibly successful for those years  in the sense you enjoyed your life 😀\n\nMy game plan is this case would be to volunteer doing something whilst applying. It gets you relevant skills whilst showing your commitment to hard work hasn't disappeared. It's not going to be easy (nothing worthwhile is ever easy), but you'll strike gold soon!\n", "Permalink": "https://www.reddit.com/by_id/t3_5vyigu.json"}, "298": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1488180890, "Score": 2, "Body": "Did you enjoy your previous academic projects? Would you enjoy them if they were ten times the intensity and with less guidance?\n\nThat's the question you should be able to answer 'yes' to.\n\nAlso, what benefits do you feel this PhD will bring to your life? Why would doing one enhance your future? All a PhD is, is the qualification that tells people you can do research at the highest testable level. Is that going to be useful for you in ten years?", "Permalink": "https://www.reddit.com/by_id/t3_5vz9dk.json"}, "299": {"Subreddit": "PhD", "Author": "Stinky_McCrunchyface", "Date": 1488198214, "Score": 6, "Body": "Listen to your gut. In my experience, and what I've witnessed around me, the most critical decision is the choice of advisor. ", "Permalink": "https://www.reddit.com/by_id/t3_5we90q.json"}, "300": {"Subreddit": "PhD", "Author": "DMass777", "Date": 1488201022, "Score": 1, "Body": "Depends is your Phd in a saturated field like biology or highly marketable field, if the former industry via consulting. I know people who have pursued law and  used that to become patent attorneys or consultant and it's only 3years. Hopefully that helps, good luck either way", "Permalink": "https://www.reddit.com/by_id/t3_5vyigu.json"}, "301": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1488215394, "Score": 1, "Body": "Yay, finally another PhD'er who wants industry! :)\nMe too. This is the perfect time for me to learn new tools and protocols.", "Permalink": "https://www.reddit.com/by_id/t3_5uleij.json"}, "302": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1488219155, "Score": 2, "Body": "There are a lot of important things you haven't mentioned here, such as: \n\n* where the grad students from the two advisors end up (industry? academia? government?  places you want to go?) and how that aligns with your career goals\n* how much the students of each typically publish before graduating (this will open or close a lot of doors to you, especially if you want to stay in academia!)\n* how much time you can / have to spend TAing in both.  \n\nI'd weight those pretty heavily along with what you describe as the \"shallow\" bits as well, since they have major implications for how valuable your PhD will be.  Obviously you can (for example) publish a bunch more than the people around you, but if you want to keep academia open as a possibility then there's no point on making it even more of an uphill battle than it will be anyways.\n\nOn the \"shallow\" side - of course it's great to live somewhere exciting, but really any place can be okay as long as you find the right friends.  This is probably easier in a city where more people are like you, but regardless of where you live it will ultimately depend on your willingness to get out there and be proactive about forming a good social life.", "Permalink": "https://www.reddit.com/by_id/t3_5we90q.json"}, "303": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1488225834, "Score": 1, "Body": "Gawddamn.\n\nYou are put together quite well :)", "Permalink": "https://www.reddit.com/by_id/t3_5wiyaj.json"}, "304": {"Subreddit": "PhD", "Author": "Felair", "Date": 1488233924, "Score": 2, "Body": "I'm late to the party on this one but here goes. \n\nIf you're based in the US then federal government is a great option. I'm working as an economist now and really enjoy it, though I only have a bachelor's. I just got accepted to an econ phd program and will start in the fall, plan to keep working while I do the phd and I will probably stay in the government after the phd.", "Permalink": "https://www.reddit.com/by_id/t3_5rffc0.json"}, "305": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1488242626, "Score": 1, "Body": "Yeah, that's definitely my highest consideration. I got along great with the mentor from Choice B, and I have my interview weekend with Choice A this weekend so that should hopefully clear up any questions I have regarding that mentor. I wish my gut had a instinct-to-English translator, though -_- The next 5-6 years of my life is too important to screw up!", "Permalink": "https://www.reddit.com/by_id/t3_5we90q.json"}, "306": {"Subreddit": "PhD", "Author": "N140067", "Date": 1488257583, "Score": 2, "Body": "Congrats! ", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "307": {"Subreddit": "PhD", "Author": "voodoovibe", "Date": 1488259208, "Score": 3, "Body": "Thank you. It's a relief more than joy, especially after being pilloried for 2 hours.", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "308": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488261511, "Score": 2, "Body": "If your one direction is that you want to be a tenured professor then it's going to be very hard to finish a PhD in one thing and then get a tenure-track position in another. There is some wiggle room but it's normally to do with using skills you learnt in your PhD. The issue is that less than a percent of people get tenure track positions, if someone applies for a position within a field they have experience in then they look like a better candidate than you.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "309": {"Subreddit": "Playful_PhD", "Author": "Playful_PhD", "Date": 1488266448, "Score": 1, "Body": "Thanks! ", "Permalink": "https://www.reddit.com/by_id/t3_5wiyaj.json"}, "310": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1488271864, "Score": 2, "Body": "Congratulations and good luck from here!", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "311": {"Subreddit": "PhD", "Author": "Systemofatown", "Date": 1488283948, "Score": 2, "Body": "Awesome! Remember to spoil yourself a bit and be proud of your achievement. ", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "312": {"Subreddit": "PhD", "Author": "FreebaseMcGee", "Date": 1488288026, "Score": 2, "Body": "That's a bummer. My defense was more of an intense conversation that it was an actual exam. Glad it went ok though. ", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "313": {"Subreddit": "PhD", "Author": "voodoovibe", "Date": 1488294452, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "314": {"Subreddit": "PhD", "Author": "voodoovibe", "Date": 1488294476, "Score": 3, "Body": "Yea, most important that I survived. ", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "315": {"Subreddit": "PhD", "Author": "voodoovibe", "Date": 1488294523, "Score": 1, "Body": "Yep, bought some neat vape gear (I vape), and will be having some nice dinners this week with the wife. And then, starting next week, I start writing. ", "Permalink": "https://www.reddit.com/by_id/t3_5wlj3u.json"}, "316": {"Subreddit": "Playful_PhD", "Author": "gerchoc44", "Date": 1488296497, "Score": 1, "Body": "Yep!", "Permalink": "https://www.reddit.com/by_id/t3_5wiyaj.json"}, "317": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": 1488316725, "Score": 1, "Body": "Hi! Protein crystallography PhD here :)  \nComputational biomedical field, so are you creating new software? How did you learn to code? Were you interested in it before starting PhD or did you learn on the go?  \nHow did you decide to get into consulting and how did you go about it? What are you expected to do in your new job?", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "318": {"Subreddit": "PhD", "Author": "shakaman_", "Date": 1488317194, "Score": 1, "Body": "How'd you get your next job lined up ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "319": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1488317382, "Score": 1, "Body": "Yes, PhD is super specific. Once you pick your area, you'll stick in it, at least until you make tenure. If you have to change your area before you make tenure, it's going to slow you down in research output which might hurt your chances of making tenure.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}, "320": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488318945, "Score": 1, "Body": "Question 1: No - not creating new software. I apply math models to biological networks. I learned to code initially in undergrad under the instruction of a postdoc in my lab, but I was pretty much a beginner. My coding skills grew exponentially once I started graduate school and the expectation was that I code 24/7 . That being said, I only code in MATLAB, R, Python and a shell script. No super useful coding for software / app development like Javascript or Ruby. \n\n&amp;nbsp;\n\n\nI decided early into my PhD (3-4 months) that I didn't want to go into academia after watching classmates struggle to find labs, realizing how little $$$ I'd be paid and honestly, being pretty bored early on. (See the next comment for how I got my job lined up.) I'm using my quant skills and creativity to solve problems for big companies in my new job. There's a whole subreddit dedicating to explaining what consultants do.  ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "321": {"Subreddit": "PhD", "Author": "sanfrancisco1233", "Date": 1488319435, "Score": -1, "Body": "I made sure I had a kick-ass resume by having lots of real-life, OUTSIDE OF THE LAB experiences. These experiences made me stand out from other PhDs and also the droves of MBAs applying. Most other PhDs I knew who applied to consulting were President of their school's Biotech Club. That was the extent of their experiences. Only one of these PhDs that I personally know got a FT offer in consulting. She'll be starting at McK soon. (Actually- I cased with the president of our biotech club. He got final rounds, but didn't receive any offers).  I had a funded startup, a summer internship at a notable VC firm and a clear interest and knowledge of business. I got these experiences because I took the initiative to find them. That's the type of person the top firms want. A person who is smart (that's evident in the graduate work), but also a go-getter who steps outside the box to do something interesting. At the firm that I'm joining- I waltzed through my first round interviews ( of my two interviews- one partner didn't even give me a case. We just shot the breeze for 45 minutes). Second rounds were a little harder, but still a breeze, because I was given unusually easy cases. Also, being likable and chill was extremely important and not a trait many PhDs I met on the interview trail had. ", "Permalink": "https://www.reddit.com/by_id/t3_5wq6ov.json"}, "322": {"Subreddit": "PhD", "Author": "ecodan324", "Date": 1488323112, "Score": 1, "Body": "Could you tell us more about how you've linked communications to... Cognitive neuroscience? It's certainly a interesting background to have.", "Permalink": "https://www.reddit.com/by_id/t3_5wm8yn.json"}}