{"0": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1512087938, "Score": 2, "Body": "It depends what field you're in. My colleague in chemical engineering justified her research as being in a scale large enough to attenuate variations. I have a mate who's in computer-human interaction and she says they don't really need a lot of replicates before they can publish. I guess the general rule is you should align with most of the studies in your field.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dql2ojq/"}, "1": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512097509, "Score": 2, "Body": "Thanks for sharing your story too! Reading these stories online and connecting with other students on my campus has really helped me. Thankfully I pushed ahead with publications starting a few years ago so I'm not without pubs, just lacking depth and strength in my dissertation.\n\nI have actually been thinking, if I ever do become a tenured professor I'm going to try and start reforms to draw power away from the advisor. A few of my current ideas are\n\n1) get all students in a yearly cohort together regularly to discuss research goals and lab practices, and even have structured discussions about topics like ethics, authorship, etc. This way if someone's advisor is weird the student has some perspective and, bonus, students can't be forcibly isolated if they have to attend meetings.\n\n2) change the advisor-student dynamic into more of a committee-student dynamic. This also encourages the student to mature to an independent researcher faster since they have to balance committee members who probably have different opinions.\n\n3) regular meetings with dept head or perhaps an appointed professor-as-dept-ombudsman just to discuss directions and perspective.\n\n4) required training for all advisors. I'm talking minimal training that they don't even have now, like an hour a week for two months when they start, and then distribute literature. Like basic management styles/theory, what is abuse and what is appropriate, the importance of leaving a little bit of personal space with students, ethical guidelines that have been coded into law, like basic HR stuff that they would get as a mid level manager in a large company.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gpgek/great_summary_of_abusive_advisor_behaviors_to/dqlazdd/"}, "2": {"Subreddit": "PhD", "Author": "srcyball", "Date": 1512100912, "Score": 1, "Body": "Australia/sort of political science/public administration. 2 of them basically never get involved in, well, anything much. They were more relevant to what I proposed to do, but almost totally irrelevant to what I actually ended up doing. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fwz31/paper_writing_lot_of_errors_during_revisions/dqldvn7/"}, "3": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1512115911, "Score": 3, "Body": "Thanks for this! I've also had a fair few shitty people supervise my research.\nWhen I moved on from one supervisor and started pursuing my own research ideas I was so surprised that they weren't horrible ideas, as my spending had told me. \nI also had 2 kids during my phd, and all my supervisors were older men, so you can imagine how supportive they were about that...", "Permalink": "https://www.reddit.com/r/PhD/comments/7gpgek/great_summary_of_abusive_advisor_behaviors_to/dqlmo7j/"}, "4": {"Subreddit": "PhD", "Author": "Oedipurrr", "Date": 1512137721, "Score": 2, "Body": "The problem with publishing during my PhD was that he didn't even want to read my manuscripts if I didn't do exactly what he wanted (and what he wanted was unethical). And since it's his project (and not my own) I'm not allowed to publish without his name on it.\n\nI think it's great that you're thinking about what you would do differently. \nThe main problems in my experience seem to be: \n1) it's unclear what the rights and duties are of a PhD student (going from basic practical stuff - are we allowed vacation if our supervisor denies it? - to more content-wise stuff - what can we do if our supervisor pushes us to publish bad practices? ...) \n2) professors are only evaluated on the basis of their research output (and thus how much money they make for the university) and not on anything else (management, education, ...). \n\nWe actually do have some of the things that you name, but those committees or guidelines have no real power. For example, a yearly meeting with a guidance committee is obligated since a few years. I haven't had a guidance committee until a few months back. I've never had a meeting with my guidance committee and apart from my supervisors, there's only one extra professor in it (who's also a friend of my supervisors). My supervisor disproved everyone I suggested. Abusive supervisors will mostly find a way around those guidelines, unless you make them reinforceable. We also have a document with guidelines for a good supervisor, which is also not reinforceable... I do believe that there are good supervisors that can make a difference for their students... But there need to be structural changes in the way supervisors are evaluated (and probably the financing system) to make a real structural difference.\n\nI have been to the ombudsperson, the confidant (seems like a somewhat odd translation but I can't find a better one), the follow-up committee and the dean. None of them can do much about it, because it is his project and his money, no matter what the guidelines are about being a good supervisor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gpgek/great_summary_of_abusive_advisor_behaviors_to/dqlwny2/"}, "5": {"Subreddit": "PhD", "Author": "TakeMySoul2Hell", "Date": 1512140877, "Score": 6, "Body": "Well done! I'm so proud of you my love &lt;3 xoxo", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqlzfaq/"}, "6": {"Subreddit": "PhD", "Author": "KenReid", "Date": 1512156813, "Score": 3, "Body": "Sounds like an overall good situation to be in. Congratulations.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqmg7yg/"}, "7": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1512158395, "Score": 3, "Body": "Nice one, congrats :D!\nAnd interesting- where are you based geographically? The norm for me is 2 examiners and they tend to agree on the overall mark. \nSo what happens for you now? Do all the examiners get averaged or are you required to do all of examiner 3s comments (unless you can challenge it?) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqmhulq/"}, "8": {"Subreddit": "PhD", "Author": "ginage", "Date": 1512173008, "Score": 1, "Body": "Meeting with the supervisor beforehand can also help you hear more from them about the PhD ideas, which can make your application and interview easier because you know what they want your PhD to be about. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7fyqzj/how_does_meeting_with_professors_in_person_affect/dqmvo56/"}, "9": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1512176642, "Score": 3, "Body": "It's too late for this to directly help OP, but here's my two cents:\n\n1. It's a practice for a practice presentation. So, not *very* important in the grand scheme of things. It's not like it's a practice for the final thing.\n\n2. Someone else's poor planning shouldn't be your responsibility. Twelve hours advanced notice when you have to sleep for part of those 12 hours is just not realistic expectations.\n\n3. Counter offer with a rehearsal opportunity later this month after she has a chance to change her talk according to your group's comments.", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/dqmyjt2/"}, "10": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1512178420, "Score": 3, "Body": "Thanks! I am in Australia, and the whole mark is based on the thesis (no viva here).  All the examiners reports are required to be addressed, so even though the others gave me a level 1 mark, I need to address everything required by the third examiner. I will challenge some of the comments that appear to be based on a misunderstanding/difference in theory, but most of the stuff is pretty easy so I’ll just do it over the next few weeks. \n\nAs an example: my work is specifically on cultural and media reactions to an event - the third examiner wants me to write about the police, demographics and statistics a lot more - which is an entirely different area!", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqmzxgu/"}, "11": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1512178485, "Score": 1, "Body": "Thank you!", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqmzz82/"}, "12": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1512178558, "Score": 2, "Body": "Thank you! I am super happy with the results, especially since the main issues raised by the “bad” report are easy fixes. They were just unnecessarily nasty in their comments - however, you always get people like that so I’m not taking it personally.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqn01bq/"}, "13": {"Subreddit": "PhD", "Author": "Netcat2", "Date": 1512183421, "Score": 2, "Body": "If you can’t explain your research without requiring the other person read a text book first, you’ve been watching too much rick n morty. \n\nCan just imagine the awkward twitching “thanks... that’s what I’ve always wanted” on xmas day ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g6mrg/helping_my_parents_understand_my_degree/dqn3sxv/"}, "14": {"Subreddit": "PhD", "Author": "aliyoh", "Date": 1512184459, "Score": 0, "Body": "Funny enough I’ve never watched it. Also, I can explain my research, but it’s hard when every time I have to reiterate what DNA is. I thought if I got my mom an easy-to-read book that went over basic concepts that she would feel more invested in my career and that we could connect better on that level. \n\nThis isn’t some one off thing where I need someone to digest a library to talk to me, it’s about my relationship with my mom and how I want to help her feel involved in something that she’s had no formal education in. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7g6mrg/helping_my_parents_understand_my_degree/dqn4kq6/"}, "15": {"Subreddit": "PhD", "Author": "KatieLady80", "Date": 1512185097, "Score": 1, "Body": "For the dissertation, I'm seriously thanking my cat in the Acknowledgments section! Unconditional love, support, entertainment, and laughs. 🐾", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqn527o/"}, "16": {"Subreddit": "PhD", "Author": "BlueEmpathy", "Date": 1512207671, "Score": 1, "Body": "Yep. It happened with my master thesis as well. Went to therapy, still not recovered after a year.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqngopi/"}, "17": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1512303165, "Score": 1, "Body": "Is this a christmas present to your parents or yourself?", "Permalink": "https://www.reddit.com/r/PhD/comments/7g6mrg/helping_my_parents_understand_my_degree/dqp5ui9/"}, "18": {"Subreddit": "PhD", "Author": "gandonblyat", "Date": 1512335068, "Score": 2, "Body": "You are at the exactly same situation with me! I got my reports (no viva here too) 6 months ago, two said it was perfect, and one external said \"though some parts are fresh and innovative\" there needed a new, clear research question and to cut 1/3 of the thesis! I addressed all the comments of her and rejected to make some of the changes she asked me to do, since they were absolutely wrong.  I just resubmitted last week and waiting for the results. The problem is external seems to be a very traditionalist historian too, but I have no clue who she/he is.\n\nMy supervisor was furious after getting the external's report, who accused me for having a \"political agenda\" and \"absolve the practices of Soviet Union\" and wrote a letter to PhD committee to change the reviewer as he/she was hostile to me (the subject of the thesis I did was an extremely politicized subject). The committee refused this and asked me to address all the comments, adding that I do not have to do everything the external asked for, but use a soft tone in addres sing. Upon a fail, the committee wrote, it was possible to change the reviewer. So I made most of the changes, but refused to put a new research question and cut the thesis. \n\nI am glad you are happy with the results and calm. I was furious, thought about jumping to plane (I do my PhD in another country) and break the doors of the committee. I could only calm down after two weeks, and till the last minute of my resubmission I was pissed off.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqpubj1/"}, "19": {"Subreddit": "PhD", "Author": "suverenia", "Date": 1512338809, "Score": 1, "Body": "wow, really?? What happened?", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqpxwa5/"}, "20": {"Subreddit": "PhD", "Author": "BlueEmpathy", "Date": 1512339131, "Score": 1, "Body": "Long story short, my supervisor was ignoring me, then after weeks she would remember that I existed and would freak out telling me that my work was not enough (but she couldn't remember what I was working on...), That I had to be careful because the thesis is important and so on, but without actually helping me, only criticizing. At the end I was having panic attacks every day as soon as I walked into the lab. Fortunately, I had another professor that I could rely on and I was able to complete the thesis, about 6 month later that I thought.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gp5je/applying_for_phd_have_to_choose_between_two/dqpy714/"}, "21": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1512401241, "Score": 1, "Body": "I wouldn't count on a book working for this. It could very easily cause your mum to become less interested in what you do if she doesn't find it enjoyable to read.\n\nYou'll probably find that your mum will be more interested in how your work fits into the rest of the world, and why it's important you study it both for yourself (career, why you enjoy it) as well as for society (why the PhD exists, what it's trying to solve).\n\nThat's my experience anyway!\n\nEDIT: I understand that these conversations will probably involve at least mentioning DNA anyway. Focus on how you communicate the science; after all, you want to be better than the book!", "Permalink": "https://www.reddit.com/r/PhD/comments/7g6mrg/helping_my_parents_understand_my_degree/dqr2eh1/"}, "22": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1512416078, "Score": 1, "Body": "Be very creative about finding connections between them and a title that encompasses them all.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hewge/phd_sandwich_thesis_what_if_my_articles_topics/dqrhe9t/"}, "23": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1512432513, "Score": 2, "Body": "Question - in Australia too... Are you required to deliver a seminar? We have them here as a pre-submission event where the panel provides critical feedback on your thesis before you submit it for examination.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqrxiym/"}, "24": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512443592, "Score": 1, "Body": "I'm sure you can connect them, though you might have to reshuffle the content.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hewge/phd_sandwich_thesis_what_if_my_articles_topics/dqs7jiq/"}, "25": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1512451125, "Score": 5, "Body": "OP I think the best thing is to get a diagnosis for this. It may seem right to put a name on something you feel, but you're operating from a limited frame of reference. The best thing would be to make sure you have bipolar. This will also help open up resources to help you along, and make an informed decision about where to go from here. Good luck.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dqsdy7r/"}, "26": {"Subreddit": "PhD", "Author": "Merantaz", "Date": 1512452246, "Score": 1, "Body": "I believe your Professor can understand your situation. If I were you I would look for right time and talk to him as early as possible. Recently I had a family problems back in my home country and when I asked my professor I need couple of days off to come out of that. He rather insisted me to travel to my home country and stay for a while. Go with a plan like how do you manage to work from your home country and how will you keep him updated and specify him approximate time.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dqsep7m/"}, "27": {"Subreddit": "PhD", "Author": "ganj0", "Date": 1512473067, "Score": 1, "Body": "Yep something like that.\n\nDuring the PhD i studied this and this.. so i made an article almost related !", "Permalink": "https://www.reddit.com/r/PhD/comments/7hewge/phd_sandwich_thesis_what_if_my_articles_topics/dqsnrm3/"}, "28": {"Subreddit": "PhD", "Author": "jkzr25", "Date": 1512492735, "Score": 1, "Body": "I've written about apps and programmes which make the PhD journey just that little bit less stressful. Not a panacea, but it definitely helps take the anxiety off when you're organised and have effective tools for managing your reading/time etc https://sgsahblog.wordpress.com/2017/12/04/my-top-5-software-recommendations-for-phd-students/ ", "Permalink": "https://www.reddit.com/r/PhD/comments/7f8yhv/anyone_knows_how_to_make_a_phd_journey_happier/dqt29k6/"}, "29": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1512493395, "Score": 1, "Body": "Don't make a hasty decision. This thought process (\"I should quit\") could be a symptom itself and may pass. I echo the other comments. Go to a doctor and get a diagnosis. You might be right, but self-diagnosis should always be done cautiously. There are nuances to bipolar that you may not be aware of.  As always, take care of yourself and your mental and physical health above all things. If it still seems like a good idea to head home after seeing a doctor, I wish you all the best. \n\nWhatever you decide, I just want you to know that you are wanted and welcomed here in America by at least this one white chick. Those racist assholes don't speak for all of us or even most of us. You are loved and respected here. Their day will come and we'll fight for more common sense immigration laws. Hang in there!", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dqt2ydn/"}, "30": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1512498838, "Score": 1, "Body": "Figure out what are your options for diagnosis, treatment and all the other help and general well-being in your native country vs. in the US. If you have larger financial, legal, practical barriers to it in the US, a leave of absence for a semester or year is likely to be the best option. On the other hand, if it will be impossible or more difficult for you to get treatment and the other resources you need in your native country (e.g., because mental health help isn't developed there, or because of lack of health insurance if you don't find or can't handle a job, or because of having to live with opposite-of-helpful family...), it may be wiser to get all the available support, understanding and reasonable accommodations at your university and keep sorting out your life in the US. \n\nAnd in any case see if it'll be easier to bring your fiance with you if you get married (of course if you two are fine with getting married - doesn't matter what your families want, but does matter what you two want - if you want it, just do it in the cheapest and least-hassle way possible).", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dqt8mqk/"}, "31": {"Subreddit": "PhD", "Author": "MisterrNo", "Date": 1512503624, "Score": 3, "Body": "I didn’t understand what Ph.D. program you are applying to. How irrelevant is it to your research or major?", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqtdn5t/"}, "32": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1512504002, "Score": 5, "Body": "My $0.02:\n\n1. Chill out.  Grad school isn't a one-shot-or-your-life-is-wasted application.  If you aren't satisfied with your current admissions offers, then you take the time to fix your CV and apply again next year.\n\n2. Be careful of \"top schools\".  I know you've heard this before, but I'll say it again because I completely agree: The professor matters, not the school.  You need to join a top-quality professor in a top-quality lab where you can get a good education, which may be at Boondocks Third-Tier State U because the professor is young and is 2 years away from getting cherry-picked by MIT.  Young, hungry professors can be much better mentors than old figurehead professors.\n\n3. From years of experience, I wouldn't let your professors' being \"extremely happy I decided to go into research\" sway me.  If you want to do research, then do so even if the professors are screeching at you.  If your professors are pushing you to do research regardless of your own feelings, remember that they may have ulterior motives, like validating their life choices.  \n\n4. Publications: You don't need to be a student or even affiliated to publish.  Go ahead and design a project now, and publish a paper or two on it.  If you need access to a lab, strike up a friendship with a lab and ask to use their tools.  \n\nA school really just wants to see proof that you'll be able to succeed with them in research.  You show them this by already succeeding in research.  Previous degrees, GPA, GRE scores, etc, are just formalities in the absence of better info.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqte1h4/"}, "33": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1512504958, "Score": 2, "Body": "I had a mental health breakdown (super high anxiety and depression) in my first year PhD, and I had to take a month off and start drugs, with weekly counselling sessions, before I was able to get back to work. Sometimes the brain gets to a stage where willpower alone isn't enough.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/dqtf1co/"}, "34": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1512505138, "Score": 2, "Body": "I have been considering doing the same thing but my lack of passion is compounded by issues with my advisor etc. so I'm trying to figure out how I really feel apart from the confounding factors. Your clarity is inspiring and just what I needed to read to brighten my anxiety-ridden day! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dqtf80n/"}, "35": {"Subreddit": "PhD", "Author": "Only-Me-Here", "Date": 1512505523, "Score": 5, "Body": "Hello,\n\nSorry to hear that you are struggling right now. I feel you. I am in my final stages of my PhD (in the UK) and I am (and have been) feeling very similarly. It is a long, tiring journey.\n\nI would recommend that you seek counselling,  find a PhD peer support network and some outside activities just for you. I would not have made it this far without my counsellor, she has been beyond supportive and a really useful source of help. I would suggest finding someone who has done a PhD so they grasp the challenges of the journey - it has been invaluable. \n\nYou didn't mention which area your PhD is in... but if it helps my subject lies at an intersection between two subjects (which independently I am not interested in). Yet, I have found people who I can talk to, vent with, and just be nearby. The PhD is a lonely process as it is, so try not to cut yourself off from everyone now - be open. So try putting yourself out there - go to talks, journal clubs and other student run events, just meet other people. \n\nAlso, don't under estimate the value of having other non-phd friends. So try other activities outside academia. I do a one sporting activity at the moment and it's great, because no one asks how my writing is going or whether I am nearly finished yet :) \n\nI would also definitely consider talking to your supervisor/s. It is important that they are aware of what is happening as soon as possible. They might be able to provide additional support or guidance that is a little more university specific. \n\nFor tomorrow, just do one thing and keep doing it. Get a routine (including something fun) and stick to it. It helps. You got this, I believe in you.\n\nSorry for the essay :)", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/dqtfmtl/"}, "36": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1512510651, "Score": 3, "Body": "While basic measures of academic achievement are important for phd applications, “fit” can be just as important. If there is a program (or more than one) where your research interests align well with the faculty, my advice would be to reach out to those faculty members and inquire about applying, express interest in their research, discuss how you might be able to contribute to it. If you get a responsive faculty member, you could then describe your situation and talk about why you think that program is the right fit for you (meaning how would both you *and* the program/faculty benefit from your admission). If anything, you might at least be able to get past the first “cut” in the admissions committee (where they otherwise might not even look at your application due to your GRE scores or lack of pubs), and be considered for “fit.” This could give you a leg up. Developing a relationship with faculty at the program you’re applying to before you apply has *much* more sway than you might think. Good luck! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqtl7hi/"}, "37": {"Subreddit": "PhD", "Author": "shouldersday", "Date": 1512515768, "Score": 2, "Body": "Sorry for not explaining well. I am interested in:\n\nHardware based neural networks, preferably towards autonomous driving applications, or other non-server apps.\n\nBio Sensing applications, primarily non-invasive and for wearable devices. The reason behind this is due to the heavy skills required for system-engineering, algorithm development, and require low noise and low power, making me an all-around versatile engineer.\n\nMy grad school background was involved with signal processing and communications, with my project focusing a lot on distributed systems and software architecture.\n\nSince graduating, however, I have been working exclusively with hardware", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqtq6we/"}, "38": {"Subreddit": "PhD", "Author": "shouldersday", "Date": 1512515931, "Score": 2, "Body": "I have gotten responses from some professors, however the current state is:\n\nMaybe we can talk during December/January time frame. Do you think that this is enough to get past the first cut? This is my biggest concern due to the giant hole that my GREs have left, despite my high GPA and LoR quality.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqtqc69/"}, "39": {"Subreddit": "PhD", "Author": "kateg212", "Date": 1512524723, "Score": 3, "Body": "Hmm. I don’t think just emailing and getting that response is enough to *ensure* that you make it past the first cut, but you do have some time before admissions committees start. They usually don’t start until the beginning of Feb. So I would make sure to follow up with them (sticking as close to their timeline as you can) and try to have more of an actual conversation. \n\nIf you’ve gotten the feeling that you’re being written off, I would make sure your next email isn’t just a “can I ask you basic questions” email, but instead try to lay out your case in the hopes that it will inspire a response. (For example - Hi Prof XXX, I know this must be an extremely busy time of year, and I apologize for being so persistent. I’ve applied to the PhD program for the upcoming academic year and I am specifically hoping to work with you in [XXX research area - be specific]. My previous work in this area includes XXX [List everything relevant including coursework, accolades, papers, etc], and I think I could contribute to your research by [EXPLAIN SPECIFICALLY- ie., expanding upon this topic, bringing a different perspective/method, etc.]. If you have time in the next few weeks, I‘d be thrilled if we could speak briefly about the program. Please let me know, and thank you so much in advance.)\n\nIf you don’t receive a response after an email like this, i wouldn’t email again though. Given the short timeline, you don’t want to be too pushy. And remember that academics are notoriously slow at emails, especially over holiday break. But any professor who is interested WILL get back to you, they know the stakes/timeline. So politely make your case and then it’s just cross your fingers and wait. ;)", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqty0mc/"}, "40": {"Subreddit": "PhD", "Author": "G_NC", "Date": 1512525412, "Score": 1, "Body": "Go Bayesian, specify an informed prior based on the existing literature. Voila.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dqtymvr/"}, "41": {"Subreddit": "PhD", "Author": "tentkeys", "Date": 1512544379, "Score": 2, "Body": "Some suggestions:\n\n1. Do you have to work at your isolated desk, or can you work from home or from a coffee shop or someplace else less depressing?\n\n2. Do you have an animal in your life? My mental health is _way_\nbetter when I have my cat living with me - cuddles/physical touch affect the brain on some basic level that’s hard to explain but very important. If you don’t have a pet, consider fostering for an animal rescue.\n\n3. Meds. If you’re not on them, consider seeing a doctor, they can make a huge difference. If you already are on them, consider telling your doctor about all of the symptoms you are still having, they may be able to adjust meds to be more effective for you.\n\n4. Exercise. I know it is absolutely the last thing you feel like doing when you’re depressed, but it really does help. For me, it helps most if it’s intense exercise that leaves me drenched in sweat, not just walking around the block (although that is still better than nothing)\n\n5.  Human contact. If you don’t have any friends in your program, look for friends someplace else. Some club or organization or volunteer group or even a support group - wherever you find it, having a consistent group of people in your life can make a huge difference.\n\n6. When the awful feelings reach their peak, it is often easy to ignore self-care, which can end up making us feel worse.  This video is a good reminder/troubleshooting guide for those moments when it feels like absolutely everything is s**t: https://m.youtube.com/watch?v=Ek-B_EZyoM8", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/dquc33q/"}, "42": {"Subreddit": "PhD", "Author": "bunyagirl", "Date": 1512553508, "Score": 2, "Body": "Congrats! That is awesome. I am learning to stand for what I am writing at the moment with my confirmation revisions ... I figure its practice for down the track. Love your attitude. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqufsau/"}, "43": {"Subreddit": "PhD", "Author": "ZyonCross", "Date": 1512556939, "Score": 1, "Body": "My only piece of advice/experienced wisdom is that there is a life beyond PhD with or without it. \n\nAfter quitting, I left behind my life in the UK. I did a 2 month intensive butchery course in Australia and now I work in a fairly popular kitchen as a \"Meat Entremetier\". I have never been happier. \n\nI love meat!", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dquh1vh/"}, "44": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1512557333, "Score": 2, "Body": "I have bipolar I with psychosis. It's a very serious condition but it is manageable once you get the medication right and learn how to moderate sleep and stress. \n\nGet another medical opinion and a diagnosis of bipolar before you assume that's what you're experiencing. Some disorders present like bipolar but have very different underlying causes. Some people are energetic without showing clinical hypomania or mania. Figure out treatment that stabilizes you (it won't work 100% of the time but it will make your life a lot easier). Once you've done that, think about grad school. I would recommend taking time off. Don't drop out - take medical leave. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dquh74n/"}, "45": {"Subreddit": "PhD", "Author": "ZyonCross", "Date": 1512557337, "Score": 1, "Body": "I work in a kitchen now. Training as a \"meat entrmetier\". I fucking love meat and can now butcher half-a-side of beef in 17.22 minutes to every cut.\n\nLife is fucking good ☺☺☺", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dquh76j/"}, "46": {"Subreddit": "PhD", "Author": "alw05", "Date": 1512565257, "Score": 4, "Body": "From the experience of having a shitty professor, I'm going to say that is the most important for me. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dquksus/"}, "47": {"Subreddit": "PhD", "Author": "WhiskyDrum", "Date": 1512566160, "Score": 2, "Body": "From what I have read, I would go with the second Prof. The thesis would overlap with your interests, which is a big factor in intrinsic motivation, plus you get a guaranteed scholarship (2 years is a lot of time). And who knows, maybe you establish your own contacts with his friends, pushing you even further into the field you are more interested in.\n\nIn terms of the Prof. being crazy: My experience is that they all have their kind of quirk. You are not his first PhD student I assume, so he will probably not exploit you or something along that line. Maybe you could talk to one of his assistants and ask how it is to work under him.\n\nAnyway, this is how I would do it, based on what you've written.\nBest of luck to you!", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dqulc7r/"}, "48": {"Subreddit": "PhD", "Author": "femtomatic", "Date": 1512568007, "Score": 3, "Body": "One thing I would suggest is to try to talk with some of their PhD students. From my experience, interactions with a professor might be wildly different between undergraduate classes and research work during a PhD. One of my professors was really bad at giving undergraduate classes, mostly unprepared and sometimes incoherent, but then I had an internship in his lab and the experience was completely different. He took the time to explain the subject in his office and was very clear and helpful. Some professors are just bad at giving lectures but are great scientists. \n\nOf course YMMV, each professor is different, but if you can have an insight from their graduate students it can help a lot. A great professor might make a 7/10 subject turn into something great and a bad professor will make a 9/10 subject hell on earth.\n\nYou also mentioned that one of the professors has lots of connections, this can be really important depending on your career goals. My advisor is very well known, and liked, in our field and it opened a lot of doors for me. It could also lead to a co-direction with another scientist in the field which could compensate for some of the shortcomings of your original advisor. \n\nThe most important thing is that you need to picture yourself during the toughest times, when you feel nothing works and your research seems to be going nowhere. It may be hard to picture right now, but trust me it will happen. Will the subject matter more than the advisor or vice versa? If you are very independent and resourceful you could power through it without a great professor, but an awful advisor could potentially make it worse. I know a couple of brilliant students who struggle to complete their PhD, even though they love their research subject, because their professor is a total shithead. \n\nGood luck!\n\nEdit: I forgot to mention, money is also important of course, but you should apply for scholarships even if you already have funding from your advisor. The thing with funding is that the more you recieve the more you will get. And this will follow you after you complete your PhD, especially if you work in academia. When you will apply for your first research grants, they will most likely look if you have already received scholarships and you'll get bonus points for that. For me this is a shitty part of research, running after scholarships and grant money, but it is part of the game and you need to get some experience with that. Of course it will be different if you plan a career in the private sector, but it always looks good on a resume. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dqumlws/"}, "49": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512573095, "Score": 3, "Body": "I think this is great advice - usually its hard to pick an advisor because you're working with limited information. In this case you can go and chat with their students and get the real picture. You have to listen close, though, because they cannot directly speak poorly of their advisor so if they're being cagey its because they want to say their advisor is bad but are unable.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dquqq22/"}, "50": {"Subreddit": "PhD", "Author": "femtomatic", "Date": 1512575745, "Score": 2, "Body": "Yes that's a good point! And if a student is very openly critical of his advisor, especially in public, it could be a sign that he might not be a great student as well, you never know. If you are able get a couple of samples that's definitely the best scenario, but sometimes you have to go with your gut feeling... \n\nI chose my advisor because she was a renowned scientist in the field, especially in the subject I was interested in, but I had very little info about her. I only met her once before in a meeting and she seemed kind of cold and distant. Fortunately it turned out that she is wonderful human being with a great sense of humor so I was lucky I guess! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dqut7rp/"}, "51": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1512578159, "Score": 2, "Body": "Graduating on time without taking out loans is worth a lot. Compare working 3-4 years on a project that is ok, graduating, and moving on to something else, vs spending 5-8 years on your dream project but with financial hardship and worry. Look at the professors' graduation record - do their students usually graduate on time? When I started with my professor he was relatively new, but now I can clearly point to evidence that no one should choose my advisor: the fact that just as many students have left our lab as have graduated in the past five years is a really bad sign, plus the fact that our lab is a revolving door for MS students who leave without completing their theses.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dquuxw6/"}, "52": {"Subreddit": "PhD", "Author": "buttfacedmiscreant11", "Date": 1512636868, "Score": 2, "Body": "The format seems to be a bit different for you as my transfer was after the first year of my PhD but from that experience this is what I would suggest:\n\n- make sure you know the literature around your topic really well. Key studies that you’re using to base your research on - know them inside and out, methods, limitations etc. Be able to justify that what you are proposing extends what they’ve done etc.\n\n- similarly, know the theory behind it. This was my weak point. I knew the literature behind my study well but didn’t have as good a knowledge of the wider theory to back that up. Be able to justify why you’ve chosen to go with the theory you have.\n\n- while your research plan is still somewhat subject to change, make sure you know what you’re proposing to do inside and out, your methods, sample size, why you are gonna do it the way you propose to, how you’re going to analyse it etc etc. Same goes with research you’ve already done.\n\n- mine wasn’t presentation based, i had to write a report and then had an hours questioning on the report. Presentation is good because you can practice! Practice going through it with a friend/relative/anyone, but also I would advise someone outside your subject area completely as well. Try know it as well as you can without looking at notes - you’ll seem confident, which is a big part of it.\n\n- they are also looking for you to be able to show that you can complete the work in time. Have an idea of the timeline in which you’re planning on doing the research/analysing/writing up so that you can show you will be able to finish in time.\n\nGood luck!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7grpc3/advice_for_studying_for_upcoming_phd_transfer_exam/dqw6j6n/"}, "53": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1512642523, "Score": 2, "Body": "Thank you! That sounds great- developing a strong voice is absolutely key to sounding like you have command of the topic. Didn’t happen for me until my second year at least, when it was pointed out to me that I was writing too “gently” and it came across as insecure. Good luck!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqw8nw4/"}, "54": {"Subreddit": "PhD", "Author": "srcyball", "Date": 1512681901, "Score": 1, "Body": "Do you want tips on getting in or on how to do the interviews? Most qualitative research books** will have good resources on the latter, the former is a little luck, a lot of persistence and doing your research on who to ask, when to ask and what to offer in return.\n \n\nMy key advice...\n\n1) know why you are asking what you are asking before you go in. Tie everything back to your research question so you dont waste your time or theirs. \n\n2) You mention that you might need to go beyond leveraging existing contacts. Why? That is how many students get access. If you dont know someone you will (usually) have to offer a good reason why the company should care, either your research is particularly valuable or you can offer something in return. I offered to provide some key recommendations to improve team functioning (I had a background that meant that I could call myself an expert in that) but I also used my contacts. \n\n3) Once you are in you might find it useful to use a snowball method, but make sure you ask for people they think do not share their views. Try to get a good cross-section of different levels and teams etc. as well. \n\n4) Transcribe AS YOU GO. You will see where you are making mistakes, cutting people off etc. It will significantly improve your technique. If you leave it to the end you will kick yourself when you see yourself making the same mistakes repeatedly. \n\n5) Relax. You arent an expert and people wont necessarily expect a student to be the worlds greatest interviewer. Remember that they are helping you out and be grateful and they will usually be respectful in return. \n\n** Make sure the books you are looking at align with your conceptual framework/method. I am an interpretive researcher so my interviews interrogate meaning. This is a different style and different way of sampling than other approaches.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7i7i2y/tips_on_doing_qualitative_interviewing/dqx4y2u/"}, "55": {"Subreddit": "PhD", "Author": "sollinatri", "Date": 1512688963, "Score": 2, "Body": "When all else fails and you cant find someone specific that you can be introduced to in that company, email or call the general info you find on their website, once in a while a really helpful person replies and gets you in touch with the right people inside the company.\n\nAlways check your recorder is working and not at full capacity. Its very embarrassing when it says “memory full”.\n\nBe clear about your research, how you will use the data (just thesis/for a journal article/might wanna publish the thesis later) and ask if they want to see the transcript for approval.", "Permalink": "https://www.reddit.com/r/PhD/comments/7i7i2y/tips_on_doing_qualitative_interviewing/dqxb6na/"}, "56": {"Subreddit": "PhD", "Author": "ratwitch_", "Date": 1512712324, "Score": 2, "Body": "I only had to do a probationary seminar, after the first year of my candidature. It was the final step in having my research technically approved.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqxunz3/"}, "57": {"Subreddit": "PhD", "Author": "PhDystopia", "Date": 1512712478, "Score": 2, "Body": "Trying to figure if you’ll get in in a waste of time. Apply to the best programs that focus on your interests. His includes top R1 schools and boutique programs that happen to have a strong program in your field.\n\nOnce you ID your top choices reach out to faculty to express interest. Have a polished CV ready to share. If you can, set up a phone or skype call. It always helps to actually talk to prospective students. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/dqxurat/"}, "58": {"Subreddit": "PhD", "Author": "mushbrain", "Date": 1512722837, "Score": 2, "Body": "Oh okay. We had to do that as well as a final seminar before thesis examination. Guidelines state that the final seminar is only for formative feedback.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/dqxzq4k/"}, "59": {"Subreddit": "PhD", "Author": "aledaml", "Date": 1512736929, "Score": 1, "Body": "Statistician here. Depending on how small were talking,  you can always change the p-value you are considering statistically significant to .10 instead of .05.  You would then frame the paper as looking for associations that *could* be significant given a larger sample size. This is fairly common in pilot studies and some phase 1 clinical trials. I usually recommend this for sample sizes &lt;100 with a rare outcome, or &lt;50 for an intervention study.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dqy59uj/"}, "60": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1512755081, "Score": 1, "Body": "This makes me feel so optimistic! \nMy oral exam for candidacy is 4 days from today. After another crushing email from my advisor yesterday, I told my program co-ordinator that I quit - while having a panic attack. She's trying to help and won't let me quit until I try another advisor but at this point I guess I have nothing to lose. The best part is, that I'm actually so relieved and looking forward to finally starting my life away from the pressure of a PhD. Thank you for giving me hope and dare I say it, strength.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dqyk7v4/"}, "61": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1512759149, "Score": 1, "Body": "I think you also need to trust yourself to do the right thing for you. Write down all your problems- that helps me sort them out rather than it becoming one big ball of unfixable things. It's not going to be an easy decision, either way. Considering that your mental health came into focus after the emotional trauma of your fiancee- your support system- being taken away from you, it might help to really think about what would be worse for you in this moment. Not having your fiancee close or taking leave from the program. All we really want is happiness and stability. I'm going through something of a crisis myself in my PhD but it helps me immensely to deal with my mental health with a supportive husband; it's all about giving myself the best chance to succeed. Please know that whatever you decide, you are doing the right thing.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hlklb/discovered_im_bipolar_in_the_first_semester_of_phd/dqyo8l5/"}, "62": {"Subreddit": "PhD", "Author": "hcpremed", "Date": 1512795818, "Score": 1, "Body": "Have you tried speaking with your supervisor? Perhaps you feel that they aren't going to be that helpful, which might be true. But they are there to support you.\n\nI also struggle with anxiety and depression. I am still working on the kinks myself. \n\nWe can get through this. Let's keep the conversations going.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/dqzhrov/"}, "63": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1512804193, "Score": 9, "Body": "Stick with a card and some meaningful eye contact.", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dqzm5no/"}, "64": {"Subreddit": "PhD", "Author": "EFDeezy", "Date": 1512805871, "Score": 10, "Body": "Don’t give a gift. Say happy holidays and call it a day. It can be seen as trying to get favor from your advisor. You work hard enough, save your $$$", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dqzmupv/"}, "65": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1512838285, "Score": 3, "Body": "Agreed with others, if you feel compelled, a card is always enough.", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dr021i8/"}, "66": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1512841235, "Score": 4, "Body": "Don’t do it. As a supervisor myself now, I’d feel awkward receiving anything. A nice email would suffice. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dr04emd/"}, "67": {"Subreddit": "PhD", "Author": "OMGCookieMonster", "Date": 1512854342, "Score": 2, "Body": "I think it's more about reading the culture. At your last workplace, yeah you should probably be giving gifts if most people do. But, here that obviously isn't the norm so I'd advise against it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dr0eur5/"}, "68": {"Subreddit": "PhD", "Author": "hcpremed", "Date": 1512870654, "Score": 1, "Body": "Thanks everyone! I will go with a card!", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/dr0r8bw/"}, "69": {"Subreddit": "PhD", "Author": "hcpremed", "Date": 1512870763, "Score": 2, "Body": "STAY AWAY from the crazy one. In the end the thing that matters most is your relationship with your supervisor.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dr0rb8t/"}, "70": {"Subreddit": "PhD", "Author": "KrisKat93", "Date": 1512946300, "Score": 1, "Body": "Hiya, wording of the second question is a bit weird for me.  I'm Ftm so I chose that but the second question about how strongly I identify with my gender; do you mean the gender assigned at birth or my gender identity? ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iq9to/please_help_fellow_phd_students_by_filling_out/dr24i3h/"}, "71": {"Subreddit": "PhD", "Author": "bahoo1991", "Date": 1512947279, "Score": 1, "Body": "Hi! Thanks for your question! It would be how much you identify with yourself based on your current gender identity. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iq9to/please_help_fellow_phd_students_by_filling_out/dr25dfb/"}, "72": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1512958887, "Score": 1, "Body": "Wow. I am going through a very similar situation. I finished my masters earlier this year and I passed 2 out of 3 candidacy exams this semester. Come time for exam three- proposal and its oral defense - my advisor has been yelling at me, unsupportive, changing my proposal topic 3 weeks before it's due and asked me to change labs when I brought up his toxic behaviour. I declined to take the oral exam because of the mental issues this gave me and I am 95% going to quit the program. While my anxiety is making things hard, I feel OK about it because those three letters are NOT worth developing self-esteem issues and the crushing feeling of failing all the time.", "Permalink": "https://www.reddit.com/r/PhD/comments/6yiwux/need_advice_a_new_and_abused_student/dr2flp1/"}, "73": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1512959231, "Score": 4, "Body": "Don't vote GOP", "Permalink": "https://www.reddit.com/r/PhD/comments/7iyl94/what_to_do_about_the_new_gop_tax_plan/dr2fwdg/"}, "74": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1512960569, "Score": 4, "Body": "And campaign for an end to gerrymandering and the FPTP election system", "Permalink": "https://www.reddit.com/r/PhD/comments/7iyl94/what_to_do_about_the_new_gop_tax_plan/dr2h2qm/"}, "75": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1512962173, "Score": 1, "Body": "&gt; gerrymandering \n\nThere is no point in campaign against a party after putting it power (Hint: Campaign during the election against said parties). It is like shooting yourself in the foot and then trying to bandaid it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7iyl94/what_to_do_about_the_new_gop_tax_plan/dr2idwp/"}, "76": {"Subreddit": "PhD", "Author": "Maravise", "Date": 1512966414, "Score": 2, "Body": "Hi,\n\n\"What is your current relationship status?\" has the response options: Single, not living with partner; Single, living with partner. These don't make sense.\n\nCheers", "Permalink": "https://www.reddit.com/r/PhD/comments/7iq9to/please_help_fellow_phd_students_by_filling_out/dr2lr9p/"}, "77": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1512993197, "Score": 1, "Body": "If it's at an Aus University, don't take it too personally. Aus generally lacks appreciation for research and higher education in general and thus underfunds it - let alone for the arts. Arts teaches you to think and be critical you see. Aus govt can't have that.", "Permalink": "https://www.reddit.com/r/PhD/comments/7j1pyb/4th_scholarship_application_rejection_today/dr2yaks/"}, "78": {"Subreddit": "PhD", "Author": "bunyagirl", "Date": 1512993242, "Score": 1, "Body": "Yes. I know. I’ll feel better tomorrow. Thanks. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7j1pyb/4th_scholarship_application_rejection_today/dr2ybat/"}, "79": {"Subreddit": "PhD", "Author": "mothkin", "Date": 1513011513, "Score": 4, "Body": "Thanks for posting this. I’m abd in political science (admittedly very different from your work). I read your whole post and I remember feeling exactly the same way, and often still do. It was massively overwhelming, I never felt like I was doing enough or knew enough or had the right background, and was/am constantly afraid of losing advisors’ respect. And what’s more, I didn’t realize how much this would affect my relationship. I found myself giving less and less attention to my partner, and feel alienated because I couldn’t really talk to them. \n\nI promise you that this is very very normal, in every single field, and especially in your first year. There are some folks who come in with amazing experience, some who seem to be on a different level, but I assure you that  the vast majority of us feel inadequate, overworked, and fragile. And even for those who look like they have it all together (some of my friends think I’m one of those), it certainly doesn’t feel that way to them. I know you’ll probably (like me) say that ‘no, it’s different, I really don’t know, and I really am getting sidelined’. That may be true, but its also very likely that you seem more competent than you think. \n\nSome things that help: \nfriends and safe spaces! Some PhD friends will just want to talk work: you don’t need them. But find those ones who want to have a beer, existentially complain, and support each other’s difficulties. I promise they are out there. \nWorkshops! For me it was a rewarding experience to be part of student-run workshops (if relevant for your field) where I felt comfortable saying ‘I don’t know’ or just asking questions. \nTherapy! Therapy and counseling is extremely common in graduate school, and your school medical offices should provide it free or cheap. Myself and almost all of my friends have been talking to therapist for a good portion of the last few years. \n\nFor many people this is the hardest year of their life. At the time I felt like I was being broken down so that I could be built back up, and I tried to take a ‘what doesn’t kill me makes me stronger’ attitude. Regardless, the first year can feel emotionally traumatic. \n\nA short (and true) story may be illustrative. Once in our department I was talking with some friends about feeling inadequate and like an imposter. My friend asked a young professor who had recently been tenured about when it goes away, and he laughed and said he still has it. He knocked on another professor’s door, who has been tenured in the department for a few decades and is reaching retirement. ‘When does the imposter syndrome go away?’ The younger professor asked. The older one responded: ‘what do you mean? It never does.’ \n\nIt may never go away, but it’s also a matter of perspective. I’ll end with a quote from David Foster Wallace that I always found helpful (the relevant bit will be obvious): “If you worship money and things — if they are where you tap real meaning in life — then you will never have enough. Never feel you have enough. It’s the truth. Worship your own body and beauty and sexual allure and you will always feel ugly, and when time and age start showing, you will die a million deaths before they finally plant you. On one level, we all know this stuff already — it’s been codified as myths, proverbs, clichés, bromides, epigrams, parables: the skeleton of every great story. The trick is keeping the truth up-front in daily consciousness. Worship power — you will feel weak and afraid, and you will need ever more power over others to keep the fear at bay. Worship your intellect, being seen as smart — you will end up feeling stupid, a fraud, always on the verge of being found out. And so on.”\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7j2xp9/first_year_phd_on_a_rollercoaster_of_emotions/dr3bi9r/"}, "80": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1513036792, "Score": 1, "Body": "First, you have to believe at some level that you belong there- you were accepted to 2 PhD programs, so you have the qualifications.  Second, I would highly recommend not comparing yourself to your fellow grad students.  Third, just because the other grad student spends all of his time in the lab doesnt necessarily mean you must. \n Talk to your advisor about how you learn best and come up with a plan on how to accomplish your goals.  It seems to me you just need time to figure out how to create a balance between all the requirements of a new program.  One semester is a drop in the bucket when you consider the years it will take to finish the program.  Give it at least 1 more semester before coming to any hard conclusions.  I would second the recommendation to seek counseling at your institution.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7j2xp9/first_year_phd_on_a_rollercoaster_of_emotions/dr3zrcu/"}, "81": {"Subreddit": "PhD", "Author": "mugbrushteeth", "Date": 1513047442, "Score": 2, "Body": "I read the long post of OP and this long comment too. Thanks, I can relate to most of the part.\nThen.. if we worship something we will feel insecure about it forever. The point is we should accept the insecurity (imposter syndrome in this context) coming from what we desire? or we should worship nothing? I wanna be Buddha.", "Permalink": "https://www.reddit.com/r/PhD/comments/7j2xp9/first_year_phd_on_a_rollercoaster_of_emotions/dr493ri/"}, "82": {"Subreddit": "PhD", "Author": "plukovnik_horcice", "Date": 1513047542, "Score": 2, "Body": "Don’t forget that you’re in your first semester! I didn’t feel completely comfortable with the jargon and groove in my lab until the end of my first year. If you don’t feel comfortable with the basic sciences, take some courses that you may feel will support your current understanding. Better yet, request an independent readings with your advisor where you must meet every week to discuss and read about these basic topics. I concur with others, find your group that you can mutually complain, commiserate, and joke with. And find another group completely outside of your program so you can’t be tempted to continue to ruminate. It’s healthy to acknowledge your woes, but also your personal needs that don’t revolve around the Sun that is a PhD program. \n\nAt the same time, don’t ever feel like you need to finish just because you started. Re-evaluate your status and your career goals every year. If they’re aligning less and less every year, consider changing paths. A PhD is a very complex process and very specific career paths result from its receipt; sometimes the generic “Hang in there!” isn’t the kind of encouragement that is needed given the circumstances.\n\nWhat I mean to say is, push yourself, learn as much as you can, and respect what your body, mind, and heart tell you every day.", "Permalink": "https://www.reddit.com/r/PhD/comments/7j2xp9/first_year_phd_on_a_rollercoaster_of_emotions/dr49709/"}, "83": {"Subreddit": "PhD", "Author": "ZyonCross", "Date": 1513067327, "Score": 1, "Body": "More power to you man! Life is definitely better without the stress.", "Permalink": "https://www.reddit.com/r/PhD/comments/7dav98/i_quit_my_phd/dr4m6wg/"}, "84": {"Subreddit": "PhD", "Author": "SuchInferno", "Date": 1513174119, "Score": 1, "Body": "Depends on the type of relationship you'll end up having, though. If you as a PhD student will be working daily in the same lab as the supervisor, then yeah -- pick the least crazy one.\n\nHowever, for some PhD students, their supervisor(s) are mostly a mean of helping with e.g. methods for experiments, publication outlets, proof-reading, and in general a sparring partner who'll help you when you're in need of such. If that's the case, I don't see why this student would need to stay away from the \"crazy but highly influential\" supervisor.\n\nJust my two cents.\n\nEDIT: Few corrections.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/dr6rl1u/"}, "85": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1513320408, "Score": 3, "Body": "Last I heard this provision didn’t make it into the final bill. As for the future, make sure you get into a strong program. Good schools find a way to help offset the consequences of bad policy. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7iyl94/what_to_do_about_the_new_gop_tax_plan/dra21c8/"}, "86": {"Subreddit": "PhD", "Author": "ChickenAndRiceIsNice", "Date": 1513379287, "Score": 1, "Body": "My school required that I do a second year of their Master of Research (MRes) degree before I could start my PhD in research related to deep learning. This was because my Master's degree lacked adequate units in my final practicum. \n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/drb8qmw/"}, "87": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1513381116, "Score": 1, "Body": "I normally give my supervisor a bottle of whiskey (this year) or wine or something similar, along with a Christmas card. Maybe something small for the useful technicians as well. It’s good to be generous at Christmas time!", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/drba5ox/"}, "88": {"Subreddit": "PhD", "Author": "spookylake", "Date": 1513475471, "Score": 2, "Body": "Yes, its true. Generally the top schools 100% fund every student, because they have the money to do it, and an RA after the first 2/3 years. At other schools you might have money the entire time but you will be a TA for 5 years or have to spend some effort to maintain your funding status, like applying for fellowships.", "Permalink": "https://www.reddit.com/r/PhD/comments/7iyl94/what_to_do_about_the_new_gop_tax_plan/drcx5b2/"}, "89": {"Subreddit": "PhD", "Author": "kaygee_ki", "Date": 1513478611, "Score": 1, "Body": "Omg that's such great advice! I'm switching advisors because mine turned out to be the worst decision I've ever made. I was looking through the CV of a really really nice professor who I want to possibly join but I have very little/no overlap with his science. Going to check the phd durations of his students. Thank you!", "Permalink": "https://www.reddit.com/r/PhD/comments/7hwyjo/i_have_to_choose_but_i_dont_know_whats_more/drczixf/"}, "90": {"Subreddit": "PhD", "Author": "tlmbot", "Date": 1513529210, "Score": 1, "Body": "About the GRE - Have you tried study materials for it?  Others have said that if you don't like your current admissions offers this year, it's not the end of the world to try again next year.  I would say that if you end up doing that, please consider picking up a GRE study booklet or two.  My first go-round with the GRE I was not so hot, much like you.  I worked at it a bit using a couple of booklets and improved massively.  -From nothing special to something like top 5 percent or better in both quantitative and verbal.  This was some years ago so I'd have to dig up the details but I was very pleasantly surprised (shocked really) how much that helped.  The GRE is a game you can win, especially having a 3.8 in EE it should be a snap.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/drdp7e1/"}, "91": {"Subreddit": "PhD", "Author": "Meggiekins", "Date": 1513566827, "Score": 2, "Body": "You and /u/Cephas_Yohanan really made me feel a lot better. Thank you both for sharing.", "Permalink": "https://www.reddit.com/r/PhD/comments/7j2xp9/first_year_phd_on_a_rollercoaster_of_emotions/dremw6j/"}, "92": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513597370, "Score": 1, "Body": "You seem to discount mix race people in your survey. You should have where people can put multiple ethnicities and then use a slider scale for each of them.\n\nAlso, there were a few other questions that were confusing and I felt I couldn't answer. I actually ended up quitting the survey...sorry!", "Permalink": "https://www.reddit.com/r/PhD/comments/7iq9to/please_help_fellow_phd_students_by_filling_out/drf2j1q/"}, "93": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513597650, "Score": 1, "Body": "I would say not to give one if it isn't your department's culture unless you really want to.\n\nI was my supervisor's first student so there wasn't a standard for her. But PhD students in my department are expected to give gifts to each other and our supervisors when we come back from traveling, so I ended up getting my supervisor random little gifts pretty often...she has them all around her office. But for Christmas, I always give her and her husband a bottle of wine and some chocolate. I would get her kids a little something too...but that's also different because I babysat them quite a bit.\n\nEither way, if you feel like you should give a gift...even if it's not in the culture, a bottle of wine is normally fine. If you don't feel like you should, then don't.", "Permalink": "https://www.reddit.com/r/PhD/comments/7iksuv/christmas_gift_for_supervisor/drf2nbh/"}, "94": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513598092, "Score": 3, "Body": "Congrats! Something similar just happened with me. I had two pass with no corrections (well one minor: remove a citation but nothing official) and one that hated everything about it and said it was poorly written. My viva came and the mean examiner ended up making a complete fool of himself with his questions and attitudes (he got a model completely wrong and I had to correct him). I was told later that when it went into the private session of just my BoE, he got told off. I ended up having to make minor corrections of stuff he wouldn't let go of. There are just those people that feel like making a point. But my bad examiner ended up burning a lot of bridges that day.", "Permalink": "https://www.reddit.com/r/PhD/comments/7gtxhj/i_received_my_phd_examiners_reports/drf2u3c/"}, "95": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513598397, "Score": 1, "Body": "I always said no to undergrads if I was unavailable. Just simple say something like \"I'm sorry. I'm unavailable at those times. I would be more than happy to help you in the future, but it would be best to give me more notice so you don't run into this problem again. Thank you.\"", "Permalink": "https://www.reddit.com/r/PhD/comments/7g8uow/am_i_being_too_rude_to_my_undergrad/drf2yvv/"}, "96": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513599567, "Score": 1, "Body": "I have a bad history with the GRE. I took it when some really bad things happened in my life and it certainly reflected in my embarrassing score. I ended up still doing a masters in the US and then decided to do a second masters in a different field at a world-renowned university in Europe (where they didn't care about my GRE). When I applied for my PhD (at a worldwide top 20 school in my field), they saw my second master's university and I was immediately accepted...well there was a 10 minute interview where they verified that I had really attended the other university. My point is: you don't need to let your GRE score hold you back. Just start looking at places that don't care about it. There are amazing schools that care more about your abilities than a test.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/drf3i1p/"}, "97": {"Subreddit": "PhD", "Author": "ohkay27", "Date": 1513600007, "Score": 1, "Body": "I had a very bad time when I first started my PhD and it only got worse when some personal tragedies rocked my family in my final 8 months. What helped me immensely was counseling. I really recommend it. I also downloaded a few meditation apps and joined a yoga group with other PhD students in other departments. That helped me a lot.\n\nEveryone is different and what helped me may not help you. The only advice that I can really give you is to say: Take care of yourself. Your mental health does come before your PhD work. You matter.\n\nEdit: I just saw your username...if you really can't sleep (which I couldn't for around six months), I highly recommend Sleepio. I ended up getting it free because a university was doing a research project about it's effectiveness (may have been University of Bath). I'm not sure if that's still available, but the program was great!", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/drf3phg/"}, "98": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1513628234, "Score": 3, "Body": "The Economist is ok. But I think the best resources are the original guide / tests. You'll get more feedback at /r/GMAT but everyone has their own opinion based on what worked for them.\n\nI found other 3rd party materials to underestimate your score (my theory is they do this so that you feel like you have to buy their product and improve your score). I got in the 90th percentile with 2 weeks of cramming with the original guide / tests. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7khjbu/which_gmat_test_prep/drfrj0b/"}, "99": {"Subreddit": "PhD", "Author": "BoldAbrasive", "Date": 1513777883, "Score": 1, "Body": "If you have done qualitative research then you could defend a small sample size with grounded theory and data saturation. Fuchs and Lawrence (2015) wrote a paper about data saturation and that it isn't necessarily achieved by having a large number of respondents. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7gll3x/regarding_defending_your_research_with/dripu5l/"}, "100": {"Subreddit": "PhD", "Author": "Psilociraptor3", "Date": 1513789732, "Score": 1, "Body": "In my fourth year of my biochem undergrad I caught Lyme disease and was only diagnosed about a year after the fact by which point it totally ravaged my nervous system, joints, and heart. I was magna cum laude (probably would have been suma cum laude if it weren't for the last three years of miserably crawling to the finish line. not to mention it was all physics and inorganic chemistry which was contrasting my new interest in microbiology...). So you can bet it's been a bit of an awkward disappointment to my family to announce my disinterest in pursuing academia any further. I also gradually fell out of contract with the professor I was doing undergrad research with. And more awkward than that is that he lives right down the street from me. Some of my other professors during those years don't really look me in the eye. But what can you do, health is first. And I have no regrets. I've just been working in sales, selling stuff on ebay, setting my own hours and giving myself what I need. Now that i've had a chance for a little break and perspective i'm starting to reconsider my decision to do a PhD. But not because I feel it is vital to my success. Sales has opened up all sorts of opportunities I could move forward with. I just sort of miss doing science and have a better idea of what i would want out of it as well as what my limitations and potentials are", "Permalink": "https://www.reddit.com/r/PhD/comments/7gfo3s/how_not_to_feel_guilty_about_leaving_a_phd_mainly/drj0fbs/"}, "101": {"Subreddit": "u_BioSerendipity_PhD", "Author": "BioSerendipity_PhD", "Date": 1513896885, "Score": 1, "Body": "Because humans exhibit daily rhythms in many physiological processes including stomach acid production and digestion #circadianbiology", "Permalink": "https://www.reddit.com/r/u_BioSerendipity_PhD/comments/7lag2p/why_is_heartburn_common_at_night/drlcemb/"}, "102": {"Subreddit": "PhD", "Author": "stardustimagine", "Date": 1513905150, "Score": 5, "Body": "You sound like me. “I quit before they could fire me. “, except mine was “before they could find out my incompetence “. \n\nOut of desperation, I also went to grad school in a subject in which I took only one course in. Support during grad school was really minimal (no relevant courses to take, minimal supervisor or peer support), and I found myself struggling every step of the way. On top of that, I have lost my higher steady income from work.\n\nCould you talk with current students there to see how it is like?\n\nBut you are still relatively young and you can try different things. But just keep in mind that jumping into something out of desperation may just end you in another “trap”.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drlj28g/"}, "103": {"Subreddit": "PhD", "Author": "Destructit19", "Date": 1513907470, "Score": 2, "Body": "I've had the opportunity to talk with some phd students, and they all seem happy there. They do seem like a bucnh of loud guys who get along well, which is very good, but also intimidating", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drlkw2q/"}, "104": {"Subreddit": "PhD", "Author": "EliteCloneMike", "Date": 1513914368, "Score": 3, "Body": "Hey,\n\nI feel slightly similar. I worked in a couple research labs in undergrad, then did some volunteer work for a bit at the DC Zoo after graduating. Afterwards I went into a full time lab job in the industry as a Biologist. While in my job, I started my MS as a half time student. Now I’m close to finishing my MS and started a new lab manager job about six months ago at an Ivy League University. I’ve also had some NIH training and volunteer at a lab for citizen scientists. I applied for PhD programs this past month and am awaiting a response. Very stressful.\n\nI 100% get the imposter syndrome feeling that you mentioned too. I’m always hoping to see some flashing light saying “you got there” or “you did it” or something similar. For me it sometimes doesn’t feel like enough for people to just sometimes mention what I’ve done well. I also feel that I dwell on the experiences of people pointing out my failures more than my successes.\n\nBut we are all human and people sometimes forget this. I like to try to avoid being the person that call out fault in others so easily (some labs are oversaturated with this type of personality). I would feel comfortable doing so if I was perfect, but no one is.\n\nThe best view I ever heard, which was in reference to someone moving far away on multiple occasions, was that a person can change environments, but they inherently stay the same. I think this logic can apply to transitioning to a new chapter of life. As much as I want to change my personality or feel like someone else would be a better fit (which may be true), the people who chose you must have seen something in you.\n\nI am also very good at first impressions. I also believe that lasting impressions are just as important. People will probably forget the stuff in between. I’m still pretty young and going on a journey just the same as you, feel free to message me if you want to know more, but I think you will be fine.\n\nBest of luck going into the future!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drlqd1x/"}, "105": {"Subreddit": "PhD", "Author": "zerofunhero", "Date": 1513928768, "Score": 2, "Body": "Go for it! If it helps, feel free to see it as any other job (commitment-wise) with the understanding it is okay to leave if it really does prove too challenging for whichever reason. Sounds like you may be ready for a change of scenery, you would not have applied if it was really against your interests, and the associated supervisors clearly see potential in you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drlyuji/"}, "106": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1514008783, "Score": 2, "Body": "I'm in a somewhat similar situation: I didn't major in my PhD subdiscipline (I minored in the parent discipline and my major shared the same techniques and skills as the subdiscipline). I'm also a little scared, but what has been helping me is to break down what is intimidating me, and work on this preemptively. Basically trying to turn the anxiety into something productive. I start my PhD in two months for context. \n\nIn my case, I'm most worried about the coursework. What I have done is speak to more senior students in the program and figure out what textbooks are used. I have obtained these and am looking through what isn't as familiar to me. I have spoken to my supervisor about the prospect of taking an additional advanced undergraduate course to consolidate my knowledge. My supervisor has also provided me with a list of useful textbooks and we will discuss my progress and level of comfort in the new year. \n\nJust remember, they would not have admitted you if they thought you didn't have the potential to succeed in the program. It sounds like you were happy and thrived in university settings. I can appreciate how much your self esteem can disintegrate in a bad job. Bad jobs happen to good workers. If you are polite and hardworking, you can probably be a great employee somewhere. All it would take would be one good professional experience to turn around how you perceive yourself. Just remember that - don't base your self worth off one job that happened to suck. More people have been there than you may realise. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drngnqr/"}, "107": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1514009510, "Score": 2, "Body": "Also, I can say I'd probably be bored to death as an accountant, and it's hard to have that laser eye for detail when you feel disengaged and exhausted. A PhD is very different to either of those jobs, and I'm sure you've learned a lot of life lessons from the experience too. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drnh231/"}, "108": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514010861, "Score": 2, "Body": "Over half of doctorate students suffer from depression.  It is a very stressful period.  I felt isolated and felt isolated and depressed myself.  So I started a fraternity for doctoral students to give them a sense of community and help them along their path.  If you want to take a look, visit us at www.pigammapsi.org.  You can at the very least talk to other people that understand what you are going through.  I can pm you my contact info if you need more information, or just an ear to listen.", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrdey/severe_anxiety_and_depression/drnhqcp/"}, "109": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1514012476, "Score": 2, "Body": "Yes.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drnih1h/"}, "110": {"Subreddit": "PhD", "Author": "SangiHermit", "Date": 1514014330, "Score": 4, "Body": "Congratulations!! Happy holidays. Everything will fall into place. Don't worry :-)", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drnj9ws/"}, "111": {"Subreddit": "PhD", "Author": "xtrumpclimbs", "Date": 1514030664, "Score": 2, "Body": "Congratulations!!!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drnouq7/"}, "112": {"Subreddit": "PhD", "Author": "Merantaz", "Date": 1514049907, "Score": 1, "Body": "Congrats! Where did you graduate from?", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/dro030n/"}, "113": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1514054120, "Score": 3, "Body": "Congrats! Defending is weird and can feel anticlimactic. Not everyone feels like they just finished something impossible, so it’s ok to feel however you feel about it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/dro3chc/"}, "114": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514063120, "Score": 3, "Body": "Thanks! My committee is strongly encouraging me to publish my research because it current and relevant.  I think will focus on the publication in the next few months.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/droa6b7/"}, "115": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514063254, "Score": 5, "Body": "I think it is the sudden change from constant stress to much less stress that throws the body for a loop.  You get used to the struggle you are not sure what to do when you are free.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/droaa3g/"}, "116": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514063265, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/droaae2/"}, "117": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514063285, "Score": 1, "Body": "CTU", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/droaaxr/"}, "118": {"Subreddit": "PhD", "Author": "peeteep", "Date": 1514070959, "Score": 4, "Body": "Congrats! I am experiencing something similar. The day of my defense in fact really did feel like a climax, but I did not prepare very well for what comes after (i.e. now). I think it’s best to just enjoy the holidays for now and start ‘fresh’ next year. Good luck on finding a position next year and happy holidays :-). ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drog1oz/"}, "119": {"Subreddit": "PhD", "Author": "Destructit19", "Date": 1514071018, "Score": 1, "Body": "A good post man, thanks for writing. I'll definitely mail my supervisor for some textbooks and literature that I can read in advance. \n\nI realize that one bad job shouldn't hurt my self-esteem. And my first job didn't. It's after being bad in two jobs that I started to loose confidence, thinking that I won't be good in any job. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drog391/"}, "120": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514091122, "Score": 2, "Body": "Imposter syndrome.  I had the same issue when I started my program.  I was fortunate enough to have some good processors who gave me a look \"behind the scenes\" of having a doctorate.  There are some that like to put up a front but they are people just like you.  You don't suddenly change once you defend, which actually takes getting used to.  \n\nYou will do fine.  Just focus on what you need to do, do your best, and listen to advice from your mentor if you have a good one.  But don't let anyone berate you or look down on you.  You will do fine.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/droubvq/"}, "121": {"Subreddit": "PhD", "Author": "culturecouture", "Date": 1514155869, "Score": 5, "Body": "My BA was in fashion, my PhD is in science. (In between that I received my Masters in science however.)\nFake it till you make it.", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drpvrsd/"}, "122": {"Subreddit": "PhD", "Author": "raamiah95", "Date": 1514158416, "Score": 7, "Body": "My BA was in English with Classical Studies (essentially ancient history without the chance to learn any ancient languages) and my PhD is in Classical Civilisations/ Ancient History. While this isn't as polarised as the other example I've seen posted, it means I've had to learn from scratch both Ancient Greek and Latin in under a year, and I now study alongside a group of people essentially fluent (or as fluent as you can be) in dead languages that they've been learning since an early age. \n\nIt's easy to feel inferior to my fellow PhDs because of this, but then I remind myself that I am knowledgeable on more modern literature in a way that many of my colleagues are not, and as a result I am able consider how ancient literature and practices have shaped later cultures and their writings: I have my own niche and skill set! So with that in mind I definitely agree with the previous answer - it's all about faking it until you make it, but it's also about framing your past experiences in a positive way, and celebrating the uniqueness your academic history gives you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drpxmmj/"}, "123": {"Subreddit": "PhD", "Author": "kinnunenenenen", "Date": 1514160545, "Score": 3, "Body": "So, yeah, you might be weak in some fields relative to your peers. But your different background is also a strength, youll be better at some things!", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drpz7zp/"}, "124": {"Subreddit": "PhD", "Author": "ryleto", "Date": 1514211241, "Score": 1, "Body": "#preach", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drqmouc/"}, "125": {"Subreddit": "PhD", "Author": "Klad_Steel", "Date": 1514216568, "Score": 1, "Body": "Read an introductory textbook in that area and you’ll be just fine", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drqph89/"}, "126": {"Subreddit": "PhD", "Author": "Chewbacta", "Date": 1514217959, "Score": 3, "Body": "My BA/MA was in Mathematics and I did a 12 month MSc in Mathematics and Computer Science and I recently graduated with PhD in Computing. I actually felt the mathematics background gave me an advantage since my thesis consists of a large number of proofs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drqqb1u/"}, "127": {"Subreddit": "PhD", "Author": "Cicero314", "Date": 1514221289, "Score": 1, "Body": "You were already admitted to the program. If there faculty thought for a second that you couldn’t hack it they wouldn’t have admitted you. Work hard to fill any gaps in what you need to know—if you can spend the summer before the program starts doing it.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/drqsf4v/"}, "128": {"Subreddit": "PhD", "Author": "FIST_IT_AGAIN_TONY", "Date": 1514234377, "Score": 5, "Body": "Where are you from?", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drr1e8b/"}, "129": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1514241632, "Score": 2, "Body": "This doesn't seem a nice situation at all. What do the university say on the matter? Is there some protocol in place for visa applications? You would be on their payroll, so they would have some obligation to your legal status. \n\nI would think, anyway. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drr6gti/"}, "130": {"Subreddit": "PhD", "Author": "boilerchemist", "Date": 1514263540, "Score": 2, "Body": "I cannot talk about Europe/Italy, but from the US perspective, if you've been given an admission and if you're unable to attend the university for the term you have been admitted to, you can ask for the university to defer it by a semester or a year. I have heard of a few stories of international students being rejected for visa, followed by deferment, and university providing detailed support documents strengthening the case for a successful visa interview, finally resulting in the student joining the university a year or so later. The key here is to contact your university and ask them for further instructions. You are obviously free to apply for visa as many times as you want, and usually genuine applicants get through the process with strong support from the university, which they usually provide. This is under the assumption that you don't have any criminal convictions, including DUIs, or affiliation to any known illegal organizations.\n\n\nDon't lose hope. Best wishes!", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drrl6r6/"}, "131": {"Subreddit": "PhD", "Author": "topumasum", "Date": 1514280567, "Score": 3, "Body": "Bangladesh and yeah I know the deal with 'immigration intent'", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drrsf4h/"}, "132": {"Subreddit": "PhD", "Author": "topumasum", "Date": 1514280767, "Score": 1, "Body": "Rome University asked me to apply again next time...they didnt defer it. And the university didnt really help me through the visa like I heard other universities does usually. Something about their policies changed regarding embassy and the university's communication concerning the student. I dont have any criminal convictions or any other thing. Just that they werent ascertained that i would leave in the end because...I have no ties to my country--no family or properties, job letter wasnt sufficient. I dont know how poor orphans manage to go anywhere if those are the rules.\n\nIve lost hope already..thanks anyway.", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drrshac/"}, "133": {"Subreddit": "PhD", "Author": "topumasum", "Date": 1514280903, "Score": 1, "Body": "Italy doesnt, for some reason.", "Permalink": "https://www.reddit.com/r/PhD/comments/7m29oz/another_phd_offer_with_funding/drrsip8/"}, "134": {"Subreddit": "PhD", "Author": "topumasum", "Date": 1514281559, "Score": 2, "Body": "half and half--the job quitting part--more like i lost it. I also got the phd--but my visa was denied and the uni refused to defer it.\n\nso..im in a worse situation.\nanxiety shot through the roof, with depression. i just wanna kill my ex employer.", "Permalink": "https://www.reddit.com/r/PhD/comments/7ld21d/i_just_got_accepted_into_a_phd_programme_and_im/drrspjj/"}, "135": {"Subreddit": "PhD", "Author": "LuckyBulldog", "Date": 1514288673, "Score": 2, "Body": "Congratulations. I too just defended about a week ago and I am experiencing unexpected emotions. I'm very glad to be done. However, my \"on to the next task ASAP\" anxiety hasn't really allowed me to relax at all.\n\nI hope the announcement to your family yesterday was wonderful! What an exciting time for both of us!", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drrusx6/"}, "136": {"Subreddit": "PhD", "Author": "amesbury", "Date": 1514397549, "Score": 1, "Body": "Can you share some resources that accept publications from non-students?", "Permalink": "https://www.reddit.com/r/PhD/comments/7hrnga/i_am_worried_about_my_chances_of_entering_a_phd/drtqq37/"}, "137": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1514417083, "Score": 1, "Body": "I changed supervisors and it was great! My original supervisor sounds very much like yours. Overbearing, paternalistic, patronising. If I had continued with him I know I would have graduated with a great thesis that he would have written most of, and probably gone on to a postdoc he had organised for me with someone he knew.\nLuckily for me it was easy to swap supervisors because I was forced to when he left the university for unrelated reasons. But I kept him moderately happy with the changes to my research direction and supervision by making him feel involved in the decision making.\nTalk to your supervisor about how your research is interdisciplinary, how you've got some great results coming up with second supervisor, and you think it will form a big chunk of your thesis. When you've got what you need from first supervisor, you could drift over to second supervisor and do whatever you want. \nThat's how it kind of worked out for me anyway. Best thing I could have done for myself.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/dru7nse/"}, "138": {"Subreddit": "PhD", "Author": "Armimas92", "Date": 1514419086, "Score": 1, "Body": "So a couple of things that I should probably have made clear in my original post:\n\n- I'm doing my PhD in the UK, so not everything translates well (e.g. patterns of supervision, lab structures)\n- My research isn't interdisciplinary (it's just common practice here to have 2 supervisors)\n- My supervisor _hasn't_ helped me. Part of the problem is a lack of constructive criticism or direction. In fact, he's explicitly said he's not interested in my research area (despite the fact that my proposal/grant was written for that area) and wants me to move to another tangentially-related one...which I don't want to do\n\nAs for data...i've not collected any yet, I've just started. The problem has been I want to get going and it's been a case of dragging the horse to water _and_ making it drink.\n\nAny thoughts on what you'd have done if your supervisor hadn't moved?", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/dru98kt/"}, "139": {"Subreddit": "PhD", "Author": "Philieselphy", "Date": 1514425744, "Score": 1, "Body": " Are you able to just get started on the data collection by yourself? I have also had a very hands off supervisor (I've had something like 9 in total, with generally a team of 5 at any one time. Two seems like not enough!)\nI would poke around in my data by myself sometimes, under the impression from original supervisor that I was not experienced enough to do so. Even just for your own sanity, always be working on something, and if there isn't anything, there's always your lit review that can be improved. Try to limit how reliant you are on anyone else (easier said than done I know).\nTo be honest, if my supervisor hadn't left, and considering how isolating research can be, I doubt I would have been able to identify that he was a crappy supervisor until it was way too late, and I would have just stuck it out and been miserable. I wouldn't recommend that.\nMaybe just get on with your work with the second supervisor and keep the first in name only?", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/druee66/"}, "140": {"Subreddit": "PhD", "Author": "Armimas92", "Date": 1514426183, "Score": 1, "Body": "No, not really. My subject involves testing of human subjects so ethical procedures need signing off at various points. In order to start collection of data I therefore need 'royal assent', as it were.\nMy problem is he's hands-off in not wanting to get going but hands on in terms of micro-managing me, infringing on my autonomy as an adult. I've been fairly proactive about proposing directions for research which hasn't been supported.\n\nWhy do you suggest going for the 1st in name only and not making the switch?", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/drueq7r/"}, "141": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514442009, "Score": 1, "Body": "Thanks, and congratulations!   I hope your family announcement goes better than mine.  I got a \"that's great\" and the topic changed  :(.  On the other hand, I had many people on my LinkedIn network send me congratulatory messages.  \n\nMy cohorts and fraternity members were excited for me even if my extended family was not.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7ln2en/i_just_defended/drupx9f/"}, "142": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514442330, "Score": 1, "Body": "Don't let your supervisor decide why you research.  It is hard enough to go through the process with a topic you enjoy.  Changing to something you do not care about will make it that much harder to get motivated when the pressure is on.  \n\nDon't let an uncaring supervisor be the reason you end up with a ABD.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/druq3er/"}, "143": {"Subreddit": "PhD", "Author": "Armimas92", "Date": 1514480493, "Score": 1, "Body": "That's exactly what I am doing! But as I said, it's a struggle, and that's why I'm thinking of changing supervisor. My energy should be going into my research, not into fighting to do the research I want.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/drv9sd8/"}, "144": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514504139, "Score": 1, "Body": "I got that from your post.  I just wanted to encourage you to look for a new one. I probably could have stated it better.  Either way, I want to wish you luck on your journey and I hope you find a supervisor that works with you.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/drvv5ry/"}, "145": {"Subreddit": "PhD", "Author": "Armimas92", "Date": 1514515361, "Score": 1, "Body": "Sorry, text probably made me sound grumpier than I meant to. Ta mate! Thanks for the encouragement (งツ)ว", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/drw471v/"}, "146": {"Subreddit": "PhD", "Author": "udumbo", "Date": 1514532265, "Score": 1, "Body": "hey! I'm interested in something similar. Which program / country/ university are you in ? if you dont mind..\n", "Permalink": "https://www.reddit.com/r/PhD/comments/774iuz/just_got_my_phd_funding/drwfdcz/"}, "147": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1514539487, "Score": 1, "Body": "I don't know a great deal about the language, but Bocconni and Bologna or well regarded institutions which may have English language programs.", "Permalink": "https://www.reddit.com/r/PhD/comments/7msw1i/phd_in_italy_in_english/drwiaqq/"}, "148": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1514561954, "Score": 1, "Body": "Choosing an English speaking supervisor would be the best way, but still lots of your lab mates might not speak English.", "Permalink": "https://www.reddit.com/r/PhD/comments/7msw1i/phd_in_italy_in_english/drwtgsk/"}, "149": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1514567944, "Score": 1, "Body": "Oh when my friend visited Germany for a placement he was given intensive language classes for German. This may be the same for you, depending on the country, institution and course language requirement. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7msw1i/phd_in_italy_in_english/drwynei/"}, "150": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1514594340, "Score": 4, "Body": "No research conducted prior to commencement of candidature may be used towards attaining the PhD (at least in Australia). If you want to do new stuff with it, though, that would be totally fine. ", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/drxlabg/"}, "151": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1514605841, "Score": 3, "Body": "This kind of restriction is pretty commonplace in US PhD programs as well, though there may be some exceptions that I'm not aware of. \n\nEdit: moved some content to a new thread.", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/drxu8ss/"}, "152": {"Subreddit": "PhD", "Author": "DrUav", "Date": 1514605909, "Score": 1, "Body": "I do not think you would be able to apply previous work.  However, you may be able to leverage the work and find another application.  You may also be able to do some comparisons to show how it compares against other methods.  You might also want to look at the research method called \"design science.\"  It is not accepted in all schools and is usually used by people in IT/Comp Sci.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/drxuaki/"}, "153": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1514606115, "Score": 1, "Body": "For the PhD, you might look into programs that allow candidates to apply existing methods to novel use cases. Essentially, the dissertation could be an in-depth validation study of the algorithm. That would still involve a lot of coursework that should relate to the proposed dissertation methods, and probably a systematic review of other studies that have since implemented the algorithm. But, by the time that the coursework is complete and a dissertation topic is proposed, the algorithm may no longer be novel (especially if it is already being widely implemented).\n\nIn all honesty, onward-and-upward to new algorithms may be a more rewarding approach for continued graduate studies. There will always be new problems that need to be solved and new approaches will need to be developed. Why focus on an existing algorithm when you can develop something new that could also make an impact in the field? (That's not a rhetorical question - I think that the underlying motivation for basing a PhD on past research is important to discuss.)", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/drxug01/"}, "154": {"Subreddit": "PhD", "Author": "SubjectiveReality_", "Date": 1514634458, "Score": 1, "Body": "There will be numerous use cases for the algorithm within the field so that could potentially be an avenue I could take.  I have already performed comparisons against other methods, this was required to prove that it is in fact better and quantify how much better it is.  I've not heard of design science before, I'll take a look into it. Thanks for your response :) ", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/dry7v9d/"}, "155": {"Subreddit": "PhD", "Author": "SubjectiveReality_", "Date": 1514635562, "Score": 2, "Body": "I have actually already performed an in depth validation of the algorithm.  I have conclusively shown that the algorithm is in fact superior to other methods and quantified the degree of superiority.  The algorithm is not widely used as of yet, it's adoption is still limited but increasing as the scientific community become more aware of its existence. \n\nI should have made it clear in my OP.  Ultimately I would like to land a position in industry but many of the jobs I am interested in require a PhD.  I thought that by capitalising on the research I have already done I would be able to reduce the time it would take me to attain a PhD.  I would like to think the quality of the research is at the standard of a PhD and would like some type of formal accreditation for it. \n\nThanks for your input :)  ", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/dry8906/"}, "156": {"Subreddit": "PhD", "Author": "nevk_david", "Date": 1514644118, "Score": 1, "Body": "In the Netherlands it is absolutely possible, and I guess in other European countries as well. \n\nThe requirement will often be that prior work fits in the whole thesis, or the other way around, that you find 2-3 more substantial projects that can be logically linked with your current work to make up your final thesis. Of course there needs to be money and interest for this. \n\nI want to encourage you to do it. It will be rewarding and as you have shown that you are able to finish a project this is a fair predictor of finishing your PhD thesis successfully. \n\nTalk to your supervisor! ", "Permalink": "https://www.reddit.com/r/PhD/comments/7my4gi/can_i_convert_my_research_project_into_a_phd/dryc2um/"}, "157": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1514662149, "Score": 3, "Body": "If you are *very, very* keen on doing a PhD in Italy, wouldn't it be a good idea to start learning Italian? It is a very beautiful language and not too difficult to learn, in my opinion.", "Permalink": "https://www.reddit.com/r/PhD/comments/7msw1i/phd_in_italy_in_english/dryq0vz/"}, "158": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1514662200, "Score": 1, "Body": "I totally switched gears heading into my PhD. I am a statistician doing a qualitative project! It is extremely rewarding, but be prepared for the first few months to be really tough.", "Permalink": "https://www.reddit.com/r/PhD/comments/7lxxl8/phd_outside_of_undergraduate_major/dryq2i7/"}, "159": {"Subreddit": "PhD", "Author": "tjel", "Date": 1514764615, "Score": 1, "Body": "Changing supervisors is not at all uncommon; can you speak to your head of program about it and ask them how to navigate it so as to not upset anyone? They should be very experienced in such matters. I would think being your supervisor's first PhD is a huge red flag too; at my uni they need to have been involved as secondary supervisors so they can get experience before they're allowed to be a primary. Perhaps, if you need to talk to them directly, you could cite their lack of familiarity/interest in your research topic as the primary reason, and the lack of supervision experience as a further reason if that's not enough. But hopefully your head of program will be about to help you figure out the best way to do it.\n\nGood on you for advocating for yourself and looking to make this change! It seems as PhD candidates we're often told to just be grateful for what we've got, but working for better when it's an option is the only way to maximise what you can achieve during your program and, accordingly, your opportunities afterwards.", "Permalink": "https://www.reddit.com/r/PhD/comments/7mfzue/changing_supervisor/ds0mxjo/"}}