{"0": {"Subreddit": "PhD", "Author": "ForgottenPotato", "Date": 1459471893, "Score": 1, "Body": "Yes ", "Permalink": "https://www.reddit.com/by_id/t3_4cr10i.json"}, "1": {"Subreddit": "PhD", "Author": "Throwaway_2414", "Date": 1459487147, "Score": 4, "Body": "Went just fine. They noticed some obvious formatting errors in the dissertation that I felt mildly embarrassed for not catching, but I gave an awesome talk and otherwise things went fine.\n\nAlso I'll get a chance to fix the errors.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "2": {"Subreddit": "PhD", "Author": "porterble", "Date": 1459493290, "Score": 1, "Body": "Great! Well done despite/in spite of your supervisor.", "Permalink": "https://www.reddit.com/by_id/t3_49lhgw.json"}, "3": {"Subreddit": "PhD", "Author": "rindrel", "Date": 1459535256, "Score": 1, "Body": "Oxford? Congrats! \n\nAnyway, have you tried the AHRC or the ESRC? They seem like the most relevant research councils.  \n\nIs there a relevant learned society you could contact?  \n\nSorry if you've already done these.", "Permalink": "https://www.reddit.com/by_id/t3_4cwfd9.json"}, "4": {"Subreddit": "PhD", "Author": "alwaysbelagertha", "Date": 1459562733, "Score": 1, "Body": "Omg, yes, I mean No!", "Permalink": "https://www.reddit.com/by_id/t3_4cr10i.json"}, "5": {"Subreddit": "PhD", "Author": "alwaysbelagertha", "Date": 1459562964, "Score": 1, "Body": "This is amazing, huge congrats. I'm in the US so can't offer you much insight, but did you check your school's listings for assistantships? Hopefully there are some in your department, Here in the US PhD fellowship comes with tuition waiver &amp; stipend, I'm guessing it must be similar over there as well. Finally, you should see if they will allow you to teach UG level courses as an adjunct. Hope these help, and I wish the best to you.", "Permalink": "https://www.reddit.com/by_id/t3_4cwfd9.json"}, "6": {"Subreddit": "PhD", "Author": "alwaysbelagertha", "Date": 1459563140, "Score": 1, "Body": "I have to continue with post-doc in an AMC since my speciality area/certification requirements necessitates 2 year post-doc. It's something I'm looking forward to though since I have to master bunch of topics unrelated to my focused interests during the phd that I hardly get to spend ample time for what I really care for.", "Permalink": "https://www.reddit.com/by_id/t3_4bor9a.json"}, "7": {"Subreddit": "PhD", "Author": "Dunder-Mifflin", "Date": 1459598097, "Score": 4, "Body": "&gt;I'll be studying gender politics in hacking and trolling cultures, and I am currently studying Reddit for my masters, so any internet/social science type funding would probably be most appropriate.\n\nAre you an advanced troll?", "Permalink": "https://www.reddit.com/by_id/t3_4cwfd9.json"}, "8": {"Subreddit": "PhD", "Author": "AnonymousSociologist", "Date": 1459697274, "Score": 2, "Body": "&gt; assistantships\n\nI'm on the ESRC waitlist, I'll check out AHRC thanks!", "Permalink": "https://www.reddit.com/by_id/t3_4cwfd9.json"}, "9": {"Subreddit": "PhD", "Author": "AnonymousSociologist", "Date": 1459697563, "Score": 1, "Body": "Thank you! I think I can just earn a bit of extra cash. Is that like helping with research and teaching? (This world is a bit new to me!)\n\nI'd really love to be involved with that, so if I can get some cash for it that's fantastic", "Permalink": "https://www.reddit.com/by_id/t3_4cwfd9.json"}, "10": {"Subreddit": "PhD", "Author": "perthtemp71", "Date": 1459753464, "Score": 1, "Body": "Wouldn't you go where you get the best supervision? ie, where the experts in your field are?", "Permalink": "https://www.reddit.com/by_id/t3_44w093.json"}, "11": {"Subreddit": "PhD", "Author": "boxofdice", "Date": 1459812843, "Score": 1, "Body": "PM'd you.", "Permalink": "https://www.reddit.com/by_id/t3_49w9st.json"}, "12": {"Subreddit": "PhD", "Author": "fawkesdotbe", "Date": 1459849057, "Score": 10, "Body": "I suppose a mix of \"because that's how we all feel\" and \"confirmation bias\".", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "13": {"Subreddit": "PhD", "Author": "mind_numbing", "Date": 1459864088, "Score": 11, "Body": "Because it's a microcosm of an avg. PhD student's life; marred, by the combination of high intellectual expectations and low economic value in society.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "14": {"Subreddit": "PhD", "Author": "AllUncertain", "Date": 1459867099, "Score": 3, "Body": "I have one. It seems to be an attempt to make an academia wide ID system for authors, similar to what ISBN does for books.\n\nI don't think it really has traction yet, so I wouldn't say it is useful. Maybe if it becomes a standard it will be useful.", "Permalink": "https://www.reddit.com/by_id/t3_4df9uy.json"}, "15": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1459875333, "Score": 4, "Body": "If it makes you feel any better...\n\nMy years as a PhD student were definitely some of the hardest of my life, but also some of my BEST.  I wouldn't trade them for anything.  I had a very understanding advisor, and was able to do a lot of incredible field work.  Before going back to grad school I sat in a cubicle 8 hours a day...so I gladly took the stress of dissertation prep over the corporate soul-sucking tedium of a dilbert job ;-)\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "16": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1459875473, "Score": 1, "Body": "I would add that there are two defining moments you'll never forget that are also worth the struggle.\n\n1. The random day you walk up to your graduate school office after your defense and turn in your signed dissertation form.  I still remember that day vividly.\n\n2.  The day of your graduation, wearing that spiffy gown, and hearing your name being introduced as \"Dr.  xxxxx\" for the first time.  One of the most poignant moments of my life.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4cr10i.json"}, "17": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1459882697, "Score": 8, "Body": "This has basically already been covered byte other posts, but what is academia if not repeating what others have said while adding a little more:\n\n1. Doing a PhD can be tough at times for a lot of different reasons. As a result a lot of posts here can be on the negative end of the spectrum.\n\n2. People are probably more likely to report on things that are strongly positive or negative. It's unlikely that somebody would make a post about how their day in the lab \"went pretty well but was unremarkable in every aspect\". It's not very interesting and there's no interactive element. However people posting something negative could be looking for catharsis or guidance.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "18": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1459885914, "Score": 3, "Body": "you essentially just tl;dr the past 2.5 years of my life.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "19": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1459897683, "Score": 1, "Body": "That's only for some BS social science and natural science. Engineers, doctors, and business are doing well.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "20": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1459906625, "Score": 3, "Body": "That's how I feel about my PhD. You summed it up in very nice words.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "21": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1459914542, "Score": 2, "Body": "in some fields yes, in others no/", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "22": {"Subreddit": "PhD", "Author": "Mechanical_Bear", "Date": 1459922050, "Score": 2, "Body": "In my field (computer science), definitely not.", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "23": {"Subreddit": "PhD", "Author": "Baudin82", "Date": 1459925417, "Score": 1, "Body": "I'm in life science. I will after my dissertation add some courses to get licenced to work in a hospital laboratory. My goal is to use my science experience to work with developing new diagnostic tools for microbial diseases. ", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "24": {"Subreddit": "PhD", "Author": "bongobarbie", "Date": 1459934446, "Score": 3, "Body": "Doing a PhD funded by my company, pretty sure they don't want me to go work in academia", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "25": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1459934753, "Score": 2, "Body": "How many PhD graduates end up in tenure track positions? 5%? Less?\n\nAcademia is a super niche \"alternative\" career path. It's really weird that it gets so much focus. ", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "26": {"Subreddit": "PhD", "Author": "QDefenestration", "Date": 1459936648, "Score": 3, "Body": "I mean, given that the job market is so terrible that most of us are going to have to get jobs elsewhere, I imagine for a lot of us it's a Climb-the-mountain-because-it's-there situation", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "27": {"Subreddit": "PhD", "Author": "Aplos9", "Date": 1459943883, "Score": 3, "Body": "Do we have some source studies for this?  I'm not saying you are wrong.", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "28": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1459944571, "Score": 1, "Body": "I saw an article in either nature or chronicles of higher ed. It was on paper :(\n\nMaybe somebody else has a link?", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "29": {"Subreddit": "PhD", "Author": "dny6", "Date": 1459953960, "Score": 5, "Body": "You think people who are having a good/above average PHD experience are on here whining? no! \n\nedit: I have a friend at a top STEM PHD program who is very happy, never has had to sacrifice sleep or health, and has weekends more or less to himself. ", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "30": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1459954714, "Score": 2, "Body": "absolutely not.  I work in a lab, and many in my field (geoscience) go to work for industry.  The competition for academic (particularly tenure-track) positions is fierce right now, so you almost have to be a bit flexible.  You can pretty much expect to do at least one post-doc (probably 2-3) as well before even being remotely marketable for a tenure track position (a lot different than 30-40 years ago).", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "31": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1459960132, "Score": 2, "Body": "&gt;Climb-the-mountain-because-it's-there situation\n\nSpot fucking on mate", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "32": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1459975517, "Score": 1, "Body": "Again, this is only true for social sciences and natural sciences. 95% of Business PhDs end up in tenure track positions. Not counting for profit schools and similiar shit", "Permalink": "https://www.reddit.com/by_id/t3_4djzix.json"}, "33": {"Subreddit": "PhD", "Author": "Cbear123", "Date": 1459991403, "Score": 1, "Body": "Doctoral programs are usually a completely independent application. They will likely just look at your transcript and GMAT/GRE scores and determine admissions. Compsci should have enough of a math focus to be prepared for physics. ", "Permalink": "https://www.reddit.com/by_id/t3_4dombk.json"}, "34": {"Subreddit": "PhD", "Author": "backgammon_no", "Date": 1460021705, "Score": 3, "Body": "What is your field? In science I have a hard time imagining that anything done for an assignment would be publishable at all. In the humanities I can imagine that you could rigorously address assigned questions. Your % grades are not relevant. ", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "35": {"Subreddit": "PhD", "Author": "perthtemp71", "Date": 1460023715, "Score": 1, "Body": "Humanities\n\nI mention my grades to show I can write relatively well.  I'm not sure how much input editors have in recommending changes/making changes. Honestly, I'm unsure of the process.", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "36": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1460026683, "Score": 3, "Body": "Have you asked any of your professors? I'd start there. I'm not familiar with that field, but at least in science and engineering having someone with experience backing your paper makes it easier for it to be accepted. \n\nAlso, at least in my field sometimes Professors have small projects that they need help with and that can help you to publish faster.  ", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "37": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1460031255, "Score": 3, "Body": "I'm finishing my 2nd year and I'm flying back home after my first international conference. I just presented a poster but I'm still pretty proud of myself, everyone has to start somewhere I guess. I even got to exchange some ideas with a prominent professor in my field like if we were peers already. I also submitted my first journal paper three weeks ago and I'm finishing my second one. I feel like I keep a good work-life balance, I'm married and I work Monday to Friday 8-5 unless I have a deadline to meet or I'm working on a project in the lab that needs to run out of working hours. \n\nThat said, it hasn't been easy to reach this stage and there's definitely been more tears than happy moments. Battles are long and hard, but you get some small victories every now and then before the largest victory that is your degree. But I guess if it was easy then everyone would have a PhD (?)", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "38": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1460031788, "Score": 1, "Body": "Im assuming you're wanting to publish your masters thesis? I'd speak to your supervisor and let him/her know from the start these are your thoughts as a.) they'll have input in the project and you don't want to potentially publish something they've helped alot with without their name on it and b.) they can guide you in the process and will know alot more about structuring papers and what journals to aim for. \n\nTheres absolutely nothing wrong with publishing at a msc  or even bsc level if the work is quality \n\n(that being said, also don't get too hung up on the publish or perish mentality too early on. I got accepted to a PhD program with no publications at quite a good uni, they were more impressed with my past research experience, seeking out internships so on so on.\n", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "39": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": 1460032182, "Score": 2, "Body": "Are you me? I quit a stable well paying job in a top company to be a poor grad student. I have never worked so hard in my life but I've never felt so good about it either.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "40": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1460035113, "Score": 3, "Body": "ha...I don't think so ;-)  It does seem to be a more common trend among x-gen and millennials to pursue passion over stability.  I was certainly stable at my last job, but had I not made the risky decision to start over, I never would have spent time doing field work all over the world and had the opportunity to earn a PhD in a fascinating field of study.  That said, I definitely didn't really sleep at all for the 2 months leading up to my dissertation defense.", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "41": {"Subreddit": "PhD", "Author": "cambrain", "Date": 1460036358, "Score": 2, "Body": "Hi there, I am currently about halfway through my first year of my PhD at Cambridge University. I'm based in the sciences and had a little journey to get here. I applied for PhDs straight out of undergrad, to the usual kind of suspects (Imperial/UCL/Oxbridge etc) but was rejected from all but one in Vienna, which I decided not to take as felt the project wasn't a perfect fit (although the money was great!). I was applying with firsts throughout my undergrad and achieved the overall highest grade for my course. I then stayed on at UCL and did a MSc in a related field to become a little more specialised; after which I decided to apply for PhDs again. This time I was offered interviews at all my choice universities (apart from Edinburgh.. not bitter..) and had rigorous interviews from all. However, Cambridge in particular was challenging as I not only had my Cambridge academic interviews, but also interviews with both my industrial sponsor and research council.\n\nAfter all that, it took around 2-3 months to hear that I had been accepted at Cambridge AND that the project funding was secured (two different things).\n\nThis was a little bit of a ramble. But just to say, that you can graduate from undergrad with great grades, extra stuff on your CV, be the captain of the rugby team, but ultimately experience counts (for a lab based PhD anyway). So, don't give up if applying straight from undergrad doesn't work out!\n\nI was/still am 22 years old when I started. I think the reason I got the PhD was just perseverance i.e. a continued interest in wanting to do a PhD from before graduation/after/MSc etc; you've got to show your hunger (for the interviews at least!). Also, great grades don't hurt! :)\n\nThe only regret I have is having to split my time between an academic and my industrial environment - it's making it a little tricky to meet any like-minded PhD students, and Cambridge isn't well known for having the most sociable students.. haha.\n\nTake home message: apply, re-apply, get experience, try again and you will definitely get there! Don't give up!!", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "42": {"Subreddit": "PhD", "Author": "perthtemp71", "Date": 1460038539, "Score": 1, "Body": "Thanks - that's really helpful.  RE the publish or perish mentality - the university I want to work in awards points based on publication.  If you don't publish you are severely disadvantaged when jobs are offered.", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "43": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1460056711, "Score": 1, "Body": "I went through a very similar track.  My undergraduate was computer engineering, and once I graduated I worked for several years in that capacity.  I had always regretted not following my true passion though - geoscience.  So...after 7 years of industry life, I took the GRE's, wrote a compelling essay, and applied to several graduate programs in geoscience.  I'm not going to lie...I was declined at most, but I did get into my preferred choice was able to go on to get a masters and PhD in my true passion (discipline in glaciology and geophysics).  It was a little eye opening my first day of grad school when in my first class (dynamics), the prof started scribbling differential equations on the board.  I hadn't looked at math like that in over 8 years.  I spun it back up quickly though and managed to do just fine.\n\nHonestly, the hardest part of it was going from thinking like an engineer, to thinking like a scientist again.  This can be very hard.  Part of most PhD programs involves passing a candidacy or qualifying exam where you must write one or two scientific proposals that pose a valid/testable hypothesis. You must then defend those proposals and show that they correctly apply the scientific method, and that you can think like a scientist.  I barely eeked out a passing result at my candidacy because I had such a hard time re-training my brain to not think like exclusively like an engineer.  But now...I feel I'm a more well-rounded scientist because of my deeper breadth of experiences and knowledge bases.\n\nTwo other quick things:  You'll probably spend your first year taking classes while you prep for your candidacy exam.  Then, once officially a candidate, you'll begin working on your research project.  I might suggest that you pursue a masters degree first.  I know in the end it means doing slightly more work, but I thought it was worth it.  It game me the time and opportunity to see if I really wanted to continue on with a PhD.  If you're not 100% sure you want a PhD and in what specific discipline....a masters is a good stepping stone (if there's funding for you of course).", "Permalink": "https://www.reddit.com/by_id/t3_4dombk.json"}, "44": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1460072828, "Score": 1, "Body": "Yes, you can publish.", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "45": {"Subreddit": "PhD", "Author": "coindepth", "Date": 1460075338, "Score": 1, "Body": "Anything can be published. The more important question is at how prestigious of a journal? The top journals in your field are not going to be a walk in the park. On the other end of that spectrum will be journals that publish anything and everything sent to them. If you are aiming for top journals, it's unlikely (not impossible) that anything you produce in your masters will be of that calibre ", "Permalink": "https://www.reddit.com/by_id/t3_4dq187.json"}, "46": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": 1460122119, "Score": 2, "Body": "In general nobody can accuse the average academic of being a chirpy happy go lucky personality type. \n\nThe doctoral years are generally acknowledged to be times of extreme stress, and, yes, misery.\n\nTo quote a line from The Godfather II, \" this is the business we have chosen.\"\n\nAnother major reason we don’t run down the Quad doing cartwheels EVEN after tenure was articulated by the lead character in the pilot episode of The Sopranos. The New Jersey mob boss sits with a psychiatrist and laments, \"I’m getting the feeling that I came in at the end. The best is over. … I think about my father. He never reached the heights like me. But in a lot of ways he had it better. He had his people. They had their standards. They had pride. Today, what do we got?\"", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "47": {"Subreddit": "PhD", "Author": "desertpower", "Date": 1460131675, "Score": 2, "Body": "Well Illinois is a corrupt and broken state without a budget. ", "Permalink": "https://www.reddit.com/by_id/t3_4dhdo0.json"}, "48": {"Subreddit": "PhD", "Author": "fearingtheflame", "Date": 1460217078, "Score": 2, "Body": "This stigma regarding going to the same school for undergraduate as well as graduate work has been dissipating recently. That is, unless you want to work at UMASS, in which case they probably won't hire you.  The whole idea is to get as many different worldviews as possible and if you stay at the same university your whole career then it's bad for both you and the University. That being said, I got my BA from school A, then my MA from school B, and I'm also getting my PhD at school B. I know for a fact I will never be able to teach at my current university, but I'm okay with that. So, short answer, it's not a bad idea unless you want to work at UMASS for the remainder of your career\n", "Permalink": "https://www.reddit.com/by_id/t3_4e0z6b.json"}, "49": {"Subreddit": "PhD", "Author": "Confuzzlement", "Date": 1460217423, "Score": 2, "Body": "We go to the same school! Congrats on your graduation! \n\nI'm in a phd program here in a different field, but generally speaking, it is often recommended that you go to a different school for your graduate degree so that you're able to branch out and learn in a different setting. For my undergrad alma mater, I was specifically discouraged from applying for this reason and told that inked the match between my interests were very strong I wouldn't be considered. I don't know how much that is emphasized in biochemistry or what the phd program at umb is like or it's outcomes. \n\nIMO you should choose a program that helps you meet your career goals. A lot of programs have data on where students who have graduated from the program are now, length of the program, costs, kinds of courses and research opportunities available, etc. That should help you make an informed decision about grad school. I wouldn't simply choose a program because it was convenient in lieu of conducting all of these factors. Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_4e0z6b.json"}, "50": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1460232719, "Score": 1, "Body": "http://psychology.unl.edu/psichi/Graduate_School_Application_Kisses_of_Death.pdf", "Permalink": "https://www.reddit.com/by_id/t3_4dzfkp.json"}, "51": {"Subreddit": "PhD", "Author": "N_Drewsky", "Date": 1460246726, "Score": 2, "Body": "Thanks for the input. Ill look into where graduates have gone on to", "Permalink": "https://www.reddit.com/by_id/t3_4e0z6b.json"}, "52": {"Subreddit": "PhD", "Author": "d1o0m", "Date": 1460248760, "Score": 3, "Body": "Well, it depends on your field and research...", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "53": {"Subreddit": "PhD", "Author": "RedPotato", "Date": 1460249969, "Score": 1, "Body": "This part of the lit review is the history of the Internet / web culture. But considering how rapidly it changes, is Shirky from 2008 too old? Ohanian from 2013? Cerf interviews circa 2000? ", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "54": {"Subreddit": "PhD", "Author": "lulu_luculentlady", "Date": 1460262473, "Score": 1, "Body": "This is an excellent link and the tips are really helpful.  Thank you, you're wonderful!", "Permalink": "https://www.reddit.com/by_id/t3_4dzfkp.json"}, "55": {"Subreddit": "PhD", "Author": "YouHadItComing", "Date": 1460268138, "Score": 2, "Body": "It's a literature review, so why not include them all?  Or ask your advisor.", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "56": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1460300698, "Score": 2, "Body": "Btw, if you're interested in clinical, this is another great series of resources: http://mitch.web.unc.edu/professional-development/\n\nAnd most importantly, read this one: http://mitch.web.unc.edu/files/2013/10/MitchGradSchoolAdvice.pdf", "Permalink": "https://www.reddit.com/by_id/t3_4dzfkp.json"}, "57": {"Subreddit": "PhD", "Author": "Simsimius", "Date": 1460308873, "Score": 1, "Body": "All of them. It is a review of literature, and that includes the changes in opinions over time. Sometimes you need an old key paper, and newer papers which confirm, or question, the original.", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "58": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1460310508, "Score": 1, "Body": "Is it a real literature review or a literature recension for you research questions and hypothesis? For the first, put everything that is linked to the topic. For the second, no limit for foundation texts  (e.g. Freud). Otherwise I would say 5 years,  10 at the most depending on your field.", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "59": {"Subreddit": "PhD", "Author": "lulu_luculentlady", "Date": 1460311029, "Score": 1, "Body": "Thank you. I'll read them.", "Permalink": "https://www.reddit.com/by_id/t3_4dzfkp.json"}, "60": {"Subreddit": "PhD", "Author": "jamesjacko", "Date": 1460323462, "Score": 1, "Body": "I haven't started yet, I start in August but I have secured funding for 3.5 years through the KESS scheme in Wales.\n\n&gt; How did you get funding?\n\nI'm 3rd yr Computer Science undergrad and worked with my prospective supervisor within the department. I have done some research work on top of the degree and got my name on a paper. We applied for a scheme called KESS which provides fully funded PhDs providing there is a company to sponsor you.\n\n&gt; How long it took to get a place?\n\nThis is where I have been very lucky. I talked to my supervisor about it in my second year and we kind of went for it. We found a company to sponsor the place and then applied for it and got it (this was over the course of 2 weeks or so). In terms of from initial talking about it to starting the PhD it will be just over a year, but I start my PhD 2 months after my degree finishes in May.\n\n&gt; How old you were when you started?\n\nI started my degree at 29. And will start the PhD at 33.\n\n&gt; What do you think was the reason you got it?\n\nI have already been published (author on conference paper and journal paper in review) and averaging around 87% in my undergrad , I get on very well with my prospective supervisor and the staff within a very small department and I was very lucky with timing.\n\n&gt; Do you regret anything?\n\nWish I had done it 10 years ago.", "Permalink": "https://www.reddit.com/by_id/t3_4ckawb.json"}, "61": {"Subreddit": "PhD", "Author": "RedPotato", "Date": 1460337139, "Score": 1, "Body": "Ooh, good question. It might not actually be a lit review - it seemed simpler to call it that. \n\nIt's actually a 8k word paper describing 1 of the 3 topics that I'm combining (it's an interdisciplinary topic), an exploration of the topic.... Does that make sense? Well, it needs sources. And that's my question.", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "62": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1460342416, "Score": 1, "Body": "Check our r/churning... Not sure if there is a Canadian version for it.", "Permalink": "https://www.reddit.com/by_id/t3_4e899q.json"}, "63": {"Subreddit": "PhD", "Author": "finance_phd_man", "Date": 1460346162, "Score": 1, "Body": "If you want a business PhD, I suggest you look really hard at the area you want to do. I'm in a Finance program and it's very different from a management or marketing PhD. You're not really getting a PhD in \"business administration\" even if your diploma says that-you're getting a PhD in accounting, finance, marketing, international business, etc.\n\nIf you have a science background and don't want to do accounting or finance, you might look into information systems. It's not computer science-it's information systems and is under the business school umbrella at a lot of institutions. \n\nThat being said, my undergrad was in mechanical engineering. There's lots of business PhD's with other-subject bachelor's degrees-I'd say about 50% of them. But it's not something you should approach lightly-make sure it's something you actually want to do! PhD is not an MBA in any way, shape or form. If you want to go into management, a PhD isn't going to do much for you. If you want to go into academia, a PhD is required! \n\nThe level of school absolutely matters! The best candidates go to the best schools, and the rest trickle down. Some schools only take two or three students in any given year-they make a list of applicants they want to offer, then offer the top 3. If one of those top 3 reject the offer, then they move to #4 and so on until their class is filled out. \n\nSince your degree is in a non-business discipline, the schools are going to try really hard to make sure you actually want to do research in the chosen business area you're applying for. It's understandable to not have research topics lined out or anything, but study the areas and at least know what kind of research is being published in the area. You won't get in anywhere if it's clear you're just applying because you can't think of anything better to do. \n\nAlso, you can get a pretty cheap MBA if you do well on the GMAT and get a teaching assistanceship at a state school. It won't be a Harvard MBA, but there are lots of public universities with regionally respected MBA programs that can get you in the door with a lot of companies. ", "Permalink": "https://www.reddit.com/by_id/t3_49xlkk.json"}, "64": {"Subreddit": "PhD", "Author": "porterble", "Date": 1460347595, "Score": 2, "Body": "Credit cards and points. All our daily transactions are on points earning cards and I tend to redeem bulk points for flights and hotels for various conferences. \n\nSome of course is covered by grants for the same events too ", "Permalink": "https://www.reddit.com/by_id/t3_4e899q.json"}, "65": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1460385237, "Score": 1, "Body": "Then, stick with both fundation texts if any and recent articles and texts (ideally written after 2010). Good luck! Going back to my 30 pager myself... For Friday...", "Permalink": "https://www.reddit.com/by_id/t3_4e3e2m.json"}, "66": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1460401457, "Score": 1, "Body": "You are going to have to take the physics and astronomy undergraduate requirements for the degree program of interest. It may be in your favor to look into the program offered by the school you are already enrolled in, and talk to professors there who are in the field/lab you are interested in working in. Computer science has a huge overlap in physics and astronomy especially modeling and simulation so I think you won't be too far in the rough. Best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_4dombk.json"}, "67": {"Subreddit": "PhD", "Author": "starpiss", "Date": 1460402959, "Score": 1, "Body": "It sounds counter-intuitive but making time for oneself refreshes one's spirit and vigor. \n\nFor me, hobbies and exercise (increases positive feelings and helps cope with stress) is what helps me get through the week, but especially exercise.", "Permalink": "https://www.reddit.com/by_id/t3_4a02ox.json"}, "68": {"Subreddit": "PhD", "Author": "esgresh", "Date": 1460412468, "Score": 1, "Body": "So that's the way I felt. I did a research masters which gave me a taste of what it would be like and from that decided to do a PhD. I think it also gave me some pretty essential skills. I think it was pretty important as UK PhDs are much shorter than ones in the USA and I think I will be able to get more out of my PhD as the result of doing my masters. Do you have much research experience? ", "Permalink": "https://www.reddit.com/by_id/t3_4ecrf9.json"}, "69": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": 1460418156, "Score": -2, "Body": "Do a masters first if you don't have it.  You can usually transfer those credits into the PhD anyway", "Permalink": "https://www.reddit.com/by_id/t3_4ecrf9.json"}, "70": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1460419456, "Score": 5, "Body": "Yes. Be 100% sure. It gets dark and depressing. If I knew the sorts of stress, helplessness, and general anxiety I'd be feeling throughout my PhD - I would have stuck to industry and kept growing my salary.", "Permalink": "https://www.reddit.com/by_id/t3_4ecrf9.json"}, "71": {"Subreddit": "PhD", "Author": "04binksa", "Date": 1460492447, "Score": 1, "Body": "In my opinion you can't possibly be 100% sure that you want an academic career until you're already half way through the PhD. Same with most jobs, you can't know whether you like it until you try. So it is essentially a bit of a leap of faith, but that's life. \n\nLuckily UK PhDs are relatively short, so as long as you're funded there's no reason to think of it as a waste of time or a failure if you decide to leave academia when you're done. There are plenty of other careers that it can help set you up for in the future. \n\nHonestly both of those options sound like they will lead you to great things. So whatever your choice, try not to get too hung up on whether it was the right choice and focus on moving forward. Best of luck to you. ", "Permalink": "https://www.reddit.com/by_id/t3_4ecrf9.json"}, "72": {"Subreddit": "PhD", "Author": "mr_genetics", "Date": 1460506442, "Score": 2, "Body": "You are very correct that getting a PhD will be a huge accomplishment regardless of where you get it from. The most important thing about the value of your PhD is your PI and your passion for your research. If you find a good combination of both at UMass Boston, go for it.\nThe stigma about going to the same school as your undergrad, for doctorate is because if you are in a small department, chances are pretty high that the professors might know you since you were a freshman. So, most likely, you will not be treated as professionally as you would be if it were a different school.\nRegardless, it wouldn't be the worst idea if you find a good match for your interests. Good luck on your decision.", "Permalink": "https://www.reddit.com/by_id/t3_4e0z6b.json"}, "73": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1460591443, "Score": -1, "Body": "Not enough information. In US, in business PhD you would be working on your own projects and your own papers. yes, with professors as coauthors, but it is pretty much you doing it and they checking it.\n\nYour story seems to be either from India or Africa or a from some shitty for profit college in the states.\n\nCalibrating your expectations is what you need. You need to pass and get a job. Not become the next Einstein.", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "74": {"Subreddit": "PhD", "Author": "Come_Along_Bort", "Date": 1460619446, "Score": 1, "Body": "This comment is proof that a PhD doesn't doesn't denote intelligence. Some Indian schools are very well respected you bell end.\n\nOP I feel you on this. If I were you I would speak to someone in your department who is in your field but not on your team. Ask them honestly if your body of work is something they would pass in a viva. If not raise the concerns to your supervisor. Remember your thesis is just proof you have the skills to be a researcher, it's rarely anyone's best work. ", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "75": {"Subreddit": "PhD", "Author": "Eat_My_Turdy_Vag_4_M", "Date": 1460632451, "Score": 0, "Body": "No they aren't.  All jobs I've been at pre and post PhD have avoided Indian degrees like the plague, especially after having to fire 3 in the course of a year.  That was quite a lesson on not even giving them a chance.  Impressive memorization skills, but NO problem solving skills.", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "76": {"Subreddit": "PhD", "Author": "Rotating_Fluid", "Date": 1460632671, "Score": 1, "Body": "We've had some similar shit shows with Indian and Chinese degrees.", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "77": {"Subreddit": "PhD", "Author": "fizdude", "Date": 1460640463, "Score": 1, "Body": "Actually this is a UK PhD. Hilariously the above story rings true for many of my friends also doing science PhDs. Though I partially agree with you on \"you need to pass and get a job\"", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "78": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1460662814, "Score": 2, "Body": "I'm guessing you're in Europe because you have a hard deadline of 4 years.  It sounds like you and your adviser weren't really a good fit :(\n\nAt least you will be able to get something out of it, it's true some grad students are given a 'big project' on a silver platter. Were you given an opportunity to spend some time looking into the parts of your field you find interesting to come up with one yourself?", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "79": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1460662982, "Score": 1, "Body": "Both of those will be great.  The key is to do something you have a passion for.  It will be harder to know before you start them if you like them, so go to a school that has a few options so that you can 'shop around' if needed.\n\nIf you know you want a PhD then go to a research university that has a lot of opportunities for undergrads.", "Permalink": "https://www.reddit.com/by_id/t3_4edsqk.json"}, "80": {"Subreddit": "PhD", "Author": "fizdude", "Date": 1460664879, "Score": 1, "Body": "No, never felt like I did. I've never been given that truly special area. It's a shame I only realise this now because I ran away with masters and had enough data for half a thesis apparently. I was just wondering if this was normal", "Permalink": "https://www.reddit.com/by_id/t3_4el6oq.json"}, "81": {"Subreddit": "PhD", "Author": "netopatineto", "Date": 1460679743, "Score": 1, "Body": "Thanks for your reply!, I don't know why I find it so difficult to decide. I never get tired of learning physics but I am not sure that is where the nature of passion comes from.... \nI'm applying to one, however it is in Mexico so the level is not very high. Cheers! ", "Permalink": "https://www.reddit.com/by_id/t3_4edsqk.json"}, "82": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1460774444, "Score": 1, "Body": "I have no idea what you are asking./", "Permalink": "https://www.reddit.com/by_id/t3_4exi5a.json"}, "83": {"Subreddit": "PhD", "Author": "p2harry", "Date": 1460799633, "Score": 1, "Body": "I wanted to how many of applicants will be shortlisted normally and will everyone get a chance to interview? \nIn more detail, I had applied for a position. I got an email saying I am qualified. But later came to know that there is still decision to be made about next round. So want to know how many will be typically shortlisted for the next round ", "Permalink": "https://www.reddit.com/by_id/t3_4exi5a.json"}, "84": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1460806103, "Score": 1, "Body": "I'm doing my PhD in Education after 2 Masters. Last one was in 1998. I'm 47...", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "85": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1460807544, "Score": 6, "Body": "I probably wouldn't burn the bridge with the advisor. They sounds like a really good one who cares about you. That's hard to find! ", "Permalink": "https://www.reddit.com/by_id/t3_4ezyp1.json"}, "86": {"Subreddit": "PhD", "Author": "qwerty622", "Date": 1460816842, "Score": 1, "Body": "I've heard STEM is a little bit different in that years off are strongly held against you.", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "87": {"Subreddit": "PhD", "Author": "statPhD", "Date": 1460820610, "Score": 3, "Body": "qwerty622, you may find the information at the following site to be informative. It reports on median time to degree and age at completion for research doctorates in a variety of fields, based on analyses from the annual Survey of Earned Doctorates, up to the year 2003. It's a bit out of date, but it gives some insight into what the \"typical\" experience is. The median age for a Math PhD is among the lowest, at 30.3. \nhttp://www.nsf.gov/statistics/infbrief/nsf06312/#fn5 . \n\nBut even though the median age for Math is low, there is variation. At least half of the recipients were 30.3 or older. I completed my Math PhD when I was 40. It was in Mathematical Statistics, with a minor in Real Analysis, and from one of the AMS Group I (Public) schools (http://www.ams.org/profession/data/annual-survey/group_i).\n\n( At my school, there were two stats programs, one in biostats in the School of Public Health and the other in math stats, in the Dept. of Math, Stat and Comp. Sci. In my department, all of the PhDs are in \"Mathematics\", whether in pure or applied math, mathematical statistics or mathematical computer science. )\n\nI majored in Psychology as an undergrad. After graduating, I started working for three professors at a medical school and realized that I enjoyed statistical programming, so I started work on a master's degree in statistics 4 years after completing my BA. I worked full time and did my graduate school coursework part-time. I loved it. After 3 years, including taking prerequisites that most math grad students would have completed as undergrads, I completed the Master's, which was all that I had initially aspired to. But I had done very well on my exams and was invited to try for a PhD. Balancing work and coursework was tough, but if you really enjoy studying and doing research in the area, I think it can be done. I'm very satisfied with the decision to pursue both graduate degrees. Math is a beautiful area. \nG.H. Hardy wrote, \"No mathematician should ever allow himself to forget that mathematics, more than any other art or science, is a young man's game.\" But that view comes from an earlier (and more sexist) time and has been challenged. A quick read on the oft-discussed topic of math and youth is here http://www.slate.com/articles/life/do_the_math/2003/05/is_math_a_young_mans_game.html", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "88": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1460911456, "Score": 3, "Body": "I can peripherally comment on this.  I did both my Masters and Phd at Penn State, although in Geosciences, not Computer Science (although my undergraduate BS was in Computer Engineering).\n\nThe graduate program at PSU is tough.  Normal expectation in the sciences is that you take classes for the first year (if coming in without a masters), and then in the fall of your 2nd year you are \"expected\" to take your candidacy exam.  Many people end up pushing it back until the spring though...although it's \"frowned upon\".  I can't speak for CS, but in Geosciences, the Candidacy exam was the worst of any milestone...even worse than my eventual dissertation defense.  It's at the candidacy that they decide your fate, and where your committee can legitimately kick you out of the program.  I had to write two proposals (one my actual proposal, and one something I came up with completely on my own), and then for 3 hours your committee asks you anything they want.  And I mean ANYTHING.  They will get you to the point when you say \"I don't know\" - no matter how much you studied, and then that's when the gloves come off.  They asked me to derive first principle equations on the board, asked me to talk about all the ways I might address the fact that \"i didn't know\".  I had to prove I could think like a scientist and pose valid hypotheses.  It was incredibly stressful, and leaving my exam, I felt like the stupidest person in the world.  They told me I passed, but it was \"a squeaker\".  It kind of reminded me of that annoying kid friend we all had that just kept asking \"but why\"...\"but why\"....\"but why\"....ad nauseum.\n\nRegarding timing.  I feel like my department was a little more forgiving for people without masters degrees.  I did a masters first, so when I picked back up in the fall to start my PhD, not only did I have a masters, but I had one from PSU.  This meant I had to do my Candidacy in my first semester since many of my classes overlapped.  With folks coming in right out of undergrad into the PhD, like I said, many were able to push their exam back to their 4th semester.  For me, I just wanted to know sooner rather than later if I would stay on as a student.  If I failed, I had no intention of trying again.\n\nTwo years after your candidacy, you then take your comprehensive exam, which is also stressful, but not like the candidacy.  After that, your All But Done until your defense.  Oh and there's that pesky little business of actually writing up your 3-5 chapter dissertation of course ;-)\n\nHope this helps.  Also, being that CS falls under the Engineering Program, they might do things a bit differently.", "Permalink": "https://www.reddit.com/by_id/t3_4f2nfo.json"}, "89": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1460911960, "Score": 1, "Body": "I went back to grad school after 9 years (at age 30) and still vividly remember sitting in my first class (Dynamics) and watching the professor scribble Differential Equations on the board.  I was thinking...oh crap, I haven't looked at math like this in forever.  I struggled a bit for the first month or so, but eventually caught back up once all pistons began firing again.", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "90": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1460992973, "Score": 1, "Body": "You would need a great supervisor to guide you through your phd. It's doable. Meet with a prof in your field to get his/her opinion on this.", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "91": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1460997258, "Score": 1, "Body": "http://www.nytimes.com/2016/04/16/your-money/taking-on-the-phd-later-in-life.html?_r=0 ", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "92": {"Subreddit": "PhD", "Author": "qwerty622", "Date": 1460999987, "Score": 1, "Body": "this is very interesting. thank you  ", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "93": {"Subreddit": "PhD", "Author": "Montaingebro", "Date": 1461288770, "Score": 1, "Body": "I am honestly exploring this right now. I am in my mid 30s, and have a very successful career. My background is engineering, and I miss doing math. It's been over a decade since my master's, and I have been looking at part-time PhD programs.", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "94": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1461332559, "Score": 1, "Body": "Why not?", "Permalink": "https://www.reddit.com/by_id/t3_4fy3rv.json"}, "95": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1461352867, "Score": 2, "Body": "Sure. Talk to someone at you Faculty of graduate studies. ", "Permalink": "https://www.reddit.com/by_id/t3_4fy3rv.json"}, "96": {"Subreddit": "PhD", "Author": "_SeriousCat_", "Date": 1461373155, "Score": 1, "Body": "Interdisciplinary is fine, so long as you ground your research in a SINGLE field. If you use more than one field as a foundation you will satisfy no one, as each expert in those fields will believe that you haven't done enough work on their field.\n\nChoose one main field and be up front about using it as your foundation. Let the committee know what lens you're using and judge the perspective accordingly.", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "97": {"Subreddit": "PhD", "Author": "Scary_The_Clown", "Date": 1461376569, "Score": 1, "Body": "A solid answer, and probably the main reason I'll settle for writing more books instead of getting a PhD - I have always been happiest an most successful in bridging different products, technologies, or subjects to solve problems. ", "Permalink": "https://www.reddit.com/by_id/t3_4aoce1.json"}, "98": {"Subreddit": "PhD", "Author": "davidwhalley", "Date": 1461392228, "Score": 1, "Body": "I will be applying for my PhD this Fall and it's in an area of my subject I'm really interested in. I'm not thinking of it so much as \"I'm doing a PhD\", more that I've found a platform from which I can study what I enjoy and keep my interests going. I don't think of it as a means to an end and I expect it will crush my spirits at times and often leave me feeling disappointed but to be honest so many graduate jobs sound boring, exploitative and far off the mark from what I want to do in life.  ", "Permalink": "https://www.reddit.com/by_id/t3_4dff1i.json"}, "99": {"Subreddit": "PhD", "Author": "bobleplask", "Date": 1461398939, "Score": 1, "Body": "I am probably jaded and cynical, but he's on an exchange for a short time, in a new place. He probably want to have some fun in this new place while he is there, and probably likes what he sees in you. \n\nWould you be interested in typically sleeping with this guy? If no - then slowly back away from him. If yes - ask him to go do something that you actually like instead of an insane club. You don't have to sleep with him even if you do.", "Permalink": "https://www.reddit.com/by_id/t3_4g2mfe.json"}, "100": {"Subreddit": "PhD", "Author": "1millionppm", "Date": 1461402076, "Score": 1, "Body": "Yeah I understand what you mean by jaded cause I'm in the same boat. I get where he's coming from, wanting to have fun in a new place. But I've told him COUNTLESS times that I don't want to go party with you and I don't want to drink with you I'm keeping this strictly professional. Like not even slowly backing away, I literally just said no I don't understand why that's difficult to understand even if his mother tongue is portugese.\nI know I shouldn't have gone to the club during my friend's birthday party.. But c'mon I didn't realize he was going to go too even though he's not friends with ANY of us including the birthday girl. I find it kind of difficult if I'm going to have to avoid him at social events that I enjoy going to just to avoid being grabbed and manhandled around just becuase I was there :C\n\nLike c'mon.. I'm sure there has to be ONE other person who wanted to sleep with you and you can just have fun with that instead of making me uncomfortable both at work and off work.. Argh I can't believe a 26 year old can't take no for a million answers! :C", "Permalink": "https://www.reddit.com/by_id/t3_4g2mfe.json"}, "101": {"Subreddit": "PhD", "Author": "bobleplask", "Date": 1461402452, "Score": 1, "Body": "&gt; I find it kind of difficult if I'm going to have to avoid him at social events that I enjoy going to just to avoid being grabbed and manhandled around just becuase I was there\n\nI agree 1000% - you should not alter your plans and such because of him.\n\nI don't know about his background, but his culture might have this as a normal play - where the person is hard to get, and the other person just has to keep on trying. Either you live with it, or have a really direct talk with him about your frustration.", "Permalink": "https://www.reddit.com/by_id/t3_4g2mfe.json"}, "102": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1461445788, "Score": 3, "Body": "Unless you name those fields wtf are we to go on? Same for location...", "Permalink": "https://www.reddit.com/by_id/t3_4g4b9d.json"}, "103": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1461445936, "Score": 2, "Body": "You are also overthinking this. Have you interviewed with any of those places or are you outright rejected? What are your test score(s)? Have you considered applying to other schools (not in top 20)?", "Permalink": "https://www.reddit.com/by_id/t3_4g4b9d.json"}, "104": {"Subreddit": "PhD", "Author": "tpm_", "Date": 1461452337, "Score": 1, "Body": "OP is already on a throwaway, why not tell us what the fields are? We ain't gonna hunt you down", "Permalink": "https://www.reddit.com/by_id/t3_4g4b9d.json"}, "105": {"Subreddit": "PhD", "Author": "edubya15", "Date": 1461453435, "Score": 1, "Body": "All of it", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "106": {"Subreddit": "PhD", "Author": "Khiv_", "Date": 1461458519, "Score": 1, "Body": "Assuming someone is totally ok with this, would there be something else to worry about?", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "107": {"Subreddit": "PhD", "Author": "Khiv_", "Date": 1461459253, "Score": 1, "Body": "Thanks, lol. Why are they a waste, though? No progress in the project? Useless, unrelated stuff that your mentor makes you do? I had a lot of this last one at college and still do at med school, and I'd say that's the number 1 depressing thing for me.", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "108": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1461471991, "Score": 7, "Body": "For me, it was a combination of things. \n\nA PhD is like a mill stone around your neck. It's always there. It's really difficult to switch off at the end of the day. You end up putting more and more pressure on yourself to push forward, to write that chapter or repeat that experiment. This exacerbated an underlying medical condition that has had pretty life changing impacts. You know you're ill, but you keep pushing, because it needs to be done.\n\nAdd in the fact that experiments can go wrong, or external factors start to affect your plans (our lab had a recurring mycoplasma infection that effectively wiped out 6 months of work) and it increases the pressure.\n\nYou're also, by definition, working on something on the edge of knowledge, so doubting yourself can become a big issue. Thia isnt helped by a lot of people suffering from imposter syndrome; thinking it was a fluke that you got the job and eventually someone will find out. \n\nIf you don't gel very well with your supervisors, that can be an issue, as they really are your only lifeline in terms of being a sounding board for ideas. Often you will be working outside at at the very edge of their expertise.\n\nAll of this can affect your mental health and it seems to be more comman than you'd think.\n\nNot saying that everyone suffers, but there's a reason most PhD students would advise against doing one, at least from my experience.", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "109": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1461475145, "Score": 2, "Body": "I know you specifically asked for why it is bad, but I wanted to let you know that it can be amazing as well. I was in a lab with a really decent human being as the PI (though Super hands-off), in a very tight nit group of people who loved beer, hanging out, and being offensive  (while being pretty hilarious). I have made some awesome friends for life, and loved my projects. Yes there were the dark times too, where for months not even the most simple assay was working,  and you second guess yourself,  and feel depressed, and question your life decisions, but those times end. I would not change anything about my PhD experience.", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "110": {"Subreddit": "PhD", "Author": "porterble", "Date": 1461480467, "Score": 3, "Body": "All of the above. My first doctoral research was in STEM and the failed lab time where EEG machines don't play nicely, or test software crashes, or subjects don't show up and you lose a day of testing was the worst. \n\nThis second time I'm in the humanities and sometimes have days which yield 20words written that then you decide to edit out. \n\nFor both though the biggest thing for me is loneliness. After a while you are the SME on your topic and there are a handful of people worldwide to talk to who you don't have to give a huge prolegomena to. Thankfully I have a few of them around now. But it is still different compared to my last academic job in the commercial arm of a Uni, where we were all SMEs in the field. ", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "111": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1461485047, "Score": 3, "Body": "yeah- this.\n\nMy officemates and others in my lab group make it so worth it. we're really close, go out all the time, and generally- when one person is having a bad day- the others joke around and banter and make light of the situation until you're feeling better.\n\nA PhD is generally going to be hard, and I think its knowing that going in, and keeping the mindset that...'yes, right now, this is shit- this is hard, but... It's going to be fine again soon.' I've had alot of complications with my supervisor, but on the other side of that, my supervisor has done immense things for my career. I fall out of love with my research, and the next week I'm totally inspired again (hence waking up super early on a sunday to do some analyses).\n\nBut, generally, keeping the work-life balance up is going to keep you sane. Bad day? leave the office and get a nice lunch/ forget the sad-desk lunch that day. Stressed? exercise. (I do some form of exercise daily, and Its so helpful), and socialise for sure. I'm lucky to have good officemates that know what I'm going through, but my partner understands, as do my other friends outside the PhD. (Its okay to talk about things other than your PhD....)\n", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "112": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1461500365, "Score": 3, "Body": "https://www.timeshighereducation.com/blog/what-i-lost-when-i-got-my-phd ", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "113": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1461500419, "Score": 1, "Body": "^^^^\nThis... ", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "114": {"Subreddit": "PhD", "Author": "Khiv_", "Date": 1461506020, "Score": 1, "Body": "Good points are very welcome, as well! I only asked about the negative points because I know I have a biased view of what it means to be a scientist, haha. Thank you so much for your contribution!", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "115": {"Subreddit": "PhD", "Author": "SuddenlyChineseFood", "Date": 1461564537, "Score": 1, "Body": "Holy shit. I just realized that I suffer from imposter syndrome. I didn't know there was a term for it or if it was common at all.", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "116": {"Subreddit": "PhD", "Author": "academiathrowaway3", "Date": 1461585786, "Score": 1, "Body": "Well alright. I majored in philosophy and the field I want to get a PhD in is linguistics. ", "Permalink": "https://www.reddit.com/by_id/t3_4g4b9d.json"}, "117": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1461603531, "Score": 1, "Body": "Don't know much about them, but I guess linguistics would be more desirable. This also explains you only applying to top 20, since these would be the only schools will real job prospects after graduation. What about your GRE score? Also, at what point are you being denied (application, initial interview, campus visit)?", "Permalink": "https://www.reddit.com/by_id/t3_4g4b9d.json"}, "118": {"Subreddit": "PhD", "Author": "mz_h", "Date": 1461630470, "Score": 1, "Body": "I am currently in my first semester as an engineering PhD student at Penn State. I came with with only a B.S. Typically if you come into the PhD program without an M.S. you have to take three semesters of classes and then take the candidacy exam. My program director said the Graduate School is fairly lenient though and they've never kicked someone out for failing to take the exam in time. If you take 3 - 4 classes a semester for the first year and a half you should be able to finish the course work easily. ", "Permalink": "https://www.reddit.com/by_id/t3_4f2nfo.json"}, "119": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1461683683, "Score": 1, "Body": "He probably applied for academic jobs.", "Permalink": "https://www.reddit.com/by_id/t3_4gj7b9.json"}, "120": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1461684412, "Score": 2, "Body": "In today's current academic environment, it's not unbelievable.  105 is a bit high, but I know many (myself included) that are on their 2nd or 3rd post docs and have applied to many open academic positions (often not even getting an interview).  When there are several hundred people all applying for the same jobs, statistically it can be really tough.  My advice is to just keep gaining experience however you can and publish! No matter what experience you have, if you don't have first-author pubs, you won't get a faculty position.", "Permalink": "https://www.reddit.com/by_id/t3_4gj7b9.json"}, "121": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1461687352, "Score": 1, "Body": "Today you learned supply and demand. Yes, those are real jobs. Yes, academic jobs are hard to get.", "Permalink": "https://www.reddit.com/by_id/t3_4gj7b9.json"}, "122": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1461717481, "Score": -2, "Body": "That's called depression. If the PhD makes you depressed get out. You can try some drugs, but they just make you not care in a silly way. Stop being so self-deprecating (hard, I know).", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "123": {"Subreddit": "PhD", "Author": "SLGC", "Date": 1461734030, "Score": 9, "Body": "&gt;The PhD has made me realised just how useless I am, and it's making me damn unhappy, knowing that I am actually this sort of person.\n\nThis is so common in academia. You are not useless just because you feel you don't fit in one of the most mentally demanding jobs we have been able to create. How much experience do you have? Did you go directly from undergrad to Ph.D.? I'm almost done with my masters and can safely say I felt the exact same thing towards the end of my undergrad. \"I'm useless.\" \"I don't learn the material.\" \"I don't know what I'm doing.\" That was probably 50% lack of experience and 50% depression in my case. Just remember to take care of and not to overwork yourself.", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "124": {"Subreddit": "PhD", "Author": "FearTheCron", "Date": 1461735953, "Score": 6, "Body": "A couple of things that have helped me a bit with this:\n\nFirst, if you aren't feeling stupid in your field of study then you probably aren't being productive (http://jcs.biologists.org/content/121/11/1771).  Remember that you signed up to learn to be a researcher, your advisor and group can guide you on this path but realistically you just need to spend time feeling dumb while working on a subject then suddenly people will start coming to you for advice.  For me I still feel stupid about my area of research and I have half our lab coming to me for advice on it so this is relatively normal.\n\nSecond, try to understand how you are presenting things because often times defining the problem well is enough to allow yourself to talk about something in a much more articulate way.  Try doing your best to explain the problem and then address these 3 points whenever you talk about what you are doing:\n\n* Why is this important\n* Why is this hard\n* Why is this interesting\n\nAfter you have done that you may find it easier to move on to what you did, why you did it, and what challenges you still face.  (This is still something I am working on but I do feel like I am making some headway).\n\nThere are certainly other comments in here that are worth paying attention to but I think its important to realize that feeling stupid is pretty par for the course.  I can't say for sure not having met you but based on working with people I would say its likely you are perfectly suited to this and its just going to take some getting used to the feeling of stupidity.", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "125": {"Subreddit": "PhD", "Author": "armorandsword", "Date": 1461743175, "Score": 3, "Body": "I didn't read the whole post because, unlike you, I'm lazy. You say you got a first \"just because you studied hard\". That's what you're supposed to do!! You learned the material and were awarded high marks by impartial and presumably anonymise examiners. Believe me a lot of people I know study ridiculously hard and still get low marks, because their innate capability in the subject is, frankly, low. \n\nOf course some people do slip \"upwards\" through the cracks to PhD level, but you're probably not one of them. In my experience a good work ethic will serve you better in a PhD than some divine inspiration. ", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "126": {"Subreddit": "PhD", "Author": "Feargus1", "Date": 1461747464, "Score": 2, "Body": "If it's any consolation,  I felt like that in my first year and I had more reason than you.  I barely scraped an honours mark in my undergrad having failed one year,  I passed my masters with unremarkable marks and borderline depression and throughout my first year that developed to be full blown.  My supervisor treated me with disdain and the department almost took away my fee waiver because I was doing so poorly.  To be honest what helped me was counselling.  It helped put everything in perspective and got me proactive to fix my situation. I think it's important to realise you sound like you're a lot better than the way you see yourself.  You can work hard,  that's almost everything.  When I started I couldn't concentrate for twenty minutes straight because of attentional problems I've also got help with since.  I'd kill for your work ethic.  \nIt does sound like you're depressed,  if your college offers counselling you should give it a try.  It's difficult but you deserve to feel good about yourself.  If you go and you feel like there's no way got can be happy in your situation you can leave it knowing you did your best and that this just isn't what makes you happy.  I really hope you feel better and know that you're not alone in this. If you ever want to talk pm me,  I'm only over in Ireland so we're in the same timezone.  \n", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "127": {"Subreddit": "PhD", "Author": "LadyStreetTheFirst", "Date": 1461750292, "Score": 3, "Body": "Yeah, just came here to say I feel the exact same way.  I'm in the 4th year of my PhD (running out of time) and had so many setbacks, things go wrong/not work and I even have my supervisor in the same building as me.  I just have to keep telling myself that I have learned a lot even if things haven't gone as I thought they would.  My partner continue to tells me that all the crap I've been through will help me later on as many people who have had nothing but success will have problems later on but won't know how to deal whereas I will.  So always try and think of the positives.  Keep your head up and keep going.  It'll all be fine in the end :)", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "128": {"Subreddit": "PhD", "Author": "porterble", "Date": 1461753511, "Score": 3, "Body": "Sounds like factors related to imposter syndrome and the innate competitiveness of research. One of the things i have recommend to peers and students was the Thesiswhisper/Inger Mewburn's course on 'How to Survive Your PhD' when it was an edX mooc. Its now over but much of the content is on https://thesiswhisperer.com Just search for imposter syndrome.\n\nAlso fwiw most doctoral students feel like this at some point. As do most academics. ", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "129": {"Subreddit": "PhD", "Author": "UntrustedProcess", "Date": 1461785152, "Score": 3, "Body": "Fake it till you make it.  It isn't always the smartest person who wins.", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "130": {"Subreddit": "PhD", "Author": "freddosmsc", "Date": 1461786312, "Score": 1, "Body": "I've also been having problems with concentration and productivity lately. How did you overcome this exactly?", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "131": {"Subreddit": "PhD", "Author": "Feargus1", "Date": 1461789497, "Score": 1, "Body": "I went to an occupational therapist.  There's one in my college,  I said to the doctor that I was having this trouble and she referred me.  It helped.  But to be honest,  counselling allowed me to improve and work on myself effectively.  ", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "132": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461802478, "Score": 1, "Body": "Hi there mate. I come across this post while looking for a place to post my blog on this exact subject. I'm in my first few months of my PhD and I feel exactly the same as you. I think you could take something from my piece on how to handle it; http://www.aquaevans.com/blog/my-postgraduate-insecurities \n\nPlease keep talking about it. You aren't useless. Keep your head up. ", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "133": {"Subreddit": "PhD", "Author": "porterble", "Date": 1461808726, "Score": 1, "Body": "Useful thoughts, and as someone who has watched several cohorts go through and crash from constant direction to self-supervision I think its pretty normal.", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "134": {"Subreddit": "PhD", "Author": "Zero_Fucks_", "Date": 1461830529, "Score": 2, "Body": "This rings true for me. I started in September and am still struggling with the absence of a validation tool... ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "135": {"Subreddit": "PhD", "Author": "Chemweeb", "Date": 1461840552, "Score": 2, "Body": "About the grades: definitely true. Even though they are not a clear indication, they give you some idea of how you are doing. For many us, we're stuck in that system ever since primary or secondary school and to suddenly change your life to be grade-less can be something you need to get used to.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "136": {"Subreddit": "PhD", "Author": "esgresh", "Date": 1461842921, "Score": 1, "Body": "Totally relate. I started my PhD in October in Leeds but am doing all my lab work in Hull so spend a few days a week there. Also have a background in marine biology. ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "137": {"Subreddit": "PhDStress", "Author": "shakaman_", "Date": 1461860305, "Score": 1, "Body": "Hi! Would love some uplifting stories from people having completed a phd. \n\nDoes anyone else find that they only receive negative feedback from their supervisor, never anything positive? No? Just me?  ", "Permalink": "https://www.reddit.com/by_id/t3_4gunve.json"}, "138": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461861792, "Score": 1, "Body": "Congrats on getting the PhD. Awesome to hear from someone so close to home. Keep going :) ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "139": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461861914, "Score": 1, "Body": "Thanks for taking the time. It's tough because there are no obvious answers to a very widespread problem. ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "140": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461861983, "Score": 1, "Body": "I'm sorry to hear that. I wish I had the answers mate. You got this far for a reason though, try not to forget that. ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "141": {"Subreddit": "PhD", "Author": "Zero_Fucks_", "Date": 1461863159, "Score": 2, "Body": "Thanks, that's important to remember I think, they wouldn't have given me the spot otherwise. I know logically I must be doing fine, but imposter syndrome is a weird thing! ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "142": {"Subreddit": "PhD", "Author": "Chemweeb", "Date": 1461872931, "Score": 1, "Body": "It's a matter of getting used to it, I guess. As is mentioned in the article: having results neatly ordered or crossing off things on a to-do list are good alternatives and of course publications and patents are a sign of quality as well. ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "143": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461881006, "Score": 1, "Body": "Interesting, what made you say patents? I wasn't aware they were that prevalent in academia", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "144": {"Subreddit": "PhD", "Author": "Chemweeb", "Date": 1461882982, "Score": 1, "Body": "There's a lot of possibilities to do a PhD either in cooperation with or mostly within industry. In that case, patents are favorable. Depends a lot on your field however.", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "145": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1461896152, "Score": 1, "Body": "I ask because that's true for me, but I hadn't heard of it elsewhere. I'm the only one at my university research group to setup collaboration with industry.. Thanks for taking the time ", "Permalink": "https://www.reddit.com/by_id/t3_4grha3.json"}, "146": {"Subreddit": "PhD", "Author": "lame-ousine", "Date": 1461954658, "Score": 1, "Body": "&gt; I'm not a naturally intelligent person, I have a really poor memory and I find it incredibly difficult to respond to things or explain things to people; I often lose track of thought. \n\nI recently learned of the locus of control, and learned that people fall somewhere on the spectrum of having an internal or external locus of control. On the extreme ends, someone with an external locus of control believe that they have no control in the events that affect them, and on the other side, people with an internal locus of control believe that they are in control of what happens in their lives. I think the belief that someone is naturally smart takes away that internal sense of control. It takes away from the belief that you can do well by working hard (something you can control) versus you are born that way (something you cannot control).\n\nLike you said, you got good grades in undergrad due to working ridiculously hard. That's *great!* I don't think there is any shame in achieving good grades through working hard. In fact, it's amazing and it shows you have good work ethics and that if you work hard you can achieve great things!\n\nI think you are having a difficult time because of the fact that your supervisor is hard to reach and there seems to be some impostor syndrome going on. But I think if you keep working hard, maybe find some people whom you can discuss your project and problems with then you'll do fine.\n\nAs for the difficulty in responding and explaining stuff, I find it very helpful to practice my blurb. I honestly think it's all about practice. The first time I presented about my thesis proposal, it was a mess. Then by the 4th time I made the presentation, it sounded much better. Just keep talking to people and soon enough you will find a good and concise way to explain things.\n\nI think you feel useless because you think everyone else finds these things effortless, but I think you can take comfort in knowing that a lot of people out there have the same struggles as well.", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "147": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": 1461977620, "Score": 2, "Body": "I'm only most of a year into a PhD so this might not be the best perspective but I did spend most of this year bouncing around topics and feeling stressed about finding the right subject to focus on. \n\nHave you tried mind-mapping or drawing out all your subjects of interest? It might help you find commonalities between subjects. That and keep a notebook with you to write down ideas for research or things you want to look into...helped me 'catch' really good thoughts which have helped shape my research process. Another thought is to be a bit strategic...what are the faculty in your department doing? What is 'trendy' right now in your discipline? What seems to be getting funded frequently? \n\nI found for myself, there were two main areas I was struggling to choose between and part way through this year one of them just started making more sense in terms of my non-academic career, fit in the department, relevance in my area of subject, etc. ", "Permalink": "https://www.reddit.com/by_id/t3_4h1jth.json"}, "148": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": 1461981356, "Score": 2, "Body": "It sucks that you've had to put up with him...even with some cultural/language barriers he should have understood that consistent \"no\" responses actually means no. The politics of your department make it more complicated, but think of it like any job/workplace. He's not being appropriate and if you're going to have to work with him in the future it's likely best to confront him. I'm a bit over-cautious about this type of thing, so if it was me I'd probably alert the department chair about my concerns or at least school HR. You could even bring it up without naming him, asking hypothetically what the department/schools response to that type of situation is. You might not be the only person he's harassing/ed, or if it happens again you bringing this up could be really helpful. Particularly since you say he's the top in your field, it's a good idea to have the school informed/ready to support you. \n\nHowever, if you'd rather not go to someone higher up it is a good idea to plan out a very, VERY clear statement to say to him in a neutral, public setting and not when he's asking you out (ideally with another person present...maybe someone neutral-ish like his housemate). Something along the lines of \"Hey, I want to talk to you about something to clear things up because we work together and I want to have a good work environment. When you ask me out/try to buy me drinks/etc. I have clearly said no. I'm sure you are trying to be friendly but when you continue to ask me out after I've said no, or force me to dance with you, I feel uncomfortable and don't think it's appropriate for a coworker to interact with me like that. Please stop doing the things I brought up.\" \n\n*hug* good luck...it's a shitty situation. \n", "Permalink": "https://www.reddit.com/by_id/t3_4g2mfe.json"}, "149": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462041999, "Score": 2, "Body": "Nearly all business PhDs provide a living stipend. I am not sure why would you want to get a second PhD since you can easily make more working while doing same thing as you were in your PhD. Your degrees are professional. PhD is not a collection of classes, like MBA or JD. It's about research. Finally, there are a few people with two PhDs, but I fully expect that no good school will accept you in the PhD program after you already have two. Even when applying for the second you better have very good reason for the change.", "Permalink": "https://www.reddit.com/by_id/t3_4h5in8.json"}, "150": {"Subreddit": "PhD", "Author": "xxGrobicxx", "Date": 1462042531, "Score": 1, "Body": "What jobs pay you to just do research and write scholarly articles? ", "Permalink": "https://www.reddit.com/by_id/t3_4h5in8.json"}, "151": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462048910, "Score": 5, "Body": "Professor?", "Permalink": "https://www.reddit.com/by_id/t3_4h5in8.json"}}