{"0": {"Subreddit": "PhD", "Author": "feather_red", "Date": 1506818135, "Score": 1, "Body": "In hindsight I just feel like program wasn’t a good fit for me, mainly because I feel they misrepresented themselves. One of the things that attracted me to this program (which was one of my top choices btw) was the focus on social justice and multiculturalism. Specifically, I felt like I could do research with any of the faculty as they were all doing research that was a good fit for me. However, once I was actually in the program, it felt like the multicultural values they had espoused weren’t what they actually practiced and I felt somewhat deceived by funding expectations (I thought I would be receiving more than I am). Basically, I find people in this program rude and inconsiderate which just adds to the already created financial stress. I have not found the faculty to be supportive and my cohort is a whole other issue. I loved my masters program (in the same field) and I had hoped to continue developing and learning in my PhD but unfortunately I feel that I’ve done little of that. With psychology programs typically you must complete an internship (kind of like a residency that medical students go through) before graduation. So unfortunately I’ll be stuck in the field for another year after dissertation. I’m also planning on leaving the area after graduation which I hope will improve my well being. I was looking at possibly teaching or working with businesses in lieu of doing psychotherapy.  There is a part of me that would still like to see some clients and I’m not sure how much of my lack of interest is coming from a genuine change of interest vs. just being burnt out. There is some flexibility in the direction I could go in so that helps.", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnqk17y/"}, "1": {"Subreddit": "PhD", "Author": "LucrativeSasquatch", "Date": 1506828360, "Score": 5, "Body": "That CV is all sorts of wrong. Stay away.", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dnqr31w/"}, "2": {"Subreddit": "PhD", "Author": "greenelastic", "Date": 1506848712, "Score": 3, "Body": "I've just handed in my thesis in the UK. I hated the last year and a half of my (three year) PhD, and it was a grind to get through it. I made it bearable by focussing on the other opportunities doing a PhD opened up to me - public engagement, teaching and supporting new PhD students. I was particularly lucky in that I got on really well with my colleagues, as I'm not sure I would have finished it otherwise. \n\nHad I been studying in another country where PhDs are much longer, I'm not sure I could have stuck with it. Right now I'm glad I did because I wouldn't have found the career I'm starting now otherwise. I also learned a lot about me as a person - what motivates me, what I value and what I'm good at. \n\nOne thing that really helped was the realisation that I no longer cared. When I realised that it didn't matter how many papers I published and all I had to do was submit an acceptable thesis, I was able to relax and live my life around my PhD. \n\nAll of that being said, I wish I had taken an interruption from my PhD. I've been struggling with depression over the past couple of years, and taking an interruption may have given me the breathing room to recuperate and *may* have given me more motivation to finish. Alternatively, it might have made me realise it wasn't worth finishing, which wouldn't have been an awful outcome either. ", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnr0don/"}, "3": {"Subreddit": "PhD", "Author": "RTMicro", "Date": 1506849312, "Score": 1, "Body": "What field are you in if you don’t mind me asking? \n\nI’ve just finished my first year of my PhD (UK also) and I’m becoming a bit disillusioned \nI love the research side and had planned on trying to have a career in academia when I finished but I’m not so sure anymore ", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnr0ku7/"}, "4": {"Subreddit": "PhD", "Author": "greenelastic", "Date": 1506849568, "Score": 1, "Body": "I'm in astronomy (or was in I suppose). One thing I should say is that for me it was the research side that I hated. If I'd liked the research side but not anything else I would have been tempted to just embrace that, ignore everything else as much as I could and see it as an opportunity to do research I cared about for a few years before taking my career in a different direction. \n\nWhat is it that's making you question whether to continue? The career path or how you feel about your day to day at the moment?", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnr0nx9/"}, "5": {"Subreddit": "PhD", "Author": "RTMicro", "Date": 1506854239, "Score": 1, "Body": "It’s solely the career path for me, I love the research/work day to day but the more I’ve seen of academia as a real career the less I want it, there are so many hurdles to jump through for things like grants, constantly relocating etc. which when combined with the good but not great pay makes it just not seem worth it \n\nI should point out that realistically I’m not going to drop out as I’m funded and would have to pay quite a lot back if I didn’t complete my PhD - I just wish I’d considered a different path now ", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnr26zp/"}, "6": {"Subreddit": "PhD", "Author": "greenelastic", "Date": 1506854557, "Score": 2, "Body": "I think most people start their PhD with that plan (including me) and only a fraction end up staying in academia. In physics I think 30% of PhD graduates get a postdoc and only 3% get a permanent job in academia somewhere down the line. There needs to be a change in the way PhDs are presented. You can still learn a lot from them even if you don't stay in academia. That's what kept me going anyway 😁 \n\nI'd use this time to look at what other careers might appeal to you and try to get some work experience. There's lots of opportunities during your PhD that you won't have access to otherwise - public engagement, advising on public policy and working in intellectual property. Some of what is available to you depends on your university and funding body. You have to go out and look for it though - it won't come to you. \n\nPlus, you can always take interruptions to do work placements or internships. I think it's pretty common in computer science PhDs and it's slowly becoming more of a thing in other disciplines. ", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnr2aoh/"}, "7": {"Subreddit": "PhD", "Author": "choeli9", "Date": 1506880779, "Score": 1, "Body": "Maybe not", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dnrj0c0/"}, "8": {"Subreddit": "PhD", "Author": "greenelastic", "Date": 1506882753, "Score": 1, "Body": "It didn't qualify me for any new jobs (aside from astronomers being fairly in demand in data science roles), but it gave me the opportunity to realise what I wanted from a job. Plus, the extras I did around my PhD (public engagement, teaching) helped to lead me towards what I'm doing now, which is in intellectual property ", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnrkvkl/"}, "9": {"Subreddit": "PhD", "Author": "kevinhosfordphd", "Date": 1506897492, "Score": 2, "Body": "Be honest and truthful, don't say you can do things just to look like you know how everything works. Be honest if your short comings and lack of knowledge, a PhD is a learning experience and you're not expected to know everything ", "Permalink": "https://www.reddit.com/r/PhD/comments/738gdy/visiting_a_potential_phd_advisor_how_to_make_a/dnrydfw/"}, "10": {"Subreddit": "PhD", "Author": "djdadi", "Date": 1506952061, "Score": 3, "Body": "I imagine I'm a lot like you.  Probably more perfectionist than average, dealing with something that can and will never be perfect.  It's the most stressful thing I've ever done.  I wish I had advice to give....good luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/72k7w4/im_writing_my_thesis_and_it_sucks/dnsspjb/"}, "11": {"Subreddit": "PhD", "Author": "djdadi", "Date": 1506952112, "Score": 1, "Body": "&gt;Any one with ANY suggestions?\n\nMendeley is a great program to save and mark up PDF's for use in research :)", "Permalink": "https://www.reddit.com/r/PhD/comments/72vb2z/where_do_i_start/dnssqvv/"}, "12": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506952152, "Score": 1, "Body": "Thanks, that's a pretty accurate description haha. I did it thpigh.. Managed to get it to a good enough standard and submitted last Friday! So relieved\nAnd pleased! ", "Permalink": "https://www.reddit.com/r/PhD/comments/72k7w4/im_writing_my_thesis_and_it_sucks/dnssryy/"}, "13": {"Subreddit": "PhD", "Author": "djdadi", "Date": 1506952231, "Score": 1, "Body": "Congrats.  I've got about 2 weeks left of a soft deadline to get about 40 more pages done (should be around 120 when done).  If I don't die first.", "Permalink": "https://www.reddit.com/r/PhD/comments/72k7w4/im_writing_my_thesis_and_it_sucks/dnssu4j/"}, "14": {"Subreddit": "PhD", "Author": "DnlJMrs", "Date": 1506952327, "Score": 1, "Body": "Thanks dude. That's a decent target for 2 weeks, achievable but tough for new content still. You can do it! ", "Permalink": "https://www.reddit.com/r/PhD/comments/72k7w4/im_writing_my_thesis_and_it_sucks/dnsswq7/"}, "15": {"Subreddit": "PhD", "Author": "feather_red", "Date": 1506962300, "Score": 1, "Body": "I mostly have just kept to myself. I try to spend as much time away from campus as possible and that has helped. And thank you! I hope this feeling will go away once I’ve had some time to de-stress.", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/dnt1r4p/"}, "16": {"Subreddit": "PhD", "Author": "tmotytmoty", "Date": 1506990646, "Score": 1, "Body": "I had something like this happen to me when I was getting my master's degree. Almost exact same situation: I taught a lab course that paid more for the first semester, but then the department decided that they didn't want to pay me for my time, and paid me like the other shmucks that only got 9-hour TA-ships. It took a while for me to figure the solution to this problem, but then it occurred to me that I should just half-ass it. And so I did. I half-assed the shit out of the lab class until I graduated. \nSure, a lot of students got better grades than what they deserved, but (not too surprisingly) I never got a single complaint. As a grad student, I got locked into the idea that I needed to put my whole ass into everything I did, but then I realized all the really successful researchers are completely unreliable, and that I needed to learn from them in how to delegate my energy reserves and stay focused on what was important - which was: getting my f'ing degree. Don't be fooled into striving to become the world's best graduate student because you already know from experience that it doesn't pay well.      \nBottom line: If they don't want to pay you for all the work, then don't do all the work.     \nEDIT: grammar  ", "Permalink": "https://www.reddit.com/r/PhD/comments/6z19nh/department_reduced_pay_rate_for_taing_and_make_us/dntqx8i/"}, "17": {"Subreddit": "PhD", "Author": "luleigas", "Date": 1507016225, "Score": 1, "Body": "Yes.", "Permalink": "https://www.reddit.com/r/PhD/comments/715vbt/has_anyone_ever_quit_their_phd_in_the_first/dnu711w/"}, "18": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": 1507036706, "Score": 1, "Body": "That looks like the sort of template you'd use to try and land an acting gig. ", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dnufwfo/"}, "19": {"Subreddit": "PhD", "Author": "ssrix", "Date": 1507069188, "Score": 1, "Body": "Many recruiters and recruitment agencies use .doc search tools, so if you submit it in .pdf from latex your cv won't show up in their searches. So don't use latex. Unfortunately you should use word. Obviously this is different if you're posting it to someone directly or to an academic job, but then you might as well just have one..in word. Also yeah this template is cringey. Putting a picture of yourself is...just not good", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dnv9yiz/"}, "20": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1507069933, "Score": 1, "Body": "[I like this one a lot](https://www.overleaf.com/latex/templates/awesome-cv/dfnvtnhzhhbm). I do change the font colours so it's not that flashy, but I personally feel it's a great template.", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dnvakre/"}, "21": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1507165278, "Score": 3, "Body": "Hi! I am recording brain responses to language and music, which I believe are quite similarly processed in the brain. I've made some progress, but there's lots to go!", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnx8hp2/"}, "22": {"Subreddit": "PhD", "Author": "IAmExtremelyCurious", "Date": 1507168028, "Score": 2, "Body": "Wow, that's fascinating! Any interesting insights or findings? Or any interesting hypothesis that you are trying to prove or find?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxaqcl/"}, "23": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1507171246, "Score": 1, "Body": "Im looking at provider specific insurance claims data to determine the risk of receiving care which is not evidence-based for spinal pain disorders", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxdas7/"}, "24": {"Subreddit": "PhD", "Author": "drarch", "Date": 1507171647, "Score": 5, "Body": "How to work with low-income minority communities to improve public health in the built environment. \n\nCurrently building a mobile grocery store, park trails that encourage active living, and combining research methods in public health, ethnography, and urban design. \n\nELI5 edit: Helping people build a healthy neighborhood.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxdm5a/"}, "25": {"Subreddit": "PhD", "Author": "Iluspfloufz", "Date": 1507173015, "Score": 5, "Body": "ELI5 in question formats: \n\n1. Are juvenile delinquents actually getting assigned treatments that should be effective for them (per past research and individual assessments) and that they are supposed to be getting? How do their attitudes towards said treatment affect chances of re-offending (which treatment should be reducing)?\n\n\n2. Are important criminological studies actually replicable?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxeoox/"}, "26": {"Subreddit": "PhD", "Author": "drarch", "Date": 1507173695, "Score": 1, "Body": "Thanks!\n\nWorking right now with the Gehl Institute on our [Active Living Trails project](http://www.dotteagency.org/#/active-living-trails/) in public spaces: Do interventions in the built environment that promote public health awareness have an impact? \n\nMy dissertation will eventually include a walking ethnography and community-based participatory research methods, working with WIC clients to better understand their food access issues. In a nutshell: is building a big box grocery store in a food desert really the best approach?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxf7qe/"}, "27": {"Subreddit": "PhD", "Author": "optimalcontroller", "Date": 1507175704, "Score": 2, "Body": "I am doing an engineering PhD, so most of my work includes a bunch of math equations, definitions etc. I first write down every detail (whether absolutely necessary or not) just to see what I really know. By doing that, I sometimes realize that although I think I know the essential ideas that I extract from other papers, I do not really understand what they mean. Hence, before going any further with writing, I spend time on really learning them. Then I move forward. \nOnce I develop a solution to the question at hand, the paper and all of my ideas looks like only a mess. Save that version of the paper! Then, I read again from the beginning to criticize which sections, definitions, lemmas etc. are absolutely necessary and remove irrelevant ones. After a good deal of rereadings, only what is necessary left on the paper.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/73ezny/tips_for_organizing_thoughts/dnxgn3o/"}, "28": {"Subreddit": "PhD", "Author": "mosquitoman45", "Date": 1507176002, "Score": 2, "Body": "Yes, if you consider neuroscience and cancer biology two completely different fields. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/dnxgugu/"}, "29": {"Subreddit": "PhD", "Author": "not-dead-nurse", "Date": 1507179157, "Score": 1, "Body": "What constitutes quality for cardiac arrest care for patients and families, as well as front line clinicians. Process quality indicators and outcome quality indicators will emerge. Quantitative and qualitative. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxispg/"}, "30": {"Subreddit": "PhD", "Author": "kattlaser", "Date": 1507184029, "Score": 10, "Body": "I make retinas from stem cells. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxl7l7/"}, "31": {"Subreddit": "PhD", "Author": "splintersauce", "Date": 1507195889, "Score": 1, "Body": "I design and make drugs for treating arthritis and cancer.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxpmzx/"}, "32": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1507205833, "Score": 5, "Body": "I use mathematical and computational modelling to work out how our brain gets rid of waste products. We still have no real clue, but it's really important, because the failure of waste clearance is very closely associated with the onset of Alzheimer's disease. \n\nSoon, I'll start working on modelling drug delivery to the heart via inhaled nanoparticles. It'll enable the delivery of much smaller doses, which will be much safer.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxtyy9/"}, "33": {"Subreddit": "PhD", "Author": "siemprehayquimica", "Date": 1507209686, "Score": 1, "Body": "I basically look at how cells are breathing (from patients or animals) and see how that is affected in different diseases of aging. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxwlxn/"}, "34": {"Subreddit": "PhD", "Author": "RTMicro", "Date": 1507213184, "Score": 2, "Body": "I’m monitoring/measuring volatile compounds (chemicals that go into the air) from bacteria to detect bacteria that cause disease", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnxzi90/"}, "35": {"Subreddit": "PhD", "Author": "IAmExtremelyCurious", "Date": 1507222146, "Score": 1, "Body": "Interesting! How are you doing this? How do you measure perception!?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dny80e3/"}, "36": {"Subreddit": "PhD", "Author": "rarles", "Date": 1507223833, "Score": 1, "Body": "So you have experience with this?", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/dny9mul/"}, "37": {"Subreddit": "PhD", "Author": "ThePlanck", "Date": 1507225439, "Score": 3, "Body": "I have a friend who quit a PhD program to do a PhD program in a different field\n\nI can't give you any tips on how to do it, but it can be done.\n\nThough i'd probably say if you start the new program as soon as possible to would probably be easier than waiting for a few years, i think people will understand if you tell them you wanted a different field", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/dnyb5t2/"}, "38": {"Subreddit": "PhD", "Author": "healthacorn", "Date": 1507229307, "Score": 1, "Body": "I second this. I have 0 schedule and am struggling.", "Permalink": "https://www.reddit.com/r/PhD/comments/74huud/sharing_your_daily_schedule/dnyeyy9/"}, "39": {"Subreddit": "PhD", "Author": "pdubq", "Date": 1507232908, "Score": 4, "Body": "I'm near the end of running experiments and so the writing (first of which is a review manuscript) and data analysis are now becoming more important. So this is the basic schedule I have for my days:\n\n\n7am - 2pm: read/write. I try to tackle some of the maths heavy/dense papers I'm reviewing first because my brain is most active in the morning and capacity to focus dwindles after lunch. I also take a short walking break and lunch break in this time block.\n\n2pm - 3 or 4pm: I do some coding, mostly trying to replicate algorithms I attempt to understand during my morning reading/writing sessions, so I can modify and apply them to my data.\n\n3 or 4pm - 7pm: run experiments \n\nThis is just my current schedule because I'm 1 month away from finishing experiments and about 13 months away from thesis (which will be made up of 6 papers) deadline. The last two years, I was all over the place, doing RA and TA as well. Now I have resigned from extra positions and just focused on my research.", "Permalink": "https://www.reddit.com/r/PhD/comments/74huud/sharing_your_daily_schedule/dnyigg2/"}, "40": {"Subreddit": "PhD", "Author": "mothkin", "Date": 1507236905, "Score": 2, "Body": "Thanks, this is very helpful. In discussing this with a friend, she recommended that I schedule around when my most productive hours like - like you do for the morning. My schedule has been so inconsistent that its difficult to say for sure when my best hours are, but morning is usually most productive.", "Permalink": "https://www.reddit.com/r/PhD/comments/74huud/sharing_your_daily_schedule/dnymcum/"}, "41": {"Subreddit": "PhD", "Author": "johu999", "Date": 1507239695, "Score": 7, "Body": "Depends on the subject you're doing, and the culture of your department. This is my usually schedule when I've got days where I'm just researching/writing, so no teaching or meetings. If I do have those, I just try to be flexible.\n\n8:45-9:00 emails\n9:00-10:30 writing\n10:30-11:00 break\n11:00-12:30 writing/reading\n12:30-13:30 lunch\n13:30-15:00 reading\n After that, it depends which day it is. I often go to the gym and answer a few emails and read some smaller pieces once I get home. Sometimes I have another break and then keep writing generally no later than 18:00.\n\nI find this gives me a good amount of productivity, whilst also being sustainable. I've often still get a decent amount of energy at the end of the day, and look forward to writing again the next day.\n\n", "Permalink": "https://www.reddit.com/r/PhD/comments/74huud/sharing_your_daily_schedule/dnyov0t/"}, "42": {"Subreddit": "PhD", "Author": "pdubq", "Date": 1507239701, "Score": 2, "Body": "You're welcome. I should say that I don't always stick to my schedule although I do try, but I have  learned that getting things that require the most concentration during your most active/alert hours is definitely the best way to go. All the best to you! :)", "Permalink": "https://www.reddit.com/r/PhD/comments/74huud/sharing_your_daily_schedule/dnyov84/"}, "43": {"Subreddit": "PhD", "Author": "Elesday", "Date": 1507247247, "Score": 3, "Body": "Diagnosing patients correctly is cool.\n\nAI are smart, medical doctors are smart : let’s combine their powers.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnyv5y7/"}, "44": {"Subreddit": "PhD", "Author": "mosquitoman45", "Date": 1507253484, "Score": 4, "Body": "Yes and its not as uncommon as you might think. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/dnz0f1z/"}, "45": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1507258067, "Score": 2, "Body": "Hey OP! Sorry I took a day to get back; nothing super exciting yet, but I am trying to use a new analysis type to work on a hypothesis that Aniruddh Patel made almost 14 years ago. It's called the SSIRH and is definitely worth reading about if you're interested! \n\nHe's kind of my academic crush atm. And I'm a guy. Soooooo he's good at what he does.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnz4b7n/"}, "46": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1507258095, "Score": 2, "Body": "Holy smokes. That's awesome", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnz4c0d/"}, "47": {"Subreddit": "PhD", "Author": "Theodt", "Date": 1507258170, "Score": 2, "Body": "Not OP, but I've gotta say... Question 2 is massive in psych as well. Our inability to replicate is a solid criticism of our field.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnz4e5y/"}, "48": {"Subreddit": "PhD", "Author": "Iluspfloufz", "Date": 1507261418, "Score": 3, "Body": "Yes, totally hear you. I (personal opinion here) feel like the 'replication crisis' in many fields right now has a lot to do with publish or perish. In my field at least (Criminology) journals aren't interested in publishing replication studies, just new research. So no one does them, and thus in the social sciences we end up with a lot of stuff that can't get replicated. I hope it changes during our lifetime but highly doubt it. Haha :-/ ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dnz70zx/"}, "49": {"Subreddit": "PhD", "Author": "struggling-lunatic", "Date": 1507273494, "Score": 14, "Body": "I would say you are so close to finishing your PhD. Finish the defence and worry about the other stuff later. Once you have phd,it is a valuable degree that adds to probability of getting visa in most countries.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/dnzdc7o/"}, "50": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1507324729, "Score": 2, "Body": "Wat?", "Permalink": "https://www.reddit.com/r/PhD/comments/74osot/schedule_a_5_minute_call_to_complain_to_me_about/do0daij/"}, "51": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1507325445, "Score": 2, "Body": "This is good to hear. I'm in a program in one area of biology and am having second thoughts about where I want to end up in my career. Having the possibility of leaving with a master's and switching to another focus is reassuring just in case I realize it's really not what I want to do.", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/do0dvpr/"}, "52": {"Subreddit": "PhD", "Author": "noobisDoctoris", "Date": 1507340514, "Score": 1, "Body": "I really like this. Where do you keep your notes? On paper? Digital? ", "Permalink": "https://www.reddit.com/r/PhD/comments/73ezny/tips_for_organizing_thoughts/do0pdnm/"}, "53": {"Subreddit": "PhD", "Author": "Lowzenza", "Date": 1507341338, "Score": 1, "Body": "Same boat as you. Started my PhD and realized I am actually in the wrong program/don't really need to do it for the jobs I want. Only thing keeping me going is that I can keep learning new things during my PhD (and outside of my phd in my own time) to give me more skills. I really want out though :(", "Permalink": "https://www.reddit.com/r/PhD/comments/73fh73/does_anyone_regret_getting_their_degree/do0pym7/"}, "54": {"Subreddit": "PhD", "Author": "optimalcontroller", "Date": 1507343537, "Score": 1, "Body": "I use Latex. It is better for keeping a record for yourself. I know it takes lots of time to write everything down in latex but it also looks cool !", "Permalink": "https://www.reddit.com/r/PhD/comments/73ezny/tips_for_organizing_thoughts/do0ri01/"}, "55": {"Subreddit": "PhD", "Author": "OptimalGoat", "Date": 1507349762, "Score": 6, "Body": "I teach computers how to write music for video games.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do0vcrh/"}, "56": {"Subreddit": "PhD", "Author": "ar_killah", "Date": 1507351730, "Score": 1, "Body": "Would you not be able to move to suit her job prospects? ", "Permalink": "https://www.reddit.com/r/PhD/comments/6xn6z4/gf_is_finishing_phd_in_semiconductors_but_most/do0wdqe/"}, "57": {"Subreddit": "PhD", "Author": "IAmExtremelyCurious", "Date": 1507354687, "Score": 1, "Body": "Awesome! What ML model are you using?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do0xtiw/"}, "58": {"Subreddit": "PhD", "Author": "OptimalGoat", "Date": 1507357175, "Score": 2, "Body": "Corpus-based ANN for now, but I might be trying out some deep learning stuff soon.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do0yx60/"}, "59": {"Subreddit": "PhD", "Author": "Transposer", "Date": 1507381245, "Score": 1, "Body": "Since the time of posting, I’m working on it!  Thanks for the reply ", "Permalink": "https://www.reddit.com/r/PhD/comments/6xn6z4/gf_is_finishing_phd_in_semiconductors_but_most/do17ipe/"}, "60": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507399654, "Score": 2, "Body": "LinkedIn, networking. Going to conferences where your theoretical knowledge could be applied. Don't give up, push forward in what you think is best for you! You'll later look back and see the struggle was useful", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do1kf7e/"}, "61": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507399716, "Score": 1, "Body": "That's astounding! Based in Oxford?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do1kgxw/"}, "62": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1507400579, "Score": 1, "Body": "Southampton for the brain research and I'm about to move to Oslo for the heart research.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do1l4kq/"}, "63": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507407036, "Score": 1, "Body": "Sorry for the misjudgment. I'm on a search for Doctoral Training programmes and Oxford have one for mathematical modelling", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do1q3ui/"}, "64": {"Subreddit": "PhD", "Author": "suigyouza", "Date": 1507408881, "Score": 1, "Body": "Thank you for your advice. Yeah I will try to concentrate on finishing PhD. And thats good to hear a PhD counts for something outside japan!", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do1rimu/"}, "65": {"Subreddit": "PhD", "Author": "suigyouza", "Date": 1507409381, "Score": 1, "Body": "Thank you for encouraging me! I know I should keep working on to get me back to the right path. I will keep trying.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do1rwj1/"}, "66": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507415177, "Score": 1, "Body": "I'll be happy to see your outcome 😎 how theoretical are we talking? 👀😎", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do1w9vd/"}, "67": {"Subreddit": "PhD", "Author": "XMGrymigi", "Date": 1507454075, "Score": 1, "Body": "If an offshore rig blows up, I forecast where the oil travels to", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/do2jvpj/"}, "68": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1507493194, "Score": 1, "Body": "I did a PhD in the UK after about 7 years in industry, I did natural sciences so was a bit rusty on the basics, but had a great supervisor. \n\nCambridge has a strong statistics programme, and it's a very employable degree; the advantage is that the demand (from students) is very strongly skewed towards financial statistics with opportunities available (relatively speaking of course) in the more pharmaceutical and biological leaning statistics. It's worth applying in that area. My layman's opinion is that employers don't differentiate too much on what sort of stats you did, but you know that market anyway.\n\nYour experience at work will make you more focussed and used to a regular 9-5 day as a minimum.", "Permalink": "https://www.reddit.com/r/PhD/comments/72l2bv/finding_a_phd_position_after_3_years_in_the_work/do38qfm/"}, "69": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1507514384, "Score": 1, "Body": "Re-up the link please?", "Permalink": "https://www.reddit.com/r/PhD/comments/753dt2/listen_to_a_description_of_nobel_prizewinning/do3qdip/"}, "70": {"Subreddit": "PhD", "Author": "technically_art", "Date": 1507516464, "Score": 2, "Body": "Accounting isn't my field, but to your third point, try taking a couple of Master's level courses next year if you're able. It will give you a taste of what to expect as a grad student and demonstrates competency and drive to the people considering your application.", "Permalink": "https://www.reddit.com/r/PhD/comments/755oy3/advice_to_a_potential_phd_student/do3s0r7/"}, "71": {"Subreddit": "PhD", "Author": "bFSFM", "Date": 1507524204, "Score": 2, "Body": "Good news for you: there is a shortage in accounting and so there is a lot of opportunity in the field. \n\n1) Each school is different but UT Dallas is highly reputable and I can't imagine they waive the GMAT for any reason. By research output they are top 10 for business in general (and very good for accounting as well). A \"good\" GMAT score is relative. If you have a good GPA, strong recommendation letters, research experience, etc., the GMAT matters less (but still matters). Average GMAT scores are above 700 these days for PhDs. For an accounting program they will focus more on the quant side (but you can earn easy points from the verbal side so don't neglect it). Aim for at least 700, but above that is better. \n\n2) Any PhD worth doing is going to be competitive. At a minimum you need to find one that is AACSB accredited. The second thing to look at is who will you be working with? Are there good professors? Publishing on topics you're interested in? Do they have placement records that make you think \"if I went to one of those I'd be happy\"? Besides what you mentioned the thing they look for is potential for becoming an academic researcher: past experience in research or signaling that you want to become a contributor to the field. Also for PhD programs I think UT Dallas is Ivy League level. The typical rankings for MBAs don't apply to PhDs, everything is about research output, and this is an area where UT Dallas excels. \n\n3) Talk to your current accounting professors and tell them you want to do a PhD. They are your best resources and the fact that you are interacting with them daily means you should make your intentions clear. If you really want to do a PhD at your current school they are the gatekeepers. If you want to do a PhD elsewhere they still matter because you need letters of recommendation. You could potentially enter directly from your bachelor's. See about working as an RA for them this summer, ask for advice, etc. \n\nHope this helps, feel free to PM me if you have any other questions", "Permalink": "https://www.reddit.com/r/PhD/comments/755oy3/advice_to_a_potential_phd_student/do3xj1n/"}, "72": {"Subreddit": "PhD", "Author": "suigyouza", "Date": 1507550711, "Score": 2, "Body": "not much like quantum physics. But much of researches in our field is observation oriented, and explains whats observed with simplified numetical formulae. whereas my study relaxed a precondition to estimate something based on purely theoretical consideration.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do48731/"}, "73": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507552827, "Score": 1, "Body": "So in your case it wouldn't raw data. Just satisfying conditions.\nWhere are you based at? It sounds really interesting!", "Permalink": "https://www.reddit.com/r/PhD/comments/74ksl0/2_monthes_until_my_phd_defence_and_i_can_no/do49bau/"}, "74": {"Subreddit": "PhD", "Author": "calcblurb", "Date": 1507560666, "Score": 1, "Body": "The guy above is pretty spot on I'm working on apps now for a phd in accounting. I didn't think of pursuing this until after I graduated so here's what I wish I could've done when I had the chance. \n\n1.  Talk to professors and make connections for references and maybe get some research experience. All three letter should be from people who hold a phd and are active in research if possible so start talking to those people now. Also in accounting it's common to not have research experience but if you can get it then that's one more thing to make you stand out. \n\n2.  Rankings are difficult but there are some top schools for phd that isn't what you think. Harvard and Yale etc are ok but really places like UT Dallas, UNC, University of Illinois are the power houses. A good reference is UT Dallas ranking by journal and just choose the top 3 accounting journals to filter. Also BYU has a ranking based on subject but counts all journals even ones no one has heard of. Still great though you can see who is good in financial, managerial, tax and audit. \n\n3.  A phd anywhere is extremely difficult to get into even lower programs have around a 5% acceptance rate. Many schools post class profiles although it's usually for all the business programs still you can get a idea of if you are at least competitive. Many schools have an average gmat of 720 though and only admit between 1-3 people each year. These programs have great funding compared to other fields which is why it is so competitive. Most business phd students get free tuition and a $30k year stipend and healthcare so schools can only afford to admit a 1-3 students, whereas other social science have lower funding requirements and grant funding so they can have larger programs. ", "Permalink": "https://www.reddit.com/r/PhD/comments/755oy3/advice_to_a_potential_phd_student/do4evwy/"}, "75": {"Subreddit": "PhD", "Author": "Monoclewinsky", "Date": 1507578063, "Score": 1, "Body": "Are there any moderators in this forum?", "Permalink": "https://www.reddit.com/r/PhD/comments/75b25v/phd_assistanceinnovation_system_plus/do4vgij/"}, "76": {"Subreddit": "PhD", "Author": "drProton", "Date": 1507614883, "Score": 0, "Body": "If you are a current STEM PhD student who wants to help out a tech startup that's focused on making research easier for you, I would love to chat with you for 5 min (I'm one of the cofounders).\n\nI may ask you a few questions about your \"pain points\" while researching. Likely, I'll just have you describe a typical day with a focus on problems or difficulties you experience conducting your research.\n\nThese sorts of interviews really help us to focus on a real problem that exists that we can focus our tech around. :)\n\nPlease sign up at the link above if you want to chat!", "Permalink": "https://www.reddit.com/r/PhD/comments/74osot/schedule_a_5_minute_call_to_complain_to_me_about/do5q4qr/"}, "77": {"Subreddit": "PhD", "Author": "QueueTee314", "Date": 1507617731, "Score": 2, "Body": "The hardest thing to do is to convince other people that you have the required skills to switch.", "Permalink": "https://www.reddit.com/r/PhD/comments/74cqah/has_anyone_ever_quit_a_phd_waited_a_few_years_and/do5rep6/"}, "78": {"Subreddit": "PhD", "Author": "arv504", "Date": 1507642532, "Score": 2, "Body": "Audio for Augmented reality would be a good field to go into... ", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/do62g61/"}, "79": {"Subreddit": "PhD", "Author": "plusgarbage", "Date": 1507645538, "Score": 1, "Body": "I have to stay in Computer Vision Field", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/do64tvm/"}, "80": {"Subreddit": "PhD", "Author": "mtb_addict", "Date": 1507685546, "Score": 16, "Body": "Hey, 3rd year Ph.D student here. No. Please so see someone. Typically schools have great mental health doctors and nurses.\nYes, you are going to go through times where it is a little more tedious than others, but overall, I never get out of bed hoping things get better. Talk to your family, friends, supervisor, whoever your support group includes and use them. Go get some help, take some time away, and come back when you are ready to kick your thesis' ass.\nCheers, pm me if you need it ", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do75dvs/"}, "81": {"Subreddit": "PhD", "Author": "wdmc2008", "Date": 1507686883, "Score": 14, "Body": "&gt; No.\n\nUnfortunately this is wrong. [1 in 3 phd students will develop a psychological disorder, especially depression](http://www.sciencedirect.com/science/article/pii/S0048733317300422), so it's very normal. However, you are right about getting help.\n\nAdvice for OP:  \nTalk to family, friends, a significant other, or a church leader if you are religious. I would avoid going into detail when talking to your advisor, but keep him updated (tell him that you have personal troubles and can't devote a lot of free time to your research, but you still intend to meet all your obligations.) Depression makes you want to isolate yourself, but that's exactly the opposite of what you need.\n\nIf you haven't seen [this](https://img-9gag-fun.9cache.com/photo/a2NXEze_700b.jpg), it's worth a read. You've already taken the first step by asking reddit for help. Results will likely be much better when you ask people you know for help.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do76jgv/"}, "82": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1507695020, "Score": 18, "Body": "I don't think you are using the same definition of \"normal\" here. It's common, that doesn't mean it's normal. I think the other commenter is saying that it's not normal so don't just put up with it and move on, OP should get help.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7cv8a/"}, "83": {"Subreddit": "PhD", "Author": "ABCDEAD", "Date": 1507696365, "Score": 1, "Body": "We can never be assumed to be mentally prepared for future undertakings. Our previous experiences and backgrounds can be our core values in plunging along any journey. Life moves in waves. Take it as it goes. Don't worry too much. Plan as you can. Talk to some as you need to. If you need medication to rest for a while, go for that.. Then, the next day is a new day. Make small goals and work towards that. Build as you go.. Don't worry too much.. Your health is utmost importance. Change when U need to keep you happy and content.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7dqfc/"}, "84": {"Subreddit": "PhD", "Author": "GuillaumeDuCoin", "Date": 1507704733, "Score": 8, "Body": "Exactly, being depressed is not 'the norm', but is quite common unfortunately. ", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7hz3i/"}, "85": {"Subreddit": "PhD", "Author": "Fakejaffacake", "Date": 1507711017, "Score": 5, "Body": "Honestly, I have felt exactly the same thing. \nI'm now in the final few months of my phd, and there have definitely been some hard times along the way. As other commenters mentioned, the answer depends on what you mean by \"normal\". Personally, I find it comforting to know that mental health problems in phd students are relatively common. It's nice to know I'm not the only one who finds this really difficult to manage. But that doesn't mean you shouldn't fight it.\nI found it really helped to sit down and figure out exactly what I was feeling. Why does it make you depressed? Is it the workload? The long hours? The constant failed experiments or not quite good enough statistics? If you can identify one or two key things that affect you strongly, you might be able to work on changing them for something you find less stressful. Eg. if you hate the long hours try to optimise your work schedule by coming in when you are most productive, or if you hate working alone organise a \"shut up and write\" club. (google it, they're great!)\nAnd if you really can't make a change, just talking about how you feel can help process it. If you don't have a suitably sympathetic friend or counsellor, start a diary and write your feelings down. Sometimes having a good rant can really boost your mood.\nAnd finally, remember that there is a light at the end of the tunnel. You can finish your PhD. If you can maintain enough mental health to simply keep going, you will eventually reach the end and you can move on. Why not make some plans about what you'll do next. Research jobs or book a holiday. Give yourself something to look forward to and work towards.\nBest of luck, and well done for talking about it. Just that takes a huge amount of strength.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7kad3/"}, "86": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1507711059, "Score": 1, "Body": "Same boat my friend. Only happy thing is I'm pretty close to finishing. But now I've started asking myself, what next ? Surprisingly, that question has started eating me up. ", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7kavd/"}, "87": {"Subreddit": "PhD", "Author": "cephalord", "Date": 1507714277, "Score": 1, "Body": "&gt; It's common, that doesn't mean it's normal. \n\nI think it kind of does.\n\nRegardless of all of our exact definitions of 'normal', I think we can all agree that it is _not ok_.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7lcyz/"}, "88": {"Subreddit": "PhD", "Author": "applecoreeater", "Date": 1507714346, "Score": 1, "Body": "I go through stages where everything just feels relentless and neverending - and then on top of that that I'm a fraud. It's common and unfortunately feels a lot like my normal. \n\nThankfully I have a large family nearby that helps. \n\nBecause it's not normal, but you're not alone. It just feels like I'm getting my teeth through it.\n\nAnd yes, I have sought help and was given a number of resources and strategies to try and manage those thoughts and symptoms. It helps.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7ldst/"}, "89": {"Subreddit": "PhD", "Author": "res611", "Date": 1507734435, "Score": 2, "Body": "I think it’s more common than people think. Maybe there’s a mental health center or support group at your school?", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do7x5rs/"}, "90": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1507740464, "Score": 1, "Body": "flair would be a good ting, we could see what the poster is interested in before actually reading the post.\n", "Permalink": "https://www.reddit.com/r/PhD/comments/6ynvo7/categoriesflair/do82x7y/"}, "91": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507759330, "Score": 1, "Body": "Hey broski! I hope you feel better. You can do it! Get a specialist", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do8ktg9/"}, "92": {"Subreddit": "PhD", "Author": "optimalcontroller", "Date": 1507782505, "Score": 2, "Body": "Okay, let's try to look at it from another perspective. Do you really hope that things get better or do you just think you hope it? Maybe you are just fine but since you do so many things every day and think you are doing too much, you tend to believe you are depressed? Can it be the case?\n\nI am 1st year PhD student in engineering and working on things that I have never seen before. I wake up almost every day at 8 am and leave the office not before 8 pm (mostly after 10-11 pm). By the way, when I say every day, I included weekends as well if you notice. Every morning I wake up with tons of depressive feelings and doubts in my mind like it is way to much for me. Then I really ask myself that are you complaining just because you like exaggerating things or do you really exhausted? In the days the answer is the latter one, I stop working at 3-4 pm, do things that relax me and go back to my work next morning.\n\nDon't think you are depressed only because you are getting tired every day. Wish you the best.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/do93irg/"}, "93": {"Subreddit": "PhD", "Author": "Monqih", "Date": 1507837337, "Score": 2, "Body": "I develop a comprehensive adhesive material behaviour law to be used on the next biggest telescope ever.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/doa38h7/"}, "94": {"Subreddit": "PhD", "Author": "levitatingballoons", "Date": 1507843415, "Score": 9, "Body": "Oh man, hold on, I'll just switch field real quick :p", "Permalink": "https://www.reddit.com/r/PhD/comments/75zuys/interesting_opportunity_for_postdocs_and_grad/doa8u8u/"}, "95": {"Subreddit": "PhD", "Author": "RussianWhizKid", "Date": 1507917172, "Score": 10, "Body": "I'm doing it right now just to get the piece of paper that will allow me to get PhD level jobs in the industry. \n\nI have no other aspirations besides that. ", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobmvoz/"}, "96": {"Subreddit": "PhD", "Author": "femtomatic", "Date": 1507917198, "Score": 8, "Body": "Of all the reasons to do a PhD, doing it for the title or the money has to be some of the worst reasons in my opinion. I did mine because I was interested in the subject but also as a personal challenge. Doing it solely for the experience might be unusual, but it doesn't strike me as totally insane. \n\n&gt;I worked in a topic I was not interested into at all.\n\nNow that I have a harder time believing. Maybe you lost interest in the subject along the way? I know a few people who never got back to their thesis subject once they were done with the PhD and that's quite normal. But to endure all this with no interest whatsoever in the subject... Are you some kind of zen monk who feels totally detached from your own thoughts? \n\nAnyways, congratulations on  obtaining your PhD, not that many people can claim that as an accomplishment! I just submitted my thesis for review by the jury last week. If all goes well I should defend it somewhere in December. ", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobmwkb/"}, "97": {"Subreddit": "PhD", "Author": "mojoliveshere", "Date": 1507919015, "Score": 4, "Body": "Sounds about right. The accomplishment of earning the degree is the only real driver I have to see it through. At one time I waffled about a career in academia, but now I am quite sure that it's not for me.\n\nI'll likely be a well-educated stay at home dad/ part-time something, and I'm pretty alright with that.\n\nYou should not feel ashamed. Live your life in a way that satisfies you.", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobolqe/"}, "98": {"Subreddit": "PhD", "Author": "stalecheddar", "Date": 1507919984, "Score": 5, "Body": "Same here. Start in January and alot of opportunities are available with that PhD. Many of these positions require a PhD just to even be looked at. That and the fact I want to be called Dr. Daddy ", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobpi0t/"}, "99": {"Subreddit": "PhD", "Author": "mrsnuggets", "Date": 1507921801, "Score": 1, "Body": "I am interested in the answers too. I am thinking about doing an Accounting PhD too!!! I posted a while back looking for insight in the Business PhD experience and got no responses. ", "Permalink": "https://www.reddit.com/r/PhD/comments/755oy3/advice_to_a_potential_phd_student/dobr5c4/"}, "100": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507922101, "Score": 2, "Body": "Ahahha!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobrf9f/"}, "101": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507922153, "Score": 1, "Body": "Yeah that was one of the reasons for me as well, and having a cooler job. \nI dunno where the shame came out... Maybe from living in a toxic environment...", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobrh0m/"}, "102": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507922876, "Score": 2, "Body": "Good luck to you!\nWell, it's a long story. I studied computer engineering, I quite enjoyed the analytic and math part of what I studied, and I went in that direction. I had then an hard time in deciding where to go, and I chose going in a place I was not so interested in going, doing something I was not that interested, as I had said already many \"no\", and the professors to whom I asked cover letters, back after my master, were getting without pacience and a bit upset. I decided to do \"the good guy\" and I chose a thing I didn't like in a place I didn't like to be. Then the possibility of a split PhD came up, the topic got interesting, and I decided to go for that PhD. But after I started, things changed, no split PhD anymore, flat topic, and lots of thoughts about what was wrong with me.\nMaybe I was too much worried about what people, including my former professors, thought about me, and I had no strength in affirming myself.\n\nI lost badly, even if I finished my PhD.\nAlso, I was severely mocked and quite abused by a colleague of mine, who used me to affirm his strength and control. I passed the last two years of my life in a \"sabbatical\" trying to recover: I became aware of the abuse just six months ago, and since then working for taking back what I lost, even if it is very difficult. I am a person few people gave credit, and with this last stupid thing I did, I think I have no possibility to take back any respect. I dunno...", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobs4gh/"}, "103": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507922995, "Score": 1, "Body": "Thanks a lot. Yes, I am thinking academia is not for me as well... Dunno... But yes, a PhD was a personal challenge, and I did it...!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobs7n6/"}, "104": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507923003, "Score": 1, "Body": "Thanks a lot. Yes, I am thinking academia is not for me as well... Dunno... But yes, a PhD was a personal challenge, and I did it...!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobs893/"}, "105": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507923025, "Score": 1, "Body": "Thanks a lot. Yes, I am thinking academia is not for me as well... Dunno... But yes, a PhD was a personal challenge, and I did it...!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobs9ls/"}, "106": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1507923075, "Score": 2, "Body": "Yep, I thought about this as well... Maybe I have not to feel ashamed, after all...", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobsbia/"}, "107": {"Subreddit": "PhD", "Author": "stalecheddar", "Date": 1507926620, "Score": -1, "Body": "PhDs aren't given, they are earned. Only a select few can make it through that journey comrade ", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dobviwj/"}, "108": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507934869, "Score": 1, "Body": "I love my subject and I wanna do deep and also wanna be an expert in my field and solving problems. I love teaching", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/doc24cu/"}, "109": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1507935154, "Score": 1, "Body": "I don't think this is the best way to do this.\n\nI would say mental health is one huge topic to look at", "Permalink": "https://www.reddit.com/r/PhD/comments/74osot/schedule_a_5_minute_call_to_complain_to_me_about/doc2bsv/"}, "110": {"Subreddit": "PhD", "Author": "brimacki", "Date": 1507945541, "Score": 2, "Body": "I solve really big physics problems on really big computers.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/doc9mjc/"}, "111": {"Subreddit": "PhD", "Author": "snowball3xz", "Date": 1507954500, "Score": 1, "Body": "I have turned down opportunities where i could enter my email address for the chance of winning something at the end of a survey. I usually don't enjoy putting down my information in too many places. If your survey is anonymous and people get the free gift upon entering their contact info, i can understand people turning this offer down. ", "Permalink": "https://www.reddit.com/r/PhD/comments/6vyfbx/surprised_at_amount_of_respondents_that_dont_want/docfj8s/"}, "112": {"Subreddit": "PhD", "Author": "snowball3xz", "Date": 1507955001, "Score": 2, "Body": "Don't get bitten by mosquitoes. In some parts of the world this can kill you!", "Permalink": "https://www.reddit.com/r/PhD/comments/6vcm33/phd_students_lets_all_share_a_dumbed_down_summary/docftmx/"}, "113": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1507969859, "Score": 3, "Body": "I'm not sure I'd agree. I think most people do a PhD primarily for career progression (which almost always translates into earning more money). I don't see that as a bad thing. The majority also do it because it's what they're interested in and it's a personal challenge, but if it didn't eventually open doors to better jobs, I don't think many would put themselves through it. If I asked my colleagues, I doubt many would way they did it purely \"for the experience\" but your personal motivation shouldn't matter to anyone other than yourself. You did it! Well done!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/docm8y4/"}, "114": {"Subreddit": "PhD", "Author": "Invyz", "Date": 1507984389, "Score": 1, "Body": "Do you have any papers out? This seems dope as hell and up my alley", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/docrkhu/"}, "115": {"Subreddit": "PhD", "Author": "OptimalGoat", "Date": 1507997737, "Score": 1, "Body": "I don't right now, but I'm working on a few! My background is in art(BFA in Music, MFA), which generally doesn't really need publications. \n\nIf you want some of the sources that I generally read and cite though, it's a lot of Julian Togelius, Georgios Yannakakis, Arne Eigenfeldt, Philippe Pasquier, Darrel Conklin, and some Karen Collins. Togelius and Yannakakis generally focus on all sorts of procedural generation for games, Eigenfeldt is all generative music, Pasquier is generative art a little more in general(Lots of music, but also generative movement and other stuff). Collins is a lot of game sound stuff.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dod05eu/"}, "116": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1508064638, "Score": 1, "Body": "Congratulation on getting an interview! Have you had a look at the official page description for the course? \nYou could also ask them what type of questions they would be asking or area. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76i6sx/i_am_an_overseas_student_looking_forward_to/doe6pn4/"}, "117": {"Subreddit": "PhD", "Author": "PhD-SurfaceScience", "Date": 1508065762, "Score": 3, "Body": "I make metal structures by manipulating surfaces with atomic precision using scanning probe lithography. I then use use these structures as electrodes to catalyse redox reactions for fuel cells.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/doe72od/"}, "118": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1508079987, "Score": 2, "Body": "For a DPhil the questions will be about your knowledge of the top of your title, as well as more general ones about your experience in science and if you know what doing a DPhil will be like.  A lot of the specific questions will depend on the funding - if it’s research council funded and a competitive interview then it could be tough. If the supervisors have the money already, then you just have to prove you’re good enough. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76i6sx/i_am_an_overseas_student_looking_forward_to/doeea0a/"}, "119": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1508128791, "Score": 4, "Body": "I'm doing quantum biology. \n\nThe world of quantum mechanics behaves very differently to ours. For example, in the normal world, if you throw a ball against a wall, it will bounce off. In quantum mechanics, you can perform a similar experiment only to have the ball appear on the other side of the wall, without ever having travelled through it.\n\nI'm interested in how this quantum 'weirdness' is used in biological systems (such as plants or animals) to help the organisms survive and thrive.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dofilpg/"}, "120": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1508129137, "Score": 3, "Body": "I have no idea what I want to do in life: PhD was just the next obvious step after finishing uni, so it's the one I took. Hopefully it will give me time to figure out the next step (although with only six months left the chances of that are pretty grim).", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dofiss7/"}, "121": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1508129539, "Score": 1, "Body": "Why are the first three letters of every title red? It seems like a really odd choice", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dofj0vy/"}, "122": {"Subreddit": "PhD", "Author": "blabbermeister", "Date": 1508129610, "Score": 1, "Body": "Aesthetic choice by the author, it's easy to change though", "Permalink": "https://www.reddit.com/r/PhD/comments/73f8bi/latex_cv_template_for_phd_students/dofj2bj/"}, "123": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1508140255, "Score": 9, "Body": "The whole concept of a 'telltale' is bullshit; you can have a word with the student, asking if there's anything in particular they're having difficulties with. If they don't address it/don't improve, go to your supervisor and ask for their advice on how to proceed: them messing up the lab isn't helping anyone, not even the undergrad.", "Permalink": "https://www.reddit.com/r/PhD/comments/76onwa/undergrads/dofnt1m/"}, "124": {"Subreddit": "PhD", "Author": "1nstantHuman", "Date": 1508168512, "Score": -11, "Body": "Edit: I retract my advice. Seems like it might be outside my expertise. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dog2y2e/"}, "125": {"Subreddit": "PhD", "Author": "polyphonal", "Date": 1508181034, "Score": 3, "Body": "&gt;  So I didn't really get if you have to apply for a PhD or a scholarship before\n\nIt depends on what country you're applying to.  In some places there will be funded positions with a job description posted online; in other places you'll need to find funding first.  You'll need to look this information up for every country you apply for, and then you'll need to find out whether there's a central repository for funded positions.  In the UK there's [jobs.ac.uk](www.jobs.ac.uk), in the Netherlands there's [academic transfer](https://www.academictransfer.com/), some places use [FindAPhD](https://www.findaphd.com/) and I'm sure you'll be able to find the equivalent sites for other countries.\n\n&gt; Should I continue to contact professors directly or apply to open positions ? \n\nYou should do both.  Applying for a PhD position is like applying for jobs - unless you're an extremely strong candidate or find the exact perfect position, you'll probably need to apply for many places before finding the best fit.  ", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dogen96/"}, "126": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1508189035, "Score": 1, "Body": "I'm doing the exact same thing! I'm on the search for a PhD and I've got a few events planned. So findaphd have a live event in three cities at the end of this month. You can also look at the post graduate fair in London,(December) 🤔\n", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dogm5fb/"}, "127": {"Subreddit": "PhD", "Author": "Selest1", "Date": 1508195596, "Score": 2, "Body": "Thank you : ))", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dogrmbh/"}, "128": {"Subreddit": "PhD", "Author": "castroliu", "Date": 1508201023, "Score": 1, "Body": "I waited for one day, what's happening...", "Permalink": "https://www.reddit.com/r/PhD/comments/76jdl0/should_i_transfer_to_the_university_that_i/dogvzn2/"}, "129": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1508205725, "Score": 2, "Body": "I think that's pretty normal. I would try to have a direct conversation about it with your supervisor because I'm sure they've seen this before. Tell them that you're struggling to nail down exactly what you want to do and that you're feeling really panicked about everything. They will hopefully be able to give you some direct instructions about where to go from here. I would also suggest getting some counselling, particularly if you have free sessions available to you on campus. It's not unusual to have a spike in anxiety and depression at this stage and you want to deal with it before it is a problem for you day to day life.", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dogzwdi/"}, "130": {"Subreddit": "PhD", "Author": "warwick607", "Date": 1508205971, "Score": 8, "Body": "&gt;I just started my PhD program this term, and I already feel totally inadequate.\n\nDon't worry, everyone feels the same exact way.\n\n&gt;I know part of that is because I suffer from anxiety, but the other part is that I just don't feel as..put together or up to par as some of the other incoming students?\n\nOther students come in at different points of their career, some appear more developed while others may appear less so. However the department picked you because they believe you belong there, you're just as capable as the other students and your department believes in you, don't forget that.\n\n&gt;but all I can seem to do is babble &amp; not satisfactorily answer the questions my sup has for me about the readings I've done when we meet. It's like my brain seizes up &amp; won't allow me to articulate anything.\n\nBeing nervous causes your central nervous system to start firing off in rapid succession, often causing a flood of emotions to the point where you can't articulate your thoughts correctly. This is normal. Remember that even your professor is just another person like you, there is nothing special about them, and there is no reason to think of them any differently, or be nervous about them when talking to them, including things about class. It is not as big of a deal as it seems, they are just people like you and me, nothing to stress over.\n\nGraduate level reading is tough, and no one expects you to read it all and memorize it 110% every single week. Just realize that all you need to do is read the required chapters, give your opinions when asked, and relax about \"trying to answer perfectly\" when talking to the professor. \n\nSomething I've told myself lately: It's okay to be wrong. We are all human, we are learning. We are in graduate *school* for a reason, to learn. Professors don't expect you to know everything right away, they are trying to test your limits to see how far you can go with this. \n\nAlso, don't worry if you don't know what you want to study right now. It is early, it's your first year and your research interests inevitably change as the years pass. Find what really interests you and look into researching that, everything else will fall into place.", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/doh03p0/"}, "131": {"Subreddit": "PhD", "Author": "BirdFacee", "Date": 1508210098, "Score": 2, "Body": "I just had to go back up to the top to check that I wasn't OP for this haha. I feel exactly the same.", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/doh3dea/"}, "132": {"Subreddit": "PhD", "Author": "manicmuncher", "Date": 1508217303, "Score": 1, "Body": "Something we are always told is not to compare our journey or progress with someone else's.\n\n I have had similar issues with my supervisors. If I am not able to gather my thoughts enough to answer a question I will sometimes email them after the fact with the answer. This at least proves that I can answer or can now after some reading answer the questions. Reading is very broad at this stage so people may not judge you if you don't know one thing yet, but they will respect you if you take time to find out.\n\n I have taken to asking if they didn't know the answer to a question or were asking to see if I did. That way it gives me a better idea of what type of answer they are looking for. If they know then I can just hit main concepts that I am familiar with and if they don't o try and do a quick explanation. These questions have a point. Listen to what they are asking, usually they do this to prepare for your VIVA and get you used to answering question. It is just a skill they are trying to build up. \n\n Don't worry we all feel like frauds sometimes.\n\n I try to think of my supervisors as managers at a job. They are there to guide you but you are both people doing a job. They know more than you on some things but you will find you will quickly outpace them in certain areas. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/doh7uxj/"}, "133": {"Subreddit": "PhD", "Author": "snowball3xz", "Date": 1508223216, "Score": 2, "Body": "I just started my second year. Almost done with classwork now. Have my first committee meeting in 3 weeks. I'm supposed to give a talk about my more narrowed down research interest. I still have no clue.   To everything my advisor suggests I'm just like 'that sounds cool, I'd be happy working on that'. But I am having trouble coming up with own ideas. \n\nI thought I was very inadequate too. My advisor is just crazy smart and whenever I talk to him I feel dumb and useless and like an employee who is only executing what he suggests. I told myself that I won't drop out from my own decision. I decided that I'll try as long as possibly and that I'll only go if they'll kick me out or tell me I should go. Weirdly enough I'm actually getting quite a bit of positive feedback. So I guess I'll stay. ;-)\n\nJust saying. We're in a field where everyone it's smart. Feeling inadequate is very easy in such an environmrnt is easy. You got this far, so you're definitely smart enough to go further. One good pics of advise the counseling service at my uni have us all in the introduction week was 'it's not the smartest who graduate, it's the most tenacious ones'. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dohajmy/"}, "134": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1508230594, "Score": 1, "Body": "I won't be suprised that I'll be feeling the exact same feeling. Not everyone will have the same answer. \nI mean a huge part of a PhD is research! Maybe you can ask your supervisor for some recommending reading. Area that seems interesting and engaging", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dohd78h/"}, "135": {"Subreddit": "PhD", "Author": "Garlic_aroma", "Date": 1508241429, "Score": 1, "Body": "\"ProQuest\" searches everything at the same time. Does your library have a Proquest  account?", "Permalink": "https://www.reddit.com/r/PhD/comments/76y0gp/how_to_search_jstor_muse_sage_etc_at_the_same_time/dohhek2/"}, "136": {"Subreddit": "PhD", "Author": "Leelum", "Date": 1508242972, "Score": 2, "Body": "My normal first option is Google Scholar. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76y0gp/how_to_search_jstor_muse_sage_etc_at_the_same_time/dohi9qd/"}, "137": {"Subreddit": "PhD", "Author": "TeamPattycake", "Date": 1508244980, "Score": 1, "Body": "A lot of university libraries will have a \"search everything\" tool on their websites.", "Permalink": "https://www.reddit.com/r/PhD/comments/76y0gp/how_to_search_jstor_muse_sage_etc_at_the_same_time/dohjj1o/"}, "138": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1508246319, "Score": 1, "Body": "s/anxiety/depression/ and you could be me, but as far as i know this is a pretty common feeling.\n\nI am a very nontraditional student and am doing the PhD part time while working fulltime, the thing that is keeping me going is that I realize that it is only this one course which is very far outside of my comfort zone is what is getting me down right now. ", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dohkggz/"}, "139": {"Subreddit": "PhD", "Author": "avflinsch", "Date": 1508246458, "Score": 2, "Body": "&gt;  'it's not the smartest who graduate, it's the most tenacious ones'\n\nPretty much what I was told also, 'the PhD is not about who is the smartest, it is an endurance race'", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dohkjzu/"}, "140": {"Subreddit": "PhD", "Author": "andumar", "Date": 1508249085, "Score": 1, "Body": "Hi two-years-ago me,\n\nThings will definitely get better. Talk to a professional (in anxiety related disorders), and don't worry about not having a very concrete plan at this point. Just pursue what seems interesting to you and go forming questions along the way. Many of the people who seem to have very clear ideas are just faking it, they are lost to various degrees.\n\nI wish I could say more, but I'm here happily busy and going about my projects; now I have to prepare a presentation for the reading group I coordinate in one of the subfields I ended up narrowing my interests to (it gradually happened!).\n\nThey admitted you, you've just started, you'll do great!", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dohml8g/"}, "141": {"Subreddit": "PhD", "Author": "mtb_addict", "Date": 1508298972, "Score": 3, "Body": "I'm not in the field so I don't have specific resources, but read anything in the field, you won't fully comprehend at first, but take your time and work through things. This sucks, but we'll worth it and comb through ref lest and look for reviews or specifically search for them. \nFind a solid text book and work your way through it.\nKahn academy is getting some pretty advanced topics now, might be the best place to start. That's what I've done in the past and been pretty successful with it.\nCheers ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/doiwpfx/"}, "142": {"Subreddit": "PhD", "Author": "FB917", "Date": 1508299645, "Score": 1, "Body": "Thanks so much, really helpful! ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/doix6pn/"}, "143": {"Subreddit": "PhD", "Author": "cephalord", "Date": 1508324068, "Score": 2, "Body": "You have to treat it like job hunting. 4 applications is nothing. Expect dozens before you get an offer, if at all.\n\nThis is not to discourage you, but the reality of things.", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/doj7pxd/"}, "144": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1508337378, "Score": 2, "Body": "Congrats! ", "Permalink": "https://www.reddit.com/r/PhD/comments/774iuz/just_got_my_phd_funding/dojgbob/"}, "145": {"Subreddit": "PhD", "Author": "heidzelaine", "Date": 1508347441, "Score": 1, "Body": "What kind of Ph.D program are you doing? I'm just curious because I'm in instructional design and wondered if you were studying something related. ", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/dojq0jz/"}, "146": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1508359162, "Score": 2, "Body": "Yesssss boiiiii8iiiiiiiiiiiiiii", "Permalink": "https://www.reddit.com/r/PhD/comments/774iuz/just_got_my_phd_funding/dok1wcc/"}, "147": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1508361290, "Score": 1, "Body": "So your background is purely psychology? I don't mean to put you off but youre talking about catching up on years worth of subject matter. Especially if you haven't done A levels. That being said, you could focus your background reading on your area of interest and hopefully expand your general biology knowledge over time. Good luck. ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dok3zbk/"}, "148": {"Subreddit": "PhD", "Author": "FB917", "Date": 1508361854, "Score": 1, "Body": "Well I've recently completed an MRes in Health Science Research where I've learnt various laboratory techniques and carried out a project investigating a potential gene therapy approach to a condition. So, I've caught up on the background of that particular research area. I'm just interested in expanding my general biology knowledge as well, without embarking on expensive courses, whilst I apply for PhDs. (I've done A Levels, just not in core science subjects). ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dok4il7/"}, "149": {"Subreddit": "PhD", "Author": "meningo1986", "Date": 1508362153, "Score": 2, "Body": "Its worth looking at free online courses, Coursera and the like. That will catch you up on core degree modules but won't cost you a penny. You should be able to cherry pick the modules you're most interested in. That would probably be more effective than just trying to read text books. ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dok4sog/"}, "150": {"Subreddit": "PhDStress", "Author": "barcerrano", "Date": 1508362281, "Score": 1, "Body": "DON’T EVEN THINK ABOUT IT!!", "Permalink": "https://www.reddit.com/r/PhDStress/comments/773ke5/phd_students_what_advice_would_you_give_to_a/dok4wxi/"}, "151": {"Subreddit": "PhD", "Author": "FB917", "Date": 1508362330, "Score": 1, "Body": "You're right, probably the best way to do it. Thanks ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dok4yjv/"}, "152": {"Subreddit": "PhD", "Author": "q6D7n3G80i", "Date": 1508369331, "Score": 2, "Body": "I did my masters in Augmented Reality (Master in Computer Sciences) and I consider it is easy to publish in the field, but it depends on what type of research you're into.\nExample, if you have access to a cultural heritage site (museum, ruin, historical place; also by access I mean you can secure working with the people in charge of that place either directly or with the aid of your advisor or one of his/her contacts) you could easily recruit a couple of undergrad students and develop an AR application using whatever tools and techniques already exist. Such development could totally net you a publication in, say, IEEE Computer Graphics and Applications or Presence.\nHowever, to participate at SIGGRAPH one would probably need to present novel knowledge in computer graphics (say, a 'better' way to utilize a mobile processor to track targetless objects; whatever better entails: more efficient than others, specialized for a particular domain, etc.)\nThat's not to say IEEE is more lenient towards the contents, rather they have many journals and some of them specialize in applications or multidisciplinary approaches to computing; which I consider easier than developing breakthroughs, although that depends of how well networked you are and how good you are working with others.", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/dokb10n/"}, "153": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1508422457, "Score": 1, "Body": "Make the student's direct supervisor aware of the situation.  If it was just one mistake, then you could easily correct the problem by just explaining the mistake to the student.  This sounds more like a laziness/personality issue though.", "Permalink": "https://www.reddit.com/r/PhD/comments/76onwa/undergrads/dol6h33/"}, "154": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1508422706, "Score": 2, "Body": "A lot of the \"put together\" students are just talk and don't actually have an intuition about how to get anything done.  Some of the quiet people seem quiet because they're too busy getting shit done to flex loudly about it.\n\nDo get the anxiety under control with therapy and/or medicine so that you don't get in your own way.  That'll help you think more clearly and plan.", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dol6owl/"}, "155": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1508423120, "Score": 2, "Body": "Learn broadly if it interests you, but that won't actually help you with a PhD.  Research is more about logic and arguments than facts and knowledge.  Specific facts can help you build an argument, but those won't be covered in a broad undergraduate -style class or book.\n\nI'm doing a PhD in neuroscience with 0 biology background, I have a squishy fluffy-bunny undergrad humanities degree.  Even a broad neuroscience background isn't that important for the work, writing or research I'm doing.  You'll absorb what you need and develop a good sense by doing very focused topical reading as the need arises.", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dol720u/"}, "156": {"Subreddit": "PhD", "Author": "FB917", "Date": 1508426310, "Score": 1, "Body": "This is reassuring! So there was no specific requirement for a certain undergraduate degree when applying? Did you gain experience prior to the PhD in any other way? ", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dola0x9/"}, "157": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1508450140, "Score": 1, "Body": "There is no hard requirement for degree, but there's a lot of variation.  I didn't even get interviews at programs far 'worse' than the one I ended up at, and some of those places rejected me because of my degree.  What mattered was that I worked in neuro labs with multiple pubs prior to applying.", "Permalink": "https://www.reddit.com/r/PhD/comments/773xhm/how_to_brush_up_on_background_knowledge_before/dolx1i8/"}, "158": {"Subreddit": "PhD", "Author": "SimmyDark", "Date": 1508485541, "Score": 1, "Body": "I'm sure you are all done now and feeling great!! I'm writing up now and share your pain!!", "Permalink": "https://www.reddit.com/r/PhD/comments/72k7w4/im_writing_my_thesis_and_it_sucks/dommboq/"}, "159": {"Subreddit": "PhD", "Author": "cheoppy", "Date": 1508537154, "Score": 1, "Body": "in what ways would a PhD give you more than a MA? \n\nin most fields, if you are not into research then a PhD is not necessary to get a great job, but a PhD usually takes a lot of time and mental capacity to pursue.", "Permalink": "https://www.reddit.com/r/PhD/comments/77p67n/been_considering_a_phd_or_2nd_ma_for_7_years/donoat6/"}, "160": {"Subreddit": "PhD", "Author": "papiou", "Date": 1508608422, "Score": 3, "Body": "Thanks to everyone for the great replies - it's reassuring to know that feeling totally out of my depth isn't something uncommon for new students. And the advice is all very much appreciated, so really...thank you all for taking the time to comment and share some wisdom with me. I've already been to my uni's health center this week to get a referral for a psych, so I'm doing my best to nip some of this in the bud. I haven't been able to really become a part of a 'community' at my school yet, so it was great to be able to come here and feedback...thank you all, again!", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dooshtm/"}, "161": {"Subreddit": "PhD", "Author": "Astro_Biscuit", "Date": 1508615721, "Score": 1, "Body": "Are you looking for technical issues you can then fix and monetise? Because I think the average PhDs problems is more of the \"what am I doing with my life, I have no motivation, impostor syndrome\" type issues. Don't think any tech startup is gonna deal with that...", "Permalink": "https://www.reddit.com/r/PhD/comments/74osot/schedule_a_5_minute_call_to_complain_to_me_about/dooy5wa/"}, "162": {"Subreddit": "PhD", "Author": "NerdBell", "Date": 1508623649, "Score": 8, "Body": "Unless there is something you are not saying, it is extraordinarily common to build on other people's work during your PhD, bordering on a necessity/guarantee. The fact that the person did not finish with the data does not mean you are \"finishing their PhD\" (again, unless your supervisor has said something alarming) -- you're doing *your* PhD, with some data that have already been collected for you. ", "Permalink": "https://www.reddit.com/r/PhD/comments/77ut2s/taking_over_a_phd_position/dop46zg/"}, "163": {"Subreddit": "PhD", "Author": "craoloro", "Date": 1508625178, "Score": 1, "Body": "As with above posts, it depends on your department, field, desired journal etc. Using a reference manager you would easily be able to switch from one style to another. \n\nVancouver can be quite easily on the eyes, however. ", "Permalink": "https://www.reddit.com/r/PhD/comments/6ye8ry/what_bibliographic_style_do_you_use/dop5bju/"}, "164": {"Subreddit": "PhD", "Author": "craoloro", "Date": 1508625363, "Score": 1, "Body": "Perpetua, please. ", "Permalink": "https://www.reddit.com/r/PhD/comments/6xf91o/that_beautiful_moment_when_you_change_the_font/dop5gee/"}, "165": {"Subreddit": "PhD", "Author": "biznatch11", "Date": 1508644113, "Score": 4, "Body": "&gt;that means that they also expect me to be done \"earlier\"\n\nThat's not really how it works. To graduate you need to generate a certain amount of your own data regardless of what someone has done before you. But you should be able to take the project farther than if you'd started from scratch. One word of caution though, don't blindly put too much trust in their data, try to replicate some of their work first.", "Permalink": "https://www.reddit.com/r/PhD/comments/77ut2s/taking_over_a_phd_position/dopjj9l/"}, "166": {"Subreddit": "PhD", "Author": "p10_user", "Date": 1508645843, "Score": 1, "Body": "Depending on the cost of living, you can keep your expenses fairly low without much effort - especially by sharing a place with a roommate. You won't have additional spending money as you might now so you might have to forego more expensive vacations and recreation. ", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dopklen/"}, "167": {"Subreddit": "PhD", "Author": "purpleoctopuppy", "Date": 1508655275, "Score": 8, "Body": "Tutoring's a good way to get some extra money, but I've found the PhD stipend here (c. $25k-30k AUD per year) has been sufficient to live comfortably, within reason (not partying every night etc.). My partner and I split all bills evenly, but when it comes to treats (e.g. eating out) we spend our own money.\n\n$500 a week is more than enough to live on (it's nearly double welfare payment), but if your payment is less than about $350-$400 you'll definitely want to pick up a tutoring job (my experience is exclusively Australian).", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dopp594/"}, "168": {"Subreddit": "PhD", "Author": "legendfriend", "Date": 1508662139, "Score": 3, "Body": "Teaching and tutoring are obvious ones - either undergraduates as part of an official program (ie you’re giving lectures/seminars or marking papers) or a 1-to-1 style of teaching for undergrads and school kids. It won’t be reliable, but I made some nice money doing proof-reading for work from international students (not writing it for them of course). Takes a couple of days, but it can work out nicely. ", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/doprkir/"}, "169": {"Subreddit": "PhD", "Author": "overlyattchhornyexGF", "Date": 1508685429, "Score": 1, "Body": "Some fellowships can pay more than a typical stipend (in the US). Scholarships for graduate students tend to have a cash award.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/doq2hhu/"}, "170": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1508692813, "Score": 1, "Body": "I was certainly quite down during the last part of my thesis writing...I am not sure it was clinical depression, but it was definitely not a good time. Power through, it ends eventually.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/doq8lvt/"}, "171": {"Subreddit": "PhD", "Author": "petitcrocodile", "Date": 1508724692, "Score": 1, "Body": "Can you change advisors? Here in Australia in theory we can change advisors if you have a *from hell* situation.  I have a friend in a position similar to yours.  Maybe you can look into this? I don’t know about the funding so I can’t advise you on that but if you really don’t like the field I would quit and find something else but if it’s mostly because you have a crappy advisor it might be worth exploring switching advisors.  Best of luck!", "Permalink": "https://www.reddit.com/r/PhD/comments/78491d/leaving_phd_advice/dor1s8g/"}, "172": {"Subreddit": "PhD", "Author": "plusgarbage", "Date": 1508778296, "Score": 2, "Body": "Pattern Recognition and correlated topics like action recognition. I'm going into deep learning in months", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/doryzcw/"}, "173": {"Subreddit": "PhD", "Author": "heidzelaine", "Date": 1508779941, "Score": 2, "Body": "That's very interesting and a field I haven't heard of before! ", "Permalink": "https://www.reddit.com/r/PhD/comments/75glt4/how_easily_is_possible_to_publish_in_agumented/dos0mix/"}, "174": {"Subreddit": "PhD", "Author": "throwAway02102017abc", "Date": 1508787700, "Score": 1, "Body": "Thank you, I almost forgot this motivation... Thanks a lot!", "Permalink": "https://www.reddit.com/r/PhD/comments/765vcf/is_it_ok_to_do_a_phd_for_the_sake_of_the/dos8d4m/"}, "175": {"Subreddit": "PhDCafe", "Author": "truonghuuphuoc", "Date": 1508873255, "Score": 1, "Body": "công viên là nơi mọi người vui chơi giải trí", "Permalink": "https://www.reddit.com/r/PhDCafe/comments/78i5fn/hé_lộ_tài_năng_giữa_công_viên_đất_thủ_miền_đông/dotzare/"}, "176": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1508959384, "Score": 2, "Body": "ELI5: You know how you can take a straw and put it in your soda...and then put your thumb over the end, and pull up a tube full of soda from the middle of your cup? I do the same thing but with a giant hollow metal drill instead of a straw, and instead of soda, I stick it into a huge pile of snow called an ice sheet. I lower the drill in to the ice sheet, and pull out a tube of old snow from the middle. This tube of snow, has information in it that can tell me about what it was like when each flake of snow actually fell.\n\nELI 18: I drill and analyze ice cores to understand past deformational changes in several Antarctic Ice Sheets. In addition, I look at the chemistry to reconstruct past atmospheres and climate.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dovqfjx/"}, "177": {"Subreddit": "PhD", "Author": "IAmExtremelyCurious", "Date": 1508959680, "Score": 1, "Body": "That's really \"cool\"! ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dovqqew/"}, "178": {"Subreddit": "PhD", "Author": "suiitopii", "Date": 1509096730, "Score": 1, "Body": "I feel your pain, I went from working in industry to living on a PhD stipend too. I have found it difficult too, and my partner and I have just accepted that she will have to pick up more of the bills/shopping for a few years until we can be on even financial footing again. If you really don't want to do this, I'm sure you can pick up a bit of extra cash elsewhere. Tutoring, as someone has already suggested. I don't know what your field of work is, but in the sciences PhD students can often earn a bit of money by helping teaching undergrad lab classes (maybe other disciplines have similar ways to earn money). Keep an eye out for university or research council scholarships you can apply for to offer a bit more support, though perhaps these are more intended for people who self-fund.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/doyj2tr/"}, "179": {"Subreddit": "PhD", "Author": "w4ck05", "Date": 1509111506, "Score": 1, "Body": "i try to survive :)\nNo, i work on a wearable device in order to put in communication deaf-blind people and people without disabilities.", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/doyqpah/"}, "180": {"Subreddit": "PhD", "Author": "tbiro", "Date": 1509123798, "Score": 2, "Body": "Hey! You're not alone. I've been dealing with pretty bad depression this semester too. We can commiserate over all the things making us depressed over pm if you want. \n\nI think my depression stems from putting off working on my research and writing to work on things that have more urgent deadlines, like coursework or teaching, which leaves me and my advisor/collaborators disappointed with my research progress. Can't say acknowledging this has made me much better at time management either. \n\nWhat's been helping me combat my depression is scheduling in little breaks for my social and home life, and sticking mostly to a 9 am - 5 pm Monday - Friday schedule for being at the school/lab. I have a cat too, which forces me to go home at reasonable times to feed him and helps give me some semblance of a normal schedule. However, I will say, sticking with a normal schedule and maintaining my social life has not made me a better or more competitive researcher compared to people who spend much more of their time in the lab, which in turn makes me feel guilty and feeds into my depression. Then again, if I was in the lab all the time and let my social connections and hobbies outside of academia die, I would also be equally depressed. A healthy work-life balance is the single hardest thing to maintain in academia.", "Permalink": "https://www.reddit.com/r/PhD/comments/75llus/do_you_think_its_normal_for_phd_students_to_be/doz1wpq/"}, "181": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509157614, "Score": 1, "Body": "I took a second job and I hide it from my program to avoid getting my pay docked.  It has nothing to do with teaching or tutoring, and it pays as much as my stipend on about 6-10 hours a week, working remotely.  5-6 years is too damn long to be making only $30k a year in one of the highest cost of living areas in the US.  I firmly refuse to follow these rules and accept less when both bosses are happy with my work.\n\nGiven the far higher number of PhDs awarded than the world needs for employment, any competitive edge you can get over your peers is crucial.  My side job is affording me that edge in a real way that my university just cannot provide.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dozt8ex/"}, "182": {"Subreddit": "PhD", "Author": "123gatos", "Date": 1509159015, "Score": 1, "Body": "What is this second job that you do remotely?! I am a PhD student in an expensive urban area and I need to figure this out! ", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dozu6pc/"}, "183": {"Subreddit": "PhD", "Author": "optimalcontroller", "Date": 1509171526, "Score": 1, "Body": "My topic: Consider an autonomous robot (car, uav etc.). How would you mathematically guarantee that it will both learn the environment and complete its mission even in the case that it knows completely nothing about the environment?", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dp016mv/"}, "184": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509196508, "Score": 1, "Body": "I have a background in software (completely unrelated to any degrees or fields of study), and I've been doing some development and technical work for a company.  Its funny--every interview I've gone on for my post-PhD job, even if it has no relationship to software at all, has been asking me more about this job than what I've done for the last 5 years in the PhD.  People want to hear what real world experience I have, not what stuff I studied during graduate research.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dp0a6e7/"}, "185": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509198746, "Score": 1, "Body": "A year of data isn't much, so don't agree to a second authorship position.  You'll likely be doing a lot more data collection, analysis and coming up with new directions so you should push for a first authorship.\n\nBut also, don't put all of your eggs in one basket.  You might agree to the project, analyze this data and realize there isn't anything there worth pursuing.  You don't want to box yourself into a crappy project, so make sure you have some contingency plan with your PI.  I came into my PhD working on a project that another had started, and all of his data turned out to be mostly shit because he set up his experiment wrong.  I agreed to fix the design, run that data, publish it, but then *stop* that project completely in favor of my own idea.  It was a compromise, but it worked out.", "Permalink": "https://www.reddit.com/r/PhD/comments/77ut2s/taking_over_a_phd_position/dp0bgej/"}, "186": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509199031, "Score": 1, "Body": "Do you need additional degrees to get those jobs?", "Permalink": "https://www.reddit.com/r/PhD/comments/78pbzw/asu_online_edd_program_worth_it/dp0bmav/"}, "187": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509199569, "Score": 1, "Body": "Don't do graduate work if you don't really like research that much.  You want to be a \"storyteller and communicator,\" so do that.  You don't need to purchase more education for that, especially not a \"stepping stone\" degree.\n\nI'm having a hard time wrapping my head around your career goals.  What is your current job title, and what job title do you want?  How much do you want to be paid?  Don't take on a degree unless you *need it* for the job you want, or if you have a bunch of money laying around.", "Permalink": "https://www.reddit.com/r/PhD/comments/77p67n/been_considering_a_phd_or_2nd_ma_for_7_years/dp0by1m/"}, "188": {"Subreddit": "PhD", "Author": "diamondsinthecirrus", "Date": 1509226526, "Score": 1, "Body": "Did you find that working an additional day each week detracted from your PhD? I've received conflicting advice, and don't want to overload myself.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dp0w34l/"}, "189": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1509229241, "Score": 2, "Body": "You also need to look at failed/false democracies. Russia, the Middle East, North Korea.", "Permalink": "https://www.reddit.com/r/PhD/comments/79cfdb/kinda_stuggling_with_my_phd_thesis_topic/dp0y4yr/"}, "190": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509248693, "Score": 1, "Body": "Sometimes, yes--it detracted from my PhD.  But what I gained was worth *more* than what the PhD work had to offer.  I was already working 7 days a week, so I figured out a way to reduce that committed time and redirect it to the job.  I also started this position only after I had a fully flushed-out set of protocols with most of the troubleshooting done for the PhD work.  Right now, I have 3 mentees that do the majority of the day to day work in the lab, allowing me to manage from the desk while working on projects for the other job.  This is only possible because the protocol has already been established over the past 2.5 years.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dp1byvo/"}, "191": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509249142, "Score": 3, "Body": "Can your third part be based upon the preliminary results of the first two?  It seems to make sense that if you find some interesting or unique result from the first two sets of broad questions, you could come up with something novel for the third.", "Permalink": "https://www.reddit.com/r/PhD/comments/79cfdb/kinda_stuggling_with_my_phd_thesis_topic/dp1c88a/"}, "192": {"Subreddit": "PhD", "Author": "convo_casual", "Date": 1509249308, "Score": 3, "Body": "Why do you want to go to Japan specifically?  Choose the best option for getting your preferred job, ie where does the \"best\" econ degree come from when it comes to job hunting?", "Permalink": "https://www.reddit.com/r/PhD/comments/79dxor/econ_ma_soon_to_be_but_want_to_go_abroad/dp1cbqn/"}, "193": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1509257297, "Score": 4, "Body": "Get your PhD where you want to get your job. ", "Permalink": "https://www.reddit.com/r/PhD/comments/79dxor/econ_ma_soon_to_be_but_want_to_go_abroad/dp1ga4s/"}, "194": {"Subreddit": "PhD", "Author": "kalithrall", "Date": 1509275237, "Score": 1, "Body": "Your university should have guidance on examiner viability. I don't think educational background matters as long as they are deemed competent ", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp1m8iw/"}, "195": {"Subreddit": "PhD", "Author": "councilanderson4", "Date": 1509276521, "Score": 1, "Body": "I'll be applying for outside US, so not every university have that guidance.", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp1mol2/"}, "196": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1509282184, "Score": 3, "Body": "Get reading the literature around the subject. What work is already out there in these two areas? Make notes of what has been studied and where the gaps are. This will help you formulate your research questions in more detail.", "Permalink": "https://www.reddit.com/r/PhD/comments/79cfdb/kinda_stuggling_with_my_phd_thesis_topic/dp1oyxv/"}, "197": {"Subreddit": "PhD", "Author": "Tatta_Tatta", "Date": 1509291702, "Score": 1, "Body": "Go with the person who knows you best and who you think will write the strongest letter. Much better than a generic letter from a legit professor that is vague and superficial. ", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp1uwwz/"}, "198": {"Subreddit": "PhD", "Author": "culturecouture", "Date": 1509297598, "Score": 0, "Body": "I had the mayor of the town where I worked/volunteered in write one of my letters; my department appreciated it. ", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp1zqi8/"}, "199": {"Subreddit": "PhD", "Author": "ImmunizedBear", "Date": 1509304623, "Score": 1, "Body": "Have you used any of the literature focusing on the newly discovered lymphatic ducts in the human brain?\n\nhttps://www.sciencealert.com/researchers-have-now-watched-the-sewer-system-of-the-human-brain-in-action", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dp2623n/"}, "200": {"Subreddit": "PhD", "Author": "mycloudlesssky", "Date": 1509305379, "Score": 1, "Body": "No, because they only exist at the surface of the brain and don't tell you anything about what happens deep in the parenchyma, where the waste products are produced. I know the work and it's essentially a sink for what I investigate, but the existence of those lymphatic vessels unfortunately tells you nothing about how the brain deals with waste. They're also not newly discovered actually, just rediscovered. Lymphatic vessels in the dura were first described at the beginning of the 19th century. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dp26rv8/"}, "201": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1509322577, "Score": 1, "Body": "Some will, some won't. Those graduate schools who will are likely to state/ hint it somewhere on their website if they have some application instructions there. Typically you need to have at least one strong letter from a person who has a PhD (which it seems you in any case do). If you are supposed to teach in the PhD you are applying for and it is at an institution which cares about teaching, having that second letter which tells about your excellent teaching ability makes most sense.", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp2lkyr/"}, "202": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1509322992, "Score": 1, "Body": "Because you don't have (enough) research experience and connections. If you never did a degree with research thesis (did that 1 year MSc have it?) or an equivalent amount of research, you are likely to even be ineligible for most PhD positions in Europe. If you left a decent impression on some of on your professors in your MSc and undergrad, you can ask them where/ to which of their colleagues they'd especially recommend you to apply.", "Permalink": "https://www.reddit.com/r/PhD/comments/76qzx7/why_is_it_so_complicated_to_find_a_phd/dp2lwqn/"}, "203": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1509332852, "Score": 3, "Body": "Look up Imposter Syndrome, and remember that if you already knew what you needed to constitute a PhD, you'd have the degree. You don't, so you don't, but you will.", "Permalink": "https://www.reddit.com/r/PhD/comments/76v9f8/feeling_inadequateand_its_only_my_first_term/dp2tziy/"}, "204": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1509333432, "Score": 1, "Body": "Social justice social media campaign impacts on mainstream news narratives. ", "Permalink": "https://www.reddit.com/r/PhD/comments/74ccc2/what_cool_research_are_you_guys_doing_eli5/dp2uffo/"}, "205": {"Subreddit": "PhD", "Author": "rhetoricetc", "Date": 1509333499, "Score": 2, "Body": "Varies by discipline. Me? APA.", "Permalink": "https://www.reddit.com/r/PhD/comments/6ye8ry/what_bibliographic_style_do_you_use/dp2uh6b/"}, "206": {"Subreddit": "PhD", "Author": "enigmaticfermat", "Date": 1509348990, "Score": 1, "Body": "I'm also planning to do my PhD too 😂. There's a CDT program that I know that requires three referees\n\nSo my first one is my third year supervisor, second is the head of my department. The third one was briefly my tutor in my first year and knows me. Although he's more likely to give my strong reference.\n\nTbh it's going to be a qualatitive review for them. So you know they'll give you a fair description", "Permalink": "https://www.reddit.com/r/PhD/comments/79fs69/selecting_referees/dp333sh/"}, "207": {"Subreddit": "PhD", "Author": "shaner92", "Date": 1509354289, "Score": 1, "Body": "I studied abroad during undergrad and have taken time since to learn the language.  I enjoy Japan, and I enjoy my major, thought I could kill two birds with one stone.  I think my problem is I imagine Economics as such a broadly applicable field, so I then imagine that I should be able to find a job no matter what.  Everyone seems to advise against it though.", "Permalink": "https://www.reddit.com/r/PhD/comments/79dxor/econ_ma_soon_to_be_but_want_to_go_abroad/dp34xs2/"}, "208": {"Subreddit": "PhD", "Author": "fiorescuro", "Date": 1509411418, "Score": 1, "Body": "It would depend a bit on your stipend, but in Australia most people receive ~$500 a week. It's not a lot, but it's enough to cover cost of living. During the teaching semester, I do tutoring and marking for 1-2 subjects, with the uni rates being between $30-45 an hour depending on the subject and the level of responsibility.\n\nI use zero budgeting to manage my finances; when I get paid on my fortnightly pay day, I sit down and work out where the money needs to go over the next fortnight. That's doesn't mean I'm spending it all - I specifically allocate a decent portion of my earnings into my savings every fortnight. I prioritize groceries, rent, bills, and my dog, and try to allocate myself a bit of \"just for fun\" spending so I'm getting to enjoy myself a bit.\n\nMy partner and I typically split essentials and bills evenly. Any other \"just for fun\" spending comes from our individual money, and we take turns at covering eating out (which we typically budget a little bit for once a fortnight). It helps that he's earning a similar amount to me because we each have about the same to spend on \"just for fun\" items, but it's not like it would be impossible if he was able to spend a lot more on that kind of stuff.", "Permalink": "https://www.reddit.com/r/PhD/comments/77y0x4/budgeting_while_on_a_phd_stipend/dp4dok1/"}, "209": {"Subreddit": "PhD", "Author": "antihero790", "Date": 1509437698, "Score": 3, "Body": "Yes! Also in Australia and I do a similar thing of working from home quite often. I like working at night and if I don't have to use an instrument, I'd rather use my computer at home. I felt guilty about it all through honours and for the first year or so of my PhD. Then I started directly asking my supervisors if they were happy with my progress. As long as they keep saying they are, then I'll keep doing what I'm doing. I'm second call for any issues on our instruments so some times I feel like I'm letting people down by not being there but I live relatively close and people are welcome to phone me and I'll head in.", "Permalink": "https://www.reddit.com/r/PhD/comments/79twa1/does_anyone_else_feel_guilty_about_working_on/dp4umva/"}, "210": {"Subreddit": "PhD", "Author": "caz-", "Date": 1509440824, "Score": 5, "Body": "I basically did 100% of my PhD from home except for meetings with my supervisors and giving presentations and stuff. When I get absorbed in something, I can get a bit obsessive, so when I was trying to solve a problem, I would spend every waking hour on it for days or weeks. On the flipside, I'd sometimes get distracted and become obsessively focussed on something else for a week until I realise I'm meant to be working. I had anxiety about whether I was doing enough all throughout my candidature, but I always got enough done during my 'up' time to make up for any time I'd lost. In the end, I completed my thesis and passed with flying colours, and none of the details of how I got there matter any more.\n\nIf you're making the progress, which you obviously are, then it doesn't matter that you're not on campus as long as YOU are happy. Some people can't survive without daily human interaction, but that's a different issue. If you okay with solitude, there's nothing to feel bad about. I think it's a hangup we develop during lower levels of education. You kind of feel like you're wagging school and are going to get in trouble for it; you won't!", "Permalink": "https://www.reddit.com/r/PhD/comments/79twa1/does_anyone_else_feel_guilty_about_working_on/dp4vmgf/"}, "211": {"Subreddit": "PhD", "Author": "aakashvani", "Date": 1509444042, "Score": 2, "Body": "I get the same feeling a lot of times (about 10 months into my PhD now). For the inital 5-6 months, it was mostly coursework, so I didn't feel that bad about lesser time at lab. However, after that, for the first 1-2 months, I felt bad about not spending time in the lab. However, for the last month or so, I still stay at lab around 10-4 but I spend a good amount of time at my room working on the problem I have, which sort of alleviates the guilt (need to work on my productivity more).\nI guess what caz- says is correct too. The flexibility offered by doctorate studies can be utilized if you are the sort of person that can get work done in-solitude/away-from-workplace. This flexibility is rather difficult to find in a standard corporate job. Also, I think the \"long hours to be spent at lab to get work done\" is more applicable for people working on experimental projects (even that can be not true if someone plans their experiments well).", "Permalink": "https://www.reddit.com/r/PhD/comments/79twa1/does_anyone_else_feel_guilty_about_working_on/dp4wobw/"}, "212": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1509444927, "Score": 2, "Body": "I am in lab chemistry and my ability and willingness to work non-standard hours is actually usually an advantage (also for people around me) because of availability of instruments and lab space (introverts need lots of space...). I am actually responsible for most things to keep the lab functioning, but for that it's enough that I am around for a few hours around the middle of most workdays and accessible by email and phone almost all the time (I live a few minutes' walk away).", "Permalink": "https://www.reddit.com/r/PhD/comments/79twa1/does_anyone_else_feel_guilty_about_working_on/dp4wze4/"}, "213": {"Subreddit": "PhD", "Author": "thismynewaccountguys", "Date": 1509460871, "Score": 3, "Body": "Firstly I would recommend talking to someone like a councillor or therapist if your university provides such services. In terms of how it will look to future employers if you drop out, I'm no expert but I doubt it would look bad, people are aware that studying for a doctorate is a particularly arduous and sometimes lonely process that is very different to a regular job. If you are seriously considering dropping out then you should talk to your advisor. You may feel awkward about doing so but if it's that or definitely drop out/let your health suffer then it must be worth trying.", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp56q2t/"}, "214": {"Subreddit": "PhD", "Author": "Cerriddwen", "Date": 1509462070, "Score": 7, "Body": "In advance, I offer no guarantee that I talk anything but b.s. ^_^\n\nI can't tell you that you aren't inadequate with any ounce of qualification behind it. I can tell you that you aren't in your 2nd year because you lucked out or because someone made a mistake. You're there because you *did* earn it in year one and in the degree that you did before it. Have a look at something called the imposter syndrome and allow yourself a few hours to have a read about it. \n\nIn the first instance, I agree with the poster before me - there are professional counselors and therapists that are trained specifically to go through this with you and I'd really recommend setting up an appointment as a first step. You should be able to access this through your university and their benefit over us is that they'll see you on a continuing basis. \n\nIf you've made no progress and feel that your supervisors are disappointing with you, they have a responsibility as supervisors but also as functional adults, to convey this to you in a proper manner. If you haven't had a meeting with them where they've expressed this is proper wording, then it doesn't deserve the time that you've spent worrying about it. You cannot control how others may or may not act in that way and it's up to them to put their feelings out there if they're genuine. \n\nIf your supervisor is one such that you can talk to them about things outside of your project, a quiet word and perhaps telling them that you acknowledge you get anxious before meetings might help. It also might help to ask what they would suggest about that anxiety and perhaps that reaching out for their opinion/information may be the first step in them understanding what they should be doing to help out. \n\nIf this isn't possible, have a try anyway but perhaps through an email instead. If you get some help from a counselor, maybe they could help you write something to your supervisor. \n\nMy other tip right now would be - write the resignation letter. Write it, put it in an envelope and keep it on a shelf somewhere with a timer to say when to think about it. See how you feel after writing the letter. And remember that you can get paid for the PhD and still not complete (we can here anyways ^_^) . Someone in my office genuinely saved up all the pay from the phd first year, didn't turn up for 2nd year and completed his pilot licence on the money instead. \n\nHave a think about the stuff above and chuck out the stuff I've said that's crap. \n\nIt's a damn hard trip and you will be your own worst enemy. Give yourself permission to feel like crap. \n", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp57tbb/"}, "215": {"Subreddit": "PhD", "Author": "omgu8mynewt", "Date": 1509467666, "Score": 2, "Body": "I think you're having anxiety problems which are making stuff more difficult than it is. LOTS of phd students get anxiety problems because it is a really stressful job and students arent shown how to deal with it. You need to talk to a councillor, therapist, parent, doctor, advisor or close friend or somebody and maybe get some help putting things back in perspective. Maybe medicine to help if you get panic attacks and there are lots of other strategies too, but keeping it bottled up allows it to grow.\n\nI think the anxiety / stress is your biggest problem right away, you need to be able to think clearly and not be scared of the future to plan your work and your life. There are lots of people who can help but you have to tell someone who will help you do something about it.", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp5d399/"}, "216": {"Subreddit": "PhD", "Author": "monmostly", "Date": 1509476889, "Score": 2, "Body": "I hardly visited my school at all during the exams and dissertation phase of my PhD. I have a full-time job. So I work on my PhD at home before and after work and on weekends. I have no guilt about this, but I do sometimes take days off from work to focus on my PhD all day (which may or may not involved pajamas and an afternoon nap). I sometimes feel guilty about that, but my job is flexible and my coworkers are supportive. As long as my projects get done, they want me to get me degree. I still feel a little guilty, but I try to be very transparent with them and demonstrate responsiveness to them even when I'm at home working on my dissertation. So far, it has been working. As for my PhD advisors, they don't care at all when it how I work as long as I send them chapters on deadline. \n\nGood luck in your dissertation! Remember you're doing a great job!", "Permalink": "https://www.reddit.com/r/PhD/comments/79twa1/does_anyone_else_feel_guilty_about_working_on/dp5m1hc/"}, "217": {"Subreddit": "PhD", "Author": "Becca-Reyna", "Date": 1509484900, "Score": 2, "Body": "I'm at about the same stage as you and have been feeling the same on and off for a while. I think second year is the toughest; for some people, the PhD is starting to take shape, and for others it's still a mystery.\n\nMine's still a mystery. I have no idea how it's going to shape up, and I am quite convinced I'm going to have to go into an (unpaid) 4th year. But I basically decided that I might as well finish and submit something, even if it just gets me another MPhil. \n\nI recently gave up on the chapter I'd been stuck on for 6 months and started another one which involved reading outside my comfort zone and it really helped. If that's possible for you, then I'd recommend it.\n\nBut just to say you're not alone; loads of my friends have gone through the same thing in second year. At the end of the day, its up to you, and if Academia isn't what you want to do then there giving up may be the best thing for your health.\n\nWishing you all the best with your PhD. :)", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp5tub2/"}, "218": {"Subreddit": "PhD", "Author": "AstraGlacialia", "Date": 1509490372, "Score": 1, "Body": "If you are receiving funding which you won't need to return if you quit, don't quit in a rush - while still getting paid, \"steal\" what time you can to assess your skills and options (and think of less self-negative ways to explain why you want to quit), perhaps even work on improving/ acquiring some skills, and when you figure it out, start applying for jobs (in some cases you may not even need to quit until you get a job). It may not be fair towards your supervisors that you aren't putting 100% waking time and effort towards PhD, but it's very common, and fine as long as you get enough done to not harm them, and putting 100% waking time and effort into one thing, especially one you aren't enjoying, is unhealthy anyway. And you are probably putting about the same time and energy into miserable thoughts anyway, so doing something else prospectively productive to find hope may even make you more productive at your PhD.", "Permalink": "https://www.reddit.com/r/PhD/comments/79w18z/too_scared_to_quit_but_miserable_to_continue/dp5yky4/"}}