{"0": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1446403416", "Score": 1, "Body": "oh wow does it really work?! :D", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "1": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": "1446411240", "Score": 1, "Body": "I've had alot of results from it, I also have a relatively large number of followers who are in academia fields as well, so that is an added boost.\n\nAlso, researchgate. Do any of you use that? I've found it helpful to directly ask the author and/or coauthor on researchgate for permission of the paper if they have it listed(theres a request button, so its already all set up). This has got me papers several times.\n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3qepl1.json"}, "2": {"Subreddit": "PhD", "Author": "pikus_gracilens", "Date": "1446412578", "Score": 1, "Body": "I had an \"expert\" committee member tell me to \"start from scratch\" on my thesis. I said fuck that and instead worked on a manuscript which got accepted into a top tier journal in my field.\n\nIn short, verdicts of thesis committee experts can be hella subjective, I wouldn't attach too much value to them. Committee members feel obligated to comment and change shit so they don't feel passive and ignored. \n\nSeems like you got the important parts right, they just want you to \"reframe\" it which in BS in my opinion. Congrats on a great thesis!\n", "Permalink": "https://www.reddit.com/by_id/t3_3r3wra.json"}, "3": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1446415614", "Score": 1, "Body": "Thanks u/pikus_gracilens . am not sure I completely agree with the great thesis description, but I do feel I just have to bite the bullet and do the changes. Its hard to feel motivated or confident about it at the moment which is the hard part, as i would have preferred the award of the docorate with major revisions. Sadly, my thesis content - specifically the theoretical framework - had already been accepted by two peer reviewed journals and I had another paper accepted on a similar topic that was co-authored, but this stood for nothing it seemed. Hopefully I can muster up the motivation and get back my confidence, and things will look brighter in a week or so. ", "Permalink": "https://www.reddit.com/by_id/t3_3r3wra.json"}, "4": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": "1446417635", "Score": 1, "Body": "I had a disaster scale viva and was passed, but really should have been a resubmit. I feel they may have felt sorry for me given how ill I was at the time. \n\nThere were a lot of corrections, most of them entirely needed and some of them were clearly preference of style from the examiners. \n\nI was the same as you after the ordeal. Dejected and mildly depressed. Take a week and don't think about it. Relax and make aplan of action. Treat it like a rewrite, the difference is the giant's share is done. \n\nMost importantly, don't let the bastards grind you down. Talk to your supervisor and get their thoughts then make a plan. You can do this and don't let anyone tell you that you cant. \n\nGood luck amigo :)", "Permalink": "https://www.reddit.com/by_id/t3_3r3wra.json"}, "5": {"Subreddit": "PhD", "Author": "idealgrind", "Date": "1446429538", "Score": 1, "Body": "Pretty sure here (in Australia) it's only one chance and if it still doesn't meet the requirements for a PhD, then you may just be awarded an MPhil (masters by research) instead.", "Permalink": "https://www.reddit.com/by_id/t3_3r5h0w.json"}, "6": {"Subreddit": "PhD", "Author": "jelly_quiche", "Date": "1446490217", "Score": 1, "Body": "Take time off. If you already feel uncertain about whether this is what you want and feel a lack of motivation for your project I highly doubt this will improve. In fact, most people go in the opposite direction (starting out with enthusiasm and certainty and ending up miserable, uninspired, and uncertain). Just my two cents as someone who's four and half years in and still kind of wishing I had quit a long time ago even though I'm almost done. It doesn't help that many of my peers aren't getting jobs anyways...  ", "Permalink": "https://www.reddit.com/by_id/t3_3mbgep.json"}, "7": {"Subreddit": "PhD", "Author": "Littlemousy", "Date": "1446533637", "Score": 3, "Body": "Not my field, but I have a friend who studied something similar to what you did. She now works for EDF (electricity utility company) calculating predictions of the supply demand. She likes it, it's quite well paid (though I don't know exactly how much), and they will always need someone like her. Just an idea, hope that helps! ", "Permalink": "https://www.reddit.com/by_id/t3_3ragmo.json"}, "8": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1446586020", "Score": 1, "Body": "Here in the UK, you get one resubmission. The thesis may need to be examined again. The outcome of this may be major/minor corrections, or of course fail. Usually you have quite good contact with your examiners (at least I am hoping as I got that verdict just last Friday) as well as your supervisor, and the resubmission should go well. ", "Permalink": "https://www.reddit.com/by_id/t3_3r5h0w.json"}, "9": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1446586175", "Score": 1, "Body": "Thanks u/ApacheFlame I will try and keep my chin up and as you say just get on with the corrections. Hopefully won't be too draining, but it just feels at this stage like I have to write a whole new thesis, after just writing one! At least this one is half as long, so that helps!", "Permalink": "https://www.reddit.com/by_id/t3_3r3wra.json"}, "10": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1446595602", "Score": 2, "Body": "You shouldn't ever let a mental illness hold you back from achieving what you want in life. Yes, it may mean you are tested more than others, but that is not a reason to not try in the first place. \n\nI have bi polar disorder, and spent a few years languishing in life, attempting to get to grips with both the diagnosis in my early twenties. I then decided, with help from family and friends, that I wasn't going to let a perceived 'illness' stop me from achieving something that I would be proud of. \n\nI am now in the final throws of my PhD. I suffered a massive setback in my Viva, just Friday gone, receiving a revise and resubmit verdict that i was not expecting or planning for. I was really scared at first that this had meant I had failed. I sent a day or two wondering whether my illness may have been a cause for this or at least linked to it, and even thought that the verdict might send me in to a downward spiral of depression. After much thought, I realised i was not going to let that happen.\n\nMy illness hadn't held me back this far, and I won't let it hold me back in the future. \n\nYes, it is something that I have to manage. Yes, it is something that I have to keep aware of and be in control of with help from family, friends and the support systems put in place (universities have very good disability services), but it is not going to be a reason for me to not achieve what I think I am capable of achieving. This should be the same for you. ", "Permalink": "https://www.reddit.com/by_id/t3_3r8wzm.json"}, "11": {"Subreddit": "PhD", "Author": "victor_knight", "Date": "1446715379", "Score": 0, "Body": "Let's put it this way... you are unlikely to remain her priority for long. And understandably so, don't you think?", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "12": {"Subreddit": "PhD", "Author": "Beammeupsnotty", "Date": "1446740265", "Score": 3, "Body": "&gt;eventually come back and be a lecturer\n\nIt's extremely hard to get university work in the current climate. Perhaps it will be different in years when you have your degree but as it stands I don't envy anyone trying to get work as a lecturer.\n\n\n&gt;typical thesis\n\nWhy not read one on [EthOs](http://ethos.bl.uk/Home.do;jsessionid=6CF2651FED79296132FAE8E809DD8B28)\n\n\n&gt;I've also never really been huge into writing shit\n\nThis will be a problem. A lot of writing is required. Perhaps 80,000 words depending on uni and specialty.\n\n\nSorry to be negative!", "Permalink": "https://www.reddit.com/by_id/t3_3rm51t.json"}, "13": {"Subreddit": "PhD", "Author": "esshall", "Date": "1446743173", "Score": 1, "Body": "Neither of us have made each other priority #1, because we both understand the importance of school and work. I would never expect her to put me ahead of her education and career path, and I wouldn't want her to. \nI was just asking how much time I may or may not lose with her. I think it's likely different for everyone, but I'm glad I got some feedback here. We'll just have to see what happens. (Btw, I am thrilled she's doing what she's doing. I couldn't be more proud/excited for her)", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "14": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1446770720", "Score": 1, "Body": "You wouldn't really have to do research independently.  You would probably join an econ professor's existing research group, and you would have a moderate amount of independence.  Usually you would publish a few articles in journals throughout the years, and your thesis is really just those articles stitched together into a book.  So it isn't so hard because it is done over a long period of time.  Classes in grad school are similarly complex and difficult, but you have less classes per semester so it isn't so bad.  You may be able to do undergrad research at your university to see what it is like and it looks good on a resume'.", "Permalink": "https://www.reddit.com/by_id/t3_3rm51t.json"}, "15": {"Subreddit": "PhD", "Author": "SnakeFarmer", "Date": "1446812393", "Score": 1, "Body": "Working on a dissertation is not easy. Hardest part is finding a topic.  ", "Permalink": "https://www.reddit.com/by_id/t3_3rm51t.json"}, "16": {"Subreddit": "PhD", "Author": "KittenInPink", "Date": "1446950895", "Score": 1, "Body": "I am Computer Science PhD student in my first year. We have six weeks holidays as PhD students. And I think my holidays will actually add up to 6 weeks. I visited my parents twice for a week each. I will fly home over Christmas for a week. Otherwise I spent a week in the Netherlands with my partner and we did some short trips over extended weekends here and there. And I don't feel bad about it. My supervisors don't care either. I think it is a very individual decision on how much holidays one needs. I experienced that I get really unproductive and shift towards depression if I don't take some time of regularly. ", "Permalink": "https://www.reddit.com/by_id/t3_3q9fe8.json"}, "17": {"Subreddit": "PhD", "Author": "sadmoody", "Date": "1447035972", "Score": 3, "Body": "I have a whole program to write before a meeting at 2pm tomorrow. It's currently 3:25pm. I've done none of it just because the prospect of it is too daunting. I hope to be super productive tomorrow.", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "18": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1447036293", "Score": 2, "Body": "good luck, may the force be with you!", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "19": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": "1447086342", "Score": 1, "Body": "Yes, I guess we all do. After my BA I said it will all change and I'll stop procrastinating. Same story after my MA, and now again during my PhD. Oh, well. Of course I could just never go on reddit again, but... that's hard.", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "20": {"Subreddit": "PhD", "Author": "a5ph", "Date": "1447096824", "Score": 3, "Body": "What do you mean 'whole program'? ", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "21": {"Subreddit": "PhD", "Author": "ProjectAmmeh", "Date": "1447106235", "Score": 0, "Body": "I've got a paper to write for Friday. I've been writing the odd word here and there today, but honestly I'm just staring at the Fallout 4 countdown and wishing it to go faster.\n\nI think everybody has days like that, I've found personally that sometimes it's better just to say \"fuck it\" and take a day. That way you can relax and not have the \"I'm supposed to be doing work\" sensation hanging over your head, and you're generally in a better mood for it later.", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "22": {"Subreddit": "PhD", "Author": "RevisedMonk", "Date": "1447116531", "Score": 1, "Body": "A lot of it depends on where you go for your PhD and in what subject. I decided to try for a top 5 school in my subject (science/engineering hybrid) and the workload is extreme for myself and everybody I know. I think pretty much everyone in our group works 60-80 hrs a week, and everyone feels behind still. I can point out several weeks this past spring where I worked 90-100 hrs a week. Obviously, with a schedule like this, there's no time to do anything else. You do get out what you put in though - I've grown more as a person and a professional in the past 3 years than I have at any point in my life, and that's saying a lot since people don't expect to change much after they hit 25-ish.", "Permalink": "https://www.reddit.com/by_id/t3_3p6a7o.json"}, "23": {"Subreddit": "PhD", "Author": "pisses_on_kittens2", "Date": "1447119734", "Score": 0, "Body": "Fuck no, that would give me an anxiety attack.  Get it done. ", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "24": {"Subreddit": "PhD", "Author": "edubya15", "Date": "1447120075", "Score": 2, "Body": "must.. resist... pre-order... no.. time!", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "25": {"Subreddit": "PhD", "Author": "Leelum", "Date": "1447164683", "Score": 1, "Body": "You speak words from my mouth brother, (or sister).", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "26": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": "1447176254", "Score": 1, "Body": "Sister. Though I'm fairly certain this is a gender-neutral problem.", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "27": {"Subreddit": "PhD", "Author": "mck87", "Date": "1447407894", "Score": 2, "Body": "So I think that there are a few key questions you want to address in your statement.  \nFirst, why do you want to do your phd? It sounds obvious, but I think it's important to make it clear what led you to decide to pursue a doctoral degree. For example, I talked about my master's research/work in public health and how I finished with unanswered questions that I wanted to address with my doctoral research. (This also allowed me to emphasize my previous experience without making it so obvious)... But you could also describe a personal/work experience that led you to your decision ( as long as it's not too cheesy).  With that said, even if you don't know know for sure exactly what you want to research for your PhD,  make it seem like you have a clear plan- the more specific the better. This is also a good way to link to why you chose to apply to that  specific program/ work with potential supervisor(s) with expertise in your area of interest, and how you think the training you'll receive will best prepare you to fulfill your long -term career goal. \n\n That's all I can think of for now, but let me know if I can give any more tips! Good luck!", "Permalink": "https://www.reddit.com/by_id/t3_3ri778.json"}, "28": {"Subreddit": "PhD", "Author": "tiny_cheese_merchant", "Date": "1447522049", "Score": 6, "Body": "Yep,I can definitely feel what is being said in that article. Not being able to bring up depression and anxiety with my supervisor is another cause of anxiety for me. As I want to pursue a career in academia post PhD (7 months away) being open about depression,etc can easily be seen as a reason not to be hired", "Permalink": "https://www.reddit.com/by_id/t3_3ss1r4.json"}, "29": {"Subreddit": "PhD", "Author": "Vailhem", "Date": "1447528292", "Score": 2, "Body": "not related to the article but more so your post, check out [these](http://www.one-tab.com/page/ZvTliDNIQ3i7j0X_wAhseQ)", "Permalink": "https://www.reddit.com/by_id/t3_3ss1r4.json"}, "30": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": "1447674338", "Score": 3, "Body": "This is a tough one since I don't truly know your state of mind. First off, there is going to be bureaucracy no matter where you work. Learning to navigate the nuances of politics in your program will help tremendously.  The same as true in a research lab or a corporate setting. \n\nMoney-wise we would need to know more information. Are you living alone or with roommates? Do you not have a stipend even though you are funded?\n\nAs for your girlfriend, long distance sucks. I did it during my two years for my masters. I was surprised to hear that you followed your advisor, that seems to be an exception to the norm. I couldn't figure out the timing between your GF moving to the west coast and your advisor leaving, but that might have been the correct time to transfer schools closer to your GF.\n\nAt the end of the day, I would do an informal SWOT analysis of what you want today, what you want in five years, and what you want in ten years. That should give you an idea of where you stand and allow you to create a general path to follow. Then all you have to do is execute. ", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "31": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": "1447683191", "Score": 3, "Body": "Do you have a back up plan? Have you discussed any of this with your advisor? Perhaps you could take some time off and think things through, I don't know where you are but here in Australia you can take leave for up to 6 months. If you are really unhappy I'd say the effort is not worth it, but you need to plan your way out because quitting without a safety net will make you just as miserable. You could start looking for a job closer to your girlfriend if you wanted to, and maybe go part-time if that's a possibility. I know how bad long distance sucks, you should decide where your relationship stands in your priorities list: are you planning to marry the girl, do you see yourself starting a family, you need to ask yourself this questions.\n\nSorry I can't give you an answer, but think about the things I've said :) and best of luck with whatever you decide ", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "32": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": "1447684065", "Score": 1, "Body": "Having worked for five years prior to coming back to school, I learned how to deal with corporate politics; academia seems a different beast to me. \n\nI'm currently living in a 2/1 with two others (3 of us total) with a stipend that doesn't even cover living expenses. It's more than the stipend that I got at my previous school, but due to state and local taxes, and cost of living being roughly double (and rent alone, triple) where I was living before, it's not actually enough to live on.\n\nI didn't realize following your advisor was weird, as when the exodus happened from my old program, all but one of the PhD students followed their advisors. \n\nI've also added some of this info to the original post in case other people want to know about it. Thanks for replying!", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "33": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": "1447684725", "Score": 1, "Body": "My back up  plan would be moving to where my gf currently is and getting a job out there in either the old field that I used to work in (biochemistry) or the field that I had done my BA in (computer science). I've looked at openings for adjunct professors and tutoring jobs as well. \n\nAccording to the handbook, non-medical, non-military leave can be taken for up to two semesters. I've thought  about this option, but if I read right, there are still a number of fees that I would have to pay to effectively \"keep my file open.\"", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "34": {"Subreddit": "PhD", "Author": "jorgewisconsin", "Date": "1447685955", "Score": 2, "Body": "The main reason I wouldn't want to follow my advisor is because of the exact problem you ran into with credits failing to transfer. This would be the biggest deterrent for me simply because that means all that time and work I put into my classes was 100% wasted. Nearly every PhD program suggests front-loading your classes and getting them finished before diving fully into your research topic. It doesn't sound like you have started work on your thesis yet (writing, data collecting, etc.) so I don't understand completely why you would follow your advisor.\n\nI understand that a mass exodus of faculty would cause problems in finding a new advisor, but I doubt the entire department was shut down in one semester (barring some truly apocalyptic problems) and I doubt they are not actively searching for new faculty (which you could've benefited from because the administration would most likely try to hire a professor in your area to keep you around, especially if there was a mass exodus of students as well). These are just my thoughts because ....\n\n\n... you have already made your choice and moved schools with your advisor. So what do you do now? If I were you, I would take some time off from school. If you were really serious about your GF, move out to the west coast with her and focus on your life together. I know you don't want to be a practicing clinician, but have you actually worked in that field? It wasn't clear if your 5 years was in an unrelated industry or not. I have heard that speech pathology is in need of practitioners, especially in early childhood and special needs.\n\nThere is a sweet spot to deciding whether to leave the program or not. If you asked me a year or two ago (right after finishing all my classes) what I would do if my advisor left, I would probably say \"screw it\" and leave the program to find a job. But now that I am nearly done with writing my dissertation, if my advisor left, I would probably say \"screw him\" and find a new chair for my committee.\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "35": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": "1447686007", "Score": 2, "Body": "Go to student services or whatever it's called in your uni and find out, my administrative fee is only $143 per semester.\n\nRegarding the rest, it seems you've done your research already so it's not  something that just crossed your mind. Maybe you can start looking for a job now and see what happens. \n\nIn my case I left the industry because in spite of making money it wasn't enough for me. I thought to go back to uni and do research for the wrong reasons (I was doing some soul searching). Turns out I like doing research but I also like teaching, probably even more that research itself. If I can't/decide I don't want to go into academia after my phd I'm thinking about getting a teaching diploma or try to get into the teach in Australia program. Maybe you need to think about what you where looking for when you first started your phd and what you want know, it's ok to want something different after all four years is a long time and lots of things happen.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "36": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": "1447696074", "Score": 2, "Body": "&gt;I understand that a mass exodus of faculty would cause problems in finding a new advisor, but I doubt the entire department was shut down in one semester (barring some truly apocalyptic problems)\n\nThe reason I ended up following my advisor was that the PhD program was pretty much crippled. They moved our department from one college to another within the university (college of liberal arts to college of health) and that college cut almost all financial support for the department. All told, the department lost 6-8 PhD level tenure-track professors in about 2 years and had only hired one new full time professor back, who was not in my area of study. They have replaced several of the teaching positions with clinical faculty to continue the masters program, but it has basically shut down the PhD. Since my departure, the program has not admitted a single new PhD student, so staying wasn't an option.\n\n&gt;It wasn't clear if your 5 years was in an unrelated industry or not. I have heard that speech pathology is in need of practitioners, especially in early childhood and special needs.\n\nMy 5 years of work prior to coming back were in biochemistry, not speech pathology, so the two don't have a ton of overlap. My specialty is not working with kids, it's working with adults with traumatic brain injury and stroke, so I don't have the training for working with kids. And based on my experience during the masters program, I confirmed what I knew going in -- that I did not want to be a full-time clinician. ", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "37": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": "1447696399", "Score": 2, "Body": "&gt;In my case I left the industry because in spite of making money it wasn't enough for me. I thought to go back to uni and do research for the wrong reasons (I was doing some soul searching). Turns out I like doing research but I also like teaching, probably even more that research itself. \n\nAre you me? This was my case as well. I've always enjoyed teaching. When I was 18-19, my high school hired me to help teach summer biology labs while I was home from college. I also frequently tutored throughout undergrad and have taught undergrad neurology and a neuroscience lab as part of my PhD program. I enjoy research, but I do really enjoy teaching more, I think.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "38": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": "1447728003", "Score": 2, "Body": "haha I only discovered I liked teaching this year when my supervisor put me in charge of workshops and lab sessions. I also ended up covering a few of his lectures and had to supervise undergraduates theses. I thought he had made the biggest mistake ever, but it turned out I'm pretty good at teaching, at least that's the feedback I got from students. And I really enjoy it too. \n\nMy husband and I faced the same thing when we were dating, after we finished uni our jobs took us to different parts of the country for almost 2 years. It was probably the toughest thing we had to face in our relationship. After the first year living apart we started looking for jobs that would take us to the same city, and almost a year after that my husband got a job in the city I was living. It was probably the best decision we ever made, we wouldn't have made it through much longer living apart and we are really happy now. It sounds like you have experience in different fields, so it wouldn't be that hard to get a job (our degree is very specific so there's only certain jobs we can do). If I were you I'd take some time off to figure things out. Go and stay with your GF and see how you feel.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "39": {"Subreddit": "PhD", "Author": "DoctorNoPants_PhD", "Date": "1447733642", "Score": 2, "Body": "Thanks for your advice. I really appreciate it. And I'm glad you two were able to work things out and be together. It's certainly not been fun for us to be apart, either.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "40": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1448022107", "Score": 3, "Body": "Digital humanities?? I am ignorant of this...please elaborate.", "Permalink": "https://www.reddit.com/by_id/t3_3tgd4u.json"}, "41": {"Subreddit": "PhD", "Author": "Phdigitalhumanities", "Date": "1448029068", "Score": 1, "Body": "How humanities fields can use computers.", "Permalink": "https://www.reddit.com/by_id/t3_3tgd4u.json"}, "42": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1448032983", "Score": 2, "Body": "That's quite broad!!", "Permalink": "https://www.reddit.com/by_id/t3_3tgd4u.json"}, "43": {"Subreddit": "PhD", "Author": "folame", "Date": "1448057901", "Score": 2, "Body": "Hello.\nHere are a few questions you need to answer (not necessarily to me, but for yourself):\n\n1. If you separate your advisor from the workload/demands, how would you describe your interaction with him/her. Every advisor has his/her issues (this is a FACT that any PhD student/holder will tell you), what are his/hers?\n\n2. Deducing from one, can you see yourself working under this person for 5-6 more years?\n\n3. Do you have a Master's degree? Is this from a US university or from your home country?\n\n4. Why did you go into training for a doctoral degree in the first place? &lt;- You need to have a well outlined answer for this question, which i'd recommend you write down and frame somewhere (physically). You will revisit this very question SEVERAL times should you continue.\n\nYour answers, particularly #4, will guide you on what to do next. Should you decide to change labs, you should first speak with your advisor about what you are experiencing, seek his/her 'advise', and, should you decide that the conditions can not continue, see if he/she can help you with transitioning to a different lab. \n\nIf your advisor is uncooperative, then arrange to speak with the graduate advisor. During this time you should also be actively researching other similar labs within your department. If you are a minority, seek help from diversity programs or faculty who is charged with such.\n\nChanging labs can be very difficult especially if your advisor has been funding you, and are unwilling or unsympathetic to your situation. The alternative for you would be to seek admission at a different university. This will affect your student status. I am not sure what the legal ramifications are but it is likely you will have to go back to your home country and reapply for a new F1 visa. I AM NOT SURE ABOUT THAT LAST PART, SO DON'T QUOTE ME ON IT!.\n\nIf you have additional, more specific questions, you can message me directly.\n\nGood luck.\n\nFYI: your situation is not uncommon.", "Permalink": "https://www.reddit.com/by_id/t3_3tm0o2.json"}, "44": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": "1448102572", "Score": 3, "Body": "Is it really not uncommon to be worked for 8 years like a slave? That sounds like poor supervision to me. If you're a young lawyer trying to make it in a top-tier law firm, well, fine; but as a student that strikes me as over the top. To me it sounds like a prestigious university and supervisor exploiting their grad students. Is having a PhD really worth that?", "Permalink": "https://www.reddit.com/by_id/t3_3tm0o2.json"}, "45": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1448114806", "Score": 3, "Body": "It's not all horror stories. I defended my dissertation for my PhD in physical chemistry last year. I worked 20-30 hours a week (closer to 20 if I'm being honest haha), published numerous times including as a first author in JACS (top chemistry journal in the world) and it took me 4.5 years start to finish.\n\nMy research adviser tried to get me to work more hours a couple times, but 20 hours was in the contract, he had no leverage, and I simply told him as much and reminded him of all the papers we were coming out with. They certainly weren't paying me enough for 40 hours per week of labor I'll tell you that.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "46": {"Subreddit": "PhD", "Author": "speedz1", "Date": "1448127995", "Score": 1, "Body": "Here in south africa, its all up to you to start and complete your phd. Our exam process is different too, we submit a proposal of our intended topic and get an approval/disapproval from a comitee. The theses is then submitted to 2 national and 1 international examiners for marking. Well this is for a social science phd", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "47": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1448128151", "Score": 1, "Body": "wow you must be super effective at work. I am aware of how hard it is to publish in JACS (congrats! :)) What do you do now?", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "48": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1448128219", "Score": 1, "Body": "Oh BTW. I'm in physics. I work like a dog. 7 days a week almost every other week and 12-13 hr work days. ", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "49": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1448128335", "Score": 1, "Body": "Now I am applying for post docs, I wrote a proposal and a professor is sponsoring me in my search for funding. Don't wanna name drop but he's a big shot haha.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "50": {"Subreddit": "PhD", "Author": "folame", "Date": "1448133558", "Score": 2, "Body": "I said it wasn't uncommon. What I didn't say, or comment about, was whether or not it was right, good or bad supervision, or whether or not it is worth the effort.\n\nI would say it depends. If you want to go into a pure research career, the time to doctorate is immaterial. What matters is how much knowledge you have and your ability to conduct important research independently. After a PhD, you likely will end up as a postdoc or junior researcher where you will still be working under supervision (albeit less rigid and slightly higher compensation).\n\nThink of a doctorate as an apprenticeship. The problem here is the one to one or a handful of apprentices has become one to many. So the close friction required for transfer of deep knowledge is watered down and takes a longer and more painful amount of time to occur. \n\nThese are just my personal thoughts on the matter. ", "Permalink": "https://www.reddit.com/by_id/t3_3tm0o2.json"}, "51": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1448139535", "Score": 1, "Body": "All the best! I'm just starting :D", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "52": {"Subreddit": "PhD", "Author": "Dixzon", "Date": "1448141987", "Score": 1, "Body": "I went theoretical, so that may have something to do with the easier time that I had, I take it you are experimental with that workload.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "53": {"Subreddit": "PhD", "Author": "mr_hunting", "Date": "1448182883", "Score": 1, "Body": "Yes I am. ", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "54": {"Subreddit": "PhD", "Author": "biocomputer", "Date": "1448184626", "Score": 1, "Body": "Most reddit users are from the US so most posts on many subs will be from Americans. Also everyone's grad school experience is different, I think it depends much more on things like how good your supervisor is than what country you're in.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "55": {"Subreddit": "PhD", "Author": "Scientist_girl_", "Date": "1448250733", "Score": 2, "Body": "PhD student from Australia here. I work 8-5 Mon to Fri, I don't work outside those hours except when I have a deadline coming or have to prepare a special class or something out of the ordinary. Other than that, I'm married, I go out with friends, I have my own life during weekends and go on holidays too (we can take up to 4 weeks/year + christmas break). Everyone I know here is like that, and they still graduate and publish journal papers. It's the same for the academics too. \n\nI always think the same as you when I read those horror stories, my case is completely different. I'm a very happy PhD student, I love my department and get on really well with lecturers and supervisors, I wouldn't change at all where I am now.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "56": {"Subreddit": "PhD", "Author": "FreepostPlus", "Date": "1448282266", "Score": 2, "Body": "That's perfect. I'm working on building an outline now. What you said will fit perfectly into what I have, so thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_3ri778.json"}, "57": {"Subreddit": "PhD", "Author": "RoboticElfJedi", "Date": "1448328202", "Score": 2, "Body": "I'm glad you posted this because I've been wondering the same thing. I'm just starting a PhD in Australia as a 40-year-old. I'm excited and really looking forward do it. Mostly because I have great supervisors and an interesting project lined up, but also because the lifestyle will be pretty cruisy and flexible which is exactly what I want at this point in life. I've worked crazy, stressful jobs plenty in my career; and I have also managed my own business and kept a sane lifestyle. The PhD here will certainly be more like the latter.\n\nAs I anticipate it, my PhD will have:\n\n- Regular supervision (weekly at least)\n- Mutually agreed milestones\n- Pressure to publish something along the way\n- Regular opportunities to present on the status of my work to my peers\n- Regular colloquia and meetings at the research centre I'm in\n- Enough pocket money to pay the rent\n\nWhat it won't have:\n\n- Anyone caring what time I arrive or how long I spend in the office (and on which days)\n- Anyone minding what direction I take things\n- A supervisor yelling at me or breathing down my neck too hard when I have a slow week/month [year]\n\nMy wife also did a PhD (hers in the social sciences, mine in the hard sciences) and she was totally self-directed as well, so I have a good idea about how it can go.\n\nThe US PhDs often sound like being a first-year lawyer at a big law firm or something. I don't think at 40 I would make the same decision in the US context.\n", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "58": {"Subreddit": "PhD", "Author": "Beammeupsnotty", "Date": "1448351699", "Score": 1, "Body": "The actual solution is to get some experience, not \"a unique positioning of skills\". \n\n\nJust because someone has a PhD doesn't mean they should be parachuted into their ideal job without having to demonstrate their capacity to be effective in an office environment.\n\n\nJust my tuppence.", "Permalink": "https://www.reddit.com/by_id/t3_3tz532.json"}, "59": {"Subreddit": "PhD", "Author": "Beammeupsnotty", "Date": "1448363199", "Score": 3, "Body": "My PhD is part-time and I have a full-time job to pay the bills, so I work *every* weekend. \n\n\nWho needs hobbies or a social life ^weeps ^quietly", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "60": {"Subreddit": "PhD", "Author": "Beammeupsnotty", "Date": "1448365807", "Score": 1, "Body": "How are the revisions going?", "Permalink": "https://www.reddit.com/by_id/t3_3r8wzm.json"}, "61": {"Subreddit": "PhD", "Author": "chef_baboon", "Date": "1448394605", "Score": 1, "Body": "I'm having a similar experience as you in Denmark. The pay is decent, work hours are reasonable, holiday time is generous, etc. We would get quite some months parental leave when having a child too. From my observations, US labs work like crazy, but just follow the rankings, grant money and fame. I think it's the epitome of the American dream actually. Work very hard and achieve something great m", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "62": {"Subreddit": "PhD", "Author": "abloblololo", "Date": "1448396915", "Score": 2, "Body": "The way you describe your situation makes it sound miserable. I'm surprised you seem to be coping with it this well. What are your aspirations after you potentially finish your PhD? You said you've become disillusioned with academia, so presumably you'll go back to industry. Would completing your PhD boost your career opportunities a lot?\n\nIf I were you, which I'm not, I'd at least look for jobs in your GF's city and see what you could potentially get. You only get one life and while it's good to have goals you have to spend some of that life enjoying it. I guess it depends on how serious you two are, but if you're holding it together with a LDR then you're probably quite committed.", "Permalink": "https://www.reddit.com/by_id/t3_3syil2.json"}, "63": {"Subreddit": "PhD", "Author": "midipoet", "Date": "1448402006", "Score": 1, "Body": "To be honest I haven't even started. I digested the recommendations that I received from the examiners. They were quite different and so I am happy I have the joint recommendations to work from. I am working at the moment and need to for money. Hopefully in a week or two I can start in on them in earnest. Frustrating, but doable!!", "Permalink": "https://www.reddit.com/by_id/t3_3r8wzm.json"}, "64": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": "1448665247", "Score": 1, "Body": "First of all - congratulations. Did you have to do a viva?\nWhat sort of places do you want to be known as Dr FM25?\nA bank is a good one, you can write to them and take the letter to your branch. I'm guessing work already know, so time for new business cards.", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "65": {"Subreddit": "PhD", "Author": "sadmoody", "Date": "1448667480", "Score": 3, "Body": "EVERYWHERE", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "66": {"Subreddit": "PhD", "Author": "familyman25", "Date": "1448674791", "Score": 2, "Body": "I keep seeing that, though I don't quite know why.  Should an in flight emergency occur, I can simply tell them about the designation.", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "67": {"Subreddit": "PhD", "Author": "familyman25", "Date": "1448675058", "Score": 1, "Body": "Viva accomplished, graduation was recent as well. \"Viva la vida\" and such :)\n\nBusiness cards yes I assumed, the bank will not change things until I provide \"substantiating documentation,\" I am attempting to discover what they are looking to receive. \n\nI'm not looking to flaunt of course, but I am curious about where people have changed this in their experience. \n\nThanks!\n", "Permalink": "https://www.reddit.com/by_id/t3_3uib05.json"}, "68": {"Subreddit": "PhD", "Author": "familyman25", "Date": "1448675161", "Score": 1, "Body": "Yes frequently. Postdoc (should you go down that road) is worse... Sigh.", "Permalink": "https://www.reddit.com/by_id/t3_3s2yd5.json"}, "69": {"Subreddit": "PhD", "Author": "mck87", "Date": "1448690915", "Score": 1, "Body": "No prob! Happy to help. ", "Permalink": "https://www.reddit.com/by_id/t3_3ri778.json"}, "70": {"Subreddit": "PhD", "Author": "im_in_the_pants", "Date": "1448732380", "Score": 1, "Body": "He's such a dick. My first job offer was for an academic project and i luckily refused since the day before a friend of mine who worked with this professor told me that he did the same thing that happened to you. Some people are just parasites ", "Permalink": "https://www.reddit.com/by_id/t3_3ujuaj.json"}, "71": {"Subreddit": "PhD", "Author": "calikilla", "Date": "1448733921", "Score": 1, "Body": "Do you have any proof that you created it before him that could challenge it? Like did you use a Google Drive system which could outline the progress? Do you have previous drafts? Do you have the email you sent him with your work? Do you have ANY emails with your work in it? I know personally I send out drafts of my work to friends and family before submitting it anywhere. If you have timestamped proof that would be huge.\n\nIf you have a way to prove that he plagiarized the work then just go to whatever type of system your school has for dealing with cases like this or go to the organization itself and present it to them.\n\nFrom the look of it, you might need these things prepared anyway. He might try to accuse you of plagiarism and prevent you from graduating. I'm sorry man, that sounds like a terrible situation to be in, I hope you find some recourse.", "Permalink": "https://www.reddit.com/by_id/t3_3ujuaj.json"}, "72": {"Subreddit": "PhD", "Author": "igryski", "Date": "1448754002", "Score": 1, "Body": "PhD student from the Netherlands here. Contract is typically 38hrs per week, for 4 years. Most dutch students finish within 4.5 years, while foreigners (like me) take it to 5 or more. The salary is 2x less than en engineer with an MSc in any company would get, but yeah flexible working hours. I am at 4.5 yrs into my PhD now, thesis writing phase. With no pay after 4yrs you have to work for free until the defense.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "73": {"Subreddit": "PhD", "Author": "rajpectiliace", "Date": "1448773583", "Score": 1, "Body": "Hi, thank you very much for taking your time out and helping me. I really appreciate it.\nTo answer your question, yes I do have the evidence such as the multiple draft copies of the proposal that I sent to my advisor via the university official email along with time when I sent those documents. Fortunately, I already graduated with PhD this August, so I am hoping my advisor isn't going to cause much trouble in long run, even if I bring this matter up to the concerned authorities.\nI was really wondering what would be my options to take this matter forward as I am already out of the school and working full time. Should I directly contact to the department head and the university or to the NSF? \nThank you, any help will be greatly appreciated! ", "Permalink": "https://www.reddit.com/by_id/t3_3ujuaj.json"}, "74": {"Subreddit": "PhD", "Author": "jethroguardian", "Date": "1448810532", "Score": 5, "Body": "I've never heard of a grad student paying out of state tuition. Seems crazy. I'd ask around the school and other departments to see if that's common or not. There must be some way to get in-state tuition right away.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "75": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": "1448814352", "Score": 3, "Body": "My understanding of grad school was that an unfunded PhD is basically a polite \"no\" to the program and that pretty much all grad students would at least have their tuition covered by a scholarship or teaching/research assistant position. But maybe that's a Canada vs. USA difference. \n\nIs it possible that the funding structure basically only starts in the fall? In Canada pretty much every graduate program starts in September, so I can see funding being tied to that start date. \n\nMaybe ask the professor how you can keep in touch and learn more about working with him from now until the fall so you can build a relationship (and increase your likelihood of getting an assistantship). \n\n\n", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "76": {"Subreddit": "PhD", "Author": "Thought_exp3riment", "Date": "1448821461", "Score": 1, "Body": "I'm pretty sure that they would simply decline admissions instead of admitting a student without funding as a polite \"no\". Additionally, I believe that the funding structure starts in the fall, as a result I am in this predicament. I was in oil &amp; gas until I got let-go due to the current market and decided to leave the industry all together (and that is when I began to apply for the most immediate semester, which happened to be Spring). I suppose that the only remaining avenue to explore is to try to keep in touch with the professor through spring. Thanks I guess.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "77": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": "1448832788", "Score": 2, "Body": "Have you asked the potential advisor about alternate funding opportunities (maybe with other labs or campus centers)? It's a benefit to the faculty member for you to come to campus early, knock out several classes while they're not footing the bill, and have you ready to roll in the fall... so I don't see why they wouldn't be interested in connecting you to other funding sources on campus, if they're available.\n\n\nAs far as relocating your life, there's three things to consider: \n\n1) You're NEVER guaranteed to have funding without documentation. So, even if you do move, there's no way to say that you'll definitely be funded in the fall. Especially considering that if a faculty member already has students, then they're committed to funding current students first. \n\n2) On the flip side, moving would give you the opportunity to network with more than just the one professor. You might find a lab/faculty member that you like even more than this one. \n\n3) Lastly, can your partner find a comparable (if not better) job in the new location? And, how does the move affect your cost of living? My spouse and I had to have a MAJOR conversation about job prospects and finances when I was considering grad school in cities like SF and Boston. \n\n\nEither way (move or not), you can stay in touch with the advisor by sending them regular emails and/or asking how you might be able to prepare for their lab (take online courses, read relevant papers, watch some of their course videos if available, etc). You might ask if they've completed a recent literature review or have a research proposal you can read so you can get background information on their research area.\n\nMy personal preference? I would not move. But, I'm a pretty risk-adverse person, so my preference is always a cautious one. Instead, I'd investigate any online course options and inquire about the institution's acceptance of online credits in lieu of on-campus courses. That would keep me connected to the campus, move my degree forward, show the faculty member my commitment to this program, AND allow me to continue working at my current job-- essentially minimizing the risk of starting the graduate program. \n\nGood luck!!", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "78": {"Subreddit": "PhD", "Author": "DavidDPerlmutter", "Date": "1448848775", "Score": 7, "Body": "Hard to generalize but I will...\n\nNever, ever start a PhD program full time without being funded -- fully funded.\n\nNote that I said full-time. Some people continue their regular work and take courses towards a PhD.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "79": {"Subreddit": "PhD", "Author": "XenesisXenon", "Date": "1448850555", "Score": 1, "Body": "I had a pretty rough ride as a PhD in Australia, but that was partially because the project I undertook managed to be a horror and I'm really bad at managing my own stress.\n\nAfter an anxiety attack about 2 years in, forcing myself to work only weekdays and not more than ~40 hours per week did do wonders for not making it as horrible! The pay was decent (I managed to fund my half of a wedding, pay food/rent and get some savings on my stipend/topup), but it was certainly on the ickier end.\n\nOf course everything I hear is that's kinda the baseline for USA PhDs.", "Permalink": "https://www.reddit.com/by_id/t3_3tonbk.json"}, "80": {"Subreddit": "PhD", "Author": "XenesisXenon", "Date": "1448850713", "Score": 3, "Body": "That sounds obscene. I wouldn't even give them the time of day unless they came back to you with a realistic offer.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "81": {"Subreddit": "PhD", "Author": "Thought_exp3riment", "Date": "1448856398", "Score": 2, "Body": "Thank you for your help; you have listed some things that I need to think about. I will most likely postpone attendance until Fall 2016 with hopes that the funding structure works in my favor.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "82": {"Subreddit": "PhD", "Author": "Thought_exp3riment", "Date": "1448856604", "Score": 1, "Body": "Yeah the tuition waiver is supposed to help, if I can get a teaching assistantship for fall; unfortunately there werent any TA appointments available for spring (thus my predicament).", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "83": {"Subreddit": "PhD", "Author": "jethroguardian", "Date": "1448860333", "Score": 1, "Body": "Gotcha. Yea I'd defer and wait until you can get a GA or TA and the tuition waiver. They have no excuse not to give you one for the fall since now you should be first in line. If they don't in the fall, I'd find another program.", "Permalink": "https://www.reddit.com/by_id/t3_3uoffo.json"}, "84": {"Subreddit": "PhD", "Author": "microconfused", "Date": "1448905244", "Score": 1, "Body": "Thanks, I appreciate the time you took to reply comprehensively :)\n", "Permalink": "https://www.reddit.com/by_id/t3_3gcptr.json"}}