{"0": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462081174, "Score": 3, "Body": "If you only want to do this for the experience why not just talk to profs in the lit department or even current PhD students. You could sit it on the seminars and attend workshops the same way. \n\nI am not sure why would you want to earn a degree that you know is useless at the outset.", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "1": {"Subreddit": "PhD", "Author": "officer_fava_beans", "Date": 1462082424, "Score": 1, "Body": "Well, that's the thing...\nSince I do know that it would be useless, at least in monetary terms, I am automatically discouraged from pursuing.\nHowever, I can not and have not stopped doing literary research (close-reading, writing, gathering evidence, etc.), which leads me to believe that I am not done, academically, at least. \nI haven't yet found another outlet for my urge to continue in this way in practical terms, other than going back to grad school. Hence the input invitation of my post. ", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "2": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462082830, "Score": 1, "Body": "Why not apply to those fellowships, etc. and only go in when you get one that provides full funding?", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "3": {"Subreddit": "PhD", "Author": "officer_fava_beans", "Date": 1462083433, "Score": 1, "Body": "I guess I am thinking that a fellowship or assistantship would require 100% commitment to that program/income only, yet the pay would not be comparable to what I am making now or would be making if I wasn't in a fellowship.\nYet, I also consider the fact that, if the program is particularly rigorous, applicants may be discouraged from maintaining much of a separate work schedule anyway. ", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "4": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462083829, "Score": 2, "Body": "Well, you can't eat the fish and sit on the dick at the same time.", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "5": {"Subreddit": "PhD", "Author": "officer_fava_beans", "Date": 1462084292, "Score": 2, "Body": "I'm going to act like you meant for this to be a fishing and sitting on the dock metaphor while also laughing at knowing exactly what you are really saying. ", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "6": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462084634, "Score": 1, "Body": "In English its something about cake. и рыбку съесть, и на хуй сесть", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "7": {"Subreddit": "PhD", "Author": "rindrel", "Date": 1462087509, "Score": 1, "Body": "\"You can't have your cake and eat it too\" is probably what you're thinking of.", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "8": {"Subreddit": "PhD", "Author": "porterble", "Date": 1462101834, "Score": 1, "Body": "Sounds like you are in it for the knowledge, and the PhD is a structured way of getting into it. Nothing wrong with that. \nPerhaps see if you can sit in on the colloquia and reading groups for a semester and see if that gives you the same desired outcome. Even if it doesn't the time spent doing the formal meetings will build the foundation for doctoral research. Potentially this will shorten your dissertation period later if you decide to formally pursue it. ", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "9": {"Subreddit": "PhD", "Author": "nhmo", "Date": 1462113273, "Score": 4, "Body": "Your profs are right. If you are not getting paid to do your PhD, it is not worth it. Depending on what's available to you, you might still need additional funds for cost of living (rent, utilities, groceries).\n\nI did my PhD in Music Theory (currently ABD)--and I was lucky enough to have a significant stipend to do so.\n\nIf they don't offer you a stipend (and they have them available), they don't want you in their program. You'll likely not get the experience you were hoping for because you'd just really be seen as a source of revenue rather than an equal scholar.\n\nThis sounds harsh, but this is the reality. I was lucky enough to have professors tell me this straight up when I was applying to grad school.", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "10": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1462148111, "Score": 1, "Body": "Also research scientists.", "Permalink": "https://www.reddit.com/by_id/t3_4h5in8.json"}, "11": {"Subreddit": "PhD", "Author": "danielabd", "Date": 1462160791, "Score": 2, "Body": "Unpopular opinion: \n\nLiterature PhD student here. It's true that getting a job with a PhD in literature is extremely difficult, but if it's something you want to do than by all means do it. I think working while getting your PhD might put you at a slight disadvantage because you won't have the same time to invest in your work that your peers will, but maybe you're actually a super motivated, extremely bright person who will be able to close that gap.\n\nAnd maybe you'll graduate, pay a lot less than you thought, and have some student loan debt to pay back for a few years--assuming you're a US citizen, if you borrow federally, the repayment plans can be quite lenient ((RE)PAYE plans mean that you'll pay 10% of your income, but that might be an ok price to pay if getting a PhD is something you really want). If you end up working in the public sector, you'll only have to pay for 10 years before your loan is forgiven. \n\nPerhaps you won't get a tenure-track job, in truth, the likelihood is that you won't, but if you're very committed to doing a PhD and seeing where it takes you, by all means do it. Make sure you like your supervisor and your institution, and if you stop enjoying it then stop. All this talk about uselessness; nobody gets a bachelor's and an MA in literature thinking it's useless, so why change your mind now? (That is, once again, if you'll enjoy the work and will be able to handle the reality that you might not get the tenured position--but hey, you might get another position doing something you like more somewhere else).", "Permalink": "https://www.reddit.com/by_id/t3_4h7vr2.json"}, "12": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462253714, "Score": 7, "Body": "Don't worry. You don't have a social life as a PhD student.", "Permalink": "https://www.reddit.com/by_id/t3_4hkwxv.json"}, "13": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1462260908, "Score": 2, "Body": "Tell her that you feel it would be healthier for your career to continue your academic career at another university. Also tell her the other stuff. She is a professional, she will understand.", "Permalink": "https://www.reddit.com/by_id/t3_4hkwxv.json"}, "14": {"Subreddit": "PhD", "Author": "diassistance", "Date": 1462270078, "Score": -2, "Body": "UK Dissertations is a Reputed Dissertation writing and editing Company in Maharashtra , India .offers Dissertation writing services,Dissertation editing services ,UK Dissertation Help by the top most Writers of United Kingdom(UK). Best Dissertation Writing services at affordable prices. our first priority to Satisfy the needs of the Students who are looking for UK based Dissertations, UK Dissertation Help and UK Dissertations.\n", "Permalink": "https://www.reddit.com/by_id/t3_4hmkuk.json"}, "15": {"Subreddit": "PhD", "Author": "Dunder-Mifflin", "Date": 1462282560, "Score": 6, "Body": "You could at least try to use correct capitalisation and standardised punctuation if you're gonna pretend to offer \"dissertation writing assistance\".", "Permalink": "https://www.reddit.com/by_id/t3_4hmkuk.json"}, "16": {"Subreddit": "PhD", "Author": "Fenzik", "Date": 1462311420, "Score": 1, "Body": "All of the following is just my impression from unsuccessfully Ph.D. hunting over the past months.\n\nI'm not sure what field you're in, but I do think that in a lot of academia your location isn't really something you get to choose. It's more of a \"suck it up\" kind of career path where you go where the jobs are, unless you're some kind of star/genius. If you have the opportunity and a supervisor who you know would value you, I would take it.", "Permalink": "https://www.reddit.com/by_id/t3_4hkwxv.json"}, "17": {"Subreddit": "PhD", "Author": "porterble", "Date": 1462330619, "Score": 2, "Body": "From that website I wouldn't want to touch any dissertation that has gone through there.\n\nPerhaps dis-assistance is a better username.", "Permalink": "https://www.reddit.com/by_id/t3_4hmkuk.json"}, "18": {"Subreddit": "PhD", "Author": "porterble", "Date": 1462330821, "Score": 1, "Body": "Its marking time of year down here in Australia, and one of my side responsibilities is to put together little short study tips videos. This is me both letting off some steam after some frustrating marking, and also having a jab at my supervisor on one of our shared peeves: bad abstracts.\n\nFigure any other PhD students doing TA/marking work might like the humour.\n\nSadly some students seem to be taking this seriously.... wtf.", "Permalink": "https://www.reddit.com/by_id/t3_4hsl9g.json"}, "19": {"Subreddit": "PhD", "Author": "thqrun", "Date": 1462349454, "Score": 1, "Body": "Its typically a bad move to get your phd the same place you got your undergraduate degree. Future employers may look at it and view you as someone who couldn't \"move on.\" Just tell her that you wanna go bust your science nut somewhere else.", "Permalink": "https://www.reddit.com/by_id/t3_4hkwxv.json"}, "20": {"Subreddit": "PhD", "Author": "Dr_Curcumsinside", "Date": 1462370631, "Score": 1, "Body": "Only in part. I took time off before starting my program so it is nice to be a student again. While certain classes are a definite drag I feel that the classes I have taken have been mostly useful. At the very least they are a nice break from lab.", "Permalink": "https://www.reddit.com/by_id/t3_4htjw4.json"}, "21": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1462372800, "Score": 3, "Body": "Congratulations! 😀", "Permalink": "https://www.reddit.com/by_id/t3_4hulbh.json"}, "22": {"Subreddit": "PhD", "Author": "IAmPixel", "Date": 1462375037, "Score": 2, "Body": "Brilliant news. Well done.", "Permalink": "https://www.reddit.com/by_id/t3_4hulbh.json"}, "23": {"Subreddit": "PhD", "Author": "xxGrobicxx", "Date": 1462382839, "Score": 1, "Body": "I'm more inclined to go with this one. I have no desire to teach and be a professor. I want to continue to learn and write academic papers \n\nThank you for the responses everyone! I'm gonna go for my PhD/DBA in business then pursue research afterwards.", "Permalink": "https://www.reddit.com/by_id/t3_4h5in8.json"}, "24": {"Subreddit": "PhD", "Author": "Dr_Curcumsinside", "Date": 1462384236, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_4hulbh.json"}, "25": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1462399670, "Score": 2, "Body": "Hey!!! Congrats! All the hard work payed off. ", "Permalink": "https://www.reddit.com/by_id/t3_4hulbh.json"}, "26": {"Subreddit": "PhD", "Author": "PM_me_good_Reviews", "Date": 1462410914, "Score": 1, "Body": "Well, whatever else you consider, don't worry about taking an \"academic gap\" to go work somewhere while you study and/or publish on your own on the weekends.  It won't hurt your chances of PhD program admittance, prestige, or funding.  And you'll have such a better PhD experience if you are prepared and are a strong candidate!\n\nI took a 3-year gap myself when I realized I needed better programming skills.\n\nIt's up to you to decide how you want to acquire the necessary skills and track record to become a strong PhD candidate.  You can do it on your own, which requires bravery and persistence, or you can enroll in a MA program where you pay a large amount of money for someone to stand over you and crack a whip.  Please be aware that many universities see MA students as merely a source of income, and do not devote much effort to their education.  And anecdotally, of grad student loan recipients I've seen, who all thought their loans sounded manageable at first, the majority ended up with their careers derailed from the loans.  Several of them, Americans, have fled the US.\n\nFood for thought.", "Permalink": "https://www.reddit.com/by_id/t3_4hwqwl.json"}, "27": {"Subreddit": "PhD", "Author": "SalingerPoe", "Date": 1462423304, "Score": 3, "Body": "I'm not dyslexic, but I can tell you that is a real issue for me too. I have C-PTSD and I also struggle with memory and other such essential qualities for academia. I LOVE academia. I LOVE teaching. I LOVE my field. And that's what's keeping me motivated. Because not a day goes by when I don't ask myself \"what am I doing?\" I have this very real part of me that tells me I will never succeed, and even though I hear it loud and clear, I choose to not dwell on that. I'm still working on my PhD so I don't know where I'll end up or how this will end. On my good days I just tell myself to take it a day at a time, on my bad days I cry and wonder what the hell I'm doing and if I'll ever make it. You've made it this far, OP. That's no coincidence. You are gifted in that you can thrive despite the difficulties with your coping strategies. You are resilient! You can do it!", "Permalink": "https://www.reddit.com/by_id/t3_4hxw7g.json"}, "28": {"Subreddit": "PhD", "Author": "sadmoody", "Date": 1462424708, "Score": 2, "Body": "&gt; I take 2 hours to read a paper that others read in 30 minutes, or not remembering the author of a paper that I read just two days before in a conversation with my supervisor\n\nThat sounds like me, and I'm not dyslexic. You're fine. Or as fine as can be I guess. If it takes you 2 hours to read a paper, you're still 1 paper ahead of all the students that don't put in any work yet somehow end up graduating.\n\nI feel stupid like you a lot. In fact, I don't even feel like an expert. I'm in my final year. Been feeling shitty for the last 4 years. You're not different :)", "Permalink": "https://www.reddit.com/by_id/t3_4hxw7g.json"}, "29": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1462446956, "Score": 5, "Body": "The funny thing about the imposter syndrome is that you always think it is not imposter syndrome  (first rule of imposter syndrome). \n\nI got my PhD last august. Throughout my PhD I was told to read this one paper by my advisor, on the method that I used everyday. After 4+ tries, I never got even halfway through. Some people have the attention to read those damn things. To be honest, I had a hard time reading my own papers in a single sitting. \n\nI learned a trick: \n\n1: read the abstract once or twice. \n\n2: read the introduction once or twice.\n\n3: look at the figures, and try to understand them (read the captions carefully)\n\n4: read the conclusion (or generally the last 2 paragraph of results and discussion\n\n5: you are done. If something is unclear, read that part of the results and discussion page\n\n\n6: never read materials and methods unless you want to replicate the results, or if something about the data seems screwey. Even so, only read the part that pertains to the experiment you care about \n\n7: I still cannot remember for the life of me which PI's lab each paper came out of. Just remember vaguely what they did in the paper, and you are good. Names only matter for a few PIs that you might like, and might see in conferences. Also, you will pick up a few names after 4ish years.", "Permalink": "https://www.reddit.com/by_id/t3_4hxw7g.json"}, "30": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1462527523, "Score": 1, "Body": "Is it posted on their website?", "Permalink": "https://www.reddit.com/by_id/t3_4i2meu.json"}, "31": {"Subreddit": "PhD", "Author": "emzzie43", "Date": 1462561921, "Score": 2, "Body": "Dropbox works for me", "Permalink": "https://www.reddit.com/by_id/t3_4i6ldo.json"}, "32": {"Subreddit": "PhD", "Author": "breakthatbass", "Date": 1462573290, "Score": 1, "Body": "Thanks for the reply! I was leaning more towards studying/preparing on my own since I'm already in plenty of debt from my undergrad but I wasn't sure what was more appealing to an institution when applying for a PhD program. ", "Permalink": "https://www.reddit.com/by_id/t3_4hwqwl.json"}, "33": {"Subreddit": "PhD", "Author": "hytti", "Date": 1462594932, "Score": 1, "Body": "Check out [Zotero](https://www.zotero.org/) and plugin [Zotfile](http://zotfile.com/).", "Permalink": "https://www.reddit.com/by_id/t3_4i6ldo.json"}, "34": {"Subreddit": "PhD", "Author": "porterble", "Date": 1462596412, "Score": 1, "Body": "I use Dropbox for cloud storage with Goodreader as the PDF reader/annotator. GoodReader is the best PDF app i have found, but it is only on iOS. None of the Android ones i have used in the past have a bar on GR, which is a pity as some competition would be good.\n\nI also use Zotero and Zotfile for managing my reference database, but not for reading/markup.\n\nI wrote a few blog posts on my research organisation methodology for a pedagogical professional development thing a while ago, and then updated them on the blog last year:\nOrganising research with Zotero: http://www.porterblepeople.com/2015/02/organising-research-advanced-zotero/\nWorking with Digital Print Media:\nhttp://www.porterblepeople.com/2015/02/digitising-print-media-briss-and-ocr/\nRecovering/Finding Resources:\nhttp://www.porterblepeople.com/2015/03/finding-your-material-dropbox-and-devonthink/\n\nAnd a much longer dribble here that was a repost/update of a 2011 post on another blog.\nhttp://www.porterblepeople.com/2012/03/useful-study-tools-part-1-zotero/\n\nI really should do one dedicated to paper reading/syncing though.", "Permalink": "https://www.reddit.com/by_id/t3_4i6ldo.json"}, "35": {"Subreddit": "PhD", "Author": "midipoet", "Date": 1462635066, "Score": 4, "Body": "If its any consolation to you, I handed in after three and a half years, only to get a revise and resubmit verdict on my Viva. \n\nHad to pretty much rewrite the whole thesis and add one more portfolio work. \n\nFor the first three months of this process I was distraught, depressed and seriously lacking in confidence and motivation. \n\nThings got better and I can finally now see the actual end in sight. \n\nThings could be worse. Just stick with it.\n\nIt'll be worth it in the end. ", "Permalink": "https://www.reddit.com/by_id/t3_4ia1t2.json"}, "36": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1462665485, "Score": 1, "Body": "The PhD program in general is on their website and a description of the different means of funding. When you apply you are automatically put in the running for the fellowship. ", "Permalink": "https://www.reddit.com/by_id/t3_4i2meu.json"}, "37": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1462665750, "Score": 1, "Body": "Check out engineering management. It's not going to kill you with math, but it's still in the engineering field. Western new England university has part time and all online. ", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "38": {"Subreddit": "PhD", "Author": "phddumbdumb", "Date": 1462670556, "Score": 5, "Body": "First - I don't know where you're located/what discipline you're in, but if this happened to me I'd probably turn around and ask my supervisor \"Seriously, what have YOU been doing for the last three years that you're surprised by the work I've done in that time?!\" Shouldn't they have been checking in on you, ensuring your progress was going according to the planned timeline, etc? At least in my area (social sciences) supervisors are supposed to be doing annual official progress meetings, with more unofficial progress discussions throughout the program. This is on them as well. \n\nSecond - Think of this like a big work project. Sometimes projects don't go according to plan. Sometimes because limited resources/unexpected problems, and sometimes because plain old human error (illness, lack of skills, laziness, etc.). That doesn't mean the project is doomed to fail, or the project lead is a failure. I've worked plenty of places where projects get delayed for whatever reason. Academia is SO BAD for research getting delayed or off track. \n\nAll you can do is decide if it's worth sticking things out a bit longer (6 months is not very long compared to a four year program!) and maybe being a bit discouraged/embarrassed. If you decide you want to continue, sit down and think through what happened for the past few years that delayed your work, and hold yourself accountable for any errors on your part. In my experience, people respect anyone who admits their mistakes, or that they are still learning, and makes a plan for fixing things. \n\nI hope things work out for you! *hug* ", "Permalink": "https://www.reddit.com/by_id/t3_4ia1t2.json"}, "39": {"Subreddit": "PhD", "Author": "Montaingebro", "Date": 1462678879, "Score": 1, "Body": "But I do want something that's heavy on the math side. Real analysis, topology, number theory, lots of PDEs etc. That's the part that I really miss.", "Permalink": "https://www.reddit.com/by_id/t3_4ezeoo.json"}, "40": {"Subreddit": "PhDStress", "Author": "AxiomShell", "Date": 1462800764, "Score": 1, "Body": "Hi there! Thanks for participating in /r/PhDStress!\n\n(I'm currently still a PhD student) I think I'm fortunate that I don't get constant negative feedback from my supervisor.\n\nBut there are \"worse kinds\" of supervisor, ones that never give feedback or ones that you only see once every two years.\n\nIs his feedback negative but constructive? Meaning, do you at least get a sense of needs to be changed after talking to him/her?", "Permalink": "https://www.reddit.com/by_id/t3_4gunve.json"}, "41": {"Subreddit": "PhDStress", "Author": "classic123456", "Date": 1462804163, "Score": 1, "Body": "Hi Guys, 3rd year PhD. Loved first two years, wow so much freedom to learn AND you get paid?? 3rd year is a nightmare having to finalise hypothes and conclude on the work you've done that youre so involved in you no longer appreciate or think is good enough. \n\nI've developed severe anxiety and depression because of this and there doesnt seem to be a way out other than to carry on and hope to pass with what I've already done as theres no way I can put more effort into further research on my topic. ", "Permalink": "https://www.reddit.com/by_id/t3_4gunve.json"}, "42": {"Subreddit": "PhD", "Author": "Simsimius", "Date": 1462814822, "Score": 1, "Body": "&gt;If the phd's can't remote into their computers, all of their research has to be conducted on sight in the lab\n\nPerhaps, that is the point.", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "43": {"Subreddit": "PhDStress", "Author": "AxiomShell", "Date": 1462815501, "Score": 1, "Body": "Hi!\n\nWelcome to /r/PhDStress!\n\nThe final year can take its toll in terms on stress, that is true.\nBut every single student I know wishes their thesis could have been better or they could have more time, I think this is very common.\n\nI wish you the best of luck and I think just talking about these problems or worries helps a lot. That's the purpose of this sub after all.", "Permalink": "https://www.reddit.com/by_id/t3_4gunve.json"}, "44": {"Subreddit": "PhDStress", "Author": "classic123456", "Date": 1462819999, "Score": 1, "Body": "Thanks yeah that's a good point to make and one that can be written into the discussion section. I am fortunate in that I am still young and have time to change careers after but it's pretty terrifying knowing you don't want to pursue an academic career any more", "Permalink": "https://www.reddit.com/by_id/t3_4gunve.json"}, "45": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1462839152, "Score": 2, "Body": "It's not that simple. The lab closes for instance and we can't just stop doing work because it's memorial day. ", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "46": {"Subreddit": "PhD", "Author": "biocomputer", "Date": 1462844663, "Score": 1, "Body": "I use SSH to connect to my school's servers.", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "47": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1462845533, "Score": 1, "Body": "No clue about liberal arts, but in economics the subjects were just far more difficult and built open other courses.", "Permalink": "https://www.reddit.com/by_id/t3_4im2dn.json"}, "48": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1462845640, "Score": 3, "Body": "&gt;if this happened to me I'd probably turn around and ask my supervisor \"Seriously, what have YOU been doing for the last three years that you're surprised by the work I've done in that time?\n\nThanks, this might be terribly relevant advice for me soon ^^", "Permalink": "https://www.reddit.com/by_id/t3_4ia1t2.json"}, "49": {"Subreddit": "PhD", "Author": "sheldonalpha5", "Date": 1462867063, "Score": 2, "Body": "Masters is generally a more focused regimen on subjects you choose to study, involving the understanding of text book concepts, theories etc. A Master's course doesn't expect you to make a contribution to the existing body of knowledge of the subject/s you're studying, they may involve a research module but most of that is generally derivative or at best establish causal links between phenomena. However, at a doctorate level you are expected to bring new knowledge to the field you're studying. Doctorates are topic specific within a subject, in fact most research programme applications explicitly ask the candidates to demonstrate how their proposed research would be significant in terms of the contribution it would make to the knowledge of the field, at least that's how it works in the UK, in US I believe PhD is a 5 year full-time course, with the first two years essentially being a Master's programme as students are supposed to undertake course work and in the third year they develop their research plans based on the interests they have developed in the past two years or before that. ", "Permalink": "https://www.reddit.com/by_id/t3_4im2dn.json"}, "50": {"Subreddit": "PhD", "Author": "Simsimius", "Date": 1462895051, "Score": 1, "Body": "Fair enough.\n\nMy lab (plant science) you can access 24/7 as long as you have a late working pass, but not all places are like that.", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "51": {"Subreddit": "PhD", "Author": "Dr_Curcumsinside", "Date": 1462907470, "Score": 1, "Body": "One thing that I have learned through my training is that procrastination really is just shooting yourself in the foot. Seems obvious but to me it was incredibly valuable to learn. \nThat said, knowing what your goals are is a great place to start. Trying coming up with a realistic and detailed individual development plan. Doing so will not only make visual what it is you want to learn but how you plan to achieve your goals and in what timeline. \n\n1.Keep in mind that a PhD is a marathon and not a sprint. \n2. Try to meet your goals everyday, break things up so you are not just working on one thing so it is not so monotonous. \n3. Plan fun activities, make time to meet up with other students and the postdoc outside of lab. ", "Permalink": "https://www.reddit.com/by_id/t3_4io9xl.json"}, "52": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462917753, "Score": 1, "Body": "withdraw... I would got to a poster sessions even with results", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "53": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1462928985, "Score": 1, "Body": "What's SSH?", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "54": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1462935621, "Score": 1, "Body": "Second those questions", "Permalink": "https://www.reddit.com/by_id/t3_4io9xl.json"}, "55": {"Subreddit": "PhD", "Author": "doctorofnilosophy", "Date": 1462940140, "Score": 8, "Body": "YOU GOT THIS, two weeks is peanuts for the years you've put in! Keep your eye on the prize, stay stong, and push through. It's time for you to sprint the last leg of the marathon--push, push, push and anticipate the ENORMOUS sense of relief and accomplishment coming your way!! ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "56": {"Subreddit": "PhD", "Author": "Miles1124", "Date": 1462943056, "Score": 2, "Body": "Thank you so much. I need that push. The road has been hard and I know everyone tells me that if your committee gives you permission to write it's hard to fail but it still gives me anxiety ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "57": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1462964913, "Score": 5, "Body": "Think when it will be done and behind of you. You already have gone way farther than most people, you've already achieved quite a lot. I would like for you to come back here to comment on your success, give us some advice on how to prepare for a defence and sign your comment with your name + 3 letters= Ph. D. We're counting on you. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "58": {"Subreddit": "PhD", "Author": "Miles1124", "Date": 1462971893, "Score": 1, "Body": "Thank you so much for those words. I really appreciate it. I know I can do it... It's just a crazy moment in life I have to get through ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "59": {"Subreddit": "PhD", "Author": "Calamistrate", "Date": 1462974751, "Score": 3, "Body": "You can do it!!! The next two weeks will suck ass, but in the end it's beyond amazing to feel accomplished and see everything in one document. Push forward, and remember that in the end it's definitely worth it...The feeling of putting everything together and getting it out there is AMAZING. Live for that moment. Get there!   \n  \nAlso, if you have any PhD buddies who are in a similar position, have them text you 2-3 times a day with their accomplishments and you do the same in return (e.g. \"Finished 5 pages in Chapter 3. Moving on to Chapter 4's summary\"). Or, send texts to a family member/friend at 8am and 8pm each day. It gives a little bit of accountability and shows your daily progress. ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "60": {"Subreddit": "PhD", "Author": "biocomputer", "Date": 1463005685, "Score": 1, "Body": "[Secure Shell](https://en.wikipedia.org/wiki/Secure_Shell), it's used to make secure connections to remote systems usually through a command line interface.  I use [MobaXterm](http://mobaxterm.mobatek.net/) to connect to a CentOS high performance computer cluster where all my files and programs are stored.", "Permalink": "https://www.reddit.com/by_id/t3_4ikavh.json"}, "61": {"Subreddit": "PhD", "Author": "shekpvar", "Date": 1463016560, "Score": 1, "Body": "ADHD is quite a hurdle to overcome for a PhD.  What kind of accommodations do you expect to get?", "Permalink": "https://www.reddit.com/by_id/t3_4iwbx6.json"}, "62": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1463023695, "Score": 1, "Body": "Not really...\n\nJust standard GRE time extension. Idk why this got so downvoted.", "Permalink": "https://www.reddit.com/by_id/t3_4iwbx6.json"}, "63": {"Subreddit": "PhD", "Author": "rrgjl", "Date": 1463064741, "Score": 7, "Body": "I think you should do something that makes you happy and not overcomplicate matters so much. It might very well be that on some level you just want that title (you don't need to share it here, just consider for yourself). Really, can you be happy with a job not in research? Do you want to even stay in research, if this is how you are feeling about it now already? If you can be happy in a different job and cannot imagine yourself working in research, I would say step out.  You don't need to absolutely work a dead end job either. There are always ways to do something you enjoy, and only your own clinging to a certain way things are right now can stop you from not doing those things. But yes, maybe you need to move somewhere else, maybe you need to cut spendings, who knows. Change might be necessary. But isn't your happiness right now as opposed to some moment in an imagined future way more important?", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "64": {"Subreddit": "PhD", "Author": "tureann", "Date": 1463072011, "Score": 4, "Body": "I honestly think you are answering the question yourself, you don't like what you are doing and you don't seem to have a strong desire to pursue an academic career, is that right? Think about what the advantages of getting a PhD would be for you and whether or not it's worth going through the process. A PGCE and becoming a teacher is a great career choice and it's often a quite stable one (depending where you want to work and what years you are teaching I guess) and if that is what you want then go for it! It doesn't seem like you are happy and that you are mentally and emotionally drained, that's really not good.\n\nOn a different note, does your uni offer any sort of counselling support? It could be helpful if you are feeling overwhelmed. ", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "65": {"Subreddit": "PhD", "Author": "Ermischiella", "Date": 1463072789, "Score": 1, "Body": "You're right- I have very little desire to pursue an academic career- I've realised my main goal is stability, and that's not too possible when post-doccing etc. With how I'm feeling and not wanting to stay in academia, a PhD probably isn't worth it.\n\nI have had some fairly negative experiences with the counselling service previously, so I'm avoiding that option. I have arranged to speak to the post-grad tutor in my department tomorrow to discuss it though. I'm hoping laying things out with someone close to the situation will help.\n\n ", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "66": {"Subreddit": "PhD", "Author": "Ermischiella", "Date": 1463072954, "Score": 3, "Body": "I think you're right- I'm not happy currently, and a change will make me happier. My biggest worry isn't ending up in a dead-end job long term, it's that I might have to work one for a year before I can get on a teacher training course. A year of a shitty job vs 3 or 4 years in a setting I'm already miserable in should be a no-brainer though.\n\nI don't want a job in research. I went into the PhD already unsure if I wanted one long-term, but thought that I wanted the experience of research before moving on to other things. That was probably not the right way of looking at it though.", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "67": {"Subreddit": "PhD", "Author": "criticalcontext", "Date": 1463078712, "Score": 1, "Body": "I think people are missing the question... The OP talks about my ADHD and struggle, but the question is how a 3.5 would effect applications, and whether or not I should try again given the other scores.", "Permalink": "https://www.reddit.com/by_id/t3_4iwbx6.json"}, "68": {"Subreddit": "PhD", "Author": "rrgjl", "Date": 1463080384, "Score": 2, "Body": "Yeah but that's the thing - I don't think you need to get a 'shitty' job for a year. There are often more possibilities than we think. We limit ourselves. And part of it can also be a way of looking at the job. But I totally understand the prospect of a 'shitty' job not being a nice one..\n\nWhat do you think you'll like about teaching? And why do you think you'll like working with children/teenagers? (just helping you along with some questions, because you don't want to make the same mistake again I hope... :-) )", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "69": {"Subreddit": "PhD", "Author": "Ermischiella", "Date": 1463081394, "Score": 2, "Body": "I was planning on getting into teaching of some sort post-PhD anyway. One of the reasons I chose PhD was the window to move into higher education teaching of some sort, if I decided I wanted to. I taught gymnastics for 7 years and loved it- I stopped as I didn't have the time alongside the PhD- so I'm hoping that's a sign teaching is for me. My favourite part of the last 7 months of this PhD was a few weeks of lab demo work, and working with our undergrad research project students. I want to get into biology at secondary and post-16, so 11-18 year olds, and am in the process of getting a couple of weeks observation experience in some schools. \n\nCourses start in October, so if I can't get on one this year (it's quite late to apply, but there are some spaces still), I'd have to spend a year working a non-long term job and getting an awesome application together. My hope would be that maybe I could get some gymnastics coaching to at least partly cover this year gap. \n\nI appreciate the questions, I'm definitely in need of a sounding board at the moment! I think I'm a lot more confident I can teach than I was that I could research, but I'm open to all opinions at the moment.", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "70": {"Subreddit": "PhD", "Author": "rrgjl", "Date": 1463082523, "Score": 2, "Body": "Sounds great! You seem to have the teaching affinity, so that's good. One thing to consider might be, as I've heard from teachers even at university level, that you'll be going over the same stuff year after year. I'm not saying don't do it and I'm not trying to put you down, but if you're not one for routine then that's something to consider. Of course, on the other hand, there are always new people coming in each year, the dynamics are always different, and people just keep surprising you with questions you hadn't thought of, so maybe these bored teachers were just a tad arrogant. Who knows.\n\nYou can of course , for the coming year or months, also consider things like freelance teaching, which would be great for you cv as well. Helping teenagers with high school biology, or even university level. If you're any good at statistics, those are always in demand too. You could combine it with some form of gym teaching, and maybe this year won't be so bad :-)", "Permalink": "https://www.reddit.com/by_id/t3_4j099b.json"}, "71": {"Subreddit": "PhD", "Author": "awesomejt", "Date": 1463094049, "Score": 2, "Body": "Are you just starting out? This is extremely common for a lot of people but it doesn't mean the conference can't be useful for you. Talking with experts in your field might help you with your future direction so you should definitely consider going through with it. Anyway, this is what I did for my first poster.\n\nJust outline your plan, include any results your group has had which lead to your project. Figures can be referenced from others (with permission) also I always keep my abstracts slightly vague so that the poster can have something only slightly related if necessary. Try to use pretty pictures if possible (no joke this is important) and have fun designing a nice poster, it shouldn't be a stressful thing!\n\nHope it goes well!", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "72": {"Subreddit": "PhD", "Author": "porterble", "Date": 1463113440, "Score": 3, "Body": "Podcasts. Lots and lots and lots of podcasts.\nYoutube Videos of various forms, i watched tons of how to and artisan videos while entering and anonymising datasets", "Permalink": "https://www.reddit.com/by_id/t3_4j4hvp.json"}, "73": {"Subreddit": "PhD", "Author": "ThyZAD", "Date": 1463149875, "Score": 2, "Body": "Audiobooks", "Permalink": "https://www.reddit.com/by_id/t3_4j4hvp.json"}, "74": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1463175343, "Score": 2, "Body": "It sounds like your advisor and you aren't on the same page regarding the status of the project.  I would discuss with him, and you can decide together what to put on the poster.", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "75": {"Subreddit": "PhD", "Author": "Oreo_Sundaes", "Date": 1463182268, "Score": 1, "Body": "I use Mendeley", "Permalink": "https://www.reddit.com/by_id/t3_4i6ldo.json"}, "76": {"Subreddit": "PhD", "Author": "MissBee123", "Date": 1463195945, "Score": 1, "Body": "Just as a side note, Americans with Disabilities Act requires your school to make reasonable accommodations for your dyslexia.  If you feel you need extra support, you are entitled to it.  This includes recording lectures, enlisting a note taker, extra time on exams, a person to READ you content, etc.  There are a slew of supports available to you if you know where to go.  Ask your school's HR office or Student's With Disabilities office to help you get all you are legally entitled to.  You're not meant to struggle more than you have to and there are laws in place to protect you from this. ", "Permalink": "https://www.reddit.com/by_id/t3_4hxw7g.json"}, "77": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1463240904, "Score": 3, "Body": "Go kick some thesis butt", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "78": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1463251021, "Score": 2, "Body": "Nine months still is quite a lot of time if you're looking at 1 paper/every 3 months. And your first is done so really you have more time! \n\nI'm in LibArts so I might not be much help here but -- conferences are a great place to get feedback on your papers for revision. What about submitting your second paper for a con and preface it by saying work in progress, comments appreciated? \n\nAlso, what other journals are available in your field? I would consider submitting abstracts to online journals or university department publications first OR see if a professor is interested in helping you edit/revise paper #2 and you can share your name with them as a publication end goal. \n\nPaper #3 can be a new version of paper #1 based on conference comments that you take in a new direction! Or, can you do case studies? The more applicable they are for IRL, the better it looks on your CV too! Hope that helps some?", "Permalink": "https://www.reddit.com/by_id/t3_4jbx80.json"}, "79": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1463251762, "Score": 1, "Body": "I would always suggest an MA first, followed by a PhD. Although, given your field/area, you'll really want to see which universities offer MAs and what their funding packages are. It might be worth it going abroad versus staying domestically US.\n\nAlso, if you just want research and not to teach, a PhD in Europe might be your best bet as they don't have teaching requirements that CAN/USA do - it's just writing your dissertation. (But you'd need to find someone to be your supervisor first to gain acceptance after the fact)\n\nLanguages would be necessary but in Canada at least, you demonstrate your competency by the time you defend through an oral exam. So there would be time to work on that! ", "Permalink": "https://www.reddit.com/by_id/t3_4hwqwl.json"}, "80": {"Subreddit": "PhD", "Author": "tpn86", "Date": 1463255088, "Score": 1, "Body": "Thanks for the input! :)", "Permalink": "https://www.reddit.com/by_id/t3_4jbx80.json"}, "81": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1463256919, "Score": 8, "Body": "You are crazy. PhD committee members sit on tens of PhD committees at the same time.", "Permalink": "https://www.reddit.com/by_id/t3_4jcj47.json"}, "82": {"Subreddit": "PhD", "Author": "Suds_Lightyear", "Date": 1463267611, "Score": 1, "Body": "&gt; It doesn't help that my supervisor lives on the opposite side of the Earth and seldom responds to me.\n\nSwitch to someone who is physically in the building and who has time to actually mentor you. It doesn't matter if their expertise is not as ideal a fit; it matters that you are trained how to think.\n\nGrad school is hard and there are a lot of factors influencing our experiences, but I'd hazard a guess that your lack of adequate mentoring is a significant reason for why you're experiencing what you are experiencing.", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "83": {"Subreddit": "PhD", "Author": "DVS_phoenix", "Date": 1463272428, "Score": 6, "Body": "It really doesn't matter; professors are always on a bunch of different committees, and a lot of those committees can be similar or exactly the same. I'd worry more about who's on your committee than who's on your friend's.\n\nAlso, potential committee members can always turn down sitting on a committee if they don't feel it's appropriate (e.g. not in their area of expertise, or not of interest to them). Maybe it's a little weird that your friend can't seem to pick their own committee and might be copying you (or maybe they're not copying you), but that's their problem, not yours. I wouldn't waste another minute thinking about it. There are much more important things to think about during grad school. ", "Permalink": "https://www.reddit.com/by_id/t3_4jcj47.json"}, "84": {"Subreddit": "PhD", "Author": "TraceyThomas86", "Date": 1463275407, "Score": -4, "Body": "Appreciated; thanks. It's just more than frustrating that every name I contemplated or answered her questions with ended up being the same people she wanted to ask later. It really didn't have anything to do with who is on my committee but more about her figuring things out on her own and doing the research.", "Permalink": "https://www.reddit.com/by_id/t3_4jcj47.json"}, "85": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1463277568, "Score": 2, "Body": "keep whining", "Permalink": "https://www.reddit.com/by_id/t3_4jcj47.json"}, "86": {"Subreddit": "PhD", "Author": "chenpingjun", "Date": 1463383660, "Score": 1, "Body": "Thanks for your suggestion. ", "Permalink": "https://www.reddit.com/by_id/t3_4j4hvp.json"}, "87": {"Subreddit": "PhD", "Author": "Quant_Liz_Lemon", "Date": 1463443276, "Score": 5, "Body": "PhDs are degrees like all the rest. They're awarded by universities -- not friends with PhDs.", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "88": {"Subreddit": "PhD", "Author": "ShadowHunter", "Date": 1463453305, "Score": 9, "Body": "Is this wacko for real? What are you five?", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "89": {"Subreddit": "PhD", "Author": "SLGC", "Date": 1463466926, "Score": 13, "Body": "Tell him I have a message for him from a Nigerian Prince. It is a mutually beneficial arrangement and he would most likely like to hear it.", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "90": {"Subreddit": "PhD", "Author": "meg_a_tron_", "Date": 1463477700, "Score": 3, "Body": "yeah, no. but thats cute.", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "91": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1463483553, "Score": 1, "Body": "Makes you wonder who received the first PhD ever and who gave it to him/her...", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "92": {"Subreddit": "PhD", "Author": "meowoodie", "Date": 1463484849, "Score": 1, "Body": "Lol! Best joke I have ever heard", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "93": {"Subreddit": "PhD", "Author": "yyzyyzyyzyyz", "Date": 1463491564, "Score": 2, "Body": "Dwight?", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "94": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1463519950, "Score": 1, "Body": "I've been working as research administrator for the past 10 years (research assistant --&gt; program coordinator).  The biggest tangible benefit has been a great tuition assistance program that paid for most of my master's degree at the university where I work.  In addition to learning the research administration ropes (study design, IRB protocols, grants &amp; contracts, recruitment, etc.), I've learned a ton about behavioral health and social science - topics that I find endlessly fascinating!  I even racked up a few presentations and publications along the way.\n\nBut, I've pretty much hit the glass ceiling as a masters-level researcher in my current environment.  I also get bored pretty easily if I'm not learning and doing new things.  So if I don't want my career to stagnate, I either need to switch careers or get a PhD and set my sights on a more senior research position (e.g., faculty, department lead).  Even if I decide to leave academia and do research-type work elsewhere, a PhD (both the added knowledge and the credential itself) will benefit my career trajectory.  \n\nI'm endlessly inquisitive and have always been a researcher at heart... even before I knew that \"research\" might be a viable career path.\n\nTL;DR - The research bug bit me a long time ago and I can't imagine a career path that is more intellectually stimulating.  If I don't finish my PhD, I'll be selling myself short on the possibility of pursuing a really interesting research career.", "Permalink": "https://www.reddit.com/by_id/t3_4jqmja.json"}, "95": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1463525280, "Score": 1, "Body": "Hi mate, \n\nI've actually just blogged answering all these questions. I'd say sorry for the clear self promotion but I only wrote it so people like you can read it and benefit from it. It's over at www.aquaevans.com , I hope it helps you out. \n\nIn a nutshell, I felt like an idiot but then realised that most people feel this way because they start with next to zero knowledge on the topic. Particularly in my field of experimental biology, where I try to build stuff on a budget all the time with minimal experience building aquaria etc. \n\nMy advice and a few times are on that that blog post but to add to it; be confident, you were chosen because you're capable. \n\nGood luck. ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "96": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463529364, "Score": 1, "Body": "Have you watched this yet? \n[how to get through your PhD without going insane](https://www.youtube.com/watch?v=4MkRMp3roKQ) \n\nnever posted a hyperlink before... hope it worked! \nEdit: Woohoo! \n", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "97": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463529872, "Score": 1, "Body": "Statistician here, I enjoyed your post. I'm starting my PhD in September. \n\nTelling someone with no statistical or programming experience to analyse in R is crazy, and a recipe for epic headache. How has this gone? R is powerful but such a steep learning curve... ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "98": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463531096, "Score": 3, "Body": "When I was small (~10) I made my dad take me to the supermarket so I could weigh a sample of various vegetables and compare the variances. For fun. I didn't know what variance was so developed my own test statistic which in hindsight really wasn't bad. \n\nNow I'm just months away from finishing my masters in statistics (yessss!!), and ploughing straight into a PhD because I finally have the skills to answer more interesting questions than whether sweet potatoes have a larger variance in weight than corn cobs. \n\nI may end up jaded and outside research, but nothing ever made more sense to me than the scientific method. I'm just a hypothesis testing creature. ", "Permalink": "https://www.reddit.com/by_id/t3_4jqmja.json"}, "99": {"Subreddit": "PhD", "Author": "ApacheFlame", "Date": 1463556175, "Score": 2, "Body": "You'll read a lot of doom and gloom here, but unfortunately that tends to be the way. Very few people I know have had a trouble free experience. Im going by UK PhD timetables here, so 3-3.5 years.\n\nYour first year: Really this is where you get a proler idea of your field and narrow down the exact questions you are looking to answer with your thesis. It will seem like you have all the time in the world, but that's deceptive. Iddally you want to get some primary data to support your theory so you can be confident that not only is your thesis topic sensible, but you have an idea of roughly how the data supports your theories. That is all ideal, in reality you may find that your topic changes and you end up with very little data. \n\nPhD life is strange. You are still technically a student, but you are not treated like one. It really hits home around year two where you will finish a days work and then feel guilty that you are not working in the evening. It never ends up being a 9-5, as it tends to loom over you. However, you can get some amazing experiences that very few people will. It's a real rollercoaster.\n\nAdvice for newbies? Love your topic. You will be slogging away at this and it will probably define your career. If you have only a passing interest, then it is not the right topic for you. Often you will be working on the very edge of knowledge and your supervisors will get to a point where you are far more up on your subject than them. \n\nFinal piece of advice: Do not ignore warning signs. Health (both mental and physical) take a beating. You get so wrapped up in your PhD that you get ill and you just dont think it's important because you have your thesis to finish. I ignored my decline in health and it almost killed me and I am sure I am not the only one that made the process harder by not sorting my health issues first.\n\nGood luck!", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "100": {"Subreddit": "PhD", "Author": "Grantmitch1", "Date": 1463579138, "Score": 2, "Body": "Utterly shameless self-promotion is utterly shameless. 10/10 would shame again. \n\nI read the article and while your research sounds, for want of a better word, weird, the article was interesting so thank you. \n\nWhat helps me is that my PhD research is an extension of my undergraduate and research master's work. This means I already know the core texts and literature. \n\n", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "101": {"Subreddit": "PhD", "Author": "Grantmitch1", "Date": 1463579380, "Score": 1, "Body": "I already have a good working relationship with my supervisor, so I am hoping that tensions or problems shouldn't exist there, although I do hope your brief explanation of the academic political environment isn't as applicable to my University as it is others. While I love politics, I have no time for office politics. \n\nYour advice is essentially read, read, and when you aren't reading, do more reading? Got it! ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "102": {"Subreddit": "PhD", "Author": "Grantmitch1", "Date": 1463579386, "Score": 1, "Body": "I have, thank you! ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "103": {"Subreddit": "PhD", "Author": "Grantmitch1", "Date": 1463579526, "Score": 1, "Body": "Thank you for the thoughtful advice. Thankfully I do love my field and there is plenty to keep me engaged! Not only is the research interesting but the method I have selected is fascinating (and I'm not usually a methods person)", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "104": {"Subreddit": "PhD", "Author": "colditzjb", "Date": 1463594321, "Score": 1, "Body": "Community colleges are inundated with applications from PhD-level applicants who are looking to score some entry-level teaching experience.  Prestige of your terminal degree is helpful, but some practical university teaching experience would be preferable.  If you want to teach CC/JC, dedicate some credit hours to teaching while in your PhD program.  That practical experience will benefit you more than the name of your school (though higher-tier schools are still viewed more favorably than lower-tier schools, of course).  Even some informal, online teaching experience would be beneficial if you can't land a teaching post in your PhD program.", "Permalink": "https://www.reddit.com/by_id/t3_4irynt.json"}, "105": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1463614245, "Score": 1, "Body": "Really really slowly. I struggle to motivate myself to learn it without guidance, to be honest. I need to work on that though, I'm experiencing what people describe as burn out I think.. ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "106": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463625730, "Score": 2, "Body": "Do yourself a favour and have a low threshold for switching software to something simpler. PM me if you want to chat about this more. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "107": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463626204, "Score": 1, "Body": "These are great suggestions! ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "108": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463626509, "Score": 2, "Body": "I am working on a project which will report results in 2018 and have done a lot of posters along the way. Focus on any novel methodological stuff you've done, or practical lessons you've learned which could help other researchers. Our \"conclusion\" is always along the lines of \"[Project Name] is one of the most important studies investigating X Y Z and will provide significant blah blah\". I think of it as hype-building for the final outcomes.", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "109": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1463657815, "Score": 1, "Body": "Sorry for the late reply!\nI'm glad you're finding positive ways to cope with the bullying. It's so odd that bullies can be intelligent people, you wouldn't think it but I think for people like this I think it stems from insecurities. This thought makes me see them in a compassionate light. We can forgive and forget, as long as we don't let it happen to us again. And we continue working on our own goals. ", "Permalink": "https://www.reddit.com/by_id/t3_49qwfw.json"}, "110": {"Subreddit": "PhD", "Author": "OhDearDarling", "Date": 1463657944, "Score": 1, "Body": "Hahahaha! Brilliant. \nResearch and academic offices are often very much like The Office.", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "111": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1463665181, "Score": 2, "Body": "I knew my advisor for years before starting my PhD. It absolutely helps, but it's not going to be problem free. Doing a PhD is hard. You feel lost and lose your confidence at times. Someone told me that what got him through his PhD was watching people dumber than him graduate. Now it's terrible to call people dumb, but his point is that people who just stick it out, overcome the slightly sorrowful feelings that will happen, and handle their business eventually graduate. So be prepared for the long haul and recognize this will not be a vacation. Someone else said don't let the seemingly endless free time of the first year sink in either. They are so right! ", "Permalink": "https://www.reddit.com/by_id/t3_4jqgwl.json"}, "112": {"Subreddit": "PhD", "Author": "olorinii", "Date": 1463797489, "Score": 2, "Body": "I cannot speak for anyone else but I can tell you about my experience.  This was towards the the end of my dissertation while I was doing rewrites, defending my dissertation, and then reworking the committee draft.  First, I was having frequent panic attacks.  It happened multiple times a day with no rhyme or reason for when they would start.  Second, I developed acid re-flux bad enough to require trips to a specialist and medication.  Next, I was drinking way too much.  Finally, I was really emotional and would tear up over everyday things.  It all stemmed from stress.  I had worked so hard and getting a PhD became part of who I was.  It was part of my identity.  It did not help matters that I had no power over the committee members and no recourse it they simple refused to sign.  I finally finished in the summer of 2014 and thing got better once the weight was off.  ", "Permalink": "https://www.reddit.com/by_id/t3_4g5qel.json"}, "113": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1463874504, "Score": 2, "Body": "I'm doing a PhD in engineering so may be slightly different. I had a hell of a time finding a topic and just getting started in research. Everyone told me to just read journals. There's like a million out there. What I found more helpful was talking to professors and asking them what they are working on. I found someone doing something I found interesting and I binge read their papers. Suddenly I found a gap in their research. Now not only did I have a topic, but a clear choice for an advisor as well.  ", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "114": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463891656, "Score": 1, "Body": "I started with my research question and then went hunting for a supervisor. I was lucky enough to strike gold with a sensational researcher who really cares about my question. How mobile are you? I was ready to move to any city on earth - which is good because I ended up moving from Australia to Scotland. I came back from the workforce, had 'decent' grades and no publications to my name but managed to get a scholarship on the strength of my research proposal alone - so don't lose heart!! The key is a supervisor who wants you as their student. \n\nProfessors love to discuss their topic, I agree a great approach is to set up some meetings/coffees with researchers you admire/have read and ask a boatload of questions. Good luck! ", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "115": {"Subreddit": "PhD", "Author": "msnova", "Date": 1463936539, "Score": 1, "Body": "Hi there. Thanks a lot for your response. I have no problem with relocating to Europe (actually I'm pushing to peruse my degree there). See, your very lucky to have your mind set on a topic, which eventually landed you the scholarship. For me, it's still a bit hard to come with something original (I'm currently contemplating doing a research on a sitcom of my choice, where all the heroes here are amazingly apathetic, selfish, egotistical, and  Machiavellians). I could relate this piece of media to the social conducts, immorality namely. But everybody is undermining this topic and think that I could do better. Besides, I'm not sure that doing a research on an American sitcom would be interesting to European academic entities. Anyhow, I have to come up with a better thing through the many readings I'm doing before finding an advisor willing to take my nonsense under their wing! Thanks again, and wish you all the best!", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "116": {"Subreddit": "PhD", "Author": "msnova", "Date": 1463937460, "Score": 1, "Body": "Thank you so much for sharing this. I'm reading journals and other PhD theses to get a handle on what topics and subtopics covered as well as methodologies applied. I'm also meeting professors specializing in different art and humanitarian fields, but they're just so damn busy to give me a decent advice! Some topics that I chose were ridiculed gently, thinking that I could do much better. What scares me most is the qualitative and quantitative data analysis that I haven't been exposed to properly...or let's just say that I forgot what I've learnt back in school. I guess I'll just have to read more about what might intrigue my interests and give it a shot. Thanks again, and wish you the best of luck!", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "117": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463958419, "Score": 1, "Body": "Have you posted this in r/math ? ", "Permalink": "https://www.reddit.com/by_id/t3_4kjn3b.json"}, "118": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1463958746, "Score": 1, "Body": "I thought I was the only human alive interested in my topic, I found my supervisor by reviewing related literature. To speed up the process why not attend a relevant academic conference? Just being there demonstrates your enthusiasm and you can meet a lot of people in a short space of time. You might attend a session and be inspired by something you hadn't considered. All the best! ", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "119": {"Subreddit": "PhD", "Author": "porterble", "Date": 1463961640, "Score": 2, "Body": "Good advice in there. Some a little less relevant to STEM but broadly applicable. Change point 9 regarding an installation to being about the experiments and it transfers too. ", "Permalink": "https://www.reddit.com/by_id/t3_4kl05b.json"}, "120": {"Subreddit": "PhD", "Author": "msnova", "Date": 1464023817, "Score": 1, "Body": "Thank you so much, that's what I intend to do! Wish you all the best :)", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "121": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1464025820, "Score": 1, "Body": "Don't worry about the analysis. You have to take classes first and it'll all come back to you. I would suggest not looking specifically for a thesis topic but rather an area. Once you start learning all about the area, a topic will fall out eventually. ", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "122": {"Subreddit": "PhD", "Author": "YuePing", "Date": 1464117267, "Score": 1, "Body": "PhD is a learning process. If you're not pushing yourself out of your comfort zone you'll never become more than you already are. So, feeling like you don't have ability for something and being able to recognise it is in fact a good thing. It just shows which fields you need to practice more.\n\nAlso, there a lot of skills that would help you become a better researcher, but you don't have to master all of them. Explaining something nicely is something that even experienced professors and researchers find difficult. So, don't worry too much if you find something difficult. \n\nOne thing that I like to do before these meetings is to practice pretty much like one would prepare for a presentation. That helps a lot. ", "Permalink": "https://www.reddit.com/by_id/t3_4glpac.json"}, "123": {"Subreddit": "PhD", "Author": "YuePing", "Date": 1464117571, "Score": 1, "Body": "You can do it! ", "Permalink": "https://www.reddit.com/by_id/t3_4it50x.json"}, "124": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1464187309, "Score": 2, "Body": "Concept ---&gt; Dimensions ---&gt; Indicators\n\nEpistemology is key. ", "Permalink": "https://www.reddit.com/by_id/t3_4kzfap.json"}, "125": {"Subreddit": "PhD", "Author": "CoolEngineer", "Date": 1464189576, "Score": 1, "Body": "Thank you. I just begun reading literature relating to formulation of questionnaires. Is there a book you would recommend? I will also look at example/sample questionnaires on the internet.", "Permalink": "https://www.reddit.com/by_id/t3_4kzfap.json"}, "126": {"Subreddit": "PhD", "Author": "MissBee123", "Date": 1464197873, "Score": 1, "Body": "I'm looking into Ed.D programs as well, and my understanding is the content is not quite as rigorous as a PhD program.  For example, I'm likely going to be joining the program at UC Denver and their PhD program is 3 years, full time, while the EdD is 3 years part time (meaning I can still work, which is very necessary). My advisor put it well in comparing the two, \"Do you want to *do* the research or *use* the research?\"  Because it's an EdD, you will likely need to apply current best practice research to relevant, current topics/problems and describe ways to solve them.  It is similar to masters, but much more in-depth where you are going to have demonstrate a deep understanding of topics.  ", "Permalink": "https://www.reddit.com/by_id/t3_4im2dn.json"}, "127": {"Subreddit": "PhD", "Author": "Milpat", "Date": 1464200039, "Score": 1, "Body": "It truly depends of what you want to measure. Depending of what it is, a specific method will impose itself. After that it's a matter of making sure that you construct your questions/measures so that you fulfill your original intents. You will find literature both theoretical and methodological one your project is well defined. Good luck. ", "Permalink": "https://www.reddit.com/by_id/t3_4kzfap.json"}, "128": {"Subreddit": "PhD", "Author": "msnova", "Date": 1464275839, "Score": 1, "Body": "I sure do hope so! Thanks for the tips...I think I'm gonna look up more than one area and try to connect then to something I'm passionate about/familiar with. Thanks and wish you all the best! ", "Permalink": "https://www.reddit.com/by_id/t3_4kduqe.json"}, "129": {"Subreddit": "PhD", "Author": "YuePing", "Date": 1464426134, "Score": 1, "Body": "If you just need to sync the files then Dropbox is the best choice.\n\nIf you also want to organise a bib file I would recommend Mendeley. It is super easy to use and also, and it is also able to index the contents of the papers you save so that you can search in your library much easier.\n\nThere are plenty of other tools similar to Mendeley such as Zotero, JebRef, etc... ", "Permalink": "https://www.reddit.com/by_id/t3_4i6ldo.json"}, "130": {"Subreddit": "PhD", "Author": "lakewoodhiker", "Date": 1464443653, "Score": 3, "Body": "Geosciences/Glaciology - most of my \"data collection\" comes through proprietary software related to my instrumentation (although I do use labview, and campbell software a lot).\n\nRegarding data analysis - I would say the biggies are matlab (and maybe python) for the actual analyses, and then for plotting, I really like Datagraph or Kalaidagraph. During my dissertation work, my advisor once told me that if I ever plotted data in excel, he would literally trash the file without even looking at it.  Excel is considered a big no-no in the research science world.\n\nAs far as presentation and manuscript work, I would say posters are mostly done in Illustrator (maybe some in keynote). The default for manuscript writing/editing seems to be Latex now, although I still find it easier to \"Track changes\" in Word, and I don't need to download 20 different add-ons like I do for Latex.\n\nAs far as literature, I still like Papers 3.0...but Mendeley and Zotero are also really nice.  I gave up on Endnote years ago.\n\nhope that helps", "Permalink": "https://www.reddit.com/by_id/t3_4lcwp5.json"}, "131": {"Subreddit": "PhD", "Author": "just_jimmy", "Date": 1464553742, "Score": 2, "Body": "Yes, I am just starting out! Thanks a lot for the advice! I followed it best I could. The conference was last week, and I think it went really well! With some introductory figures/schematics, a methods figure and some so far unpublished results from co-authors, it filled itself out easily! It just took me putting a *very* rough draft out there to start a conversation among all the authors that well framed it.", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "132": {"Subreddit": "PhD", "Author": "Anything_OK", "Date": 1464618215, "Score": 3, "Body": "Hey, if you know some research labs that are specialized in something you are interested in, or if you know the name of some researchers, you can always send a mail to ask if they can have you for a period of time. From what ive seen so far, it is not inappropriate.", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "133": {"Subreddit": "PhD", "Author": "Khiv_", "Date": 1464618418, "Score": 1, "Body": "Thanks!\nMy greatest concern is for professors or PIs to find it strange to get an e-mail from some dude across the ocean, lol.", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "134": {"Subreddit": "PhD", "Author": "Anything_OK", "Date": 1464618855, "Score": 2, "Body": "nah dont worry, good luck", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "135": {"Subreddit": "PhD", "Author": "Khiv_", "Date": 1464619085, "Score": 1, "Body": "Thanks!", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "136": {"Subreddit": "PhD", "Author": "gittinglearnted", "Date": 1464627571, "Score": 1, "Body": "Thanks! I appreciate the response!", "Permalink": "https://www.reddit.com/by_id/t3_4lcwp5.json"}, "137": {"Subreddit": "PhD", "Author": "stellabrew", "Date": 1464652282, "Score": 1, "Body": "I'm in social science and take a mixed-methods approach. \n\nI use REDCap to store and enter my data.  The program allows you to export into excel, SPSS, and SAS.  I use SPSS for quantitative data because it's user friendly and it is just the main statistical program social scientists use.\n\nAs for qualitative data, I use NVivo- it's cheap and their customer support is timely and helpful.  I know many old school researchers who use Atlas.ti because of it's simplicity, but I find it too expensive and it doesn't have the capability to analyze large datasets. \n", "Permalink": "https://www.reddit.com/by_id/t3_4lcwp5.json"}, "138": {"Subreddit": "PhD", "Author": "AquaEvans", "Date": 1464653237, "Score": 1, "Body": "I second this, throw it out there and see what sticks. You have nothing to lose... ", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "139": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464654788, "Score": 2, "Body": "Yep. Send all the emails.  \nI work for one project at the moment, a behemoth clinical trial with data collection period of 7 years. We are always getting emails from eager beavers wanting to get some research experience - do not expect to be doing anything particularly fun, but it's a great way to get yourself that important \"Letter of Reccomendation\" for a PhD application. ", "Permalink": "https://www.reddit.com/by_id/t3_4lpo2n.json"}, "140": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464654965, "Score": 1, "Body": "Our study has 20k participants and a total budget of ~80M so everything is on a massive scale. We work on a custom  web app which facilitates data entry, booking study appointments, sending correspondence, data cleaning and reporting. All interim analyses are in R and stata.\nedit: typos", "Permalink": "https://www.reddit.com/by_id/t3_4lcwp5.json"}, "141": {"Subreddit": "PhD", "Author": "bombhood", "Date": 1464665495, "Score": 2, "Body": "Ouch, yea I feel your pain. I don't know how you can get around this. I'm trying to think if there's some Design of Experiments magic trick you can pull, but I really don't think so. If you know data integrity is fishy, you have no choice but to do root cause analysis and retest. Maybe you can use some spc to figure out which lab is screwed up. However, even if you do figure out the screw up there's no reasonable answer except retest which will take more than 3 weeks. It's not unusual to present a topic at a conference that's slightly different from your abstract so maybe restructure your talk to highlight your hypotheses and discuss how you're tackling the lab problem scientifically to ensure significant results? Aka just be honest with your audience and show that you are systematically fixing the problem to ensure the highest quality results. There's no statistical magic bullet here.", "Permalink": "https://www.reddit.com/by_id/t3_4lt3v8.json"}, "142": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464676217, "Score": 3, "Body": "I agree, but your presentation isn't ruined. Being honest about the challenges you're facing will be valuable to others. You might need to reposition slightly, but your presentation can still be memorable and worthwhile. If we can't discuss the realities of research at academic conferences then there really is no hope! Good luck.", "Permalink": "https://www.reddit.com/by_id/t3_4lt3v8.json"}, "143": {"Subreddit": "PhD", "Author": "notmycuppatea", "Date": 1464688232, "Score": 1, "Body": "I...don't. And it's a huge problem. I have to hand in my semester report tonight, but I don't have any content that I could write about. Once I'm done with it I'll watch the linked video, maybe it will give me some guidance. Sorry I can't be of help.", "Permalink": "https://www.reddit.com/by_id/t3_4ltv7i.json"}, "144": {"Subreddit": "PhD", "Author": "Lithicist", "Date": 1464693211, "Score": 2, "Body": "The most telling sentence in this is that you admit you're not coping. Honestly, you sound like you could benefit from talking to someone professional, like a counsellor or therapist. You're not useless, it's normal to fall out of love with your research (I've definitely felt the same). Please seek out someone more qualified than people like me on reddit. ", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "145": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464696043, "Score": 1, "Body": "Sounds like you're feeling really down - take care of yourself and good luck with the report. ", "Permalink": "https://www.reddit.com/by_id/t3_4ltv7i.json"}, "146": {"Subreddit": "PhD", "Author": "sharkbaitohhaahaa", "Date": 1464696836, "Score": 1, "Body": "I normally set goals for my day(s)/weeks. But daily goals I almost find impossible because I tend to overestimate my ability - I'll put on my list about 50 things I want done (overexaggeration), and complete maybe a 1/3 of it. I personally am not a fan of allocating \"said hours\" because sometimes you get into a groove and it's best to work on that. \n\n\nAt least I find the way I'm most productive is by playing up how I'm feeling that day. Some days I find I'm better for lab work, other days I'm more productive reading papers, and quantifying data. \n\nSo, i tend to set weekly goals as they seem to work best for me instead of daily goals and hourly allocations.", "Permalink": "https://www.reddit.com/by_id/t3_4ltv7i.json"}, "147": {"Subreddit": "PhD", "Author": "redditor0000001", "Date": 1464702022, "Score": 1, "Body": "I'm in my second year and feel like this for weeks at a time and then I spend a day working hard and everything goes well and I feel back on track again. Talk to your supervisor. They probably went through the same or know a hundred people that did", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "148": {"Subreddit": "PhD", "Author": "IkeaViking", "Date": 1464704170, "Score": 1, "Body": "Hello Friend!  By opening this email you have been awarded a PhD!  \n\nPlease forward this email to five others and give them their PhD or a curse will be placed upon you and your family.\n\nRegards,\n\nDr. Phisher", "Permalink": "https://www.reddit.com/by_id/t3_4jo3g2.json"}, "149": {"Subreddit": "PhD", "Author": "EvermoreCR", "Date": 1464716579, "Score": 1, "Body": "wow, you are so lucky, \n\nI spend 40 hr/week in full time job, 20hr/week family, and the rest for my PhD vs Sleep!. ", "Permalink": "https://www.reddit.com/by_id/t3_4ldr10.json"}, "150": {"Subreddit": "PhD", "Author": "just_jimmy", "Date": 1464720295, "Score": 1, "Body": "Good point! Thank you! After freaking out a bit and writing this, I finally wrote a first draft. Then my professor and I scheduled a meeting to frame out the poster. The conference was last week. It actually all went much better than expected. Thanks again!", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "151": {"Subreddit": "PhD", "Author": "just_jimmy", "Date": 1464720439, "Score": 1, "Body": "Thanks a lot! That's very helpful!", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "152": {"Subreddit": "PhD", "Author": "n4noNuclei", "Date": 1464720444, "Score": 2, "Body": "Awesome!  I'm happy to hear it.", "Permalink": "https://www.reddit.com/by_id/t3_4ir9z3.json"}, "153": {"Subreddit": "PhD", "Author": "boxofdice", "Date": 1464732620, "Score": 2, "Body": "Hi - I just finished my PhD and I can empathize with a lot of what you're feeling. Have you talked to others in your program about these feelings at all? I found out recently that a lot of my friends were struggling internally as well, but no one talks about it.\n\nI think my main thought after reading your post is that believe me, you're not screwed. You're going to be ok, truly. The task ahead of you now, aside from actually finishing the thing (which you *can* do, though it will be hard), is to decide what you **want** to do after you're done.\n\nDo you want to continue in science? Forget about all your feelings of inadequacy. If you do, then you can start to think about how to put yourself back together emotionally so you can continue. Many, many successful scientists have felt this way. They just managed to keep on going and not give up.\n\nIf you feel you don't want to continue, that's ok too. Most of my friends decided this. There are a lot of other things out there. Once you've decided this (not that it's the easiest thing, you can give yourself a few months to think about it), then you can move forward.\n\nI agree with the other poster about finding a therapist/counselor to talk to. I really avoided this for a long time but it did help me a bit. The way in which it helped was to have someone force me to talk aloud about what I wanted and what I was afraid of, without getting stuck in my very negative thought loops. I am very critical of myself and have developed a lot of negative/pessimistic ways of seeing things during my time in grad school. Not that I have stopped entirely, but my therapist helped me put that aside for at least a few minutes so I could think about the way I wanted my life to go.", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}, "154": {"Subreddit": "PhD", "Author": "sewballet", "Date": 1464736199, "Score": 1, "Body": "In addition to being really over it, it seems like you might be burnt out. For me wanting to curl up in a ball and hide from the world is a sign I have been pushing too hard for too long. Is it feasible for you to take a short break? A Sat/Sun/Mon long weekend - without working on your thesis *at all*? I find in these times I am able to recover some energy, and remember what I was enjoying and passionate about. Feeling depressed makes you less productive, which makes you feel depressed. It's a horrible vicious cycle, you might need to check out for a few days. Yesterday I watched [this](https://www.youtube.com/watch?v=cRFsuNczIjk) workshop - it is a bit cheesy but I found it overwhelmingly comforting, and much more practical than a lot of academic \"self help\", it might be useful to you.\n  \nI agree that it's important for you to turn your attention to what you *do* want, that way completing your thesis will be a stepping stone to a good place, and seem easier. Just 6 more months to go, wishing you all the very best. \n  ", "Permalink": "https://www.reddit.com/by_id/t3_4lukpm.json"}}